#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AmbientAudio

#include "Basic.hpp"

#include "AmbientAudio_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class AmbientAudio.AmbientAudioDataAsset
// 0x0020 (0x0050 - 0x0030)
class UAmbientAudioDataAsset : public UDataAsset
{
public:
	TArray<struct FAmbientAudioLoop>              LoopingSounds;                                     // 0x0030(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FAmbientAudioOneShot>           OneShotSounds;                                     // 0x0040(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AmbientAudioDataAsset">();
	}
	static class UAmbientAudioDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAmbientAudioDataAsset>();
	}
};
static_assert(alignof(UAmbientAudioDataAsset) == 0x000008, "Wrong alignment on UAmbientAudioDataAsset");
static_assert(sizeof(UAmbientAudioDataAsset) == 0x000050, "Wrong size on UAmbientAudioDataAsset");
static_assert(offsetof(UAmbientAudioDataAsset, LoopingSounds) == 0x000030, "Member 'UAmbientAudioDataAsset::LoopingSounds' has a wrong offset!");
static_assert(offsetof(UAmbientAudioDataAsset, OneShotSounds) == 0x000040, "Member 'UAmbientAudioDataAsset::OneShotSounds' has a wrong offset!");

// Class AmbientAudio.AmbientAudioStatics
// 0x0000 (0x0028 - 0x0028)
class UAmbientAudioStatics final : public UBlueprintFunctionLibrary
{
public:
	static void AddAmbientEntry(class UObject* WorldContextObject, class FName AmbientName, const class UAmbientAudioDataAsset* Asset, int32 Priority);
	static void AddAmbientGameplayTag(class UObject* WorldContextObject, const struct FGameplayTag& GameplayTag);
	static class UAudioComponent* CreateAudioComponent(class UObject* WorldContextObject, class USoundBase* Sound);
	static void PlaySoundAtLocation(class UObject* WorldContextObject, class USoundBase* Sound, const struct FVector& Location);
	static void RemoveAmbientEntry(class UObject* WorldContextObject, class FName AmbientName);
	static void RemoveAmbientGameplayTag(class UObject* WorldContextObject, const struct FGameplayTag& GameplayTag);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AmbientAudioStatics">();
	}
	static class UAmbientAudioStatics* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAmbientAudioStatics>();
	}
};
static_assert(alignof(UAmbientAudioStatics) == 0x000008, "Wrong alignment on UAmbientAudioStatics");
static_assert(sizeof(UAmbientAudioStatics) == 0x000028, "Wrong size on UAmbientAudioStatics");

// Class AmbientAudio.AmbientVolume
// 0x0010 (0x0260 - 0x0250)
class AAmbientVolume final : public AVolume
{
public:
	class UAmbientAudioDataAsset*                 AmbientAsset;                                      // 0x0250(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         Priority;                                          // 0x0258(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         bEnabled : 1;                                      // 0x025C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, Net, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         Pad_25D[0x3];                                      // 0x025D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnRep_bEnabled();
	void SetAmbientAsset(class UAmbientAudioDataAsset* NewAmbientAsset);
	void SetEnabled(bool bNewEnabled);
	void SetPriority(int32 NewPriority);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AmbientVolume">();
	}
	static class AAmbientVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAmbientVolume>();
	}
};
static_assert(alignof(AAmbientVolume) == 0x000008, "Wrong alignment on AAmbientVolume");
static_assert(sizeof(AAmbientVolume) == 0x000260, "Wrong size on AAmbientVolume");
static_assert(offsetof(AAmbientVolume, AmbientAsset) == 0x000250, "Member 'AAmbientVolume::AmbientAsset' has a wrong offset!");
static_assert(offsetof(AAmbientVolume, Priority) == 0x000258, "Member 'AAmbientVolume::Priority' has a wrong offset!");

}

