#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ArrowButton

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ArrowButton.ArrowButton_C.ExecuteUbergraph_ArrowButton
// 0x0040 (0x0040 - 0x0000)
struct ArrowButton_C_ExecuteUbergraph_ArrowButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ArrowButton_C_ExecuteUbergraph_ArrowButton) == 0x000008, "Wrong alignment on ArrowButton_C_ExecuteUbergraph_ArrowButton");
static_assert(sizeof(ArrowButton_C_ExecuteUbergraph_ArrowButton) == 0x000040, "Wrong size on ArrowButton_C_ExecuteUbergraph_ArrowButton");
static_assert(offsetof(ArrowButton_C_ExecuteUbergraph_ArrowButton, EntryPoint) == 0x000000, "Member 'ArrowButton_C_ExecuteUbergraph_ArrowButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(ArrowButton_C_ExecuteUbergraph_ArrowButton, Temp_bool_Variable) == 0x000004, "Member 'ArrowButton_C_ExecuteUbergraph_ArrowButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ArrowButton_C_ExecuteUbergraph_ArrowButton, Temp_object_Variable) == 0x000008, "Member 'ArrowButton_C_ExecuteUbergraph_ArrowButton::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(ArrowButton_C_ExecuteUbergraph_ArrowButton, Temp_object_Variable_1) == 0x000010, "Member 'ArrowButton_C_ExecuteUbergraph_ArrowButton::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(ArrowButton_C_ExecuteUbergraph_ArrowButton, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'ArrowButton_C_ExecuteUbergraph_ArrowButton::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ArrowButton_C_ExecuteUbergraph_ArrowButton, CallFunc_PlayAnimation_ReturnValue_1) == 0x000020, "Member 'ArrowButton_C_ExecuteUbergraph_ArrowButton::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ArrowButton_C_ExecuteUbergraph_ArrowButton, CallFunc_PlayAnimation_ReturnValue_2) == 0x000028, "Member 'ArrowButton_C_ExecuteUbergraph_ArrowButton::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ArrowButton_C_ExecuteUbergraph_ArrowButton, K2Node_Select_Default) == 0x000030, "Member 'ArrowButton_C_ExecuteUbergraph_ArrowButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ArrowButton_C_ExecuteUbergraph_ArrowButton, K2Node_Event_IsDesignTime) == 0x000038, "Member 'ArrowButton_C_ExecuteUbergraph_ArrowButton::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function ArrowButton.ArrowButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ArrowButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ArrowButton_C_PreConstruct) == 0x000001, "Wrong alignment on ArrowButton_C_PreConstruct");
static_assert(sizeof(ArrowButton_C_PreConstruct) == 0x000001, "Wrong size on ArrowButton_C_PreConstruct");
static_assert(offsetof(ArrowButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'ArrowButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function ArrowButton.ArrowButton_C.UpdateArrowColor
// 0x0028 (0x0028 - 0x0000)
struct ArrowButton_C_UpdateArrowColor final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           HoverColor_0;                                      // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ArrowButton_C_UpdateArrowColor) == 0x000008, "Wrong alignment on ArrowButton_C_UpdateArrowColor");
static_assert(sizeof(ArrowButton_C_UpdateArrowColor) == 0x000028, "Wrong size on ArrowButton_C_UpdateArrowColor");
static_assert(offsetof(ArrowButton_C_UpdateArrowColor, Color) == 0x000000, "Member 'ArrowButton_C_UpdateArrowColor::Color' has a wrong offset!");
static_assert(offsetof(ArrowButton_C_UpdateArrowColor, HoverColor_0) == 0x000010, "Member 'ArrowButton_C_UpdateArrowColor::HoverColor_0' has a wrong offset!");
static_assert(offsetof(ArrowButton_C_UpdateArrowColor, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000020, "Member 'ArrowButton_C_UpdateArrowColor::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

}

