#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaItemCustomizationSelector

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "SlateCore_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AthenaItemCustomizationSelector.AthenaItemCustomizationSelector_C.ExecuteUbergraph_AthenaItemCustomizationSelector
// 0x0200 (0x0200 - 0x0000)
struct AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bShowingVariants;                     // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItem*                              CallFunc_GetCurrentItem_ReturnValue;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItem*                              K2Node_Event_SelectedItem;                         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortItemType                                 CallFunc_GetType_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortItemType                                 CallFunc_GetType_ReturnValue_1;                    // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaCosmeticAccountItem*             K2Node_DynamicCast_AsAthena_Cosmetic_Account_Item; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetLockerItemTypeText_ReturnValue;        // 0x0040(0x0018)()
	class FText                                   CallFunc_GetLockerDescriptionText_ReturnValue;     // 0x0058(0x0018)()
	class UFortHero*                              CallFunc_GetHero_ReturnValue;                      // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemDefinition*                    CallFunc_GetItemDefinitionBP_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaCosmeticItemDefinition*          K2Node_DynamicCast_AsAthena_Cosmetic_Item_Definition; // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOwnedByCampaignHero_ReturnValue;        // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortRarity                                   CallFunc_GetRarity_ReturnValue;                    // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_93[0x5];                                       // 0x0093(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetDisplayName_ReturnValue;               // 0x0098(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemInfoHeaderWidget_C*                K2Node_DynamicCast_AsItem_Info_Header_Widget;      // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HandleBack_PassThrough;                   // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_ComponentBoundEvent_TabId;                  // 0x00D4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_TabButton;              // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HandleBack_PassThrough_1;                 // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UIconTabButton_C*                       K2Node_DynamicCast_AsIcon_Tab_Button;              // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate;              // 0x00FC(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x010C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0120(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue;        // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x0130(0x0010)(NoDestructor)
	bool                                          CallFunc_K2_IsValidTimerHandle_ReturnValue_1;      // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_CategoryDisplayName;                  // 0x0148(0x0018)(ConstParm)
	class FText                                   K2Node_Event_ItemDisplayTypeName;                  // 0x0160(0x0018)(ConstParm)
	EAthenaCustomizationCategory                  K2Node_Event_SelectedCategory;                     // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstance*                      K2Node_Event_OverrideSlotImage;                    // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaCustomizationPicker_C*           K2Node_DynamicCast_AsAthena_Customization_Picker;  // 0x0188(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_192[0x6];                                      // 0x0192(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemInfoHeaderWidget_C*                K2Node_DynamicCast_AsItem_Info_Header_Widget_1;    // 0x0198(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bIsSelected;                    // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A2[0x6];                                      // 0x01A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaCustomizationPicker_C*           K2Node_DynamicCast_AsAthena_Customization_Picker_1; // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x3];                                      // 0x01B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bIsSelected)>             K2Node_CreateDelegate_OutputDelegate_2;            // 0x01B4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue_1;                 // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortFrontEndContext*                   CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_NewText;                        // 0x01D8(0x0018)()
	TDelegate<void(class FText NewText)>          K2Node_CreateDelegate_OutputDelegate_3;            // 0x01F0(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector) == 0x000008, "Wrong alignment on AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector");
static_assert(sizeof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector) == 0x000200, "Wrong size on AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, EntryPoint) == 0x000000, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_ComponentBoundEvent_Button) == 0x000008, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, Temp_bool_IsClosed_Variable) == 0x000010, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_Event_bShowingVariants) == 0x000012, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_Event_bShowingVariants' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_GetCurrentItem_ReturnValue) == 0x000018, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_GetCurrentItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_Event_SelectedItem) == 0x000020, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_Event_SelectedItem' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_GetType_ReturnValue) == 0x000028, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_GetType_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_IsValid_ReturnValue_1) == 0x000029, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00002A, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_IsValid_ReturnValue_2) == 0x00002B, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_GetType_ReturnValue_1) == 0x00002C, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_GetType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x00002D, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_DynamicCast_AsAthena_Cosmetic_Account_Item) == 0x000030, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_DynamicCast_AsAthena_Cosmetic_Account_Item' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_GetLockerItemTypeText_ReturnValue) == 0x000040, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_GetLockerItemTypeText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_GetLockerDescriptionText_ReturnValue) == 0x000058, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_GetLockerDescriptionText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_GetHero_ReturnValue) == 0x000070, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_GetHero_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_GetItemDefinitionBP_ReturnValue) == 0x000078, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_GetItemDefinitionBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_IsValid_ReturnValue_3) == 0x000080, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_DynamicCast_AsAthena_Cosmetic_Item_Definition) == 0x000088, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_DynamicCast_AsAthena_Cosmetic_Item_Definition' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_DynamicCast_bSuccess_1) == 0x000090, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_IsOwnedByCampaignHero_ReturnValue) == 0x000091, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_IsOwnedByCampaignHero_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_GetRarity_ReturnValue) == 0x000092, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_GetRarity_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_GetDisplayName_ReturnValue) == 0x000098, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_IsValid_ReturnValue_4) == 0x0000B0, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_DynamicCast_AsItem_Info_Header_Widget) == 0x0000B8, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_DynamicCast_AsItem_Info_Header_Widget' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_DynamicCast_bSuccess_2) == 0x0000C0, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_GetContext_ReturnValue) == 0x0000C8, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_HandleBack_PassThrough) == 0x0000D0, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_HandleBack_PassThrough' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_ComponentBoundEvent_TabId) == 0x0000D4, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_ComponentBoundEvent_TabId' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_ComponentBoundEvent_TabButton) == 0x0000E0, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_ComponentBoundEvent_TabButton' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_HandleBack_PassThrough_1) == 0x0000E8, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_HandleBack_PassThrough_1' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_DynamicCast_AsIcon_Tab_Button) == 0x0000F0, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_DynamicCast_AsIcon_Tab_Button' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_DynamicCast_bSuccess_3) == 0x0000F8, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_CreateDelegate_OutputDelegate) == 0x0000FC, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_CreateDelegate_OutputDelegate_1) == 0x00010C, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000120, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_K2_IsValidTimerHandle_ReturnValue) == 0x000128, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_K2_IsValidTimerHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_MakeStruct_DataTableRowHandle) == 0x000130, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_MakeStruct_DataTableRowHandle' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_K2_IsValidTimerHandle_ReturnValue_1) == 0x000140, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_K2_IsValidTimerHandle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_Event_CategoryDisplayName) == 0x000148, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_Event_CategoryDisplayName' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_Event_ItemDisplayTypeName) == 0x000160, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_Event_ItemDisplayTypeName' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_Event_SelectedCategory) == 0x000178, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_Event_SelectedCategory' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_Event_OverrideSlotImage) == 0x000180, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_Event_OverrideSlotImage' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_DynamicCast_AsAthena_Customization_Picker) == 0x000188, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_DynamicCast_AsAthena_Customization_Picker' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_DynamicCast_bSuccess_4) == 0x000190, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, Temp_bool_Has_Been_Initd_Variable) == 0x000191, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_DynamicCast_AsItem_Info_Header_Widget_1) == 0x000198, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_DynamicCast_AsItem_Info_Header_Widget_1' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_DynamicCast_bSuccess_5) == 0x0001A0, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_CustomEvent_bIsSelected) == 0x0001A1, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_CustomEvent_bIsSelected' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_DynamicCast_AsAthena_Customization_Picker_1) == 0x0001A8, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_DynamicCast_AsAthena_Customization_Picker_1' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_DynamicCast_bSuccess_6) == 0x0001B0, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_CreateDelegate_OutputDelegate_2) == 0x0001B4, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_GetContext_ReturnValue_1) == 0x0001C8, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x0001D0, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_CustomEvent_NewText) == 0x0001D8, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_CustomEvent_NewText' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector, K2Node_CreateDelegate_OutputDelegate_3) == 0x0001F0, "Member 'AthenaItemCustomizationSelector_C_ExecuteUbergraph_AthenaItemCustomizationSelector::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");

// Function AthenaItemCustomizationSelector.AthenaItemCustomizationSelector_C.BndEvt__CloseButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaItemCustomizationSelector_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaItemCustomizationSelector_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaItemCustomizationSelector_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaItemCustomizationSelector_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaItemCustomizationSelector_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaItemCustomizationSelector_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaItemCustomizationSelector_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaItemCustomizationSelector.AthenaItemCustomizationSelector_C.HandleTextChanged
// 0x0018 (0x0018 - 0x0000)
struct AthenaItemCustomizationSelector_C_HandleTextChanged final
{
public:
	class FText                                   NewText;                                           // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(AthenaItemCustomizationSelector_C_HandleTextChanged) == 0x000008, "Wrong alignment on AthenaItemCustomizationSelector_C_HandleTextChanged");
static_assert(sizeof(AthenaItemCustomizationSelector_C_HandleTextChanged) == 0x000018, "Wrong size on AthenaItemCustomizationSelector_C_HandleTextChanged");
static_assert(offsetof(AthenaItemCustomizationSelector_C_HandleTextChanged, NewText) == 0x000000, "Member 'AthenaItemCustomizationSelector_C_HandleTextChanged::NewText' has a wrong offset!");

// Function AthenaItemCustomizationSelector.AthenaItemCustomizationSelector_C.HandleTextSearchSelectedChanged
// 0x0001 (0x0001 - 0x0000)
struct AthenaItemCustomizationSelector_C_HandleTextSearchSelectedChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaItemCustomizationSelector_C_HandleTextSearchSelectedChanged) == 0x000001, "Wrong alignment on AthenaItemCustomizationSelector_C_HandleTextSearchSelectedChanged");
static_assert(sizeof(AthenaItemCustomizationSelector_C_HandleTextSearchSelectedChanged) == 0x000001, "Wrong size on AthenaItemCustomizationSelector_C_HandleTextSearchSelectedChanged");
static_assert(offsetof(AthenaItemCustomizationSelector_C_HandleTextSearchSelectedChanged, bIsSelected) == 0x000000, "Member 'AthenaItemCustomizationSelector_C_HandleTextSearchSelectedChanged::bIsSelected' has a wrong offset!");

// Function AthenaItemCustomizationSelector.AthenaItemCustomizationSelector_C.OnFinishedItemSetup
// 0x0040 (0x0040 - 0x0000)
struct AthenaItemCustomizationSelector_C_OnFinishedItemSetup final
{
public:
	class FText                                   CategoryDisplayName;                               // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   ItemDisplayTypeName;                               // 0x0018(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	EAthenaCustomizationCategory                  SelectedCategory;                                  // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstance*                      OverrideSlotImage;                                 // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaItemCustomizationSelector_C_OnFinishedItemSetup) == 0x000008, "Wrong alignment on AthenaItemCustomizationSelector_C_OnFinishedItemSetup");
static_assert(sizeof(AthenaItemCustomizationSelector_C_OnFinishedItemSetup) == 0x000040, "Wrong size on AthenaItemCustomizationSelector_C_OnFinishedItemSetup");
static_assert(offsetof(AthenaItemCustomizationSelector_C_OnFinishedItemSetup, CategoryDisplayName) == 0x000000, "Member 'AthenaItemCustomizationSelector_C_OnFinishedItemSetup::CategoryDisplayName' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_OnFinishedItemSetup, ItemDisplayTypeName) == 0x000018, "Member 'AthenaItemCustomizationSelector_C_OnFinishedItemSetup::ItemDisplayTypeName' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_OnFinishedItemSetup, SelectedCategory) == 0x000030, "Member 'AthenaItemCustomizationSelector_C_OnFinishedItemSetup::SelectedCategory' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_OnFinishedItemSetup, OverrideSlotImage) == 0x000038, "Member 'AthenaItemCustomizationSelector_C_OnFinishedItemSetup::OverrideSlotImage' has a wrong offset!");

// Function AthenaItemCustomizationSelector.AthenaItemCustomizationSelector_C.OnCurrentItemChanged
// 0x0008 (0x0008 - 0x0000)
struct AthenaItemCustomizationSelector_C_OnCurrentItemChanged final
{
public:
	class UFortItem*                              SelectedItem;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaItemCustomizationSelector_C_OnCurrentItemChanged) == 0x000008, "Wrong alignment on AthenaItemCustomizationSelector_C_OnCurrentItemChanged");
static_assert(sizeof(AthenaItemCustomizationSelector_C_OnCurrentItemChanged) == 0x000008, "Wrong size on AthenaItemCustomizationSelector_C_OnCurrentItemChanged");
static_assert(offsetof(AthenaItemCustomizationSelector_C_OnCurrentItemChanged, SelectedItem) == 0x000000, "Member 'AthenaItemCustomizationSelector_C_OnCurrentItemChanged::SelectedItem' has a wrong offset!");

// Function AthenaItemCustomizationSelector.AthenaItemCustomizationSelector_C.OnTabSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct AthenaItemCustomizationSelector_C_OnTabSelectionChanged final
{
public:
	bool                                          bShowingVariants;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaItemCustomizationSelector_C_OnTabSelectionChanged) == 0x000001, "Wrong alignment on AthenaItemCustomizationSelector_C_OnTabSelectionChanged");
static_assert(sizeof(AthenaItemCustomizationSelector_C_OnTabSelectionChanged) == 0x000001, "Wrong size on AthenaItemCustomizationSelector_C_OnTabSelectionChanged");
static_assert(offsetof(AthenaItemCustomizationSelector_C_OnTabSelectionChanged, bShowingVariants) == 0x000000, "Member 'AthenaItemCustomizationSelector_C_OnTabSelectionChanged::bShowingVariants' has a wrong offset!");

// Function AthenaItemCustomizationSelector.AthenaItemCustomizationSelector_C.BndEvt__HorizontalTabList_K2Node_ComponentBoundEvent_44_OnTabButtonCreated__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct AthenaItemCustomizationSelector_C_BndEvt__HorizontalTabList_K2Node_ComponentBoundEvent_44_OnTabButtonCreated__DelegateSignature final
{
public:
	class FName                                   TabId;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          TabButton;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaItemCustomizationSelector_C_BndEvt__HorizontalTabList_K2Node_ComponentBoundEvent_44_OnTabButtonCreated__DelegateSignature) == 0x000008, "Wrong alignment on AthenaItemCustomizationSelector_C_BndEvt__HorizontalTabList_K2Node_ComponentBoundEvent_44_OnTabButtonCreated__DelegateSignature");
static_assert(sizeof(AthenaItemCustomizationSelector_C_BndEvt__HorizontalTabList_K2Node_ComponentBoundEvent_44_OnTabButtonCreated__DelegateSignature) == 0x000010, "Wrong size on AthenaItemCustomizationSelector_C_BndEvt__HorizontalTabList_K2Node_ComponentBoundEvent_44_OnTabButtonCreated__DelegateSignature");
static_assert(offsetof(AthenaItemCustomizationSelector_C_BndEvt__HorizontalTabList_K2Node_ComponentBoundEvent_44_OnTabButtonCreated__DelegateSignature, TabId) == 0x000000, "Member 'AthenaItemCustomizationSelector_C_BndEvt__HorizontalTabList_K2Node_ComponentBoundEvent_44_OnTabButtonCreated__DelegateSignature::TabId' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_BndEvt__HorizontalTabList_K2Node_ComponentBoundEvent_44_OnTabButtonCreated__DelegateSignature, TabButton) == 0x000008, "Member 'AthenaItemCustomizationSelector_C_BndEvt__HorizontalTabList_K2Node_ComponentBoundEvent_44_OnTabButtonCreated__DelegateSignature::TabButton' has a wrong offset!");

// Function AthenaItemCustomizationSelector.AthenaItemCustomizationSelector_C.HandleBack
// 0x0001 (0x0001 - 0x0000)
struct AthenaItemCustomizationSelector_C_HandleBack final
{
public:
	bool                                          PassThrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaItemCustomizationSelector_C_HandleBack) == 0x000001, "Wrong alignment on AthenaItemCustomizationSelector_C_HandleBack");
static_assert(sizeof(AthenaItemCustomizationSelector_C_HandleBack) == 0x000001, "Wrong size on AthenaItemCustomizationSelector_C_HandleBack");
static_assert(offsetof(AthenaItemCustomizationSelector_C_HandleBack, PassThrough) == 0x000000, "Member 'AthenaItemCustomizationSelector_C_HandleBack::PassThrough' has a wrong offset!");

// Function AthenaItemCustomizationSelector.AthenaItemCustomizationSelector_C.ToggleFavorite
// 0x0040 (0x0040 - 0x0000)
struct AthenaItemCustomizationSelector_C_ToggleFavorite final
{
public:
	bool                                          PassThrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItem*                              CallFunc_GetCurrentItem_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAccountItem*                       K2Node_DynamicCast_AsFort_Account_Item;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFavorite_ReturnValue;                   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue_1;                 // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortUIFeatureState                           CallFunc_GetFeatureState_OutFeatureState;          // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortUIFeatureStateReason                     CallFunc_GetFeatureState_OutReason;                // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaItemCustomizationSelector_C_ToggleFavorite) == 0x000008, "Wrong alignment on AthenaItemCustomizationSelector_C_ToggleFavorite");
static_assert(sizeof(AthenaItemCustomizationSelector_C_ToggleFavorite) == 0x000040, "Wrong size on AthenaItemCustomizationSelector_C_ToggleFavorite");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ToggleFavorite, PassThrough) == 0x000000, "Member 'AthenaItemCustomizationSelector_C_ToggleFavorite::PassThrough' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ToggleFavorite, CallFunc_GetCurrentItem_ReturnValue) == 0x000008, "Member 'AthenaItemCustomizationSelector_C_ToggleFavorite::CallFunc_GetCurrentItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ToggleFavorite, K2Node_DynamicCast_AsFort_Account_Item) == 0x000010, "Member 'AthenaItemCustomizationSelector_C_ToggleFavorite::K2Node_DynamicCast_AsFort_Account_Item' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ToggleFavorite, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'AthenaItemCustomizationSelector_C_ToggleFavorite::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ToggleFavorite, CallFunc_GetContext_ReturnValue) == 0x000020, "Member 'AthenaItemCustomizationSelector_C_ToggleFavorite::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ToggleFavorite, CallFunc_IsFavorite_ReturnValue) == 0x000028, "Member 'AthenaItemCustomizationSelector_C_ToggleFavorite::CallFunc_IsFavorite_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ToggleFavorite, CallFunc_GetContext_ReturnValue_1) == 0x000030, "Member 'AthenaItemCustomizationSelector_C_ToggleFavorite::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ToggleFavorite, CallFunc_Not_PreBool_ReturnValue) == 0x000038, "Member 'AthenaItemCustomizationSelector_C_ToggleFavorite::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ToggleFavorite, CallFunc_GetFeatureState_OutFeatureState) == 0x000039, "Member 'AthenaItemCustomizationSelector_C_ToggleFavorite::CallFunc_GetFeatureState_OutFeatureState' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ToggleFavorite, CallFunc_GetFeatureState_OutReason) == 0x00003A, "Member 'AthenaItemCustomizationSelector_C_ToggleFavorite::CallFunc_GetFeatureState_OutReason' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ToggleFavorite, K2Node_SwitchEnum_CmpSuccess) == 0x00003B, "Member 'AthenaItemCustomizationSelector_C_ToggleFavorite::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function AthenaItemCustomizationSelector.AthenaItemCustomizationSelector_C.GetWidgetForFramingViewedItem
// 0x0008 (0x0008 - 0x0000)
struct AthenaItemCustomizationSelector_C_GetWidgetForFramingViewedItem final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaItemCustomizationSelector_C_GetWidgetForFramingViewedItem) == 0x000008, "Wrong alignment on AthenaItemCustomizationSelector_C_GetWidgetForFramingViewedItem");
static_assert(sizeof(AthenaItemCustomizationSelector_C_GetWidgetForFramingViewedItem) == 0x000008, "Wrong size on AthenaItemCustomizationSelector_C_GetWidgetForFramingViewedItem");
static_assert(offsetof(AthenaItemCustomizationSelector_C_GetWidgetForFramingViewedItem, ReturnValue) == 0x000000, "Member 'AthenaItemCustomizationSelector_C_GetWidgetForFramingViewedItem::ReturnValue' has a wrong offset!");

// Function AthenaItemCustomizationSelector.AthenaItemCustomizationSelector_C.ShowSavingModal
// 0x00D0 (0x00D0 - 0x0000)
struct AthenaItemCustomizationSelector_C_ShowSavingModal final
{
public:
	class FText                                   Temp_text_Variable;                                // 0x0000(0x0018)(ConstParm)
	class FText                                   Temp_text_Variable_1;                              // 0x0018(0x0018)(ConstParm)
	struct FSlateBrush                            CallFunc_NoResourceBrush_ReturnValue;              // 0x0030(0x0088)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProgressModalWidget_C*                 CallFunc_Create_ReturnValue;                       // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaItemCustomizationSelector_C_ShowSavingModal) == 0x000008, "Wrong alignment on AthenaItemCustomizationSelector_C_ShowSavingModal");
static_assert(sizeof(AthenaItemCustomizationSelector_C_ShowSavingModal) == 0x0000D0, "Wrong size on AthenaItemCustomizationSelector_C_ShowSavingModal");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ShowSavingModal, Temp_text_Variable) == 0x000000, "Member 'AthenaItemCustomizationSelector_C_ShowSavingModal::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ShowSavingModal, Temp_text_Variable_1) == 0x000018, "Member 'AthenaItemCustomizationSelector_C_ShowSavingModal::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ShowSavingModal, CallFunc_NoResourceBrush_ReturnValue) == 0x000030, "Member 'AthenaItemCustomizationSelector_C_ShowSavingModal::CallFunc_NoResourceBrush_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ShowSavingModal, CallFunc_IsValid_ReturnValue) == 0x0000B8, "Member 'AthenaItemCustomizationSelector_C_ShowSavingModal::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ShowSavingModal, CallFunc_GetOwningPlayer_ReturnValue) == 0x0000C0, "Member 'AthenaItemCustomizationSelector_C_ShowSavingModal::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_ShowSavingModal, CallFunc_Create_ReturnValue) == 0x0000C8, "Member 'AthenaItemCustomizationSelector_C_ShowSavingModal::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function AthenaItemCustomizationSelector.AthenaItemCustomizationSelector_C.GetCurrentItemCosmeticDefinition
// 0x0038 (0x0038 - 0x0000)
struct AthenaItemCustomizationSelector_C_GetCurrentItemCosmeticDefinition final
{
public:
	class UAthenaCosmeticItemDefinition*          Cosmetic_Item_Definition;                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItem*                              CallFunc_GetCurrentItem_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaCosmeticAccountItem*             K2Node_DynamicCast_AsAthena_Cosmetic_Account_Item; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemDefinition*                    CallFunc_GetItemDefinitionBP_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaCosmeticItemDefinition*          K2Node_DynamicCast_AsAthena_Cosmetic_Item_Definition; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaItemCustomizationSelector_C_GetCurrentItemCosmeticDefinition) == 0x000008, "Wrong alignment on AthenaItemCustomizationSelector_C_GetCurrentItemCosmeticDefinition");
static_assert(sizeof(AthenaItemCustomizationSelector_C_GetCurrentItemCosmeticDefinition) == 0x000038, "Wrong size on AthenaItemCustomizationSelector_C_GetCurrentItemCosmeticDefinition");
static_assert(offsetof(AthenaItemCustomizationSelector_C_GetCurrentItemCosmeticDefinition, Cosmetic_Item_Definition) == 0x000000, "Member 'AthenaItemCustomizationSelector_C_GetCurrentItemCosmeticDefinition::Cosmetic_Item_Definition' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_GetCurrentItemCosmeticDefinition, CallFunc_GetCurrentItem_ReturnValue) == 0x000008, "Member 'AthenaItemCustomizationSelector_C_GetCurrentItemCosmeticDefinition::CallFunc_GetCurrentItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_GetCurrentItemCosmeticDefinition, K2Node_DynamicCast_AsAthena_Cosmetic_Account_Item) == 0x000010, "Member 'AthenaItemCustomizationSelector_C_GetCurrentItemCosmeticDefinition::K2Node_DynamicCast_AsAthena_Cosmetic_Account_Item' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_GetCurrentItemCosmeticDefinition, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'AthenaItemCustomizationSelector_C_GetCurrentItemCosmeticDefinition::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_GetCurrentItemCosmeticDefinition, CallFunc_GetItemDefinitionBP_ReturnValue) == 0x000020, "Member 'AthenaItemCustomizationSelector_C_GetCurrentItemCosmeticDefinition::CallFunc_GetItemDefinitionBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_GetCurrentItemCosmeticDefinition, K2Node_DynamicCast_AsAthena_Cosmetic_Item_Definition) == 0x000028, "Member 'AthenaItemCustomizationSelector_C_GetCurrentItemCosmeticDefinition::K2Node_DynamicCast_AsAthena_Cosmetic_Item_Definition' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_GetCurrentItemCosmeticDefinition, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'AthenaItemCustomizationSelector_C_GetCurrentItemCosmeticDefinition::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function AthenaItemCustomizationSelector.AthenaItemCustomizationSelector_C.UpdateToggleFavoriteVisibility
// 0x0030 (0x0030 - 0x0000)
struct AthenaItemCustomizationSelector_C_UpdateToggleFavoriteVisibility final
{
public:
	class UFortItem*                              Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasInputActionHandler_ReturnValue;        // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsItemOwned_ReturnValue;                  // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemDefinition*                    CallFunc_GetItemDefinitionBP_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsItemDefRandomCustomizationSelector_ReturnValue; // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B[0x1];                                       // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaItemCustomizationSelector_C_UpdateToggleFavoriteVisibility) == 0x000008, "Wrong alignment on AthenaItemCustomizationSelector_C_UpdateToggleFavoriteVisibility");
static_assert(sizeof(AthenaItemCustomizationSelector_C_UpdateToggleFavoriteVisibility) == 0x000030, "Wrong size on AthenaItemCustomizationSelector_C_UpdateToggleFavoriteVisibility");
static_assert(offsetof(AthenaItemCustomizationSelector_C_UpdateToggleFavoriteVisibility, Item) == 0x000000, "Member 'AthenaItemCustomizationSelector_C_UpdateToggleFavoriteVisibility::Item' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_UpdateToggleFavoriteVisibility, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'AthenaItemCustomizationSelector_C_UpdateToggleFavoriteVisibility::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_UpdateToggleFavoriteVisibility, CallFunc_HasInputActionHandler_ReturnValue) == 0x000009, "Member 'AthenaItemCustomizationSelector_C_UpdateToggleFavoriteVisibility::CallFunc_HasInputActionHandler_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaItemCustomizationSelector_C_UpdateToggleFavoriteVisibility, CallFunc_IsItemOwned_ReturnValue) == 0x00000A, "Member 'AthenaItemCustomizationSelector_C_UpdateToggleFavoriteVisibility::CallFunc_IsItemOwned_ReturnValue' has a wrong offset!");
