#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaMatchmakingTile

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function AthenaMatchmakingTile.AthenaMatchmakingTile_C.ExecuteUbergraph_AthenaMatchmakingTile
// 0x03C0 (0x03C0 - 0x0000)
struct AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_DateTimeMinValue_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlaylistAdvertisementType                    Temp_byte_Variable_2;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlaylistAdvertisementType                    Temp_byte_Variable_6;                              // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17[0x1];                                       // 0x0017(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0018(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0030(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0048(0x0018)()
	EFortMatchmakingTileStyle                     Temp_byte_Variable_7;                              // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                Temp_object_Variable;                              // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortMatchmakingTileStyle                     Temp_byte_Variable_8;                              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_9;                              // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_10;                             // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_11;                             // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_12;                             // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortMatchmakingTileStyle                     Temp_byte_Variable_13;                             // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_76[0x2];                                       // 0x0076(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       Temp_object_Variable_1;                            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable;                               // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable_1;                             // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_14;                             // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_15;                             // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9B[0x5];                                       // 0x009B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCMSContext*                            CallFunc_GetContext_ReturnValue;                   // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsNewPlaylistInformationAvailable_ReturnValue; // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AA[0x2];                                       // 0x00AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_2;                             // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_3;                             // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_16;                             // 0x00C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_17;                             // 0x00C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x00C7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_18;                             // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_19;                             // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CB[0x1];                                       // 0x00CB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_4;                             // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_5;                             // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable;                              // 0x00DC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_1;                            // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_1;                           // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_2;                            // 0x00F4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_3;                               // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_NumRowTiles;                          // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPlaylistFrontEndData                  K2Node_Event_PlaylistToRepresent;                  // 0x0108(0x0028)(ConstParm)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_3;                           // 0x0140(0x0018)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x015A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15B[0x5];                                      // 0x015B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0160(0x0018)()
	class FText                                   CallFunc_TextToUpper_ReturnValue_1;                // 0x0178(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_MakeBrushFromTexture_ReturnValue;         // 0x0198(0x0088)()
	struct FSlateBrush                            CallFunc_MakeBrushFromTexture_ReturnValue_1;       // 0x0220(0x0088)()
	bool                                          Temp_bool_Variable_7;                              // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_20;                             // 0x02A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_21;                             // 0x02AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AB[0x5];                                      // 0x02AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x02B8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable_8;                              // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_22;                             // 0x02C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_4;                           // 0x02CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CB[0x5];                                      // 0x02CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default_5;                           // 0x02D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_23;                             // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_Select_Default_6;                           // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FC[0x4];                                      // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_7;                           // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_9;                              // 0x0309(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30A[0x6];                                      // 0x030A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_5;              // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_6;                             // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_7;                             // 0x0324(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0329(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32A[0x6];                                      // 0x032A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 K2Node_Select_Default_8;                           // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_10;                             // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0339(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x033A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33B[0x1];                                      // 0x033B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Len_ReturnValue;                          // 0x033C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0341(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x0342(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0343(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Select_Default_9;                           // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_10;                          // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_2;          // 0x0349(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_11;                          // 0x034A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_3;          // 0x034B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x034C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue_1;                // 0x034D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x034E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_5;                  // 0x034F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0351(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_12;                          // 0x0352(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_353[0x1];                                      // 0x0353(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_13;                          // 0x0354(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_14;                          // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_359[0x3];                                      // 0x0359(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_15;                          // 0x035C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_UtcNow_ReturnValue;                       // 0x0360(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x036C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_Subtract_DateTimeDateTime_ReturnValue;    // 0x0378(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Select_Default_16;                          // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetTimespanAsText_ReturnValue;            // 0x0388(0x0018)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x03A0(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x03B0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DateTimeDateTime_ReturnValue;  // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_Available;                            // 0x03B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_17;                          // 0x03BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile) == 0x000008, "Wrong alignment on AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile");
static_assert(sizeof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile) == 0x0003C0, "Wrong size on AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, EntryPoint) == 0x000000, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_DateTimeMinValue_ReturnValue) == 0x000008, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_DateTimeMinValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable) == 0x000010, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable_1) == 0x000011, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable_2) == 0x000012, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable_3) == 0x000013, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable_4) == 0x000014, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable_5) == 0x000015, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable_6) == 0x000016, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_text_Variable) == 0x000018, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_text_Variable_1) == 0x000030, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_text_Variable_2) == 0x000048, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable_7) == 0x000060, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_object_Variable) == 0x000068, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable_8) == 0x000070, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable_9) == 0x000071, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable_9' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable_10) == 0x000072, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable_10' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable_11) == 0x000073, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable_11' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable_12) == 0x000074, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable_12' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable_13) == 0x000075, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable_13' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_object_Variable_1) == 0x000078, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_bool_Variable) == 0x000080, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_class_Variable) == 0x000088, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_class_Variable_1) == 0x000090, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_class_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_bool_Variable_1) == 0x000098, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable_14) == 0x000099, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable_14' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable_15) == 0x00009A, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable_15' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_GetContext_ReturnValue) == 0x0000A0, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_bool_Variable_2) == 0x0000A8, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_IsNewPlaylistInformationAvailable_ReturnValue) == 0x0000A9, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_IsNewPlaylistInformationAvailable_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_int_Variable) == 0x0000AC, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_int_Variable_1) == 0x0000B0, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_float_Variable) == 0x0000B4, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_float_Variable_1) == 0x0000B8, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_float_Variable_2) == 0x0000BC, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_float_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_float_Variable_3) == 0x0000C0, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_float_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_bool_Variable_3) == 0x0000C4, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable_16) == 0x0000C5, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable_16' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable_17) == 0x0000C6, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable_17' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_bool_Variable_4) == 0x0000C7, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable_18) == 0x0000C8, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable_18' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable_19) == 0x0000C9, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable_19' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_bool_Variable_5) == 0x0000CA, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_float_Variable_4) == 0x0000CC, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_float_Variable_4' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_float_Variable_5) == 0x0000D0, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_float_Variable_5' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_int_Variable_2) == 0x0000D4, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000D8, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_struct_Variable) == 0x0000DC, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_Select_Default) == 0x0000E4, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_struct_Variable_1) == 0x0000E8, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_Select_Default_1) == 0x0000F0, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_struct_Variable_2) == 0x0000F4, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_bool_Variable_6) == 0x0000FC, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_int_Variable_3) == 0x000100, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_Event_NumRowTiles) == 0x000104, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_Event_NumRowTiles' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_Event_PlaylistToRepresent) == 0x000108, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_Event_PlaylistToRepresent' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000130, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_Select_Default_2) == 0x000138, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_Select_Default_3) == 0x000140, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000158, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000159, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_BooleanOR_ReturnValue) == 0x00015A, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_TextToUpper_ReturnValue) == 0x000160, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_TextToUpper_ReturnValue_1) == 0x000178, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_TextToUpper_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_TextIsEmpty_ReturnValue) == 0x000190, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_MakeBrushFromTexture_ReturnValue) == 0x000198, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_MakeBrushFromTexture_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_MakeBrushFromTexture_ReturnValue_1) == 0x000220, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_MakeBrushFromTexture_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_bool_Variable_7) == 0x0002A8, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_bool_Variable_7' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable_20) == 0x0002A9, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable_20' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable_21) == 0x0002AA, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable_21' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_PlayAnimation_ReturnValue) == 0x0002B0, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_CreateDelegate_OutputDelegate) == 0x0002B8, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_bool_Variable_8) == 0x0002C8, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_bool_Variable_8' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable_22) == 0x0002C9, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable_22' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_Select_Default_4) == 0x0002CA, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_Select_Default_5) == 0x0002D0, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_byte_Variable_23) == 0x0002D8, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_byte_Variable_23' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_Select_Default_6) == 0x0002E0, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_Select_Default_6' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_PlayAnimation_ReturnValue_1) == 0x0002E8, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_PlayAnimation_ReturnValue_2) == 0x0002F0, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_GetEndTime_ReturnValue) == 0x0002F8, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_PlayAnimation_ReturnValue_3) == 0x000300, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_Select_Default_7) == 0x000308, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_Select_Default_7' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_bool_Variable_9) == 0x000309, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_bool_Variable_9' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_PlayAnimation_ReturnValue_4) == 0x000310, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_PlayAnimation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_PlayAnimation_ReturnValue_5) == 0x000318, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_PlayAnimation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_float_Variable_6) == 0x000320, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_float_Variable_6' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_float_Variable_7) == 0x000324, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_float_Variable_7' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_BooleanOR_ReturnValue_1) == 0x000328, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_BooleanAND_ReturnValue) == 0x000329, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_Select_Default_8) == 0x000330, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_Select_Default_8' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, Temp_bool_Variable_10) == 0x000338, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::Temp_bool_Variable_10' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000339, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x00033A, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_Len_ReturnValue) == 0x00033C, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_BooleanOR_ReturnValue_2) == 0x000340, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_Greater_IntInt_ReturnValue) == 0x000341, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_BooleanOR_ReturnValue_3) == 0x000342, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_Not_PreBool_ReturnValue) == 0x000343, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_Select_Default_9) == 0x000344, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_Select_Default_9' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_Select_Default_10) == 0x000348, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_Select_Default_10' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_EqualEqual_StrStr_ReturnValue_2) == 0x000349, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_EqualEqual_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_Select_Default_11) == 0x00034A, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_Select_Default_11' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_EqualEqual_StrStr_ReturnValue_3) == 0x00034B, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_EqualEqual_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_BooleanOR_ReturnValue_4) == 0x00034C, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_BooleanOR_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_TextIsEmpty_ReturnValue_1) == 0x00034D, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_TextIsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_SwitchEnum_CmpSuccess) == 0x00034E, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_BooleanOR_ReturnValue_5) == 0x00034F, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_BooleanOR_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_BooleanAND_ReturnValue_1) == 0x000350, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000351, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_Select_Default_12) == 0x000352, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_Select_Default_12' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_Select_Default_13) == 0x000354, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_Select_Default_13' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_Select_Default_14) == 0x000358, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_Select_Default_14' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_Select_Default_15) == 0x00035C, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_Select_Default_15' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_UtcNow_ReturnValue) == 0x000360, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_UtcNow_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_Clamp_ReturnValue) == 0x000368, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00036C, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_MakeVector2D_ReturnValue) == 0x000370, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_Subtract_DateTimeDateTime_ReturnValue) == 0x000378, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_Subtract_DateTimeDateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_Select_Default_16) == 0x000380, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_Select_Default_16' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_GetTimespanAsText_ReturnValue) == 0x000388, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_GetTimespanAsText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_CreateDelegate_OutputDelegate_1) == 0x0003A0, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0003B0, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, CallFunc_EqualEqual_DateTimeDateTime_ReturnValue) == 0x0003B8, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::CallFunc_EqualEqual_DateTimeDateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_Event_Available) == 0x0003B9, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_Event_Available' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile, K2Node_Select_Default_17) == 0x0003BA, "Member 'AthenaMatchmakingTile_C_ExecuteUbergraph_AthenaMatchmakingTile::K2Node_Select_Default_17' has a wrong offset!");

// Function AthenaMatchmakingTile.AthenaMatchmakingTile_C.UpdateTileAvailability
// 0x0001 (0x0001 - 0x0000)
struct AthenaMatchmakingTile_C_UpdateTileAvailability final
{
public:
	bool                                          Available;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaMatchmakingTile_C_UpdateTileAvailability) == 0x000001, "Wrong alignment on AthenaMatchmakingTile_C_UpdateTileAvailability");
static_assert(sizeof(AthenaMatchmakingTile_C_UpdateTileAvailability) == 0x000001, "Wrong size on AthenaMatchmakingTile_C_UpdateTileAvailability");
static_assert(offsetof(AthenaMatchmakingTile_C_UpdateTileAvailability, Available) == 0x000000, "Member 'AthenaMatchmakingTile_C_UpdateTileAvailability::Available' has a wrong offset!");

// Function AthenaMatchmakingTile.AthenaMatchmakingTile_C.PlaylistChanged
// 0x0028 (0x0028 - 0x0000)
struct AthenaMatchmakingTile_C_PlaylistChanged final
{
public:
	struct FPlaylistFrontEndData                  PlaylistToRepresent;                               // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaMatchmakingTile_C_PlaylistChanged) == 0x000008, "Wrong alignment on AthenaMatchmakingTile_C_PlaylistChanged");
static_assert(sizeof(AthenaMatchmakingTile_C_PlaylistChanged) == 0x000028, "Wrong size on AthenaMatchmakingTile_C_PlaylistChanged");
static_assert(offsetof(AthenaMatchmakingTile_C_PlaylistChanged, PlaylistToRepresent) == 0x000000, "Member 'AthenaMatchmakingTile_C_PlaylistChanged::PlaylistToRepresent' has a wrong offset!");

// Function AthenaMatchmakingTile.AthenaMatchmakingTile_C.SetTileSize
// 0x0004 (0x0004 - 0x0000)
struct AthenaMatchmakingTile_C_SetTileSize final
{
public:
