#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Athena_LockOnWidgetActor_Proto

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Athena_LockOnWidgetActor_Proto.Athena_LockOnWidgetActor_Proto_C
// 0x0018 (0x0230 - 0x0218)
class AAthena_LockOnWidgetActor_Proto_C final : public AActor
{
public:
	class UWidgetComponent*                       LockOnWidget;                                      // 0x0218(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       HealthBar;                                         // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Athena_LockOnWidgetActor_Proto_C">();
	}
	static class AAthena_LockOnWidgetActor_Proto_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAthena_LockOnWidgetActor_Proto_C>();
	}
};
static_assert(alignof(AAthena_LockOnWidgetActor_Proto_C) == 0x000008, "Wrong alignment on AAthena_LockOnWidgetActor_Proto_C");
static_assert(sizeof(AAthena_LockOnWidgetActor_Proto_C) == 0x000230, "Wrong size on AAthena_LockOnWidgetActor_Proto_C");
static_assert(offsetof(AAthena_LockOnWidgetActor_Proto_C, LockOnWidget) == 0x000218, "Member 'AAthena_LockOnWidgetActor_Proto_C::LockOnWidget' has a wrong offset!");
static_assert(offsetof(AAthena_LockOnWidgetActor_Proto_C, HealthBar) == 0x000220, "Member 'AAthena_LockOnWidgetActor_Proto_C::HealthBar' has a wrong offset!");
static_assert(offsetof(AAthena_LockOnWidgetActor_Proto_C, DefaultSceneRoot) == 0x000228, "Member 'AAthena_LockOnWidgetActor_Proto_C::DefaultSceneRoot' has a wrong offset!");

}

