#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaDirectAcquisitionOfferWidget

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "GameSubCatalog_structs.hpp"
#include "SlateCore_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function AthenaDirectAcquisitionOfferWidget.AthenaDirectAcquisitionOfferWidget_C.ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget
// 0x02D0 (0x02D0 - 0x0000)
struct AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPurchasedItemInfo>             K2Node_CustomEvent_PurchasedItems;                 // 0x0018(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortStoreFrontOfferInfo*               K2Node_DynamicCast_AsFort_Store_Front_Offer_Info;  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A[0x2];                                       // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetOfferIndexAndCountText_OfferIndex;     // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetOfferIndexAndCountText_OfferDisplayCount; // 0x0080(0x0018)()
	int32                                         CallFunc_GetOfferIndexAndCountText_NextOfferIndex; // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetOfferIndexAndCountText_NextOfferDisplayCount; // 0x00A0(0x0018)()
	int32                                         CallFunc_GetOfferIndexAndCountText_OfferIndex_1;   // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetOfferIndexAndCountText_OfferDisplayCount_1; // 0x00C0(0x0018)()
	int32                                         CallFunc_GetOfferIndexAndCountText_NextOfferIndex_1; // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetOfferIndexAndCountText_NextOfferDisplayCount_1; // 0x00E0(0x0018)()
	bool                                          CallFunc_HasGroupedOffers_ReturnValue;             // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasGroupedOffers_ReturnValue_1;           // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FB[0x1];                                       // 0x00FB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            K2Node_Event_OfferBrush;                           // 0x0108(0x0088)(ConstParm)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0195(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_2;         // 0x0196(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_197[0x1];                                      // 0x0197(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemThumbnailRenderer*             K2Node_Event_InThumbnailRenderer;                  // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRendererIndex_ReturnValue;             // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_CaptureItem_C*                      CallFunc_GetOrCreateCaptureActor_ReturnValue;      // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorInt_ReturnValue;           // 0x01B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bSuccess, TArray<struct FPurchasedItemInfo>& PurchasedItems)> K2Node_CreateDelegate_OutputDelegate;              // 0x01C0(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_GetOfferIndexAndCountText_OfferIndex_2;   // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetOfferIndexAndCountText_OfferDisplayCount_2; // 0x01D8(0x0018)()
	int32                                         CallFunc_GetOfferIndexAndCountText_NextOfferIndex_2; // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetOfferIndexAndCountText_NextOfferDisplayCount_2; // 0x01F8(0x0018)()
	class UFortStoreFrontOfferInfo*               CallFunc_Array_Get_Item;                           // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0218(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0224(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0230(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x02BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2BD[0x3];                                      // 0x02BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_InDeltaTime;                          // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget");
static_assert(sizeof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget) == 0x0002D0, "Wrong size on AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, EntryPoint) == 0x000000, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, Temp_int_Variable) == 0x000004, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, K2Node_Event_bIsSelected) == 0x000008, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, Temp_int_Variable_1) == 0x00000C, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, K2Node_CustomEvent_bSuccess) == 0x000010, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::K2Node_CustomEvent_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, K2Node_CustomEvent_PurchasedItems) == 0x000018, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::K2Node_CustomEvent_PurchasedItems' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_PlayAnimation_ReturnValue) == 0x000028, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_PlayAnimation_ReturnValue_1) == 0x000030, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, K2Node_Event_ListItemObject) == 0x000038, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, K2Node_DynamicCast_AsFort_Store_Front_Offer_Info) == 0x000040, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::K2Node_DynamicCast_AsFort_Store_Front_Offer_Info' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000050, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000058, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, K2Node_Event_bIsExpanded) == 0x000060, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_PlayAnimation_ReturnValue_2) == 0x000068, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_GetContext_ReturnValue) == 0x000070, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000079, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_GetOfferIndexAndCountText_OfferIndex) == 0x00007C, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_GetOfferIndexAndCountText_OfferIndex' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_GetOfferIndexAndCountText_OfferDisplayCount) == 0x000080, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_GetOfferIndexAndCountText_OfferDisplayCount' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_GetOfferIndexAndCountText_NextOfferIndex) == 0x000098, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_GetOfferIndexAndCountText_NextOfferIndex' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_GetOfferIndexAndCountText_NextOfferDisplayCount) == 0x0000A0, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_GetOfferIndexAndCountText_NextOfferDisplayCount' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_GetOfferIndexAndCountText_OfferIndex_1) == 0x0000B8, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_GetOfferIndexAndCountText_OfferIndex_1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_GetOfferIndexAndCountText_OfferDisplayCount_1) == 0x0000C0, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_GetOfferIndexAndCountText_OfferDisplayCount_1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_GetOfferIndexAndCountText_NextOfferIndex_1) == 0x0000D8, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_GetOfferIndexAndCountText_NextOfferIndex_1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_GetOfferIndexAndCountText_NextOfferDisplayCount_1) == 0x0000E0, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_GetOfferIndexAndCountText_NextOfferDisplayCount_1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_HasGroupedOffers_ReturnValue) == 0x0000F8, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_HasGroupedOffers_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_HasGroupedOffers_ReturnValue_1) == 0x0000F9, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_HasGroupedOffers_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x0000FA, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000FC, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000100, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_Array_Length_ReturnValue) == 0x000104, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, K2Node_Event_OfferBrush) == 0x000108, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::K2Node_Event_OfferBrush' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_Subtract_IntInt_ReturnValue) == 0x000190, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000194, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, Temp_bool_Variable) == 0x000195, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_Greater_FloatFloat_ReturnValue_2) == 0x000196, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_Greater_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, K2Node_Event_InThumbnailRenderer) == 0x000198, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::K2Node_Event_InThumbnailRenderer' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_GetRendererIndex_ReturnValue) == 0x0001A0, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_GetRendererIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_GetOrCreateCaptureActor_ReturnValue) == 0x0001A8, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_GetOrCreateCaptureActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_Multiply_VectorInt_ReturnValue) == 0x0001B0, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_Multiply_VectorInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, K2Node_Select_Default) == 0x0001BC, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, K2Node_CreateDelegate_OutputDelegate) == 0x0001C0, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_GetOfferIndexAndCountText_OfferIndex_2) == 0x0001D0, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_GetOfferIndexAndCountText_OfferIndex_2' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_GetOfferIndexAndCountText_OfferDisplayCount_2) == 0x0001D8, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_GetOfferIndexAndCountText_OfferDisplayCount_2' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_GetOfferIndexAndCountText_NextOfferIndex_2) == 0x0001F0, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_GetOfferIndexAndCountText_NextOfferIndex_2' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_GetOfferIndexAndCountText_NextOfferDisplayCount_2) == 0x0001F8, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_GetOfferIndexAndCountText_NextOfferDisplayCount_2' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_Array_Get_Item) == 0x000210, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_MakeVector_ReturnValue) == 0x000218, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_Add_VectorVector_ReturnValue) == 0x000224, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000230, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_K2_SetActorLocation_ReturnValue) == 0x0002BC, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, K2Node_Event_InDeltaTime) == 0x0002C0, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x0002C4, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget, CallFunc_FMax_ReturnValue) == 0x0002C8, "Member 'AthenaDirectAcquisitionOfferWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferWidget::CallFunc_FMax_ReturnValue' has a wrong offset!");

// Function AthenaDirectAcquisitionOfferWidget.AthenaDirectAcquisitionOfferWidget_C.UpdateCarousel
// 0x0004 (0x0004 - 0x0000)
struct AthenaDirectAcquisitionOfferWidget_C_UpdateCarousel final
{
public:
	float                                         InDeltaTime;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaDirectAcquisitionOfferWidget_C_UpdateCarousel) == 0x000004, "Wrong alignment on AthenaDirectAcquisitionOfferWidget_C_UpdateCarousel");
static_assert(sizeof(AthenaDirectAcquisitionOfferWidget_C_UpdateCarousel) == 0x000004, "Wrong size on AthenaDirectAcquisitionOfferWidget_C_UpdateCarousel");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateCarousel, InDeltaTime) == 0x000000, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateCarousel::InDeltaTime' has a wrong offset!");

// Function AthenaDirectAcquisitionOfferWidget.AthenaDirectAcquisitionOfferWidget_C.SetupThumbnailRenderer
// 0x0008 (0x0008 - 0x0000)
struct AthenaDirectAcquisitionOfferWidget_C_SetupThumbnailRenderer final
{
public:
	class UFortItemThumbnailRenderer*             InThumbnailRenderer;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaDirectAcquisitionOfferWidget_C_SetupThumbnailRenderer) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionOfferWidget_C_SetupThumbnailRenderer");
static_assert(sizeof(AthenaDirectAcquisitionOfferWidget_C_SetupThumbnailRenderer) == 0x000008, "Wrong size on AthenaDirectAcquisitionOfferWidget_C_SetupThumbnailRenderer");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_SetupThumbnailRenderer, InThumbnailRenderer) == 0x000000, "Member 'AthenaDirectAcquisitionOfferWidget_C_SetupThumbnailRenderer::InThumbnailRenderer' has a wrong offset!");

// Function AthenaDirectAcquisitionOfferWidget.AthenaDirectAcquisitionOfferWidget_C.OnOfferTileBrushLoaded
// 0x0088 (0x0088 - 0x0000)
struct AthenaDirectAcquisitionOfferWidget_C_OnOfferTileBrushLoaded final
{
public:
	struct FSlateBrush                            OfferBrush;                                        // 0x0000(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaDirectAcquisitionOfferWidget_C_OnOfferTileBrushLoaded) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionOfferWidget_C_OnOfferTileBrushLoaded");
static_assert(sizeof(AthenaDirectAcquisitionOfferWidget_C_OnOfferTileBrushLoaded) == 0x000088, "Wrong size on AthenaDirectAcquisitionOfferWidget_C_OnOfferTileBrushLoaded");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_OnOfferTileBrushLoaded, OfferBrush) == 0x000000, "Member 'AthenaDirectAcquisitionOfferWidget_C_OnOfferTileBrushLoaded::OfferBrush' has a wrong offset!");

// Function AthenaDirectAcquisitionOfferWidget.AthenaDirectAcquisitionOfferWidget_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct AthenaDirectAcquisitionOfferWidget_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaDirectAcquisitionOfferWidget_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on AthenaDirectAcquisitionOfferWidget_C_BP_OnItemExpansionChanged");
static_assert(sizeof(AthenaDirectAcquisitionOfferWidget_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on AthenaDirectAcquisitionOfferWidget_C_BP_OnItemExpansionChanged");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'AthenaDirectAcquisitionOfferWidget_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

// Function AthenaDirectAcquisitionOfferWidget.AthenaDirectAcquisitionOfferWidget_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct AthenaDirectAcquisitionOfferWidget_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaDirectAcquisitionOfferWidget_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionOfferWidget_C_OnListItemObjectSet");
static_assert(sizeof(AthenaDirectAcquisitionOfferWidget_C_OnListItemObjectSet) == 0x000008, "Wrong size on AthenaDirectAcquisitionOfferWidget_C_OnListItemObjectSet");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'AthenaDirectAcquisitionOfferWidget_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

// Function AthenaDirectAcquisitionOfferWidget.AthenaDirectAcquisitionOfferWidget_C.HandleOfferPurchaseComplete
// 0x0018 (0x0018 - 0x0000)
struct AthenaDirectAcquisitionOfferWidget_C_HandleOfferPurchaseComplete final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPurchasedItemInfo>             PurchasedItems;                                    // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(AthenaDirectAcquisitionOfferWidget_C_HandleOfferPurchaseComplete) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionOfferWidget_C_HandleOfferPurchaseComplete");
static_assert(sizeof(AthenaDirectAcquisitionOfferWidget_C_HandleOfferPurchaseComplete) == 0x000018, "Wrong size on AthenaDirectAcquisitionOfferWidget_C_HandleOfferPurchaseComplete");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_HandleOfferPurchaseComplete, bSuccess) == 0x000000, "Member 'AthenaDirectAcquisitionOfferWidget_C_HandleOfferPurchaseComplete::bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_HandleOfferPurchaseComplete, PurchasedItems) == 0x000008, "Member 'AthenaDirectAcquisitionOfferWidget_C_HandleOfferPurchaseComplete::PurchasedItems' has a wrong offset!");

// Function AthenaDirectAcquisitionOfferWidget.AthenaDirectAcquisitionOfferWidget_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct AthenaDirectAcquisitionOfferWidget_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaDirectAcquisitionOfferWidget_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on AthenaDirectAcquisitionOfferWidget_C_BP_OnItemSelectionChanged");
static_assert(sizeof(AthenaDirectAcquisitionOfferWidget_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on AthenaDirectAcquisitionOfferWidget_C_BP_OnItemSelectionChanged");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'AthenaDirectAcquisitionOfferWidget_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function AthenaDirectAcquisitionOfferWidget.AthenaDirectAcquisitionOfferWidget_C.UpdateAvailability
// 0x0180 (0x0180 - 0x0000)
struct AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	bool                                          Temp_bool_Variable_1;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_2;                               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue_1;                 // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortStoreFrontOfferInfo*               CallFunc_GetOfferInfo_ReturnValue;                 // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetOfferId_ReturnValue;                   // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOwned_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortStoreFrontOfferInfo*               CallFunc_GetOfferInfo_ReturnValue_1;               // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortStoreFrontOfferInfo*               CallFunc_GetOfferInfo_ReturnValue_2;               // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetOfferId_ReturnValue_1;                 // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUnique_ReturnValue;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOwned_ReturnValue_1;                    // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_93[0x1];                                       // 0x0093(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetQuantityRemaining_ReturnValue;         // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x00A0(0x0018)()
	int32                                         K2Node_Select_Default_1;                           // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00C0(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0108(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0118(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0130(0x0018)()
	class FText                                   K2Node_Select_Default_2;                           // 0x0148(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0160(0x0018)()
	bool                                          Temp_bool_Variable_3;                              // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability");
static_assert(sizeof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability) == 0x000180, "Wrong size on AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, Temp_bool_Variable) == 0x000000, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, Temp_text_Variable) == 0x000008, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, Temp_bool_Variable_1) == 0x000020, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, Temp_int_Variable) == 0x000024, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, Temp_int_Variable_1) == 0x000028, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, Temp_bool_Variable_2) == 0x00002C, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, Temp_int_Variable_2) == 0x000030, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, Temp_int_Variable_3) == 0x000034, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, CallFunc_GetContext_ReturnValue) == 0x000038, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, CallFunc_GetContext_ReturnValue_1) == 0x000040, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, CallFunc_GetOfferInfo_ReturnValue) == 0x000048, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::CallFunc_GetOfferInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, Temp_byte_Variable) == 0x000050, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, CallFunc_GetOfferId_ReturnValue) == 0x000058, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::CallFunc_GetOfferId_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, CallFunc_IsOwned_ReturnValue) == 0x000068, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::CallFunc_IsOwned_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, Temp_byte_Variable_1) == 0x000069, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, CallFunc_GetOfferInfo_ReturnValue_1) == 0x000070, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::CallFunc_GetOfferInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, CallFunc_GetOfferInfo_ReturnValue_2) == 0x000078, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::CallFunc_GetOfferInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, CallFunc_GetOfferId_ReturnValue_1) == 0x000080, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::CallFunc_GetOfferId_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, CallFunc_IsUnique_ReturnValue) == 0x000090, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::CallFunc_IsUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, CallFunc_IsOwned_ReturnValue_1) == 0x000091, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::CallFunc_IsOwned_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, CallFunc_BooleanOR_ReturnValue) == 0x000092, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, K2Node_Select_Default) == 0x000094, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, CallFunc_GetQuantityRemaining_ReturnValue) == 0x000098, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::CallFunc_GetQuantityRemaining_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00009C, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, CallFunc_Conv_IntToText_ReturnValue) == 0x0000A0, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, K2Node_Select_Default_1) == 0x0000B8, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, K2Node_MakeStruct_FormatArgumentData) == 0x0000C0, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000100, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, K2Node_MakeArray_Array) == 0x000108, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, CallFunc_Format_ReturnValue) == 0x000118, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, CallFunc_MakeLiteralText_ReturnValue) == 0x000130, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, K2Node_Select_Default_2) == 0x000148, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, CallFunc_MakeLiteralText_ReturnValue_1) == 0x000160, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, Temp_bool_Variable_3) == 0x000178, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability, K2Node_Select_Default_3) == 0x000179, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateAvailability::K2Node_Select_Default_3' has a wrong offset!");

// Function AthenaDirectAcquisitionOfferWidget.AthenaDirectAcquisitionOfferWidget_C.UpdateStyle
// 0x0060 (0x0060 - 0x0000)
struct AthenaDirectAcquisitionOfferWidget_C_UpdateStyle final
{
public:
	TSoftObjectPtr<class UMaterialInterface>      CallFunc_GetFirstOfferSeriesBackgroundMaterial_ReturnValue; // 0x0000(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetFirstOfferSeriesBackgroundTexture_ReturnValue; // 0x0030(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue_1; // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaDirectAcquisitionOfferWidget_C_UpdateStyle) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionOfferWidget_C_UpdateStyle");
static_assert(sizeof(AthenaDirectAcquisitionOfferWidget_C_UpdateStyle) == 0x000060, "Wrong size on AthenaDirectAcquisitionOfferWidget_C_UpdateStyle");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateStyle, CallFunc_GetFirstOfferSeriesBackgroundMaterial_ReturnValue) == 0x000000, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateStyle::CallFunc_GetFirstOfferSeriesBackgroundMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateStyle, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000028, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateStyle::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateStyle, CallFunc_GetFirstOfferSeriesBackgroundTexture_ReturnValue) == 0x000030, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateStyle::CallFunc_GetFirstOfferSeriesBackgroundTexture_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_UpdateStyle, CallFunc_IsValidSoftObjectReference_ReturnValue_1) == 0x000058, "Member 'AthenaDirectAcquisitionOfferWidget_C_UpdateStyle::CallFunc_IsValidSoftObjectReference_ReturnValue_1' has a wrong offset!");

// Function AthenaDirectAcquisitionOfferWidget.AthenaDirectAcquisitionOfferWidget_C.SetupPrice
// 0x0030 (0x0030 - 0x0000)
struct AthenaDirectAcquisitionOfferWidget_C_SetupPrice final
{
public:
	int32                                         PriceIndex;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemCount_C*                           PriceWidget;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortStoreFrontOfferInfo*               CallFunc_GetOfferInfo_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPriceItem_RequiredItemCount;           // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAccountItemDefinition*             CallFunc_GetPriceItem_ReturnValue;                 // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaDirectAcquisitionOfferWidget_C_SetupPrice) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionOfferWidget_C_SetupPrice");
static_assert(sizeof(AthenaDirectAcquisitionOfferWidget_C_SetupPrice) == 0x000030, "Wrong size on AthenaDirectAcquisitionOfferWidget_C_SetupPrice");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_SetupPrice, PriceIndex) == 0x000000, "Member 'AthenaDirectAcquisitionOfferWidget_C_SetupPrice::PriceIndex' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_SetupPrice, PriceWidget) == 0x000008, "Member 'AthenaDirectAcquisitionOfferWidget_C_SetupPrice::PriceWidget' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_SetupPrice, CallFunc_GetOfferInfo_ReturnValue) == 0x000010, "Member 'AthenaDirectAcquisitionOfferWidget_C_SetupPrice::CallFunc_GetOfferInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferWidget_C_SetupPrice, CallFunc_GetPriceItem_RequiredItemCount) == 0x000018, "Member 'AthenaDirectAcquisitionOfferWidget_C_SetupPrice::CallFunc_GetPriceItem_RequiredItemCount' has a wrong offset!");
