#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaLeaderboardTab

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaLeaderboardTab.AthenaLeaderboardTab_C
// 0x00D8 (0x0758 - 0x0680)
class UAthenaLeaderboardTab_C final : public UAthenaLeaderboardScreenBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0680(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           Box_ProfileNoStats;                                // 0x0688(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCloseButton_C*                         CloseButton;                                       // 0x0690(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCloseButton_C*                         CloseButton_2;                                     // 0x0698(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        EnableWidgetSwitcher;                              // 0x06A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HBContentMain;                                     // 0x06A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_109;                                         // 0x06B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULeaderboardHeaderRowWidget_C*          LeaderboardHeaderRow;                              // 0x06B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULeaderboardListView_C*                 LeaderboardListView;                               // 0x06C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  LeaderboardSwitcher;                               // 0x06C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULeaderboardThrobber_C*                 LeaderboardThrobber;                               // 0x06D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULeaderboardRowWidget_C*                LocalUserRow;                                      // 0x06D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       NoStatsText;                                       // 0x06E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPlayerRankEmblem_C*                    PlayerRankEmblem;                                  // 0x06E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               QueryError;                                        // 0x06F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       QueryErrorMessageText;                             // 0x06F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           ResetTimeBox;                                      // 0x0700(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBFriendsOnly;                                     // 0x0708(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBNoData;                                          // 0x0710(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FDataTableRowHandle                    PlaylistChange;                                    // 0x0718(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDataTableRowHandle                    FriendTypeChange;                                  // 0x0728(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FTimerHandle                           QueryTimerHandle;                                  // 0x0738(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             OnQueryFinishedSound;                              // 0x0740(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    BackAction;                                        // 0x0748(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_AthenaLeaderboardTab(int32 EntryPoint);
	void BndEvt__CloseButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__CloseButton_2_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void OnInputMethodChanged_Event_0(ECommonInputType bNewInputType);
	void BP_OnActivated();
	void OnQueryStarted();
	void OnQueryFinished();
	void BP_OnDeactivated();
	void OnUpdateListHeader(const struct FAthenaPlaylistLeaderboardData& PlaylistTabData);
	void OnUpdateLeaderboardListUI(bool bWasSuccessful, class UFortLeaderboardRowProxyInstance* LocalUserRow_0, const class FText& QueryErrorStr);
	void OnUpdateTabButtonText(class UCommonButton* Button, const struct FAthenaPlaylistLeaderboardData& PlaylistTabData);
	void BndEvt__LeaderboardTabList_K2Node_ComponentBoundEvent_57_OnTabButtonRemoved__DelegateSignature(class FName TabId, class UCommonButton* TabButton);
	void BndEvt__FriendsRotator_K2Node_ComponentBoundEvent_63_OnRotated__DelegateSignature(int32 Value);
	void BndEvt__MatchRotator_K2Node_ComponentBoundEvent_39_OnRotated__DelegateSignature(int32 Value);
	void BndEvt__LeaderboardSwitcher_K2Node_ComponentBoundEvent_17_OnActiveWidgetChanged__DelegateSignature(class UWidget* ActiveWidget, int32 ActiveWidgetIndex);
	void Construct();
	void BndEvt__SecondaryTabList_K2Node_ComponentBoundEvent_189_OnTabButtonCreated__DelegateSignature(class FName TabId, class UCommonButton* TabButton);
	void OnPlaylistChangeGamepad(bool* bCommitted);
	void OnFriendTypeChangeGamepad(bool* bCommitted);
	void OnQueryStateChanged(bool bQueryInProgress);
	void OnShowQueryThrobber();
	void ToggleDisabledTabVisuals(bool bShouldBeDisabled);
	void HandleBackAction(bool* PassThrough);
	void Init_Back_Action();
	void UpdateRotatorsForInput();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaLeaderboardTab_C">();
	}
	static class UAthenaLeaderboardTab_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaLeaderboardTab_C>();
	}
};
static_assert(alignof(UAthenaLeaderboardTab_C) == 0x000008, "Wrong alignment on UAthenaLeaderboardTab_C");
static_assert(sizeof(UAthenaLeaderboardTab_C) == 0x000758, "Wrong size on UAthenaLeaderboardTab_C");
static_assert(offsetof(UAthenaLeaderboardTab_C, UberGraphFrame) == 0x000680, "Member 'UAthenaLeaderboardTab_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardTab_C, Box_ProfileNoStats) == 0x000688, "Member 'UAthenaLeaderboardTab_C::Box_ProfileNoStats' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardTab_C, CloseButton) == 0x000690, "Member 'UAthenaLeaderboardTab_C::CloseButton' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardTab_C, CloseButton_2) == 0x000698, "Member 'UAthenaLeaderboardTab_C::CloseButton_2' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardTab_C, EnableWidgetSwitcher) == 0x0006A0, "Member 'UAthenaLeaderboardTab_C::EnableWidgetSwitcher' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardTab_C, HBContentMain) == 0x0006A8, "Member 'UAthenaLeaderboardTab_C::HBContentMain' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardTab_C, Image_109) == 0x0006B0, "Member 'UAthenaLeaderboardTab_C::Image_109' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardTab_C, LeaderboardHeaderRow) == 0x0006B8, "Member 'UAthenaLeaderboardTab_C::LeaderboardHeaderRow' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardTab_C, LeaderboardListView) == 0x0006C0, "Member 'UAthenaLeaderboardTab_C::LeaderboardListView' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardTab_C, LeaderboardSwitcher) == 0x0006C8, "Member 'UAthenaLeaderboardTab_C::LeaderboardSwitcher' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardTab_C, LeaderboardThrobber) == 0x0006D0, "Member 'UAthenaLeaderboardTab_C::LeaderboardThrobber' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardTab_C, LocalUserRow) == 0x0006D8, "Member 'UAthenaLeaderboardTab_C::LocalUserRow' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardTab_C, NoStatsText) == 0x0006E0, "Member 'UAthenaLeaderboardTab_C::NoStatsText' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardTab_C, PlayerRankEmblem) == 0x0006E8, "Member 'UAthenaLeaderboardTab_C::PlayerRankEmblem' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardTab_C, QueryError) == 0x0006F0, "Member 'UAthenaLeaderboardTab_C::QueryError' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardTab_C, QueryErrorMessageText) == 0x0006F8, "Member 'UAthenaLeaderboardTab_C::QueryErrorMessageText' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardTab_C, ResetTimeBox) == 0x000700, "Member 'UAthenaLeaderboardTab_C::ResetTimeBox' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardTab_C, VBFriendsOnly) == 0x000708, "Member 'UAthenaLeaderboardTab_C::VBFriendsOnly' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardTab_C, VBNoData) == 0x000710, "Member 'UAthenaLeaderboardTab_C::VBNoData' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardTab_C, PlaylistChange) == 0x000718, "Member 'UAthenaLeaderboardTab_C::PlaylistChange' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardTab_C, FriendTypeChange) == 0x000728, "Member 'UAthenaLeaderboardTab_C::FriendTypeChange' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardTab_C, QueryTimerHandle) == 0x000738, "Member 'UAthenaLeaderboardTab_C::QueryTimerHandle' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardTab_C, OnQueryFinishedSound) == 0x000740, "Member 'UAthenaLeaderboardTab_C::OnQueryFinishedSound' has a wrong offset!");
static_assert(offsetof(UAthenaLeaderboardTab_C, BackAction) == 0x000748, "Member 'UAthenaLeaderboardTab_C::BackAction' has a wrong offset!");

}

