#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaSeasonReward

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaSeasonReward.AthenaSeasonReward_C
// 0x00A8 (0x0C50 - 0x0BA8)
class UAthenaSeasonReward_C final : public UFortAthenaReward
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BA8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Fade;                                              // 0x0BB0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x0BB8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonBorder*                          BorderOwned;                                       // 0x0BC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Check;                                             // 0x0BC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ClaimedImage;                                      // 0x0BD0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LockedImage;                                       // 0x0BD8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       OwnedText;                                         // 0x0BE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RarityFlare;                                       // 0x0BE8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RevealOverlay;                                     // 0x0BF0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SBoxOwned;                                         // 0x0BF8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UnEarned_OverlayTint;                              // 0x0C00(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortItem*                              StrongItemToRepresent;                             // 0x0C08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             SoundOnReveal;                                     // 0x0C10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ViewOnHover;                                       // 0x0C18(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C19[0x7];                                      // 0x0C19(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItem*                              SecondaryItem;                                     // 0x0C20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           ShowVariantTimer;                                  // 0x0C28(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           ResetVariantTimer;                                 // 0x0C30(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         VariantIndex;                                      // 0x0C38(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WaitingForVaultToChange;                           // 0x0C3C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C3D[0x3];                                      // 0x0C3D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TimeBetweenVariants;                               // 0x0C40(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TimeBetweenVariantsRestart;                        // 0x0C44(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         VariantTimerIndex;                                 // 0x0C48(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AthenaSeasonReward(int32 EntryPoint);
	void BP_OnClicked();
	void ViewItem();
	void PlayIntro();
	void BP_OnHovered();
	void Setup(class UFortItem* InItemToRepresent, bool Claimed, bool Locked, bool LevelAchieved, bool bOwned, EFortItemCardSize ItemCardSize, int32 Quantity);
	void SetState(bool Claimed, bool Locked, bool LevelAchieved, bool bOwned);
	void SetViewOnHover(bool ShouldViewOnHover);
	void EnableRarityFlare();
	void SetSecondaryItem(class UFortItem* SecondaryItem_0);
	void ViewInVault(const TArray<class UFortItem*>& Additional_Items);
	void ViewInVaultByUser();
	void BeginCyclingVariants();
	void StopCyclingVariants();
	void ShowNextVariant();
	void OnVaultItemsChanged(TArray<class UFortItem*>& Items);
	void GetAthenaCosmeticItemDefinition(class UAthenaCosmeticItemDefinition** AsAthena_Cosmetic_Item_Definition);
	void StartVariantTimer(float OverrideTimer);
	void CancelVariantTimer();
	void ResetVariantToDefault();
	void GetItem(class UFortItem** Result);

	void GetTemporaryItems(TArray<struct FFortCosmeticVariantPreviewElement>& Cosmetics, TArray<class UFortItem*>* Temporary_Items) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaSeasonReward_C">();
	}
	static class UAthenaSeasonReward_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaSeasonReward_C>();
	}
};
static_assert(alignof(UAthenaSeasonReward_C) == 0x000008, "Wrong alignment on UAthenaSeasonReward_C");
static_assert(sizeof(UAthenaSeasonReward_C) == 0x000C50, "Wrong size on UAthenaSeasonReward_C");
static_assert(offsetof(UAthenaSeasonReward_C, UberGraphFrame) == 0x000BA8, "Member 'UAthenaSeasonReward_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonReward_C, Fade) == 0x000BB0, "Member 'UAthenaSeasonReward_C::Fade' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonReward_C, Intro) == 0x000BB8, "Member 'UAthenaSeasonReward_C::Intro' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonReward_C, BorderOwned) == 0x000BC0, "Member 'UAthenaSeasonReward_C::BorderOwned' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonReward_C, Check) == 0x000BC8, "Member 'UAthenaSeasonReward_C::Check' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonReward_C, ClaimedImage) == 0x000BD0, "Member 'UAthenaSeasonReward_C::ClaimedImage' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonReward_C, LockedImage) == 0x000BD8, "Member 'UAthenaSeasonReward_C::LockedImage' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonReward_C, OwnedText) == 0x000BE0, "Member 'UAthenaSeasonReward_C::OwnedText' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonReward_C, RarityFlare) == 0x000BE8, "Member 'UAthenaSeasonReward_C::RarityFlare' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonReward_C, RevealOverlay) == 0x000BF0, "Member 'UAthenaSeasonReward_C::RevealOverlay' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonReward_C, SBoxOwned) == 0x000BF8, "Member 'UAthenaSeasonReward_C::SBoxOwned' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonReward_C, UnEarned_OverlayTint) == 0x000C00, "Member 'UAthenaSeasonReward_C::UnEarned_OverlayTint' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonReward_C, StrongItemToRepresent) == 0x000C08, "Member 'UAthenaSeasonReward_C::StrongItemToRepresent' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonReward_C, SoundOnReveal) == 0x000C10, "Member 'UAthenaSeasonReward_C::SoundOnReveal' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonReward_C, ViewOnHover) == 0x000C18, "Member 'UAthenaSeasonReward_C::ViewOnHover' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonReward_C, SecondaryItem) == 0x000C20, "Member 'UAthenaSeasonReward_C::SecondaryItem' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonReward_C, ShowVariantTimer) == 0x000C28, "Member 'UAthenaSeasonReward_C::ShowVariantTimer' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonReward_C, ResetVariantTimer) == 0x000C30, "Member 'UAthenaSeasonReward_C::ResetVariantTimer' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonReward_C, VariantIndex) == 0x000C38, "Member 'UAthenaSeasonReward_C::VariantIndex' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonReward_C, WaitingForVaultToChange) == 0x000C3C, "Member 'UAthenaSeasonReward_C::WaitingForVaultToChange' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonReward_C, TimeBetweenVariants) == 0x000C40, "Member 'UAthenaSeasonReward_C::TimeBetweenVariants' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonReward_C, TimeBetweenVariantsRestart) == 0x000C44, "Member 'UAthenaSeasonReward_C::TimeBetweenVariantsRestart' has a wrong offset!");
static_assert(offsetof(UAthenaSeasonReward_C, VariantTimerIndex) == 0x000C48, "Member 'UAthenaSeasonReward_C::VariantTimerIndex' has a wrong offset!");

}

