#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaDirectAcquisitionOfferUndoOverlay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaDirectAcquisitionOfferUndoOverlay.AthenaDirectAcquisitionOfferUndoOverlay_C
// 0x0038 (0x0488 - 0x0450)
class UAthenaDirectAcquisitionOfferUndoOverlay_C final : public UFortUndoCompletionWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0450(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Refunded;                                          // 0x0458(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                BorderItemNAme;                                    // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Glow;                                              // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HBoxSuccessfullyRefund;                            // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<struct FPurchasedItemInfo>             Purchased_Bundle_Items;                            // 0x0478(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn)

public:
	void Construct();
	void WidgetAnimationEvt_Refunded_K2Node_WidgetAnimationEvent_0();
	void ExecuteUbergraph_AthenaDirectAcquisitionOfferUndoOverlay(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaDirectAcquisitionOfferUndoOverlay_C">();
	}
	static class UAthenaDirectAcquisitionOfferUndoOverlay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaDirectAcquisitionOfferUndoOverlay_C>();
	}
};
static_assert(alignof(UAthenaDirectAcquisitionOfferUndoOverlay_C) == 0x000008, "Wrong alignment on UAthenaDirectAcquisitionOfferUndoOverlay_C");
static_assert(sizeof(UAthenaDirectAcquisitionOfferUndoOverlay_C) == 0x000488, "Wrong size on UAthenaDirectAcquisitionOfferUndoOverlay_C");
static_assert(offsetof(UAthenaDirectAcquisitionOfferUndoOverlay_C, UberGraphFrame) == 0x000450, "Member 'UAthenaDirectAcquisitionOfferUndoOverlay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferUndoOverlay_C, Refunded) == 0x000458, "Member 'UAthenaDirectAcquisitionOfferUndoOverlay_C::Refunded' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferUndoOverlay_C, BorderItemNAme) == 0x000460, "Member 'UAthenaDirectAcquisitionOfferUndoOverlay_C::BorderItemNAme' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferUndoOverlay_C, Glow) == 0x000468, "Member 'UAthenaDirectAcquisitionOfferUndoOverlay_C::Glow' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferUndoOverlay_C, HBoxSuccessfullyRefund) == 0x000470, "Member 'UAthenaDirectAcquisitionOfferUndoOverlay_C::HBoxSuccessfullyRefund' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferUndoOverlay_C, Purchased_Bundle_Items) == 0x000478, "Member 'UAthenaDirectAcquisitionOfferUndoOverlay_C::Purchased_Bundle_Items' has a wrong offset!");

}

