#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaNewsTileSpecialEvent_Secondary

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaNewsTileSpecialEvent_Secondary.AthenaNewsTileSpecialEvent_Secondary_C
// 0x0068 (0x02E8 - 0x0280)
class UAthenaNewsTileSpecialEvent_Secondary_C final : public UFortAthenaNewsTile
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UIconTextButton_C*                      Button_Action;                                     // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLoadGuard*                       CommonLoadGuard_0;                                 // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ConfirmSelectionFlash;                             // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Fill;                                              // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               GameModeSB;                                        // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LoadingImage;                                      // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               LoadingImageOvr;                                   // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  LoadSwitcher;                                      // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              NewsItemScale;                                     // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Tile;                                      // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VisibilityBox;                                     // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AthenaNewsTileSpecialEvent_Secondary(int32 EntryPoint);
	void SetDefaultImage();
	void PlayIntroAnim();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaNewsTileSpecialEvent_Secondary_C">();
	}
	static class UAthenaNewsTileSpecialEvent_Secondary_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaNewsTileSpecialEvent_Secondary_C>();
	}
};
static_assert(alignof(UAthenaNewsTileSpecialEvent_Secondary_C) == 0x000008, "Wrong alignment on UAthenaNewsTileSpecialEvent_Secondary_C");
static_assert(sizeof(UAthenaNewsTileSpecialEvent_Secondary_C) == 0x0002E8, "Wrong size on UAthenaNewsTileSpecialEvent_Secondary_C");
static_assert(offsetof(UAthenaNewsTileSpecialEvent_Secondary_C, UberGraphFrame) == 0x000280, "Member 'UAthenaNewsTileSpecialEvent_Secondary_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaNewsTileSpecialEvent_Secondary_C, Intro) == 0x000288, "Member 'UAthenaNewsTileSpecialEvent_Secondary_C::Intro' has a wrong offset!");
static_assert(offsetof(UAthenaNewsTileSpecialEvent_Secondary_C, Button_Action) == 0x000290, "Member 'UAthenaNewsTileSpecialEvent_Secondary_C::Button_Action' has a wrong offset!");
static_assert(offsetof(UAthenaNewsTileSpecialEvent_Secondary_C, CommonLoadGuard_0) == 0x000298, "Member 'UAthenaNewsTileSpecialEvent_Secondary_C::CommonLoadGuard_0' has a wrong offset!");
static_assert(offsetof(UAthenaNewsTileSpecialEvent_Secondary_C, ConfirmSelectionFlash) == 0x0002A0, "Member 'UAthenaNewsTileSpecialEvent_Secondary_C::ConfirmSelectionFlash' has a wrong offset!");
static_assert(offsetof(UAthenaNewsTileSpecialEvent_Secondary_C, Fill) == 0x0002A8, "Member 'UAthenaNewsTileSpecialEvent_Secondary_C::Fill' has a wrong offset!");
static_assert(offsetof(UAthenaNewsTileSpecialEvent_Secondary_C, GameModeSB) == 0x0002B0, "Member 'UAthenaNewsTileSpecialEvent_Secondary_C::GameModeSB' has a wrong offset!");
static_assert(offsetof(UAthenaNewsTileSpecialEvent_Secondary_C, LoadingImage) == 0x0002B8, "Member 'UAthenaNewsTileSpecialEvent_Secondary_C::LoadingImage' has a wrong offset!");
static_assert(offsetof(UAthenaNewsTileSpecialEvent_Secondary_C, LoadingImageOvr) == 0x0002C0, "Member 'UAthenaNewsTileSpecialEvent_Secondary_C::LoadingImageOvr' has a wrong offset!");
static_assert(offsetof(UAthenaNewsTileSpecialEvent_Secondary_C, LoadSwitcher) == 0x0002C8, "Member 'UAthenaNewsTileSpecialEvent_Secondary_C::LoadSwitcher' has a wrong offset!");
static_assert(offsetof(UAthenaNewsTileSpecialEvent_Secondary_C, NewsItemScale) == 0x0002D0, "Member 'UAthenaNewsTileSpecialEvent_Secondary_C::NewsItemScale' has a wrong offset!");
static_assert(offsetof(UAthenaNewsTileSpecialEvent_Secondary_C, SizeBox_Tile) == 0x0002D8, "Member 'UAthenaNewsTileSpecialEvent_Secondary_C::SizeBox_Tile' has a wrong offset!");
static_assert(offsetof(UAthenaNewsTileSpecialEvent_Secondary_C, VisibilityBox) == 0x0002E0, "Member 'UAthenaNewsTileSpecialEvent_Secondary_C::VisibilityBox' has a wrong offset!");

}

