#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaSpectateMatchModal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaSpectateMatchModal.AthenaSpectateMatchModal_C
// 0x0068 (0x0500 - 0x0498)
class UAthenaSpectateMatchModal_C final : public UAthenaSpectateMatchModalBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0498(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UIconTextButton_C*                      CloseButton;                                       // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCloseButton_C*                         CloseButton_130;                                   // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDynamicEntryBox*                       FriendListEntryBox;                                // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  FriendSwitcher;                                    // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableText*                          GameSessionSearchText;                             // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           GameSessionVB;                                     // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      JoinButton;                                        // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      JoinFriendSessionButton;                           // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      JoinGameSessionButton;                             // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       NoFriendsPlayingText;                              // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         FriendListCooldown;                                // 0x04F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F4[0x4];                                      // 0x04F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           FriendListCooldownTimer;                           // 0x04F8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AthenaSpectateMatchModal(int32 EntryPoint);
	void BndEvt__CloseButton_130_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BP_OnActivated();
	void Destruct();
	void RefreshFriendList();
	void BndEvt__JoinGame_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__JoinFriend_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void PreConstruct(bool IsDesignTime);
	void OnFriendNameClicked(class UCommonButton* ButtonClicked);
	void CreateFriendList(const TArray<class FString>& FriendsNames);
	void Construct();
	void BndEvt__SearchButton_K2Node_ComponentBoundEvent_8_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__GameSessionSearchText_K2Node_ComponentBoundEvent_7_OnEditableTextCommittedEvent__DelegateSignature(const class FText& Text, ETextCommit CommitMethod);
	void BndEvt__GameSessionSearchText_K2Node_ComponentBoundEvent_5_OnEditableTextChangedEvent__DelegateSignature(const class FText& Text);
	void BndEvt__CloseButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaSpectateMatchModal_C">();
	}
	static class UAthenaSpectateMatchModal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaSpectateMatchModal_C>();
	}
};
static_assert(alignof(UAthenaSpectateMatchModal_C) == 0x000008, "Wrong alignment on UAthenaSpectateMatchModal_C");
static_assert(sizeof(UAthenaSpectateMatchModal_C) == 0x000500, "Wrong size on UAthenaSpectateMatchModal_C");
static_assert(offsetof(UAthenaSpectateMatchModal_C, UberGraphFrame) == 0x000498, "Member 'UAthenaSpectateMatchModal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaSpectateMatchModal_C, CloseButton) == 0x0004A0, "Member 'UAthenaSpectateMatchModal_C::CloseButton' has a wrong offset!");
static_assert(offsetof(UAthenaSpectateMatchModal_C, CloseButton_130) == 0x0004A8, "Member 'UAthenaSpectateMatchModal_C::CloseButton_130' has a wrong offset!");
static_assert(offsetof(UAthenaSpectateMatchModal_C, FriendListEntryBox) == 0x0004B0, "Member 'UAthenaSpectateMatchModal_C::FriendListEntryBox' has a wrong offset!");
static_assert(offsetof(UAthenaSpectateMatchModal_C, FriendSwitcher) == 0x0004B8, "Member 'UAthenaSpectateMatchModal_C::FriendSwitcher' has a wrong offset!");
static_assert(offsetof(UAthenaSpectateMatchModal_C, GameSessionSearchText) == 0x0004C0, "Member 'UAthenaSpectateMatchModal_C::GameSessionSearchText' has a wrong offset!");
static_assert(offsetof(UAthenaSpectateMatchModal_C, GameSessionVB) == 0x0004C8, "Member 'UAthenaSpectateMatchModal_C::GameSessionVB' has a wrong offset!");
static_assert(offsetof(UAthenaSpectateMatchModal_C, JoinButton) == 0x0004D0, "Member 'UAthenaSpectateMatchModal_C::JoinButton' has a wrong offset!");
static_assert(offsetof(UAthenaSpectateMatchModal_C, JoinFriendSessionButton) == 0x0004D8, "Member 'UAthenaSpectateMatchModal_C::JoinFriendSessionButton' has a wrong offset!");
static_assert(offsetof(UAthenaSpectateMatchModal_C, JoinGameSessionButton) == 0x0004E0, "Member 'UAthenaSpectateMatchModal_C::JoinGameSessionButton' has a wrong offset!");
static_assert(offsetof(UAthenaSpectateMatchModal_C, NoFriendsPlayingText) == 0x0004E8, "Member 'UAthenaSpectateMatchModal_C::NoFriendsPlayingText' has a wrong offset!");
static_assert(offsetof(UAthenaSpectateMatchModal_C, FriendListCooldown) == 0x0004F0, "Member 'UAthenaSpectateMatchModal_C::FriendListCooldown' has a wrong offset!");
static_assert(offsetof(UAthenaSpectateMatchModal_C, FriendListCooldownTimer) == 0x0004F8, "Member 'UAthenaSpectateMatchModal_C::FriendListCooldownTimer' has a wrong offset!");

}

