#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaMatchmakingSpinnerButton

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK::Params
{

// Function AthenaMatchmakingSpinnerButton.AthenaMatchmakingSpinnerButton_C.OnSpinnerValueChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct AthenaMatchmakingSpinnerButton_C_OnSpinnerValueChanged__DelegateSignature final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMatchmakingSpinnerButton_C_OnSpinnerValueChanged__DelegateSignature) == 0x000004, "Wrong alignment on AthenaMatchmakingSpinnerButton_C_OnSpinnerValueChanged__DelegateSignature");
static_assert(sizeof(AthenaMatchmakingSpinnerButton_C_OnSpinnerValueChanged__DelegateSignature) == 0x000004, "Wrong size on AthenaMatchmakingSpinnerButton_C_OnSpinnerValueChanged__DelegateSignature");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_OnSpinnerValueChanged__DelegateSignature, Index_0) == 0x000000, "Member 'AthenaMatchmakingSpinnerButton_C_OnSpinnerValueChanged__DelegateSignature::Index_0' has a wrong offset!");

// Function AthenaMatchmakingSpinnerButton.AthenaMatchmakingSpinnerButton_C.ExecuteUbergraph_AthenaMatchmakingSpinnerButton
// 0x00B0 (0x00B0 - 0x0000)
struct AthenaMatchmakingSpinnerButton_C_ExecuteUbergraph_AthenaMatchmakingSpinnerButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27[0x1];                                       // 0x0027(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button_1;               // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              K2Node_CustomEvent_bNewInputType;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x003C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Index;                          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bCurrentlyLoading;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bVisible;                             // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B[0x1];                                       // 0x008B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_Value;                                // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bUserInitiated;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0094(0x0010)(ZeroConstructor, NoDestructor)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x00A4(0x0008)(NoDestructor)
};
static_assert(alignof(AthenaMatchmakingSpinnerButton_C_ExecuteUbergraph_AthenaMatchmakingSpinnerButton) == 0x000008, "Wrong alignment on AthenaMatchmakingSpinnerButton_C_ExecuteUbergraph_AthenaMatchmakingSpinnerButton");
static_assert(sizeof(AthenaMatchmakingSpinnerButton_C_ExecuteUbergraph_AthenaMatchmakingSpinnerButton) == 0x0000B0, "Wrong size on AthenaMatchmakingSpinnerButton_C_ExecuteUbergraph_AthenaMatchmakingSpinnerButton");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_ExecuteUbergraph_AthenaMatchmakingSpinnerButton, EntryPoint) == 0x000000, "Member 'AthenaMatchmakingSpinnerButton_C_ExecuteUbergraph_AthenaMatchmakingSpinnerButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_ExecuteUbergraph_AthenaMatchmakingSpinnerButton, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'AthenaMatchmakingSpinnerButton_C_ExecuteUbergraph_AthenaMatchmakingSpinnerButton::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_ExecuteUbergraph_AthenaMatchmakingSpinnerButton, CallFunc_GetCurrentInputType_ReturnValue) == 0x000010, "Member 'AthenaMatchmakingSpinnerButton_C_ExecuteUbergraph_AthenaMatchmakingSpinnerButton::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_ExecuteUbergraph_AthenaMatchmakingSpinnerButton, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'AthenaMatchmakingSpinnerButton_C_ExecuteUbergraph_AthenaMatchmakingSpinnerButton::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_ExecuteUbergraph_AthenaMatchmakingSpinnerButton, Temp_bool_Variable) == 0x000024, "Member 'AthenaMatchmakingSpinnerButton_C_ExecuteUbergraph_AthenaMatchmakingSpinnerButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_ExecuteUbergraph_AthenaMatchmakingSpinnerButton, Temp_byte_Variable) == 0x000025, "Member 'AthenaMatchmakingSpinnerButton_C_ExecuteUbergraph_AthenaMatchmakingSpinnerButton::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_ExecuteUbergraph_AthenaMatchmakingSpinnerButton, Temp_byte_Variable_1) == 0x000026, "Member 'AthenaMatchmakingSpinnerButton_C_ExecuteUbergraph_AthenaMatchmakingSpinnerButton::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_ExecuteUbergraph_AthenaMatchmakingSpinnerButton, K2Node_ComponentBoundEvent_Button_1) == 0x000028, "Member 'AthenaMatchmakingSpinnerButton_C_ExecuteUbergraph_AthenaMatchmakingSpinnerButton::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_ExecuteUbergraph_AthenaMatchmakingSpinnerButton, K2Node_ComponentBoundEvent_Button) == 0x000030, "Member 'AthenaMatchmakingSpinnerButton_C_ExecuteUbergraph_AthenaMatchmakingSpinnerButton::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_ExecuteUbergraph_AthenaMatchmakingSpinnerButton, K2Node_CustomEvent_bNewInputType) == 0x000038, "Member 'AthenaMatchmakingSpinnerButton_C_ExecuteUbergraph_AthenaMatchmakingSpinnerButton::K2Node_CustomEvent_bNewInputType' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_ExecuteUbergraph_AthenaMatchmakingSpinnerButton, K2Node_CreateDelegate_OutputDelegate_1) == 0x00003C, "Member 'AthenaMatchmakingSpinnerButton_C_ExecuteUbergraph_AthenaMatchmakingSpinnerButton::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_ExecuteUbergraph_AthenaMatchmakingSpinnerButton, CallFunc_PlayAnimation_ReturnValue) == 0x000050, "Member 'AthenaMatchmakingSpinnerButton_C_ExecuteUbergraph_AthenaMatchmakingSpinnerButton::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_ExecuteUbergraph_AthenaMatchmakingSpinnerButton, CallFunc_PlayAnimation_ReturnValue_1) == 0x000058, "Member 'AthenaMatchmakingSpinnerButton_C_ExecuteUbergraph_AthenaMatchmakingSpinnerButton::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_ExecuteUbergraph_AthenaMatchmakingSpinnerButton, CallFunc_PlayAnimation_ReturnValue_2) == 0x000060, "Member 'AthenaMatchmakingSpinnerButton_C_ExecuteUbergraph_AthenaMatchmakingSpinnerButton::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_ExecuteUbergraph_AthenaMatchmakingSpinnerButton, K2Node_CustomEvent_Index) == 0x000068, "Member 'AthenaMatchmakingSpinnerButton_C_ExecuteUbergraph_AthenaMatchmakingSpinnerButton::K2Node_CustomEvent_Index' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_ExecuteUbergraph_AthenaMatchmakingSpinnerButton, CallFunc_PlayAnimation_ReturnValue_3) == 0x000070, "Member 'AthenaMatchmakingSpinnerButton_C_ExecuteUbergraph_AthenaMatchmakingSpinnerButton::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_ExecuteUbergraph_AthenaMatchmakingSpinnerButton, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000078, "Member 'AthenaMatchmakingSpinnerButton_C_ExecuteUbergraph_AthenaMatchmakingSpinnerButton::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_ExecuteUbergraph_AthenaMatchmakingSpinnerButton, CallFunc_PlayAnimation_ReturnValue_4) == 0x000080, "Member 'AthenaMatchmakingSpinnerButton_C_ExecuteUbergraph_AthenaMatchmakingSpinnerButton::CallFunc_PlayAnimation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_ExecuteUbergraph_AthenaMatchmakingSpinnerButton, K2Node_Event_bCurrentlyLoading) == 0x000088, "Member 'AthenaMatchmakingSpinnerButton_C_ExecuteUbergraph_AthenaMatchmakingSpinnerButton::K2Node_Event_bCurrentlyLoading' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_ExecuteUbergraph_AthenaMatchmakingSpinnerButton, K2Node_Select_Default) == 0x000089, "Member 'AthenaMatchmakingSpinnerButton_C_ExecuteUbergraph_AthenaMatchmakingSpinnerButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_ExecuteUbergraph_AthenaMatchmakingSpinnerButton, K2Node_Event_bVisible) == 0x00008A, "Member 'AthenaMatchmakingSpinnerButton_C_ExecuteUbergraph_AthenaMatchmakingSpinnerButton::K2Node_Event_bVisible' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_ExecuteUbergraph_AthenaMatchmakingSpinnerButton, K2Node_Event_Value) == 0x00008C, "Member 'AthenaMatchmakingSpinnerButton_C_ExecuteUbergraph_AthenaMatchmakingSpinnerButton::K2Node_Event_Value' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_ExecuteUbergraph_AthenaMatchmakingSpinnerButton, K2Node_Event_bUserInitiated) == 0x000090, "Member 'AthenaMatchmakingSpinnerButton_C_ExecuteUbergraph_AthenaMatchmakingSpinnerButton::K2Node_Event_bUserInitiated' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_ExecuteUbergraph_AthenaMatchmakingSpinnerButton, K2Node_CreateDelegate_OutputDelegate_2) == 0x000094, "Member 'AthenaMatchmakingSpinnerButton_C_ExecuteUbergraph_AthenaMatchmakingSpinnerButton::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_ExecuteUbergraph_AthenaMatchmakingSpinnerButton, K2Node_Event_InFocusEvent) == 0x0000A4, "Member 'AthenaMatchmakingSpinnerButton_C_ExecuteUbergraph_AthenaMatchmakingSpinnerButton::K2Node_Event_InFocusEvent' has a wrong offset!");

// Function AthenaMatchmakingSpinnerButton.AthenaMatchmakingSpinnerButton_C.OnFocusLost
// 0x0008 (0x0008 - 0x0000)
struct AthenaMatchmakingSpinnerButton_C_OnFocusLost final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(AthenaMatchmakingSpinnerButton_C_OnFocusLost) == 0x000004, "Wrong alignment on AthenaMatchmakingSpinnerButton_C_OnFocusLost");
static_assert(sizeof(AthenaMatchmakingSpinnerButton_C_OnFocusLost) == 0x000008, "Wrong size on AthenaMatchmakingSpinnerButton_C_OnFocusLost");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_OnFocusLost, InFocusEvent) == 0x000000, "Member 'AthenaMatchmakingSpinnerButton_C_OnFocusLost::InFocusEvent' has a wrong offset!");

// Function AthenaMatchmakingSpinnerButton.AthenaMatchmakingSpinnerButton_C.OnSpinnerRotated
// 0x0008 (0x0008 - 0x0000)
struct AthenaMatchmakingSpinnerButton_C_OnSpinnerRotated final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUserInitiated;                                    // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaMatchmakingSpinnerButton_C_OnSpinnerRotated) == 0x000004, "Wrong alignment on AthenaMatchmakingSpinnerButton_C_OnSpinnerRotated");
static_assert(sizeof(AthenaMatchmakingSpinnerButton_C_OnSpinnerRotated) == 0x000008, "Wrong size on AthenaMatchmakingSpinnerButton_C_OnSpinnerRotated");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_OnSpinnerRotated, Value) == 0x000000, "Member 'AthenaMatchmakingSpinnerButton_C_OnSpinnerRotated::Value' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_OnSpinnerRotated, bUserInitiated) == 0x000004, "Member 'AthenaMatchmakingSpinnerButton_C_OnSpinnerRotated::bUserInitiated' has a wrong offset!");

// Function AthenaMatchmakingSpinnerButton.AthenaMatchmakingSpinnerButton_C.SetSpinnerOptionsVisiblity
// 0x0001 (0x0001 - 0x0000)
struct AthenaMatchmakingSpinnerButton_C_SetSpinnerOptionsVisiblity final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaMatchmakingSpinnerButton_C_SetSpinnerOptionsVisiblity) == 0x000001, "Wrong alignment on AthenaMatchmakingSpinnerButton_C_SetSpinnerOptionsVisiblity");
static_assert(sizeof(AthenaMatchmakingSpinnerButton_C_SetSpinnerOptionsVisiblity) == 0x000001, "Wrong size on AthenaMatchmakingSpinnerButton_C_SetSpinnerOptionsVisiblity");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_SetSpinnerOptionsVisiblity, bVisible) == 0x000000, "Member 'AthenaMatchmakingSpinnerButton_C_SetSpinnerOptionsVisiblity::bVisible' has a wrong offset!");

// Function AthenaMatchmakingSpinnerButton.AthenaMatchmakingSpinnerButton_C.OnLoadingStateChanged
// 0x0001 (0x0001 - 0x0000)
struct AthenaMatchmakingSpinnerButton_C_OnLoadingStateChanged final
{
public:
	bool                                          bCurrentlyLoading;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaMatchmakingSpinnerButton_C_OnLoadingStateChanged) == 0x000001, "Wrong alignment on AthenaMatchmakingSpinnerButton_C_OnLoadingStateChanged");
static_assert(sizeof(AthenaMatchmakingSpinnerButton_C_OnLoadingStateChanged) == 0x000001, "Wrong size on AthenaMatchmakingSpinnerButton_C_OnLoadingStateChanged");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_OnLoadingStateChanged, bCurrentlyLoading) == 0x000000, "Member 'AthenaMatchmakingSpinnerButton_C_OnLoadingStateChanged::bCurrentlyLoading' has a wrong offset!");

// Function AthenaMatchmakingSpinnerButton.AthenaMatchmakingSpinnerButton_C.AnimateIn
// 0x0004 (0x0004 - 0x0000)
struct AthenaMatchmakingSpinnerButton_C_AnimateIn final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMatchmakingSpinnerButton_C_AnimateIn) == 0x000004, "Wrong alignment on AthenaMatchmakingSpinnerButton_C_AnimateIn");
static_assert(sizeof(AthenaMatchmakingSpinnerButton_C_AnimateIn) == 0x000004, "Wrong size on AthenaMatchmakingSpinnerButton_C_AnimateIn");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_AnimateIn, Index_0) == 0x000000, "Member 'AthenaMatchmakingSpinnerButton_C_AnimateIn::Index_0' has a wrong offset!");

// Function AthenaMatchmakingSpinnerButton.AthenaMatchmakingSpinnerButton_C.InputUpdated
// 0x0001 (0x0001 - 0x0000)
struct AthenaMatchmakingSpinnerButton_C_InputUpdated final
{
public:
	ECommonInputType                              bNewInputType;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMatchmakingSpinnerButton_C_InputUpdated) == 0x000001, "Wrong alignment on AthenaMatchmakingSpinnerButton_C_InputUpdated");
static_assert(sizeof(AthenaMatchmakingSpinnerButton_C_InputUpdated) == 0x000001, "Wrong size on AthenaMatchmakingSpinnerButton_C_InputUpdated");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_InputUpdated, bNewInputType) == 0x000000, "Member 'AthenaMatchmakingSpinnerButton_C_InputUpdated::bNewInputType' has a wrong offset!");

// Function AthenaMatchmakingSpinnerButton.AthenaMatchmakingSpinnerButton_C.BndEvt__SimpleCommonButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaMatchmakingSpinnerButton_C_BndEvt__SimpleCommonButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMatchmakingSpinnerButton_C_BndEvt__SimpleCommonButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaMatchmakingSpinnerButton_C_BndEvt__SimpleCommonButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaMatchmakingSpinnerButton_C_BndEvt__SimpleCommonButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaMatchmakingSpinnerButton_C_BndEvt__SimpleCommonButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_BndEvt__SimpleCommonButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaMatchmakingSpinnerButton_C_BndEvt__SimpleCommonButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaMatchmakingSpinnerButton.AthenaMatchmakingSpinnerButton_C.BndEvt__SimpleCommonButton_1_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaMatchmakingSpinnerButton_C_BndEvt__SimpleCommonButton_1_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMatchmakingSpinnerButton_C_BndEvt__SimpleCommonButton_1_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaMatchmakingSpinnerButton_C_BndEvt__SimpleCommonButton_1_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaMatchmakingSpinnerButton_C_BndEvt__SimpleCommonButton_1_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaMatchmakingSpinnerButton_C_BndEvt__SimpleCommonButton_1_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_BndEvt__SimpleCommonButton_1_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaMatchmakingSpinnerButton_C_BndEvt__SimpleCommonButton_1_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaMatchmakingSpinnerButton.AthenaMatchmakingSpinnerButton_C.Set Button Sizes
// 0x003C (0x003C - 0x0000)
struct AthenaMatchmakingSpinnerButton_C_Set_Button_Sizes final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_1;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_2;                             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_3;                             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Select_Default;                             // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_1;                           // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_2;                           // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMatchmakingSpinnerButton_C_Set_Button_Sizes) == 0x000004, "Wrong alignment on AthenaMatchmakingSpinnerButton_C_Set_Button_Sizes");
static_assert(sizeof(AthenaMatchmakingSpinnerButton_C_Set_Button_Sizes) == 0x00003C, "Wrong size on AthenaMatchmakingSpinnerButton_C_Set_Button_Sizes");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_Set_Button_Sizes, Temp_bool_Variable) == 0x000000, "Member 'AthenaMatchmakingSpinnerButton_C_Set_Button_Sizes::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_Set_Button_Sizes, Temp_float_Variable) == 0x000004, "Member 'AthenaMatchmakingSpinnerButton_C_Set_Button_Sizes::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_Set_Button_Sizes, Temp_float_Variable_1) == 0x000008, "Member 'AthenaMatchmakingSpinnerButton_C_Set_Button_Sizes::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_Set_Button_Sizes, Temp_bool_Variable_1) == 0x00000C, "Member 'AthenaMatchmakingSpinnerButton_C_Set_Button_Sizes::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_Set_Button_Sizes, Temp_struct_Variable) == 0x000010, "Member 'AthenaMatchmakingSpinnerButton_C_Set_Button_Sizes::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_Set_Button_Sizes, Temp_struct_Variable_1) == 0x000018, "Member 'AthenaMatchmakingSpinnerButton_C_Set_Button_Sizes::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_Set_Button_Sizes, Temp_bool_Variable_2) == 0x000020, "Member 'AthenaMatchmakingSpinnerButton_C_Set_Button_Sizes::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_Set_Button_Sizes, Temp_float_Variable_2) == 0x000024, "Member 'AthenaMatchmakingSpinnerButton_C_Set_Button_Sizes::Temp_float_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_Set_Button_Sizes, Temp_float_Variable_3) == 0x000028, "Member 'AthenaMatchmakingSpinnerButton_C_Set_Button_Sizes::Temp_float_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_Set_Button_Sizes, K2Node_Select_Default) == 0x00002C, "Member 'AthenaMatchmakingSpinnerButton_C_Set_Button_Sizes::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_Set_Button_Sizes, K2Node_Select_Default_1) == 0x000034, "Member 'AthenaMatchmakingSpinnerButton_C_Set_Button_Sizes::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_Set_Button_Sizes, K2Node_Select_Default_2) == 0x000038, "Member 'AthenaMatchmakingSpinnerButton_C_Set_Button_Sizes::K2Node_Select_Default_2' has a wrong offset!");

// Function AthenaMatchmakingSpinnerButton.AthenaMatchmakingSpinnerButton_C.DoCustomNavigation_0
// 0x0010 (0x0010 - 0x0000)
struct AthenaMatchmakingSpinnerButton_C_DoCustomNavigation_0 final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMatchmakingSpinnerButton_C_DoCustomNavigation_0) == 0x000008, "Wrong alignment on AthenaMatchmakingSpinnerButton_C_DoCustomNavigation_0");
static_assert(sizeof(AthenaMatchmakingSpinnerButton_C_DoCustomNavigation_0) == 0x000010, "Wrong size on AthenaMatchmakingSpinnerButton_C_DoCustomNavigation_0");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_DoCustomNavigation_0, Navigation_0) == 0x000000, "Member 'AthenaMatchmakingSpinnerButton_C_DoCustomNavigation_0::Navigation_0' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_DoCustomNavigation_0, ReturnValue) == 0x000008, "Member 'AthenaMatchmakingSpinnerButton_C_DoCustomNavigation_0::ReturnValue' has a wrong offset!");

// Function AthenaMatchmakingSpinnerButton.AthenaMatchmakingSpinnerButton_C.UpdateSyle
// 0x00C0 (0x00C0 - 0x0000)
struct AthenaMatchmakingSpinnerButton_C_UpdateSyle final
{
public:
	ECommonInputType                              InputType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable;                              // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_1;                            // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              Temp_byte_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              Temp_byte_Variable_1;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_2;                             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_3;                             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              Temp_byte_Variable_2;                              // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_4;                             // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_5;                             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_6;                             // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_7;                             // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSelected_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53[0x1];                                       // 0x0053(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_Select_Default;                             // 0x0054(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_1;                           // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_2;                           // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0068(0x0050)(HasGetValueTypeHash)
	float                                         K2Node_Select_Default_3;                           // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMatchmakingSpinnerButton_C_UpdateSyle) == 0x000008, "Wrong alignment on AthenaMatchmakingSpinnerButton_C_UpdateSyle");
static_assert(sizeof(AthenaMatchmakingSpinnerButton_C_UpdateSyle) == 0x0000C0, "Wrong size on AthenaMatchmakingSpinnerButton_C_UpdateSyle");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_UpdateSyle, InputType) == 0x000000, "Member 'AthenaMatchmakingSpinnerButton_C_UpdateSyle::InputType' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_UpdateSyle, Temp_bool_Variable) == 0x000001, "Member 'AthenaMatchmakingSpinnerButton_C_UpdateSyle::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_UpdateSyle, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000002, "Member 'AthenaMatchmakingSpinnerButton_C_UpdateSyle::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_UpdateSyle, Temp_struct_Variable) == 0x000004, "Member 'AthenaMatchmakingSpinnerButton_C_UpdateSyle::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_UpdateSyle, Temp_struct_Variable_1) == 0x00000C, "Member 'AthenaMatchmakingSpinnerButton_C_UpdateSyle::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_UpdateSyle, Temp_byte_Variable) == 0x000014, "Member 'AthenaMatchmakingSpinnerButton_C_UpdateSyle::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_UpdateSyle, Temp_int_Variable) == 0x000018, "Member 'AthenaMatchmakingSpinnerButton_C_UpdateSyle::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_UpdateSyle, Temp_int_Variable_1) == 0x00001C, "Member 'AthenaMatchmakingSpinnerButton_C_UpdateSyle::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_UpdateSyle, Temp_int_Variable_2) == 0x000020, "Member 'AthenaMatchmakingSpinnerButton_C_UpdateSyle::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_UpdateSyle, Temp_int_Variable_3) == 0x000024, "Member 'AthenaMatchmakingSpinnerButton_C_UpdateSyle::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_UpdateSyle, Temp_byte_Variable_1) == 0x000028, "Member 'AthenaMatchmakingSpinnerButton_C_UpdateSyle::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_UpdateSyle, Temp_float_Variable) == 0x00002C, "Member 'AthenaMatchmakingSpinnerButton_C_UpdateSyle::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_UpdateSyle, Temp_float_Variable_1) == 0x000030, "Member 'AthenaMatchmakingSpinnerButton_C_UpdateSyle::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_UpdateSyle, Temp_float_Variable_2) == 0x000034, "Member 'AthenaMatchmakingSpinnerButton_C_UpdateSyle::Temp_float_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_UpdateSyle, Temp_float_Variable_3) == 0x000038, "Member 'AthenaMatchmakingSpinnerButton_C_UpdateSyle::Temp_float_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_UpdateSyle, Temp_byte_Variable_2) == 0x00003C, "Member 'AthenaMatchmakingSpinnerButton_C_UpdateSyle::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_UpdateSyle, Temp_float_Variable_4) == 0x000040, "Member 'AthenaMatchmakingSpinnerButton_C_UpdateSyle::Temp_float_Variable_4' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_UpdateSyle, Temp_float_Variable_5) == 0x000044, "Member 'AthenaMatchmakingSpinnerButton_C_UpdateSyle::Temp_float_Variable_5' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_UpdateSyle, Temp_float_Variable_6) == 0x000048, "Member 'AthenaMatchmakingSpinnerButton_C_UpdateSyle::Temp_float_Variable_6' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_UpdateSyle, Temp_float_Variable_7) == 0x00004C, "Member 'AthenaMatchmakingSpinnerButton_C_UpdateSyle::Temp_float_Variable_7' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_UpdateSyle, CallFunc_GetSelected_ReturnValue) == 0x000050, "Member 'AthenaMatchmakingSpinnerButton_C_UpdateSyle::CallFunc_GetSelected_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_UpdateSyle, CallFunc_IsHovered_ReturnValue) == 0x000051, "Member 'AthenaMatchmakingSpinnerButton_C_UpdateSyle::CallFunc_IsHovered_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_UpdateSyle, CallFunc_BooleanOR_ReturnValue) == 0x000052, "Member 'AthenaMatchmakingSpinnerButton_C_UpdateSyle::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_UpdateSyle, K2Node_Select_Default) == 0x000054, "Member 'AthenaMatchmakingSpinnerButton_C_UpdateSyle::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_UpdateSyle, K2Node_Select_Default_1) == 0x00005C, "Member 'AthenaMatchmakingSpinnerButton_C_UpdateSyle::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_UpdateSyle, K2Node_Select_Default_2) == 0x000060, "Member 'AthenaMatchmakingSpinnerButton_C_UpdateSyle::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_UpdateSyle, K2Node_MakeStruct_SlateFontInfo) == 0x000068, "Member 'AthenaMatchmakingSpinnerButton_C_UpdateSyle::K2Node_MakeStruct_SlateFontInfo' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_UpdateSyle, K2Node_Select_Default_3) == 0x0000B8, "Member 'AthenaMatchmakingSpinnerButton_C_UpdateSyle::K2Node_Select_Default_3' has a wrong offset!");

// Function AthenaMatchmakingSpinnerButton.AthenaMatchmakingSpinnerButton_C.SetArrowVisibility
// 0x0006 (0x0006 - 0x0000)
struct AthenaMatchmakingSpinnerButton_C_SetArrowVisibility final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaMatchmakingSpinnerButton_C_SetArrowVisibility) == 0x000001, "Wrong alignment on AthenaMatchmakingSpinnerButton_C_SetArrowVisibility");
static_assert(sizeof(AthenaMatchmakingSpinnerButton_C_SetArrowVisibility) == 0x000006, "Wrong size on AthenaMatchmakingSpinnerButton_C_SetArrowVisibility");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_SetArrowVisibility, Temp_bool_Variable) == 0x000000, "Member 'AthenaMatchmakingSpinnerButton_C_SetArrowVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_SetArrowVisibility, Temp_byte_Variable) == 0x000001, "Member 'AthenaMatchmakingSpinnerButton_C_SetArrowVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_SetArrowVisibility, Temp_byte_Variable_1) == 0x000002, "Member 'AthenaMatchmakingSpinnerButton_C_SetArrowVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_SetArrowVisibility, CallFunc_IsHovered_ReturnValue) == 0x000003, "Member 'AthenaMatchmakingSpinnerButton_C_SetArrowVisibility::CallFunc_IsHovered_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_SetArrowVisibility, CallFunc_BooleanOR_ReturnValue) == 0x000004, "Member 'AthenaMatchmakingSpinnerButton_C_SetArrowVisibility::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_SetArrowVisibility, K2Node_Select_Default) == 0x000005, "Member 'AthenaMatchmakingSpinnerButton_C_SetArrowVisibility::K2Node_Select_Default' has a wrong offset!");

// Function AthenaMatchmakingSpinnerButton.AthenaMatchmakingSpinnerButton_C.Highlight
// 0x0058 (0x0058 - 0x0000)
struct AthenaMatchmakingSpinnerButton_C_Highlight final
{
public:
	bool                                          Highlight_0;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0030(0x0028)()
};
static_assert(alignof(AthenaMatchmakingSpinnerButton_C_Highlight) == 0x000008, "Wrong alignment on AthenaMatchmakingSpinnerButton_C_Highlight");
static_assert(sizeof(AthenaMatchmakingSpinnerButton_C_Highlight) == 0x000058, "Wrong size on AthenaMatchmakingSpinnerButton_C_Highlight");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_Highlight, Highlight_0) == 0x000000, "Member 'AthenaMatchmakingSpinnerButton_C_Highlight::Highlight_0' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_Highlight, K2Node_MakeStruct_SlateColor) == 0x000008, "Member 'AthenaMatchmakingSpinnerButton_C_Highlight::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(AthenaMatchmakingSpinnerButton_C_Highlight, K2Node_MakeStruct_SlateColor_1) == 0x000030, "Member 'AthenaMatchmakingSpinnerButton_C_Highlight::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");

}

