#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaNews

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaNews.AthenaNews_C
// 0x0070 (0x0328 - 0x02B8)
class UAthenaNews_C final : public UFortAthenaNewsWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       AirRoyaleIntro;                                    // 0x02C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UAthenaNewsTile_C*                      AthenaNewsTile;                                    // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaNewsTile_C*                      AthenaNewsTile_1;                                  // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaNewsTile_C*                      AthenaNewsTile_2;                                  // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaNewsTile_Spotlight_C*            AthenaNewsTile_Spotlight;                          // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonText_SpecialEvent;                           // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonText_SpecialEvent_1;                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SpecialEventImage;                                 // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  Switcher_NewsTitle;                                // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_MoTD_Layout;                        // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             UpdateStyle;                                       // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void UpdateStyle__DelegateSignature(EAthenaNewsStyle NewStyle);
	void ExecuteUbergraph_AthenaNews(int32 EntryPoint);
	void HandleNewsStyle(EAthenaNewsStyle NewsStyle);
	void ResetViewConfiguration();
	void SingleItemConfiguration();
	void BeginIntroSequence();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaNews_C">();
	}
	static class UAthenaNews_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaNews_C>();
	}
};
static_assert(alignof(UAthenaNews_C) == 0x000008, "Wrong alignment on UAthenaNews_C");
static_assert(sizeof(UAthenaNews_C) == 0x000328, "Wrong size on UAthenaNews_C");
static_assert(offsetof(UAthenaNews_C, UberGraphFrame) == 0x0002B8, "Member 'UAthenaNews_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaNews_C, AirRoyaleIntro) == 0x0002C0, "Member 'UAthenaNews_C::AirRoyaleIntro' has a wrong offset!");
static_assert(offsetof(UAthenaNews_C, Intro) == 0x0002C8, "Member 'UAthenaNews_C::Intro' has a wrong offset!");
static_assert(offsetof(UAthenaNews_C, AthenaNewsTile) == 0x0002D0, "Member 'UAthenaNews_C::AthenaNewsTile' has a wrong offset!");
static_assert(offsetof(UAthenaNews_C, AthenaNewsTile_1) == 0x0002D8, "Member 'UAthenaNews_C::AthenaNewsTile_1' has a wrong offset!");
static_assert(offsetof(UAthenaNews_C, AthenaNewsTile_2) == 0x0002E0, "Member 'UAthenaNews_C::AthenaNewsTile_2' has a wrong offset!");
static_assert(offsetof(UAthenaNews_C, AthenaNewsTile_Spotlight) == 0x0002E8, "Member 'UAthenaNews_C::AthenaNewsTile_Spotlight' has a wrong offset!");
static_assert(offsetof(UAthenaNews_C, CommonText_SpecialEvent) == 0x0002F0, "Member 'UAthenaNews_C::CommonText_SpecialEvent' has a wrong offset!");
static_assert(offsetof(UAthenaNews_C, CommonText_SpecialEvent_1) == 0x0002F8, "Member 'UAthenaNews_C::CommonText_SpecialEvent_1' has a wrong offset!");
static_assert(offsetof(UAthenaNews_C, SpecialEventImage) == 0x000300, "Member 'UAthenaNews_C::SpecialEventImage' has a wrong offset!");
static_assert(offsetof(UAthenaNews_C, Switcher_NewsTitle) == 0x000308, "Member 'UAthenaNews_C::Switcher_NewsTitle' has a wrong offset!");
static_assert(offsetof(UAthenaNews_C, WidgetSwitcher_MoTD_Layout) == 0x000310, "Member 'UAthenaNews_C::WidgetSwitcher_MoTD_Layout' has a wrong offset!");
static_assert(offsetof(UAthenaNews_C, UpdateStyle) == 0x000318, "Member 'UAthenaNews_C::UpdateStyle' has a wrong offset!");

}

