#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaMatchmakingPlayLegacy

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaMatchmakingPlayLegacy.AthenaMatchmakingPlayLegacy_C
// 0x00A8 (0x0670 - 0x05C8)
class UAthenaMatchmakingPlayLegacy_C final : public UFortAthenaMatchmakingWidgetLegacy
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       NewModeViolation;                                  // 0x05D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UAthenaGenericLobbyViolator_C*          AthenaGenericLobbyViolator;                        // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      DebugCreativeServerSelect;                         // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MatchmakingSpinner;                                // 0x05E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          NewModeBorder;                                     // 0x05F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UShowdownLobbyViolator_C*               ShowdownLobbyViolator;                             // 0x05F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               ViolatorContent;                                   // 0x0600(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        ViolatorSwitcher;                                  // 0x0608(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             PlaylistsUpdated;                                  // 0x0610(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FTimerHandle                           ShowNewPlaylistTimer;                              // 0x0620(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnPlaylistChanged;                                 // 0x0628(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class USoundBase*                             MatchmakingSucceededSound;                         // 0x0638(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   CreativeOptionsSoftClass;                          // 0x0640(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UClass*                                 CreativeOptionsClass;                              // 0x0668(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void PlaylistsUpdated__DelegateSignature();
	void OnPlaylistChanged__DelegateSignature(const struct FPlaylistFrontEndData& Playlist_Data, const class FText& Playlist_CMS_Override, EFortLobbyType Lobby_Type);
	void ExecuteUbergraph_AthenaMatchmakingPlayLegacy(int32 EntryPoint);
	void BndEvt__PlayButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void OnMatchmakingFinishedBlueprint(bool bSuccess, class UFortPlaylistAthena* Playlist);
	void Animate();
	void UpdateCustomViolatorText(const class FText& ModeName, const class FText& SubText);
	void OnNewModeViolatorUpdated(bool bShouldShow);
	void SetSquadFillText(bool InCurrentSquadFill);
	void PlaylistChanged(const struct FPlaylistFrontEndData& NewPlaylist, const class FText& PlaylistCMSOverrideName, EFortLobbyType LobbyType);
	void OnSetCancelButtonText(const class FText& CancelButtonText);
	void OnSetPlayButtonText(const class FText& PlayButtonText);
	void OnAvailablePlaylistsUpdated();
	void Construct();
	void OnLoaded_624287AB42851447B4164286AAD2D464(class UClass* Loaded);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaMatchmakingPlayLegacy_C">();
	}
	static class UAthenaMatchmakingPlayLegacy_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaMatchmakingPlayLegacy_C>();
	}
};
static_assert(alignof(UAthenaMatchmakingPlayLegacy_C) == 0x000008, "Wrong alignment on UAthenaMatchmakingPlayLegacy_C");
static_assert(sizeof(UAthenaMatchmakingPlayLegacy_C) == 0x000670, "Wrong size on UAthenaMatchmakingPlayLegacy_C");
static_assert(offsetof(UAthenaMatchmakingPlayLegacy_C, UberGraphFrame) == 0x0005C8, "Member 'UAthenaMatchmakingPlayLegacy_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingPlayLegacy_C, NewModeViolation) == 0x0005D0, "Member 'UAthenaMatchmakingPlayLegacy_C::NewModeViolation' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingPlayLegacy_C, AthenaGenericLobbyViolator) == 0x0005D8, "Member 'UAthenaMatchmakingPlayLegacy_C::AthenaGenericLobbyViolator' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingPlayLegacy_C, DebugCreativeServerSelect) == 0x0005E0, "Member 'UAthenaMatchmakingPlayLegacy_C::DebugCreativeServerSelect' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingPlayLegacy_C, MatchmakingSpinner) == 0x0005E8, "Member 'UAthenaMatchmakingPlayLegacy_C::MatchmakingSpinner' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingPlayLegacy_C, NewModeBorder) == 0x0005F0, "Member 'UAthenaMatchmakingPlayLegacy_C::NewModeBorder' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingPlayLegacy_C, ShowdownLobbyViolator) == 0x0005F8, "Member 'UAthenaMatchmakingPlayLegacy_C::ShowdownLobbyViolator' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingPlayLegacy_C, ViolatorContent) == 0x000600, "Member 'UAthenaMatchmakingPlayLegacy_C::ViolatorContent' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingPlayLegacy_C, ViolatorSwitcher) == 0x000608, "Member 'UAthenaMatchmakingPlayLegacy_C::ViolatorSwitcher' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingPlayLegacy_C, PlaylistsUpdated) == 0x000610, "Member 'UAthenaMatchmakingPlayLegacy_C::PlaylistsUpdated' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingPlayLegacy_C, ShowNewPlaylistTimer) == 0x000620, "Member 'UAthenaMatchmakingPlayLegacy_C::ShowNewPlaylistTimer' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingPlayLegacy_C, OnPlaylistChanged) == 0x000628, "Member 'UAthenaMatchmakingPlayLegacy_C::OnPlaylistChanged' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingPlayLegacy_C, MatchmakingSucceededSound) == 0x000638, "Member 'UAthenaMatchmakingPlayLegacy_C::MatchmakingSucceededSound' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingPlayLegacy_C, CreativeOptionsSoftClass) == 0x000640, "Member 'UAthenaMatchmakingPlayLegacy_C::CreativeOptionsSoftClass' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingPlayLegacy_C, CreativeOptionsClass) == 0x000668, "Member 'UAthenaMatchmakingPlayLegacy_C::CreativeOptionsClass' has a wrong offset!");

}

