#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaDirectAcquisitionConfirmation

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaDirectAcquisitionConfirmation.AthenaDirectAcquisitionConfirmation_C
// 0x00A8 (0x0730 - 0x0688)
class UAthenaDirectAcquisitionConfirmation_C final : public UFortStoreFrontOfferDetailsWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0688(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAthenaDirectAcquisitonDetails_BattlePassStarDetails_C* AthenaDirectAcquisitonDetails_BattlePassStarDetails; // 0x0690(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      CancelButton;                                      // 0x0698(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_0;                                 // 0x06A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Currency1ItemImage2;                               // 0x06A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           CurrencyVB;                                        // 0x06B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ItemRewardsSB;                                     // 0x06B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULightbox_C*                            Lightbox;                                          // 0x06C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMTXButton_C*                           MTXButton;                                         // 0x06C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaDirectAcquisitonDetails_RefundDisclaimer_C* NonrefundableText;                                 // 0x06D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               O_Sale_PreviousPrice;                              // 0x06D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       OfferName;                                         // 0x06E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      PurchaseButton;                                    // 0x06E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextOfferDisplayPrice1;                            // 0x06F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextOriginalPrice1;                                // 0x06F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          CanPurchase;                                       // 0x0700(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsPurchasing;                                      // 0x0701(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_702[0x2];                                      // 0x0702(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumberToPurchase;                                  // 0x0704(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanPurchaseLeft;                                   // 0x0708(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          CanPurchaseRight;                                  // 0x0709(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          CanChangeQuantity;                                 // 0x070A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_70B[0x5];                                      // 0x070B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             Confirm;                                           // 0x0710(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             Decline;                                           // 0x0720(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void SetPurchaseNumber(int32 InNumToPurchse);
	void UpdateCatalogOfferName();
	void UpdateItemList();
	void SetupPrice(class UWidget* PriceContainer, class UTextBlock* NormalPriceText, class UWidget* SalePriceContainer, class UTextBlock* SalePriceText, class UImage* CurrencyImage);
	void UpdateFromOffer();
	void OnOfferSet();
	void BP_OnActivated();
	void BndEvt__PurchaseButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void Construct();
	void BndEvt__CancelButton_K2Node_ComponentBoundEvent_171_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void ExecuteUbergraph_AthenaDirectAcquisitionConfirmation(int32 EntryPoint);
	void Decline__DelegateSignature();
	void Confirm__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaDirectAcquisitionConfirmation_C">();
	}
	static class UAthenaDirectAcquisitionConfirmation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaDirectAcquisitionConfirmation_C>();
	}
};
static_assert(alignof(UAthenaDirectAcquisitionConfirmation_C) == 0x000008, "Wrong alignment on UAthenaDirectAcquisitionConfirmation_C");
static_assert(sizeof(UAthenaDirectAcquisitionConfirmation_C) == 0x000730, "Wrong size on UAthenaDirectAcquisitionConfirmation_C");
static_assert(offsetof(UAthenaDirectAcquisitionConfirmation_C, UberGraphFrame) == 0x000688, "Member 'UAthenaDirectAcquisitionConfirmation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionConfirmation_C, AthenaDirectAcquisitonDetails_BattlePassStarDetails) == 0x000690, "Member 'UAthenaDirectAcquisitionConfirmation_C::AthenaDirectAcquisitonDetails_BattlePassStarDetails' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionConfirmation_C, CancelButton) == 0x000698, "Member 'UAthenaDirectAcquisitionConfirmation_C::CancelButton' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionConfirmation_C, CommonTextBlock_0) == 0x0006A0, "Member 'UAthenaDirectAcquisitionConfirmation_C::CommonTextBlock_0' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionConfirmation_C, Currency1ItemImage2) == 0x0006A8, "Member 'UAthenaDirectAcquisitionConfirmation_C::Currency1ItemImage2' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionConfirmation_C, CurrencyVB) == 0x0006B0, "Member 'UAthenaDirectAcquisitionConfirmation_C::CurrencyVB' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionConfirmation_C, ItemRewardsSB) == 0x0006B8, "Member 'UAthenaDirectAcquisitionConfirmation_C::ItemRewardsSB' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionConfirmation_C, Lightbox) == 0x0006C0, "Member 'UAthenaDirectAcquisitionConfirmation_C::Lightbox' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionConfirmation_C, MTXButton) == 0x0006C8, "Member 'UAthenaDirectAcquisitionConfirmation_C::MTXButton' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionConfirmation_C, NonrefundableText) == 0x0006D0, "Member 'UAthenaDirectAcquisitionConfirmation_C::NonrefundableText' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionConfirmation_C, O_Sale_PreviousPrice) == 0x0006D8, "Member 'UAthenaDirectAcquisitionConfirmation_C::O_Sale_PreviousPrice' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionConfirmation_C, OfferName) == 0x0006E0, "Member 'UAthenaDirectAcquisitionConfirmation_C::OfferName' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionConfirmation_C, PurchaseButton) == 0x0006E8, "Member 'UAthenaDirectAcquisitionConfirmation_C::PurchaseButton' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionConfirmation_C, TextOfferDisplayPrice1) == 0x0006F0, "Member 'UAthenaDirectAcquisitionConfirmation_C::TextOfferDisplayPrice1' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionConfirmation_C, TextOriginalPrice1) == 0x0006F8, "Member 'UAthenaDirectAcquisitionConfirmation_C::TextOriginalPrice1' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionConfirmation_C, CanPurchase) == 0x000700, "Member 'UAthenaDirectAcquisitionConfirmation_C::CanPurchase' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionConfirmation_C, IsPurchasing) == 0x000701, "Member 'UAthenaDirectAcquisitionConfirmation_C::IsPurchasing' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionConfirmation_C, NumberToPurchase) == 0x000704, "Member 'UAthenaDirectAcquisitionConfirmation_C::NumberToPurchase' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionConfirmation_C, CanPurchaseLeft) == 0x000708, "Member 'UAthenaDirectAcquisitionConfirmation_C::CanPurchaseLeft' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionConfirmation_C, CanPurchaseRight) == 0x000709, "Member 'UAthenaDirectAcquisitionConfirmation_C::CanPurchaseRight' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionConfirmation_C, CanChangeQuantity) == 0x00070A, "Member 'UAthenaDirectAcquisitionConfirmation_C::CanChangeQuantity' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionConfirmation_C, Confirm) == 0x000710, "Member 'UAthenaDirectAcquisitionConfirmation_C::Confirm' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionConfirmation_C, Decline) == 0x000720, "Member 'UAthenaDirectAcquisitionConfirmation_C::Decline' has a wrong offset!");

}

