#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaLobbyPlayerPanel

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaLobbyPlayerPanel.AthenaLobbyPlayerPanel_C
// 0x0290 (0x0760 - 0x04D0)
class UAthenaLobbyPlayerPanel_C final : public UAthenaLobbyPlayerPanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         BattlePassRow;                                     // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_0;                                          // 0x04E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SeasonPassIcon;                                    // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FFortTeamMemberInfo                    TeamMemberInfo;                                    // 0x04F0(0x0200)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnGadgetsClicked;                                  // 0x06F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FText                                   AddFriendText;                                     // 0x0700(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   AcceptInviteText;                                  // 0x0718(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   SentInviteText;                                    // 0x0730(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   AcceptedInviteText;                                // 0x0748(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void OnGadgetsClicked__DelegateSignature();
	void ExecuteUbergraph_AthenaLobbyPlayerPanel(int32 EntryPoint);
	void OnIsMutedUpdated(bool bIsMuted);
	void OnFriendStatusUpdated(EFortFriendRequestStatus FriendRequestStatus);
	void OnHasBattlePassUpdated(bool bHasBattlePass);
	struct FEventReply OnMouseButtonDown_0(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaLobbyPlayerPanel_C">();
	}
	static class UAthenaLobbyPlayerPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaLobbyPlayerPanel_C>();
	}
};
static_assert(alignof(UAthenaLobbyPlayerPanel_C) == 0x000008, "Wrong alignment on UAthenaLobbyPlayerPanel_C");
static_assert(sizeof(UAthenaLobbyPlayerPanel_C) == 0x000760, "Wrong size on UAthenaLobbyPlayerPanel_C");
static_assert(offsetof(UAthenaLobbyPlayerPanel_C, UberGraphFrame) == 0x0004D0, "Member 'UAthenaLobbyPlayerPanel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaLobbyPlayerPanel_C, BattlePassRow) == 0x0004D8, "Member 'UAthenaLobbyPlayerPanel_C::BattlePassRow' has a wrong offset!");
static_assert(offsetof(UAthenaLobbyPlayerPanel_C, Border_0) == 0x0004E0, "Member 'UAthenaLobbyPlayerPanel_C::Border_0' has a wrong offset!");
static_assert(offsetof(UAthenaLobbyPlayerPanel_C, SeasonPassIcon) == 0x0004E8, "Member 'UAthenaLobbyPlayerPanel_C::SeasonPassIcon' has a wrong offset!");
static_assert(offsetof(UAthenaLobbyPlayerPanel_C, TeamMemberInfo) == 0x0004F0, "Member 'UAthenaLobbyPlayerPanel_C::TeamMemberInfo' has a wrong offset!");
static_assert(offsetof(UAthenaLobbyPlayerPanel_C, OnGadgetsClicked) == 0x0006F0, "Member 'UAthenaLobbyPlayerPanel_C::OnGadgetsClicked' has a wrong offset!");
static_assert(offsetof(UAthenaLobbyPlayerPanel_C, AddFriendText) == 0x000700, "Member 'UAthenaLobbyPlayerPanel_C::AddFriendText' has a wrong offset!");
static_assert(offsetof(UAthenaLobbyPlayerPanel_C, AcceptInviteText) == 0x000718, "Member 'UAthenaLobbyPlayerPanel_C::AcceptInviteText' has a wrong offset!");
static_assert(offsetof(UAthenaLobbyPlayerPanel_C, SentInviteText) == 0x000730, "Member 'UAthenaLobbyPlayerPanel_C::SentInviteText' has a wrong offset!");
static_assert(offsetof(UAthenaLobbyPlayerPanel_C, AcceptedInviteText) == 0x000748, "Member 'UAthenaLobbyPlayerPanel_C::AcceptedInviteText' has a wrong offset!");

}

