#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaLocker_ItemInfo

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function AthenaLocker_ItemInfo.AthenaLocker_ItemInfo_C.ExecuteUbergraph_AthenaLocker_ItemInfo
// 0x0098 (0x0098 - 0x0000)
struct AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemDefinition*                    K2Node_CustomEvent__item_definition;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortRarity                                   CallFunc_GetRarity_ReturnValue;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsNullItem_Is_Null_Item;                  // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsNullItem_Is_Null_Item_1;                // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsNullItem_Is_Null_Item_2;                // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortColorPalette                      CallFunc_GetRarityOrSeriesColors_ReturnValue;      // 0x0028(0x0050)(NoDestructor)
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_2;                           // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo) == 0x000008, "Wrong alignment on AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo");
static_assert(sizeof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo) == 0x000098, "Wrong size on AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, EntryPoint) == 0x000000, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, Temp_bool_Variable) == 0x000010, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, Temp_byte_Variable) == 0x000011, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, Temp_byte_Variable_1) == 0x000012, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, Temp_bool_Variable_1) == 0x000013, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, K2Node_Select_Default) == 0x000014, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, K2Node_CustomEvent__item_definition) == 0x000018, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::K2Node_CustomEvent__item_definition' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, Temp_bool_Variable_2) == 0x000020, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, CallFunc_GetRarity_ReturnValue) == 0x000021, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::CallFunc_GetRarity_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, K2Node_SwitchEnum_CmpSuccess) == 0x000022, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, CallFunc_IsNullItem_Is_Null_Item) == 0x000023, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::CallFunc_IsNullItem_Is_Null_Item' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, CallFunc_IsNullItem_Is_Null_Item_1) == 0x000024, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::CallFunc_IsNullItem_Is_Null_Item_1' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, CallFunc_IsNullItem_Is_Null_Item_2) == 0x000025, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::CallFunc_IsNullItem_Is_Null_Item_2' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, CallFunc_GetRarityOrSeriesColors_ReturnValue) == 0x000028, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::CallFunc_GetRarityOrSeriesColors_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, K2Node_Select_Default_1) == 0x000078, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo, K2Node_Select_Default_2) == 0x000088, "Member 'AthenaLocker_ItemInfo_C_ExecuteUbergraph_AthenaLocker_ItemInfo::K2Node_Select_Default_2' has a wrong offset!");

// Function AthenaLocker_ItemInfo.AthenaLocker_ItemInfo_C.Set item definition
// 0x0008 (0x0008 - 0x0000)
struct AthenaLocker_ItemInfo_C_Set_item_definition final
{
public:
	class UFortItemDefinition*                    _item_definition;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLocker_ItemInfo_C_Set_item_definition) == 0x000008, "Wrong alignment on AthenaLocker_ItemInfo_C_Set_item_definition");
static_assert(sizeof(AthenaLocker_ItemInfo_C_Set_item_definition) == 0x000008, "Wrong size on AthenaLocker_ItemInfo_C_Set_item_definition");
static_assert(offsetof(AthenaLocker_ItemInfo_C_Set_item_definition, _item_definition) == 0x000000, "Member 'AthenaLocker_ItemInfo_C_Set_item_definition::_item_definition' has a wrong offset!");

// Function AthenaLocker_ItemInfo.AthenaLocker_ItemInfo_C.Overide Item Info
// 0x0070 (0x0070 - 0x0000)
struct AthenaLocker_ItemInfo_C_Overide_Item_Info final
{
public:
	class FText                                   Name_0;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   Type;                                              // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   Description;                                       // 0x0030(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	EFortRarity                                   Rarity;                                            // 0x0048(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Hide_Rarity;                                       // 0x0049(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B[0x5];                                       // 0x004B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0050(0x0018)()
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLocker_ItemInfo_C_Overide_Item_Info) == 0x000008, "Wrong alignment on AthenaLocker_ItemInfo_C_Overide_Item_Info");
static_assert(sizeof(AthenaLocker_ItemInfo_C_Overide_Item_Info) == 0x000070, "Wrong size on AthenaLocker_ItemInfo_C_Overide_Item_Info");
static_assert(offsetof(AthenaLocker_ItemInfo_C_Overide_Item_Info, Name_0) == 0x000000, "Member 'AthenaLocker_ItemInfo_C_Overide_Item_Info::Name_0' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_Overide_Item_Info, Type) == 0x000018, "Member 'AthenaLocker_ItemInfo_C_Overide_Item_Info::Type' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_Overide_Item_Info, Description) == 0x000030, "Member 'AthenaLocker_ItemInfo_C_Overide_Item_Info::Description' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_Overide_Item_Info, Rarity) == 0x000048, "Member 'AthenaLocker_ItemInfo_C_Overide_Item_Info::Rarity' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_Overide_Item_Info, Hide_Rarity) == 0x000049, "Member 'AthenaLocker_ItemInfo_C_Overide_Item_Info::Hide_Rarity' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_Overide_Item_Info, Temp_bool_Variable) == 0x00004A, "Member 'AthenaLocker_ItemInfo_C_Overide_Item_Info::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_Overide_Item_Info, CallFunc_TextToUpper_ReturnValue) == 0x000050, "Member 'AthenaLocker_ItemInfo_C_Overide_Item_Info::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_Overide_Item_Info, Temp_byte_Variable) == 0x000068, "Member 'AthenaLocker_ItemInfo_C_Overide_Item_Info::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_Overide_Item_Info, Temp_byte_Variable_1) == 0x000069, "Member 'AthenaLocker_ItemInfo_C_Overide_Item_Info::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_Overide_Item_Info, Temp_byte_Variable_2) == 0x00006A, "Member 'AthenaLocker_ItemInfo_C_Overide_Item_Info::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_Overide_Item_Info, K2Node_Select_Default) == 0x00006B, "Member 'AthenaLocker_ItemInfo_C_Overide_Item_Info::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_Overide_Item_Info, Temp_byte_Variable_3) == 0x00006C, "Member 'AthenaLocker_ItemInfo_C_Overide_Item_Info::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_Overide_Item_Info, Temp_bool_Variable_1) == 0x00006D, "Member 'AthenaLocker_ItemInfo_C_Overide_Item_Info::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaLocker_ItemInfo_C_Overide_Item_Info, K2Node_Select_Default_1) == 0x00006E, "Member 'AthenaLocker_ItemInfo_C_Overide_Item_Info::K2Node_Select_Default_1' has a wrong offset!");

}

