#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Athena_FloppingRabbit_Wire

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function B_Athena_FloppingRabbit_Wire.B_Athena_FloppingRabbit_Wire_C.ExecuteUbergraph_B_Athena_FloppingRabbit_Wire
// 0x0498 (0x0498 - 0x0000)
struct B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable;                                // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue_1;        // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x0064(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x006C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x007C(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_PlayAnimMontage_ReturnValue;              // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetAttachedActors_OutActors;              // 0x00A8(0x0010)(ZeroConstructor, ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPickup*                            K2Node_DynamicCast_AsFort_Pickup;                  // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortItemEntry                         CallFunc_GetItemEntry_ReturnValue;                 // 0x00D8(0x0150)(ConstParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0228(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortWeaponItemDefinition*              K2Node_DynamicCast_AsFort_Weapon_Item_Definition;  // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241[0x3];                                      // 0x0241(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_249[0x3];                                      // 0x0249(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x024C(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x025C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_264[0x4];                                      // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_271[0x3];                                      // 0x0271(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_5;            // 0x0274(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0288(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_1;         // 0x0290(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class AFortPickup*                      K2Node_CustomEvent_InputPin;                       // 0x0298(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue_2;         // 0x02A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B1[0x3];                                      // 0x02B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_2;                       // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x02BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x02C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_DistanceBetweenTwoVectors_Distance;       // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x02D8(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0364(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0368(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x03F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue_1;         // 0x0400(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult_1;     // 0x040C(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire) == 0x000008, "Wrong alignment on B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire");
static_assert(sizeof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire) == 0x000498, "Wrong size on B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, EntryPoint) == 0x000000, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, K2Node_CustomEvent_NotifyName_1) == 0x000004, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::K2Node_CustomEvent_NotifyName_1' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, K2Node_CustomEvent_NotifyName) == 0x00000C, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, Temp_name_Variable) == 0x000024, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000030, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_K2_GetRootComponent_ReturnValue_1) == 0x000038, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_K2_GetRootComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, Temp_bool_Has_Been_Initd_Variable) == 0x000040, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, K2Node_CreateDelegate_OutputDelegate_1) == 0x000044, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, Temp_bool_IsClosed_Variable) == 0x000054, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, Temp_int_Loop_Counter_Variable) == 0x000058, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_Add_IntInt_ReturnValue) == 0x00005C, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, Temp_bool_IsClosed_Variable_1) == 0x000060, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, Temp_bool_Has_Been_Initd_Variable_1) == 0x000061, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, K2Node_CustomEvent_NotifyName_2) == 0x000064, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::K2Node_CustomEvent_NotifyName_2' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, K2Node_CreateDelegate_OutputDelegate_2) == 0x00006C, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, K2Node_CreateDelegate_OutputDelegate_3) == 0x00007C, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, Temp_int_Array_Index_Variable) == 0x00008C, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, K2Node_CustomEvent_NotifyName_3) == 0x000090, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::K2Node_CustomEvent_NotifyName_3' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_GetOwner_ReturnValue) == 0x000098, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_IsValid_ReturnValue) == 0x0000A0, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_PlayAnimMontage_ReturnValue) == 0x0000A4, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_PlayAnimMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_GetAttachedActors_OutActors) == 0x0000A8, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_GetAttachedActors_OutActors' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_Array_Get_Item) == 0x0000B8, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_IsValid_ReturnValue_1) == 0x0000C0, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, K2Node_DynamicCast_AsFort_Pickup) == 0x0000C8, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::K2Node_DynamicCast_AsFort_Pickup' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, K2Node_DynamicCast_bSuccess) == 0x0000D0, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_GetItemEntry_ReturnValue) == 0x0000D8, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_GetItemEntry_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000228, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, K2Node_DynamicCast_AsFort_Weapon_Item_Definition) == 0x000238, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::K2Node_DynamicCast_AsFort_Weapon_Item_Definition' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, K2Node_DynamicCast_bSuccess_1) == 0x000240, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_Array_Length_ReturnValue) == 0x000244, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_Less_IntInt_ReturnValue) == 0x000248, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, K2Node_CreateDelegate_OutputDelegate_4) == 0x00024C, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, K2Node_CustomEvent_NotifyName_4) == 0x00025C, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::K2Node_CustomEvent_NotifyName_4' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue) == 0x000268, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_IsValid_ReturnValue_2) == 0x000270, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, K2Node_CreateDelegate_OutputDelegate_5) == 0x000274, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_SpawnSoundAttached_ReturnValue) == 0x000288, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_SpawnSoundAttached_ReturnValue_1) == 0x000290, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_SpawnSoundAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, K2Node_CustomEvent_InputPin) == 0x000298, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::K2Node_CustomEvent_InputPin' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_SpawnSoundAttached_ReturnValue_2) == 0x0002A0, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_SpawnSoundAttached_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_Array_Add_ReturnValue) == 0x0002A8, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_Lerp_ReturnValue) == 0x0002AC, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_Array_Contains_ReturnValue) == 0x0002B0, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_Lerp_ReturnValue_1) == 0x0002B4, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_Lerp_ReturnValue_2) == 0x0002B8, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_Lerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_VLerp_ReturnValue) == 0x0002BC, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_FindLookAtRotation_ReturnValue) == 0x0002C8, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_DistanceBetweenTwoVectors_Distance) == 0x0002D4, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_DistanceBetweenTwoVectors_Distance' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x0002D8, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000364, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000368, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_MakeVector_ReturnValue) == 0x0003F4, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_FindLookAtRotation_ReturnValue_1) == 0x000400, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_FindLookAtRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire, CallFunc_K2_SetWorldRotation_SweepHitResult_1) == 0x00040C, "Member 'B_Athena_FloppingRabbit_Wire_C_ExecuteUbergraph_B_Athena_FloppingRabbit_Wire::CallFunc_K2_SetWorldRotation_SweepHitResult_1' has a wrong offset!");

// Function B_Athena_FloppingRabbit_Wire.B_Athena_FloppingRabbit_Wire_C.AttachNonFishingPickups
// 0x0008 (0x0008 - 0x0000)
struct B_Athena_FloppingRabbit_Wire_C_AttachNonFishingPickups final
{
public:
	const class AFortPickup*                      InputPin;                                          // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_FloppingRabbit_Wire_C_AttachNonFishingPickups) == 0x000008, "Wrong alignment on B_Athena_FloppingRabbit_Wire_C_AttachNonFishingPickups");
static_assert(sizeof(B_Athena_FloppingRabbit_Wire_C_AttachNonFishingPickups) == 0x000008, "Wrong size on B_Athena_FloppingRabbit_Wire_C_AttachNonFishingPickups");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_AttachNonFishingPickups, InputPin) == 0x000000, "Member 'B_Athena_FloppingRabbit_Wire_C_AttachNonFishingPickups::InputPin' has a wrong offset!");

// Function B_Athena_FloppingRabbit_Wire.B_Athena_FloppingRabbit_Wire_C.OnCompleted_B5133DFD4E421DB08F1ED09C5E2197B4
// 0x0008 (0x0008 - 0x0000)
struct B_Athena_FloppingRabbit_Wire_C_OnCompleted_B5133DFD4E421DB08F1ED09C5E2197B4 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_FloppingRabbit_Wire_C_OnCompleted_B5133DFD4E421DB08F1ED09C5E2197B4) == 0x000004, "Wrong alignment on B_Athena_FloppingRabbit_Wire_C_OnCompleted_B5133DFD4E421DB08F1ED09C5E2197B4");
static_assert(sizeof(B_Athena_FloppingRabbit_Wire_C_OnCompleted_B5133DFD4E421DB08F1ED09C5E2197B4) == 0x000008, "Wrong size on B_Athena_FloppingRabbit_Wire_C_OnCompleted_B5133DFD4E421DB08F1ED09C5E2197B4");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_OnCompleted_B5133DFD4E421DB08F1ED09C5E2197B4, NotifyName) == 0x000000, "Member 'B_Athena_FloppingRabbit_Wire_C_OnCompleted_B5133DFD4E421DB08F1ED09C5E2197B4::NotifyName' has a wrong offset!");

// Function B_Athena_FloppingRabbit_Wire.B_Athena_FloppingRabbit_Wire_C.OnBlendOut_B5133DFD4E421DB08F1ED09C5E2197B4
// 0x0008 (0x0008 - 0x0000)
struct B_Athena_FloppingRabbit_Wire_C_OnBlendOut_B5133DFD4E421DB08F1ED09C5E2197B4 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_FloppingRabbit_Wire_C_OnBlendOut_B5133DFD4E421DB08F1ED09C5E2197B4) == 0x000004, "Wrong alignment on B_Athena_FloppingRabbit_Wire_C_OnBlendOut_B5133DFD4E421DB08F1ED09C5E2197B4");
static_assert(sizeof(B_Athena_FloppingRabbit_Wire_C_OnBlendOut_B5133DFD4E421DB08F1ED09C5E2197B4) == 0x000008, "Wrong size on B_Athena_FloppingRabbit_Wire_C_OnBlendOut_B5133DFD4E421DB08F1ED09C5E2197B4");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_OnBlendOut_B5133DFD4E421DB08F1ED09C5E2197B4, NotifyName) == 0x000000, "Member 'B_Athena_FloppingRabbit_Wire_C_OnBlendOut_B5133DFD4E421DB08F1ED09C5E2197B4::NotifyName' has a wrong offset!");

// Function B_Athena_FloppingRabbit_Wire.B_Athena_FloppingRabbit_Wire_C.OnInterrupted_B5133DFD4E421DB08F1ED09C5E2197B4
// 0x0008 (0x0008 - 0x0000)
struct B_Athena_FloppingRabbit_Wire_C_OnInterrupted_B5133DFD4E421DB08F1ED09C5E2197B4 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_FloppingRabbit_Wire_C_OnInterrupted_B5133DFD4E421DB08F1ED09C5E2197B4) == 0x000004, "Wrong alignment on B_Athena_FloppingRabbit_Wire_C_OnInterrupted_B5133DFD4E421DB08F1ED09C5E2197B4");
static_assert(sizeof(B_Athena_FloppingRabbit_Wire_C_OnInterrupted_B5133DFD4E421DB08F1ED09C5E2197B4) == 0x000008, "Wrong size on B_Athena_FloppingRabbit_Wire_C_OnInterrupted_B5133DFD4E421DB08F1ED09C5E2197B4");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_OnInterrupted_B5133DFD4E421DB08F1ED09C5E2197B4, NotifyName) == 0x000000, "Member 'B_Athena_FloppingRabbit_Wire_C_OnInterrupted_B5133DFD4E421DB08F1ED09C5E2197B4::NotifyName' has a wrong offset!");

// Function B_Athena_FloppingRabbit_Wire.B_Athena_FloppingRabbit_Wire_C.OnNotifyBegin_B5133DFD4E421DB08F1ED09C5E2197B4
// 0x0008 (0x0008 - 0x0000)
struct B_Athena_FloppingRabbit_Wire_C_OnNotifyBegin_B5133DFD4E421DB08F1ED09C5E2197B4 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_FloppingRabbit_Wire_C_OnNotifyBegin_B5133DFD4E421DB08F1ED09C5E2197B4) == 0x000004, "Wrong alignment on B_Athena_FloppingRabbit_Wire_C_OnNotifyBegin_B5133DFD4E421DB08F1ED09C5E2197B4");
static_assert(sizeof(B_Athena_FloppingRabbit_Wire_C_OnNotifyBegin_B5133DFD4E421DB08F1ED09C5E2197B4) == 0x000008, "Wrong size on B_Athena_FloppingRabbit_Wire_C_OnNotifyBegin_B5133DFD4E421DB08F1ED09C5E2197B4");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_OnNotifyBegin_B5133DFD4E421DB08F1ED09C5E2197B4, NotifyName) == 0x000000, "Member 'B_Athena_FloppingRabbit_Wire_C_OnNotifyBegin_B5133DFD4E421DB08F1ED09C5E2197B4::NotifyName' has a wrong offset!");

// Function B_Athena_FloppingRabbit_Wire.B_Athena_FloppingRabbit_Wire_C.OnNotifyEnd_B5133DFD4E421DB08F1ED09C5E2197B4
// 0x0008 (0x0008 - 0x0000)
struct B_Athena_FloppingRabbit_Wire_C_OnNotifyEnd_B5133DFD4E421DB08F1ED09C5E2197B4 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_FloppingRabbit_Wire_C_OnNotifyEnd_B5133DFD4E421DB08F1ED09C5E2197B4) == 0x000004, "Wrong alignment on B_Athena_FloppingRabbit_Wire_C_OnNotifyEnd_B5133DFD4E421DB08F1ED09C5E2197B4");
static_assert(sizeof(B_Athena_FloppingRabbit_Wire_C_OnNotifyEnd_B5133DFD4E421DB08F1ED09C5E2197B4) == 0x000008, "Wrong size on B_Athena_FloppingRabbit_Wire_C_OnNotifyEnd_B5133DFD4E421DB08F1ED09C5E2197B4");
static_assert(offsetof(B_Athena_FloppingRabbit_Wire_C_OnNotifyEnd_B5133DFD4E421DB08F1ED09C5E2197B4, NotifyName) == 0x000000, "Member 'B_Athena_FloppingRabbit_Wire_C_OnNotifyEnd_B5133DFD4E421DB08F1ED09C5E2197B4::NotifyName' has a wrong offset!");

}

