#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Athena_DangerGrape

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function B_Athena_DangerGrape.B_Athena_DangerGrape_C.ExecuteUbergraph_B_Athena_DangerGrape
// 0x03E0 (0x03E0 - 0x0000)
struct B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* DeadActor, float Damage, class AFortPawn* InstigatedBy, const struct FVector& HitLocation, class AActor* DamageCauser)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetActorTeam_ReturnValue;                 // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0084(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_EvaluateCurveTableRow_OutXY;              // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EvaluateCurveTableRow_ReturnValue;        // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x00A0(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00B0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x00B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue_1;              // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue;                // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_1;        // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0108(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAthena_GameMode_C*                     K2Node_DynamicCast_AsAthena_Game_Mode;             // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortServerBotManagerAthena*            CallFunc_GetServerBotManager_ReturnValue;          // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0148(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0154(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData;               // 0x0160(0x00B0)()
	struct FVector                                CallFunc_K2_ProjectPointToNavigation_ProjectedLocation; // 0x0210(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_ProjectPointToNavigation_ReturnValue;  // 0x021C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21D[0x3];                                      // 0x021D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_3;                   // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default;                             // 0x0228(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData_1;             // 0x0238(0x00B0)()
	class AActor*                                 K2Node_CustomEvent_DeadActor;                      // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Damage_1;                       // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F4[0x4];                                      // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              K2Node_CustomEvent_InstigatedBy_1;                 // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_HitLocation_1;                  // 0x0300(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_DamageCauser_1;                 // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortAthenaAIBotRunTimeCustomizationData K2Node_MakeStruct_FortAthenaAIBotRunTimeCustomizationData; // 0x0318(0x0010)(NoDestructor)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0328(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawnAthena*                  CallFunc_SpawnBot_ReturnValue;                     // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0338(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue_2;              // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortAthenaAIBotController*             K2Node_DynamicCast_AsFort_Athena_AIBot_Controller; // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_4;                   // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_369[0x7];                                      // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid; // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted; // 0x0379(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted; // 0x037A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_37B[0x5];                                      // 0x037B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_DamagedActor;                   // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Damage;                         // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38C[0x4];                                      // 0x038C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_CustomEvent_InstigatedBy;                   // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_HitLocation;                    // 0x03A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AC[0x4];                                      // 0x03AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_CustomEvent_FHitComponent;                  // 0x03B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_BoneName;                       // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Momentum;                       // 0x03C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x03CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OnSameTeam_ReturnValue;                   // 0x03CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x03CE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3CF[0x1];                                      // 0x03CF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x03D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x03D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SendComplexCustomStatEvent_QuestActive;   // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SendComplexCustomStatEvent_QuestCompleted; // 0x03D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape) == 0x000008, "Wrong alignment on B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape");
static_assert(sizeof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape) == 0x0003E0, "Wrong size on B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, EntryPoint) == 0x000000, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, Temp_bool_Variable) == 0x000004, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000028, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000034, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, CallFunc_BreakRotator_Roll) == 0x000040, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, CallFunc_BreakRotator_Pitch) == 0x000044, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, CallFunc_BreakRotator_Yaw) == 0x000048, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, CallFunc_GetOwner_ReturnValue) == 0x000050, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000058, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000060, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, CallFunc_MakeRotator_ReturnValue) == 0x00006C, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, CallFunc_GetController_ReturnValue) == 0x000078, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, CallFunc_GetActorTeam_ReturnValue) == 0x000080, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::CallFunc_GetActorTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, K2Node_CreateDelegate_OutputDelegate_2) == 0x000084, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, CallFunc_EvaluateCurveTableRow_OutXY) == 0x000094, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::CallFunc_EvaluateCurveTableRow_OutXY' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, CallFunc_EvaluateCurveTableRow_ReturnValue) == 0x000098, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::CallFunc_EvaluateCurveTableRow_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, CallFunc_Add_FloatFloat_ReturnValue) == 0x00009C, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000A0, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0000B0, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x0000B8, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, CallFunc_GetController_ReturnValue_1) == 0x0000C0, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::CallFunc_GetController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, CallFunc_GetBlackboard_ReturnValue) == 0x0000C8, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::CallFunc_GetBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, CallFunc_GetOwner_ReturnValue_1) == 0x0000D0, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, CallFunc_K2_GetActorRotation_ReturnValue_1) == 0x0000D8, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::CallFunc_K2_GetActorRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0000E4, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, CallFunc_GetForwardVector_ReturnValue) == 0x0000F0, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000FC, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, CallFunc_Add_VectorVector_ReturnValue) == 0x000108, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, CallFunc_GetValueAtLevel_ReturnValue) == 0x000114, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, CallFunc_GetGameMode_ReturnValue) == 0x000118, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, K2Node_DynamicCast_AsAthena_Game_Mode) == 0x000120, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::K2Node_DynamicCast_AsAthena_Game_Mode' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, K2Node_DynamicCast_bSuccess_1) == 0x000128, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, CallFunc_GetServerBotManager_ReturnValue) == 0x000130, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::CallFunc_GetServerBotManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x000138, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, CallFunc_GetOwner_ReturnValue_2) == 0x000140, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::CallFunc_GetOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000148, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000154, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, K2Node_MakeStruct_GameplayEventData) == 0x000160, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::K2Node_MakeStruct_GameplayEventData' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, CallFunc_K2_ProjectPointToNavigation_ProjectedLocation) == 0x000210, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::CallFunc_K2_ProjectPointToNavigation_ProjectedLocation' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, CallFunc_K2_ProjectPointToNavigation_ReturnValue) == 0x00021C, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::CallFunc_K2_ProjectPointToNavigation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, CallFunc_GetOwner_ReturnValue_3) == 0x000220, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::CallFunc_GetOwner_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, K2Node_Select_Default) == 0x000228, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, K2Node_MakeStruct_GameplayEventData_1) == 0x000238, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::K2Node_MakeStruct_GameplayEventData_1' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, K2Node_CustomEvent_DeadActor) == 0x0002E8, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::K2Node_CustomEvent_DeadActor' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, K2Node_CustomEvent_Damage_1) == 0x0002F0, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::K2Node_CustomEvent_Damage_1' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, K2Node_CustomEvent_InstigatedBy_1) == 0x0002F8, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::K2Node_CustomEvent_InstigatedBy_1' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, K2Node_CustomEvent_HitLocation_1) == 0x000300, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::K2Node_CustomEvent_HitLocation_1' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, K2Node_CustomEvent_DamageCauser_1) == 0x000310, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::K2Node_CustomEvent_DamageCauser_1' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, K2Node_MakeStruct_FortAthenaAIBotRunTimeCustomizationData) == 0x000318, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::K2Node_MakeStruct_FortAthenaAIBotRunTimeCustomizationData' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000328, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, CallFunc_SpawnBot_ReturnValue) == 0x000330, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::CallFunc_SpawnBot_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x000338, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, CallFunc_GetController_ReturnValue_2) == 0x000340, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::CallFunc_GetController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, K2Node_DynamicCast_AsFort_Athena_AIBot_Controller) == 0x000348, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::K2Node_DynamicCast_AsFort_Athena_AIBot_Controller' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, K2Node_DynamicCast_bSuccess_2) == 0x000350, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, CallFunc_GetOwner_ReturnValue_4) == 0x000358, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::CallFunc_GetOwner_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000360, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, CallFunc_IsValid_ReturnValue) == 0x000368, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, CallFunc_GetQuestManager_ReturnValue) == 0x000370, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid) == 0x000378, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestIsValid' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted) == 0x000379, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::CallFunc_Athena_CheckQuestAndObjectiveCompletion_QuestCompleted' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted) == 0x00037A, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::CallFunc_Athena_CheckQuestAndObjectiveCompletion_ObjectiveCompleted' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, K2Node_CustomEvent_DamagedActor) == 0x000380, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::K2Node_CustomEvent_DamagedActor' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, K2Node_CustomEvent_Damage) == 0x000388, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::K2Node_CustomEvent_Damage' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, K2Node_CustomEvent_InstigatedBy) == 0x000390, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::K2Node_CustomEvent_InstigatedBy' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, K2Node_CustomEvent_DamageCauser) == 0x000398, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::K2Node_CustomEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, K2Node_CustomEvent_HitLocation) == 0x0003A0, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::K2Node_CustomEvent_HitLocation' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, K2Node_CustomEvent_FHitComponent) == 0x0003B0, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::K2Node_CustomEvent_FHitComponent' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, K2Node_CustomEvent_BoneName) == 0x0003B8, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::K2Node_CustomEvent_BoneName' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, K2Node_CustomEvent_Momentum) == 0x0003C0, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::K2Node_CustomEvent_Momentum' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, CallFunc_Not_PreBool_ReturnValue) == 0x0003CC, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, CallFunc_OnSameTeam_ReturnValue) == 0x0003CD, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::CallFunc_OnSameTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, CallFunc_BooleanAND_ReturnValue) == 0x0003CE, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x0003D0, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, CallFunc_FTrunc_ReturnValue) == 0x0003D4, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, CallFunc_SendComplexCustomStatEvent_QuestActive) == 0x0003D8, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::CallFunc_SendComplexCustomStatEvent_QuestActive' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape, CallFunc_SendComplexCustomStatEvent_QuestCompleted) == 0x0003D9, "Member 'B_Athena_DangerGrape_C_ExecuteUbergraph_B_Athena_DangerGrape::CallFunc_SendComplexCustomStatEvent_QuestCompleted' has a wrong offset!");

// Function B_Athena_DangerGrape.B_Athena_DangerGrape_C.PawnDamaged
// 0x0050 (0x0050 - 0x0000)
struct B_Athena_DangerGrape_C_PawnDamaged final
{
public:
	class AActor*                                 DamagedActor;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage_0;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            InstigatedBy;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitLocation;                                       // 0x0020(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    FHitComponent;                                     // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BoneName;                                          // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Momentum;                                          // 0x0040(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_DangerGrape_C_PawnDamaged) == 0x000008, "Wrong alignment on B_Athena_DangerGrape_C_PawnDamaged");
static_assert(sizeof(B_Athena_DangerGrape_C_PawnDamaged) == 0x000050, "Wrong size on B_Athena_DangerGrape_C_PawnDamaged");
static_assert(offsetof(B_Athena_DangerGrape_C_PawnDamaged, DamagedActor) == 0x000000, "Member 'B_Athena_DangerGrape_C_PawnDamaged::DamagedActor' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_PawnDamaged, Damage_0) == 0x000008, "Member 'B_Athena_DangerGrape_C_PawnDamaged::Damage_0' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_PawnDamaged, InstigatedBy) == 0x000010, "Member 'B_Athena_DangerGrape_C_PawnDamaged::InstigatedBy' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_PawnDamaged, DamageCauser) == 0x000018, "Member 'B_Athena_DangerGrape_C_PawnDamaged::DamageCauser' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_PawnDamaged, HitLocation) == 0x000020, "Member 'B_Athena_DangerGrape_C_PawnDamaged::HitLocation' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_PawnDamaged, FHitComponent) == 0x000030, "Member 'B_Athena_DangerGrape_C_PawnDamaged::FHitComponent' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_PawnDamaged, BoneName) == 0x000038, "Member 'B_Athena_DangerGrape_C_PawnDamaged::BoneName' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_PawnDamaged, Momentum) == 0x000040, "Member 'B_Athena_DangerGrape_C_PawnDamaged::Momentum' has a wrong offset!");

// Function B_Athena_DangerGrape.B_Athena_DangerGrape_C.PawnDied
// 0x0030 (0x0030 - 0x0000)
struct B_Athena_DangerGrape_C_PawnDied final
{
public:
	class AActor*                                 DeadActor;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Damage_0;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPawn*                              InstigatedBy;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitLocation;                                       // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 DamageCauser;                                      // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Athena_DangerGrape_C_PawnDied) == 0x000008, "Wrong alignment on B_Athena_DangerGrape_C_PawnDied");
static_assert(sizeof(B_Athena_DangerGrape_C_PawnDied) == 0x000030, "Wrong size on B_Athena_DangerGrape_C_PawnDied");
static_assert(offsetof(B_Athena_DangerGrape_C_PawnDied, DeadActor) == 0x000000, "Member 'B_Athena_DangerGrape_C_PawnDied::DeadActor' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_PawnDied, Damage_0) == 0x000008, "Member 'B_Athena_DangerGrape_C_PawnDied::Damage_0' has a wrong offset!");
static_assert(offsetof(B_Athena_DangerGrape_C_PawnDied, InstigatedBy) == 0x000010, "Member 'B_Athena_DangerGrape_C_PawnDied::InstigatedBy' has a wrong offset!");
