#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_BGA_Athena_EnvCampFire

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_BGA_Athena_EnvCampFire.B_BGA_Athena_EnvCampFire_C
// 0x01D8 (0x0960 - 0x0788)
class AB_BGA_Athena_EnvCampFire_C : public ABuildingGameplayActorCampFire
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0788(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Cylinder;                                          // 0x0790(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        FireLoc;                                           // 0x0798(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Wood;                                              // 0x07A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   FirePitEmpty;                                      // 0x07A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x07B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              InteractingPawn;                                   // 0x07B8(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BeenUsed;                                          // 0x07C0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C1[0x3];                                      // 0x07C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DousedSmokeLife;                                   // 0x07C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         Row_DousedSmokeLife;                               // 0x07C8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          HotfixedEnabled;                                   // 0x07E8(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          DestroyIfDisabled;                                 // 0x07E9(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Destroyed;                                         // 0x07EA(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	uint8                                         Pad_7EB[0x5];                                      // 0x07EB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         Row_HotfixEnabled;                                 // 0x07F0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector                                TraceOffset;                                       // 0x0810(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Season7Campfire;                                   // 0x081C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81D[0x3];                                      // 0x081D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CustomSpecialS7Tags;                               // 0x0820(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         SpecialS7FireTime;                                 // 0x0840(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_844[0x4];                                      // 0x0844(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           DousedSmokeWispTimer;                              // 0x0848(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        S7SuccessEmitter;                                  // 0x0850(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             S7SuccessSound;                                    // 0x0858(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BlockInteraction;                                  // 0x0860(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_861[0x3];                                      // 0x0861(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LitRepBool;                                        // 0x0864(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           DousedCue;                                         // 0x0868(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           FireCue;                                           // 0x0870(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           DeathCue;                                          // 0x0878(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         Row_Light_Cost;                                    // 0x0880(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Text_Light;                                        // 0x08A0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Text_LightCost;                                    // 0x08B8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Text_LightCostNeedMore;                            // 0x08D0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UFortWorldItemDefinition*               Item_Wood;                                         // 0x08E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Stoked;                                            // 0x08F0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	uint8                                         Pad_8F1[0x3];                                      // 0x08F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           StokedCue;                                         // 0x08F4(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8FC[0x4];                                      // 0x08FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         Row_Stoke_Cost;                                    // 0x0900(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_HotfixStokeEnabled;                            // 0x0920(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Text_StokeCostNeedMore;                            // 0x0940(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          HasBeenLit;                                        // 0x0958(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_B_BGA_Athena_EnvCampFire(int32 EntryPoint);
	void PayStokeCost(class AFortPawn* InteractingPawn_0);
	void PayLightCost(class AFortPawn* InteractingPawn_0);
	void HandleCharacterVariantTransition(class AFortPawn* TransitioningPawn);
	void Server_QuestObjectiveUpdated(class AFortPlayerController* Controller, const class UFortQuestItemDefinition* QuestDef, class FName BackendName, int32 CompletionCount, bool ObjectiveCompleted, bool QuestCompleted);
	void KillDouseSmokeWisp();
	void SpecialS7LightsFireAfterOut();
	void BlueprintOnInteract(const class AFortPawn* InteractingPawn_0, const EInteractionBeingAttempted InteractionBeingAttempted);
	void Light();
	void GoOut();
	void CheckDestroyDisabled();
	void HandleBoundDestroyed();
	void BindToFloor();
	void BuildingActorDestroyedCleanUp(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void Start();
	void ReceiveBeginPlay();
	void OnReady_9F4554BE40FCB41157835B9AD897EE69(class AFortGameStateAthena* GameState, const class UFortPlaylist* Playlist, const struct FGameplayTagContainer& PlaylistContextTags);
	void SetSheetValues();
	bool RowToBool(const struct FScalableFloat& Input);
	void CheckIfUserIsSpecialS7(class AFortPawn* PawnWhoLitFire, bool* UserIsSpecial);
	void OnRep_Destroyed();
	void OnRep_LitRepBool();
	int32 GetCostReActivate();
	void OnRep_Stoked();

	bool BlueprintCanInteract(const class AFortPawn* InteractingPawn_0, const EInteractionBeingAttempted InteractionBeingAttempted, const ETInteractionType InteractionType) const;
	class FText BlueprintGetInteractionString(const class AFortPawn* InteractingPawn_0, const EInteractionBeingAttempted InteractionBeingAttempted) const;
	class FText BlueprintGetFailedInteractionString(const class AFortPawn* InteractingPawn_0, const EInteractionBeingAttempted InteractionBeingAttempted) const;
	void HasInfiniteResources(class APawn* Pawn, bool* HasInfiniteResources_0) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_BGA_Athena_EnvCampFire_C">();
	}
	static class AB_BGA_Athena_EnvCampFire_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_BGA_Athena_EnvCampFire_C>();
	}
};
static_assert(alignof(AB_BGA_Athena_EnvCampFire_C) == 0x000008, "Wrong alignment on AB_BGA_Athena_EnvCampFire_C");
static_assert(sizeof(AB_BGA_Athena_EnvCampFire_C) == 0x000960, "Wrong size on AB_BGA_Athena_EnvCampFire_C");
static_assert(offsetof(AB_BGA_Athena_EnvCampFire_C, UberGraphFrame) == 0x000788, "Member 'AB_BGA_Athena_EnvCampFire_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_EnvCampFire_C, Cylinder) == 0x000790, "Member 'AB_BGA_Athena_EnvCampFire_C::Cylinder' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_EnvCampFire_C, FireLoc) == 0x000798, "Member 'AB_BGA_Athena_EnvCampFire_C::FireLoc' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_EnvCampFire_C, Wood) == 0x0007A0, "Member 'AB_BGA_Athena_EnvCampFire_C::Wood' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_EnvCampFire_C, FirePitEmpty) == 0x0007A8, "Member 'AB_BGA_Athena_EnvCampFire_C::FirePitEmpty' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_EnvCampFire_C, DefaultSceneRoot) == 0x0007B0, "Member 'AB_BGA_Athena_EnvCampFire_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_EnvCampFire_C, InteractingPawn) == 0x0007B8, "Member 'AB_BGA_Athena_EnvCampFire_C::InteractingPawn' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_EnvCampFire_C, BeenUsed) == 0x0007C0, "Member 'AB_BGA_Athena_EnvCampFire_C::BeenUsed' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_EnvCampFire_C, DousedSmokeLife) == 0x0007C4, "Member 'AB_BGA_Athena_EnvCampFire_C::DousedSmokeLife' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_EnvCampFire_C, Row_DousedSmokeLife) == 0x0007C8, "Member 'AB_BGA_Athena_EnvCampFire_C::Row_DousedSmokeLife' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_EnvCampFire_C, HotfixedEnabled) == 0x0007E8, "Member 'AB_BGA_Athena_EnvCampFire_C::HotfixedEnabled' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_EnvCampFire_C, DestroyIfDisabled) == 0x0007E9, "Member 'AB_BGA_Athena_EnvCampFire_C::DestroyIfDisabled' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_EnvCampFire_C, Destroyed) == 0x0007EA, "Member 'AB_BGA_Athena_EnvCampFire_C::Destroyed' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_EnvCampFire_C, Row_HotfixEnabled) == 0x0007F0, "Member 'AB_BGA_Athena_EnvCampFire_C::Row_HotfixEnabled' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_EnvCampFire_C, TraceOffset) == 0x000810, "Member 'AB_BGA_Athena_EnvCampFire_C::TraceOffset' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_EnvCampFire_C, Season7Campfire) == 0x00081C, "Member 'AB_BGA_Athena_EnvCampFire_C::Season7Campfire' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_EnvCampFire_C, CustomSpecialS7Tags) == 0x000820, "Member 'AB_BGA_Athena_EnvCampFire_C::CustomSpecialS7Tags' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_EnvCampFire_C, SpecialS7FireTime) == 0x000840, "Member 'AB_BGA_Athena_EnvCampFire_C::SpecialS7FireTime' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_EnvCampFire_C, DousedSmokeWispTimer) == 0x000848, "Member 'AB_BGA_Athena_EnvCampFire_C::DousedSmokeWispTimer' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_EnvCampFire_C, S7SuccessEmitter) == 0x000850, "Member 'AB_BGA_Athena_EnvCampFire_C::S7SuccessEmitter' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_EnvCampFire_C, S7SuccessSound) == 0x000858, "Member 'AB_BGA_Athena_EnvCampFire_C::S7SuccessSound' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_EnvCampFire_C, BlockInteraction) == 0x000860, "Member 'AB_BGA_Athena_EnvCampFire_C::BlockInteraction' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_EnvCampFire_C, LitRepBool) == 0x000864, "Member 'AB_BGA_Athena_EnvCampFire_C::LitRepBool' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_EnvCampFire_C, DousedCue) == 0x000868, "Member 'AB_BGA_Athena_EnvCampFire_C::DousedCue' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_EnvCampFire_C, FireCue) == 0x000870, "Member 'AB_BGA_Athena_EnvCampFire_C::FireCue' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_EnvCampFire_C, DeathCue) == 0x000878, "Member 'AB_BGA_Athena_EnvCampFire_C::DeathCue' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_EnvCampFire_C, Row_Light_Cost) == 0x000880, "Member 'AB_BGA_Athena_EnvCampFire_C::Row_Light_Cost' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_EnvCampFire_C, Text_Light) == 0x0008A0, "Member 'AB_BGA_Athena_EnvCampFire_C::Text_Light' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_EnvCampFire_C, Text_LightCost) == 0x0008B8, "Member 'AB_BGA_Athena_EnvCampFire_C::Text_LightCost' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_EnvCampFire_C, Text_LightCostNeedMore) == 0x0008D0, "Member 'AB_BGA_Athena_EnvCampFire_C::Text_LightCostNeedMore' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_EnvCampFire_C, Item_Wood) == 0x0008E8, "Member 'AB_BGA_Athena_EnvCampFire_C::Item_Wood' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_EnvCampFire_C, Stoked) == 0x0008F0, "Member 'AB_BGA_Athena_EnvCampFire_C::Stoked' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_EnvCampFire_C, StokedCue) == 0x0008F4, "Member 'AB_BGA_Athena_EnvCampFire_C::StokedCue' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_EnvCampFire_C, Row_Stoke_Cost) == 0x000900, "Member 'AB_BGA_Athena_EnvCampFire_C::Row_Stoke_Cost' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_EnvCampFire_C, Row_HotfixStokeEnabled) == 0x000920, "Member 'AB_BGA_Athena_EnvCampFire_C::Row_HotfixStokeEnabled' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_EnvCampFire_C, Text_StokeCostNeedMore) == 0x000940, "Member 'AB_BGA_Athena_EnvCampFire_C::Text_StokeCostNeedMore' has a wrong offset!");
static_assert(offsetof(AB_BGA_Athena_EnvCampFire_C, HasBeenLit) == 0x000958, "Member 'AB_BGA_Athena_EnvCampFire_C::HasBeenLit' has a wrong offset!");

}

