#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_HeldObject_Parent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_HeldObject_Parent.B_HeldObject_Parent_C
// 0x0050 (0x07D8 - 0x0788)
class AB_HeldObject_Parent_C final : public ABuildingGameplayActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0788(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCapsuleComponent*                      Capsule;                                           // 0x0790(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortProjectileMovementComponent*       FortProjectileMovement;                            // 0x0798(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x07A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          IsHeld;                                            // 0x07A8(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	uint8                                         Pad_7A9[0x7];                                      // 0x07A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        HoldingPawn;                                       // 0x07B0(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Vector_HoldingOffset;                              // 0x07B8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ThrowSpeed;                                        // 0x07C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSocketed;                                        // 0x07C8(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	uint8                                         Pad_7C9[0x7];                                      // 0x07C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AB_HeldObjectSocket_C*                  HoldingSocket;                                     // 0x07D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_HeldObject_Parent(int32 EntryPoint);
	void ReceiveBeginPlay();
	void BlueprintOnInteract(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted);
	void OnRep_IsHeld();
	void OnRep_IsSocketed();

	bool BlueprintCanInteract(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted, const ETInteractionType InteractionType) const;
	class FText BlueprintGetInteractionString(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_HeldObject_Parent_C">();
	}
	static class AB_HeldObject_Parent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_HeldObject_Parent_C>();
	}
};
static_assert(alignof(AB_HeldObject_Parent_C) == 0x000008, "Wrong alignment on AB_HeldObject_Parent_C");
static_assert(sizeof(AB_HeldObject_Parent_C) == 0x0007D8, "Wrong size on AB_HeldObject_Parent_C");
static_assert(offsetof(AB_HeldObject_Parent_C, UberGraphFrame) == 0x000788, "Member 'AB_HeldObject_Parent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_HeldObject_Parent_C, Capsule) == 0x000790, "Member 'AB_HeldObject_Parent_C::Capsule' has a wrong offset!");
static_assert(offsetof(AB_HeldObject_Parent_C, FortProjectileMovement) == 0x000798, "Member 'AB_HeldObject_Parent_C::FortProjectileMovement' has a wrong offset!");
static_assert(offsetof(AB_HeldObject_Parent_C, StaticMesh) == 0x0007A0, "Member 'AB_HeldObject_Parent_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(AB_HeldObject_Parent_C, IsHeld) == 0x0007A8, "Member 'AB_HeldObject_Parent_C::IsHeld' has a wrong offset!");
static_assert(offsetof(AB_HeldObject_Parent_C, HoldingPawn) == 0x0007B0, "Member 'AB_HeldObject_Parent_C::HoldingPawn' has a wrong offset!");
static_assert(offsetof(AB_HeldObject_Parent_C, Vector_HoldingOffset) == 0x0007B8, "Member 'AB_HeldObject_Parent_C::Vector_HoldingOffset' has a wrong offset!");
static_assert(offsetof(AB_HeldObject_Parent_C, ThrowSpeed) == 0x0007C4, "Member 'AB_HeldObject_Parent_C::ThrowSpeed' has a wrong offset!");
static_assert(offsetof(AB_HeldObject_Parent_C, IsSocketed) == 0x0007C8, "Member 'AB_HeldObject_Parent_C::IsSocketed' has a wrong offset!");
static_assert(offsetof(AB_HeldObject_Parent_C, HoldingSocket) == 0x0007D0, "Member 'AB_HeldObject_Parent_C::HoldingSocket' has a wrong offset!");

}

