#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Minigun_Athena

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function B_Minigun_Athena.B_Minigun_Athena_C.ExecuteUbergraph_B_Minigun_Athena
// 0x0600 (0x0600 - 0x0000)
struct B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bPersistentFire;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bSecondaryFire;                       // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortCosmeticModification              K2Node_Event_CosmeticMod;                          // 0x0008(0x05B8)()
	int32                                         CallFunc_GetLocalMagazineAmmoCount_ReturnValue;    // 0x05C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x05C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C5[0x3];                                      // 0x05C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_CurrentScalarValue_ReturnValue;           // 0x05C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x05CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5CD[0x3];                                      // 0x05CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x05D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x05D4(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_CurrentScalarValue_ReturnValue_1;         // 0x05E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x05E8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x05F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x05F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F2[0x2];                                      // 0x05F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x05F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x05F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x05FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena) == 0x000008, "Wrong alignment on B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena");
static_assert(sizeof(B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena) == 0x000600, "Wrong size on B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena");
static_assert(offsetof(B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena, EntryPoint) == 0x000000, "Member 'B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena, K2Node_Event_bPersistentFire) == 0x000005, "Member 'B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena::K2Node_Event_bPersistentFire' has a wrong offset!");
static_assert(offsetof(B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena, K2Node_Event_bSecondaryFire) == 0x000006, "Member 'B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena::K2Node_Event_bSecondaryFire' has a wrong offset!");
static_assert(offsetof(B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena, K2Node_Event_CosmeticMod) == 0x000008, "Member 'B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena::K2Node_Event_CosmeticMod' has a wrong offset!");
static_assert(offsetof(B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena, CallFunc_GetLocalMagazineAmmoCount_ReturnValue) == 0x0005C0, "Member 'B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena::CallFunc_GetLocalMagazineAmmoCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x0005C4, "Member 'B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena, CallFunc_CurrentScalarValue_ReturnValue) == 0x0005C8, "Member 'B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena::CallFunc_CurrentScalarValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena, CallFunc_IsDedicatedServer_ReturnValue_2) == 0x0005CC, "Member 'B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena::CallFunc_IsDedicatedServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena, CallFunc_Lerp_ReturnValue) == 0x0005D0, "Member 'B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena, K2Node_CreateDelegate_OutputDelegate) == 0x0005D4, "Member 'B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena, CallFunc_CurrentScalarValue_ReturnValue_1) == 0x0005E4, "Member 'B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena::CallFunc_CurrentScalarValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0005E8, "Member 'B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0005F0, "Member 'B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena, CallFunc_IsPlaying_ReturnValue) == 0x0005F1, "Member 'B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x0005F4, "Member 'B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena, CallFunc_FInterpTo_ReturnValue) == 0x0005F8, "Member 'B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena, CallFunc_MapRangeClamped_ReturnValue) == 0x0005FC, "Member 'B_Minigun_Athena_C_ExecuteUbergraph_B_Minigun_Athena::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");

// Function B_Minigun_Athena.B_Minigun_Athena_C.CurrentScalarValue
// 0x0010 (0x0010 - 0x0000)
struct B_Minigun_Athena_C_CurrentScalarValue final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetOverheatingMaxValue_ReturnValue;       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurrentOverheatValue_ReturnValue;      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Minigun_Athena_C_CurrentScalarValue) == 0x000004, "Wrong alignment on B_Minigun_Athena_C_CurrentScalarValue");
static_assert(sizeof(B_Minigun_Athena_C_CurrentScalarValue) == 0x000010, "Wrong size on B_Minigun_Athena_C_CurrentScalarValue");
static_assert(offsetof(B_Minigun_Athena_C_CurrentScalarValue, ReturnValue) == 0x000000, "Member 'B_Minigun_Athena_C_CurrentScalarValue::ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Minigun_Athena_C_CurrentScalarValue, CallFunc_GetOverheatingMaxValue_ReturnValue) == 0x000004, "Member 'B_Minigun_Athena_C_CurrentScalarValue::CallFunc_GetOverheatingMaxValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Minigun_Athena_C_CurrentScalarValue, CallFunc_GetCurrentOverheatValue_ReturnValue) == 0x000008, "Member 'B_Minigun_Athena_C_CurrentScalarValue::CallFunc_GetCurrentOverheatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Minigun_Athena_C_CurrentScalarValue, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00000C, "Member 'B_Minigun_Athena_C_CurrentScalarValue::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");

// Function B_Minigun_Athena.B_Minigun_Athena_C.OnInitCosmeticAlterations
// 0x05B8 (0x05B8 - 0x0000)
struct B_Minigun_Athena_C_OnInitCosmeticAlterations final
{
public:
	struct FFortCosmeticModification              CosmeticMod;                                       // 0x0000(0x05B8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(B_Minigun_Athena_C_OnInitCosmeticAlterations) == 0x000008, "Wrong alignment on B_Minigun_Athena_C_OnInitCosmeticAlterations");
static_assert(sizeof(B_Minigun_Athena_C_OnInitCosmeticAlterations) == 0x0005B8, "Wrong size on B_Minigun_Athena_C_OnInitCosmeticAlterations");
static_assert(offsetof(B_Minigun_Athena_C_OnInitCosmeticAlterations, CosmeticMod) == 0x000000, "Member 'B_Minigun_Athena_C_OnInitCosmeticAlterations::CosmeticMod' has a wrong offset!");

// Function B_Minigun_Athena.B_Minigun_Athena_C.OnPlayWeaponFireFX
// 0x0002 (0x0002 - 0x0000)
struct B_Minigun_Athena_C_OnPlayWeaponFireFX final
{
public:
	bool                                          bPersistentFire;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bSecondaryFire;                                    // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Minigun_Athena_C_OnPlayWeaponFireFX) == 0x000001, "Wrong alignment on B_Minigun_Athena_C_OnPlayWeaponFireFX");
static_assert(sizeof(B_Minigun_Athena_C_OnPlayWeaponFireFX) == 0x000002, "Wrong size on B_Minigun_Athena_C_OnPlayWeaponFireFX");
static_assert(offsetof(B_Minigun_Athena_C_OnPlayWeaponFireFX, bPersistentFire) == 0x000000, "Member 'B_Minigun_Athena_C_OnPlayWeaponFireFX::bPersistentFire' has a wrong offset!");
static_assert(offsetof(B_Minigun_Athena_C_OnPlayWeaponFireFX, bSecondaryFire) == 0x000001, "Member 'B_Minigun_Athena_C_OnPlayWeaponFireFX::bSecondaryFire' has a wrong offset!");

// Function B_Minigun_Athena.B_Minigun_Athena_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct B_Minigun_Athena_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Minigun_Athena_C_UserConstructionScript) == 0x000008, "Wrong alignment on B_Minigun_Athena_C_UserConstructionScript");
static_assert(sizeof(B_Minigun_Athena_C_UserConstructionScript) == 0x000010, "Wrong size on B_Minigun_Athena_C_UserConstructionScript");
static_assert(offsetof(B_Minigun_Athena_C_UserConstructionScript, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'B_Minigun_Athena_C_UserConstructionScript::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Minigun_Athena_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'B_Minigun_Athena_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

}

