#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Ranged_Lotus_Mustache

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "B_Ranged_Generic_Athena_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Ranged_Lotus_Mustache.B_Ranged_Lotus_Mustache_C
// 0x00D0 (0x1120 - 0x1050)
class AB_Ranged_Lotus_Mustache_C final : public AB_Ranged_Generic_Athena_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_Ranged_Lotus_Mustache_C;          // 0x1050(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Timeline_1_NewTrack_0_8351400740E359EACF6851AB2B2BF762; // 0x1058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_1__Direction_8351400740E359EACF6851AB2B2BF762; // 0x105C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_105D[0x3];                                     // 0x105D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_1;                                        // 0x1060(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_NewTrack_0_1366F380457842955A635D98E5E62F34; // 0x1068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_1366F380457842955A635D98E5E62F34; // 0x106C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_106D[0x3];                                     // 0x106D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x1070(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    DataRow;                                           // 0x1078(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FLinearColor                           Screen_Full_Color__Material_;                      // 0x1088(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Screen_Empty_Color__Material_;                     // 0x1098(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Test_AmmoClipMax;                                  // 0x10A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Screen_Empty_Color__Light_;                        // 0x10AC(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Screen_Full_Color__Light_;                         // 0x10BC(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanPlay_;                                          // 0x10CC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10CD[0x3];                                     // 0x10CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 LockOnTarget;                                      // 0x10D0(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TurnSpeedMax;                                      // 0x10D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HomingDistanceThreshold;                           // 0x10DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TimeUntilMax;                                      // 0x10E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10E4[0x4];                                     // 0x10E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULotus_Mustache_HealthBar_C*            LockOnWidget;                                      // 0x10E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAthena_LockOnWidgetActor_Proto_C*      WidgetActor;                                       // 0x10F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HealthPercent;                                     // 0x10F8(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxTime;                                           // 0x10FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         ShouldSpawnBandages;                               // 0x1100(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_B_Ranged_Lotus_Mustache(int32 EntryPoint);
	void SetHealthPercentClient(float HealthPercent_0);
	void SetHealthPercentServer();
	void OnPlayWeaponFireFX(bool bPersistentFire, bool bSecondaryFire);
	void NewTarget();
	void ReceiveTick(float DeltaSeconds);
	void OnWeaponAttached();
	void K2_OnUnEquip();
	void OnSpawnProjectile(class AFortProjectileBase* SpawnProjectile);
	void Timeline_1__UpdateFunc();
	void Timeline_1__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Ranged_Lotus_Mustache_C">();
	}
	static class AB_Ranged_Lotus_Mustache_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Ranged_Lotus_Mustache_C>();
	}
};
static_assert(alignof(AB_Ranged_Lotus_Mustache_C) == 0x000008, "Wrong alignment on AB_Ranged_Lotus_Mustache_C");
static_assert(sizeof(AB_Ranged_Lotus_Mustache_C) == 0x001120, "Wrong size on AB_Ranged_Lotus_Mustache_C");
static_assert(offsetof(AB_Ranged_Lotus_Mustache_C, UberGraphFrame_B_Ranged_Lotus_Mustache_C) == 0x001050, "Member 'AB_Ranged_Lotus_Mustache_C::UberGraphFrame_B_Ranged_Lotus_Mustache_C' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Lotus_Mustache_C, Timeline_1_NewTrack_0_8351400740E359EACF6851AB2B2BF762) == 0x001058, "Member 'AB_Ranged_Lotus_Mustache_C::Timeline_1_NewTrack_0_8351400740E359EACF6851AB2B2BF762' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Lotus_Mustache_C, Timeline_1__Direction_8351400740E359EACF6851AB2B2BF762) == 0x00105C, "Member 'AB_Ranged_Lotus_Mustache_C::Timeline_1__Direction_8351400740E359EACF6851AB2B2BF762' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Lotus_Mustache_C, Timeline_1) == 0x001060, "Member 'AB_Ranged_Lotus_Mustache_C::Timeline_1' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Lotus_Mustache_C, Timeline_0_NewTrack_0_1366F380457842955A635D98E5E62F34) == 0x001068, "Member 'AB_Ranged_Lotus_Mustache_C::Timeline_0_NewTrack_0_1366F380457842955A635D98E5E62F34' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Lotus_Mustache_C, Timeline_0__Direction_1366F380457842955A635D98E5E62F34) == 0x00106C, "Member 'AB_Ranged_Lotus_Mustache_C::Timeline_0__Direction_1366F380457842955A635D98E5E62F34' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Lotus_Mustache_C, Timeline_0) == 0x001070, "Member 'AB_Ranged_Lotus_Mustache_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Lotus_Mustache_C, DataRow) == 0x001078, "Member 'AB_Ranged_Lotus_Mustache_C::DataRow' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Lotus_Mustache_C, Screen_Full_Color__Material_) == 0x001088, "Member 'AB_Ranged_Lotus_Mustache_C::Screen_Full_Color__Material_' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Lotus_Mustache_C, Screen_Empty_Color__Material_) == 0x001098, "Member 'AB_Ranged_Lotus_Mustache_C::Screen_Empty_Color__Material_' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Lotus_Mustache_C, Test_AmmoClipMax) == 0x0010A8, "Member 'AB_Ranged_Lotus_Mustache_C::Test_AmmoClipMax' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Lotus_Mustache_C, Screen_Empty_Color__Light_) == 0x0010AC, "Member 'AB_Ranged_Lotus_Mustache_C::Screen_Empty_Color__Light_' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Lotus_Mustache_C, Screen_Full_Color__Light_) == 0x0010BC, "Member 'AB_Ranged_Lotus_Mustache_C::Screen_Full_Color__Light_' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Lotus_Mustache_C, CanPlay_) == 0x0010CC, "Member 'AB_Ranged_Lotus_Mustache_C::CanPlay_' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Lotus_Mustache_C, LockOnTarget) == 0x0010D0, "Member 'AB_Ranged_Lotus_Mustache_C::LockOnTarget' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Lotus_Mustache_C, TurnSpeedMax) == 0x0010D8, "Member 'AB_Ranged_Lotus_Mustache_C::TurnSpeedMax' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Lotus_Mustache_C, HomingDistanceThreshold) == 0x0010DC, "Member 'AB_Ranged_Lotus_Mustache_C::HomingDistanceThreshold' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Lotus_Mustache_C, TimeUntilMax) == 0x0010E0, "Member 'AB_Ranged_Lotus_Mustache_C::TimeUntilMax' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Lotus_Mustache_C, LockOnWidget) == 0x0010E8, "Member 'AB_Ranged_Lotus_Mustache_C::LockOnWidget' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Lotus_Mustache_C, WidgetActor) == 0x0010F0, "Member 'AB_Ranged_Lotus_Mustache_C::WidgetActor' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Lotus_Mustache_C, HealthPercent) == 0x0010F8, "Member 'AB_Ranged_Lotus_Mustache_C::HealthPercent' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Lotus_Mustache_C, MaxTime) == 0x0010FC, "Member 'AB_Ranged_Lotus_Mustache_C::MaxTime' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Lotus_Mustache_C, ShouldSpawnBandages) == 0x001100, "Member 'AB_Ranged_Lotus_Mustache_C::ShouldSpawnBandages' has a wrong offset!");

}

