#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Ranged_Generic_Athena

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "En_ShellTypes_01_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Ranged_Generic_Athena.B_Ranged_Generic_Athena_C
// 0x0170 (0x1050 - 0x0EE0)
class AB_Ranged_Generic_Athena_C : public AFortWeaponRanged
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0EE0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               Muzzle1P_Empty_;                                   // 0x0EE8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   IronSightsMesh1P;                                  // 0x0EF0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               MuzzleWindParticle_Empty_;                         // 0x0EF8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Reload_Empty_;                                     // 0x0F00(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Shells_empty_;                                     // 0x0F08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ScopeMesh1P;                                       // 0x0F10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Muzzle_Empty_;                                     // 0x0F18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         AnimateScopePostProcess_DownSightPostProcessAmount_8E980769412DEF67B9B63CAE644DA93B; // 0x0F20(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            AnimateScopePostProcess__Direction_8E980769412DEF67B9B63CAE644DA93B; // 0x0F24(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F25[0x3];                                      // 0x0F25(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     AnimateScopePostProcess;                           // 0x0F28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        MuzzleParticleSystem;                              // 0x0F30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        WeaponDurabilityDestroyEffect;                     // 0x0F38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        WeaponDurabilityDestroyEffectIcon;                 // 0x0F40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseDestroyEffect;                                  // 0x0F48(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          RandomMuzzleFlashScaling;                          // 0x0F49(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Use_Reload_Particles;                              // 0x0F4A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F4B[0x5];                                      // 0x0F4B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        Reload_ParticleSystem;                             // 0x0F50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LastPlayFXTime;                                    // 0x0F58(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinPlayFXTime;                                     // 0x0F5C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseShellsOnFire_;                                  // 0x0F60(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          UseShellsOnReload_;                                // 0x0F61(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          UseShellsOnPump_;                                  // 0x0F62(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F63[0x5];                                      // 0x0F63(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        ShellsParticleSystemTemplate;                      // 0x0F68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ReloadSocketName;                                  // 0x0F70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AFortAIPawn*>                    Array_Of_Active_Enemy_AI;                          // 0x0F78(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)
	bool                                          Scope_Minus_Render_Enemies_To_Custom_Depth_Buffer; // 0x0F88(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_F89[0x3];                                      // 0x0F89(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Shells_Socket_Name;                                // 0x0F8C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	En_ShellTypes_01                              ShellTypeSelect;                                   // 0x0F94(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F95[0x3];                                      // 0x0F95(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Shells_Spawn_Rate_Scale;                           // 0x0F98(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ShellsRotationRate;                                // 0x0F9C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Shells_Velocity;                                   // 0x0FA8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Shells_Gravity;                                    // 0x0FB4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Shells_Lifetime;                                   // 0x0FC0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Shells_Size;                                       // 0x0FC4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Shells_Time_Dilation;                              // 0x0FD0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Target_Scope_Vignette_Blur_Screen_Percentage;      // 0x0FD4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Scope_Camera_Offset_Amount;                        // 0x0FD8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          SmallShells;                                       // 0x0FDC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          MediumShells;                                      // 0x0FDD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          LargeShells;                                       // 0x0FDE(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ShotgunShells;                                     // 0x0FDF(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          EnergyShells;                                      // 0x0FE0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FE1[0x3];                                      // 0x0FE1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Inherit_Parent_Velocity;                           // 0x0FE4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Cylindrical_Radius;                                // 0x0FE8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Cylindrical_Height;                                // 0x0FEC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DebugShellsSocket_;                                // 0x0FF0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FF1[0x7];                                      // 0x0FF1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Sound_ScopeZoomIn;                                 // 0x0FF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Sound_ScopeZoomOut;                                // 0x1000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Alteration_Ambient_PS;                             // 0x1008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  ReticleHUDElementTags;                             // 0x1010(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Is_Wind_Enabled;                                   // 0x1030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1031[0x7];                                     // 0x1031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        MuzzleWindParticleSystem;                          // 0x1038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        MuzzleParticleSystem1P;                            // 0x1040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldHideReticleAfterDelay;                       // 0x1048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_B_Ranged_Generic_Athena(int32 EntryPoint);
	void ShowWeapon();
	void HideWeapon();
	void ShowGunMesh();
	void HideGunMesh();
	void ShowWeaponMesh();
	void HideWeaponMesh();
	void OnWeaponVisibilityChanged(bool bVisible, bool bSetForLocalControllerOnly);
	void ReceiveBeginPlay();
	void SetWeaponPierceThrough_ClientRep(bool Enable, int32 TargetLimit);
	void SetWeaponPierceThrough(bool Enable, int32 TargetLimit);
	void OnEquippedWeaponDestory();
	void ShellsON__onPump_();
	void OnInitCosmeticAlterations(const struct FFortCosmeticModification& CosmeticMod);
	void OnInitAlteration(class UFortAlterationItemDefinition* NewAlteration);
	void OnWeaponAttached();
	void Update_Enemy_Custom_Depths(bool Enable_Or_Disable, int32 StencilBufferValue);
	void InitializeScopeVariables();
	void K2_OnUnEquip();
	void OnSetTargeting(bool bNewIsTargeting);
	void OnPlayReloadFX(EFortReloadFXState ReloadStage);
	void OnStopWeaponFireFX();
	void OnPlayWeaponFireFX(bool bPersistentFire, bool bSecondaryFire);
	void OnLoaded_351A9D71483BD9CF417705946595CB08(class UObject* Loaded);
	void OnLoaded_65280D504DA982E453E39BA22D9D1643(class UObject* Loaded);
	void OnLoaded_109F12F046377B483CA7FF92A795CBD2(class UObject* Loaded);
	void OnLoaded_43F549264BB135D3D385D4BB5846412A(class UObject* Loaded);
	void AnimateScopePostProcess__UpdateFunc();
	void AnimateScopePostProcess__FinishedFunc();
	void UserConstructionScript();
	void AddRandomScale();
	void SetWpnRarity();
	void Muzzle_Flash_FX(bool Persistent_Fire);
	void Muzzle_Play_Reload_FX(EFortReloadFXState Selection);
	void UpdateShellEmittersFX();
	void SetupShellFX();
	void DeactivateShellsFX();
	void ActivateShellsFX(bool Bool);
	void ActivateReloadSmokeFX();
	void DeactivateReloadSmokeFX();
	void DeactivateMuzzleFX();
	void ActivateOrDeactivateWindParticle(bool bNewActive);
	void HideIronSightsMesh();
	void HideReticle();
	void ShowReticle();
	void HandlePawnAndWeaponVisFor1PTargeting(bool IsTargeting);
	void GetScopeParameters(class UStaticMeshComponent** ScopeComponent, struct FVector2D* DepthOfFieldVignetteRange, float* WeaponSightsCameraOffset);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Ranged_Generic_Athena_C">();
	}
	static class AB_Ranged_Generic_Athena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Ranged_Generic_Athena_C>();
	}
};
static_assert(alignof(AB_Ranged_Generic_Athena_C) == 0x000008, "Wrong alignment on AB_Ranged_Generic_Athena_C");
static_assert(sizeof(AB_Ranged_Generic_Athena_C) == 0x001050, "Wrong size on AB_Ranged_Generic_Athena_C");
static_assert(offsetof(AB_Ranged_Generic_Athena_C, UberGraphFrame) == 0x000EE0, "Member 'AB_Ranged_Generic_Athena_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Generic_Athena_C, Muzzle1P_Empty_) == 0x000EE8, "Member 'AB_Ranged_Generic_Athena_C::Muzzle1P_Empty_' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Generic_Athena_C, IronSightsMesh1P) == 0x000EF0, "Member 'AB_Ranged_Generic_Athena_C::IronSightsMesh1P' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Generic_Athena_C, MuzzleWindParticle_Empty_) == 0x000EF8, "Member 'AB_Ranged_Generic_Athena_C::MuzzleWindParticle_Empty_' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Generic_Athena_C, Reload_Empty_) == 0x000F00, "Member 'AB_Ranged_Generic_Athena_C::Reload_Empty_' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Generic_Athena_C, Shells_empty_) == 0x000F08, "Member 'AB_Ranged_Generic_Athena_C::Shells_empty_' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Generic_Athena_C, ScopeMesh1P) == 0x000F10, "Member 'AB_Ranged_Generic_Athena_C::ScopeMesh1P' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Generic_Athena_C, Muzzle_Empty_) == 0x000F18, "Member 'AB_Ranged_Generic_Athena_C::Muzzle_Empty_' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Generic_Athena_C, AnimateScopePostProcess_DownSightPostProcessAmount_8E980769412DEF67B9B63CAE644DA93B) == 0x000F20, "Member 'AB_Ranged_Generic_Athena_C::AnimateScopePostProcess_DownSightPostProcessAmount_8E980769412DEF67B9B63CAE644DA93B' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Generic_Athena_C, AnimateScopePostProcess__Direction_8E980769412DEF67B9B63CAE644DA93B) == 0x000F24, "Member 'AB_Ranged_Generic_Athena_C::AnimateScopePostProcess__Direction_8E980769412DEF67B9B63CAE644DA93B' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Generic_Athena_C, AnimateScopePostProcess) == 0x000F28, "Member 'AB_Ranged_Generic_Athena_C::AnimateScopePostProcess' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Generic_Athena_C, MuzzleParticleSystem) == 0x000F30, "Member 'AB_Ranged_Generic_Athena_C::MuzzleParticleSystem' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Generic_Athena_C, WeaponDurabilityDestroyEffect) == 0x000F38, "Member 'AB_Ranged_Generic_Athena_C::WeaponDurabilityDestroyEffect' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Generic_Athena_C, WeaponDurabilityDestroyEffectIcon) == 0x000F40, "Member 'AB_Ranged_Generic_Athena_C::WeaponDurabilityDestroyEffectIcon' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Generic_Athena_C, UseDestroyEffect) == 0x000F48, "Member 'AB_Ranged_Generic_Athena_C::UseDestroyEffect' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Generic_Athena_C, RandomMuzzleFlashScaling) == 0x000F49, "Member 'AB_Ranged_Generic_Athena_C::RandomMuzzleFlashScaling' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Generic_Athena_C, Use_Reload_Particles) == 0x000F4A, "Member 'AB_Ranged_Generic_Athena_C::Use_Reload_Particles' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Generic_Athena_C, Reload_ParticleSystem) == 0x000F50, "Member 'AB_Ranged_Generic_Athena_C::Reload_ParticleSystem' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Generic_Athena_C, LastPlayFXTime) == 0x000F58, "Member 'AB_Ranged_Generic_Athena_C::LastPlayFXTime' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Generic_Athena_C, MinPlayFXTime) == 0x000F5C, "Member 'AB_Ranged_Generic_Athena_C::MinPlayFXTime' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Generic_Athena_C, UseShellsOnFire_) == 0x000F60, "Member 'AB_Ranged_Generic_Athena_C::UseShellsOnFire_' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Generic_Athena_C, UseShellsOnReload_) == 0x000F61, "Member 'AB_Ranged_Generic_Athena_C::UseShellsOnReload_' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Generic_Athena_C, UseShellsOnPump_) == 0x000F62, "Member 'AB_Ranged_Generic_Athena_C::UseShellsOnPump_' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Generic_Athena_C, ShellsParticleSystemTemplate) == 0x000F68, "Member 'AB_Ranged_Generic_Athena_C::ShellsParticleSystemTemplate' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Generic_Athena_C, ReloadSocketName) == 0x000F70, "Member 'AB_Ranged_Generic_Athena_C::ReloadSocketName' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Generic_Athena_C, Array_Of_Active_Enemy_AI) == 0x000F78, "Member 'AB_Ranged_Generic_Athena_C::Array_Of_Active_Enemy_AI' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Generic_Athena_C, Scope_Minus_Render_Enemies_To_Custom_Depth_Buffer) == 0x000F88, "Member 'AB_Ranged_Generic_Athena_C::Scope_Minus_Render_Enemies_To_Custom_Depth_Buffer' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Generic_Athena_C, Shells_Socket_Name) == 0x000F8C, "Member 'AB_Ranged_Generic_Athena_C::Shells_Socket_Name' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Generic_Athena_C, ShellTypeSelect) == 0x000F94, "Member 'AB_Ranged_Generic_Athena_C::ShellTypeSelect' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Generic_Athena_C, Shells_Spawn_Rate_Scale) == 0x000F98, "Member 'AB_Ranged_Generic_Athena_C::Shells_Spawn_Rate_Scale' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Generic_Athena_C, ShellsRotationRate) == 0x000F9C, "Member 'AB_Ranged_Generic_Athena_C::ShellsRotationRate' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Generic_Athena_C, Shells_Velocity) == 0x000FA8, "Member 'AB_Ranged_Generic_Athena_C::Shells_Velocity' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Generic_Athena_C, Shells_Gravity) == 0x000FB4, "Member 'AB_Ranged_Generic_Athena_C::Shells_Gravity' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Generic_Athena_C, Shells_Lifetime) == 0x000FC0, "Member 'AB_Ranged_Generic_Athena_C::Shells_Lifetime' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Generic_Athena_C, Shells_Size) == 0x000FC4, "Member 'AB_Ranged_Generic_Athena_C::Shells_Size' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Generic_Athena_C, Shells_Time_Dilation) == 0x000FD0, "Member 'AB_Ranged_Generic_Athena_C::Shells_Time_Dilation' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Generic_Athena_C, Target_Scope_Vignette_Blur_Screen_Percentage) == 0x000FD4, "Member 'AB_Ranged_Generic_Athena_C::Target_Scope_Vignette_Blur_Screen_Percentage' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Generic_Athena_C, Scope_Camera_Offset_Amount) == 0x000FD8, "Member 'AB_Ranged_Generic_Athena_C::Scope_Camera_Offset_Amount' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Generic_Athena_C, SmallShells) == 0x000FDC, "Member 'AB_Ranged_Generic_Athena_C::SmallShells' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Generic_Athena_C, MediumShells) == 0x000FDD, "Member 'AB_Ranged_Generic_Athena_C::MediumShells' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Generic_Athena_C, LargeShells) == 0x000FDE, "Member 'AB_Ranged_Generic_Athena_C::LargeShells' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Generic_Athena_C, ShotgunShells) == 0x000FDF, "Member 'AB_Ranged_Generic_Athena_C::ShotgunShells' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Generic_Athena_C, EnergyShells) == 0x000FE0, "Member 'AB_Ranged_Generic_Athena_C::EnergyShells' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Generic_Athena_C, Inherit_Parent_Velocity) == 0x000FE4, "Member 'AB_Ranged_Generic_Athena_C::Inherit_Parent_Velocity' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Generic_Athena_C, Cylindrical_Radius) == 0x000FE8, "Member 'AB_Ranged_Generic_Athena_C::Cylindrical_Radius' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Generic_Athena_C, Cylindrical_Height) == 0x000FEC, "Member 'AB_Ranged_Generic_Athena_C::Cylindrical_Height' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Generic_Athena_C, DebugShellsSocket_) == 0x000FF0, "Member 'AB_Ranged_Generic_Athena_C::DebugShellsSocket_' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Generic_Athena_C, Sound_ScopeZoomIn) == 0x000FF8, "Member 'AB_Ranged_Generic_Athena_C::Sound_ScopeZoomIn' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Generic_Athena_C, Sound_ScopeZoomOut) == 0x001000, "Member 'AB_Ranged_Generic_Athena_C::Sound_ScopeZoomOut' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Generic_Athena_C, Alteration_Ambient_PS) == 0x001008, "Member 'AB_Ranged_Generic_Athena_C::Alteration_Ambient_PS' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Generic_Athena_C, ReticleHUDElementTags) == 0x001010, "Member 'AB_Ranged_Generic_Athena_C::ReticleHUDElementTags' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Generic_Athena_C, Is_Wind_Enabled) == 0x001030, "Member 'AB_Ranged_Generic_Athena_C::Is_Wind_Enabled' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Generic_Athena_C, MuzzleWindParticleSystem) == 0x001038, "Member 'AB_Ranged_Generic_Athena_C::MuzzleWindParticleSystem' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Generic_Athena_C, MuzzleParticleSystem1P) == 0x001040, "Member 'AB_Ranged_Generic_Athena_C::MuzzleParticleSystem1P' has a wrong offset!");
static_assert(offsetof(AB_Ranged_Generic_Athena_C, ShouldHideReticleAfterDelay) == 0x001048, "Member 'AB_Ranged_Generic_Athena_C::ShouldHideReticleAfterDelay' has a wrong offset!");

}

