#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_ShootingTarget_Master

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function B_ShootingTarget_Master.B_ShootingTarget_Master_C.ExecuteUbergraph_B_ShootingTarget_Master
// 0x05B0 (0x05B0 - 0x0000)
struct B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable;                              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_1;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable_2;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_3;                            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable_4;                            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_5;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0068(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_MinigameJustStartedOrStopped;   // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanPopUp_CanPopUp;                        // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetMaxHealth_ReturnValue;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Damage;                               // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x0088(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x00B4(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AController*                            K2Node_Event_InstigatedBy;                         // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x0150(0x0018)()
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    CallFunc_WeakPointWasHit_HitComponent;             // 0x0178(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_WeakPointWasHit_ReturnValue;              // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x3];                                      // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AwardScore_ScoreAwarded;                  // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AwardScore_TeamAwardedPoints;             // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0190(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A2[0x2];                                      // 0x01A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x01C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C5[0x3];                                      // 0x01C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x01C8(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldTriggerTarget_Result;               // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_AuthorityMatchReady*   CallFunc_MatchReadyAsync_ReturnValue;              // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26A[0x6];                                      // 0x026A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0270(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TargetShouldFall_ReturnValue;             // 0x0279(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27A[0x2];                                      // 0x027A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x027C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_28C[0x4];                                      // 0x028C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable_6;                            // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            K2Node_DynamicCast_AsStatic_Mesh;                  // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A1[0x3];                                      // 0x02A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_TimerDuration;                  // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x02A8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_InJumpUpPosition;               // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B1[0x3];                                      // 0x02B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x02B4(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_2;        // 0x0340(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UStaticMesh>             CallFunc_Array_Get_Item;                           // 0x0350(0x0028)(HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_381[0x7];                                      // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            K2Node_DynamicCast_AsStatic_Mesh_1;                // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0391(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_1;              // 0x0392(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0393(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_394[0x4];                                      // 0x0394(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    CallFunc_Array_Get_Item_1;                         // 0x0398(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x03A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Knocked_Down_;                  // 0x03AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AD[0x3];                                      // 0x03AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_Select_Default;                             // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x03B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Check_for_Positive_Score;       // 0x03C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            K2Node_CustomEvent_Instigator;                     // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalController_ReturnValue;            // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D1[0x7];                                      // 0x03D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_Select_Default_1;                           // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x03E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E2[0xE];                                      // 0x03E2(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             K2Node_CustomEvent_ImpactTransform;                // 0x03F0(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0420(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x042C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0438(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_444[0x4];                                      // 0x0444(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0448(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0450(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x045C(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_CustomEvent_Jump_Up_;                       // 0x04E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E9[0x3];                                      // 0x04E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x04EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_1;  // 0x04F8(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_584[0x4];                                      // 0x0584(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_Select_Default_2;                           // 0x0588(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0590(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_4;            // 0x059C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_WeakPointArrayContainsItems_ArrayContainsItems; // 0x05AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master) == 0x000010, "Wrong alignment on B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master");
static_assert(sizeof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master) == 0x0005B0, "Wrong size on B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, EntryPoint) == 0x000000, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_MakeVector_ReturnValue) == 0x000004, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, Temp_bool_Variable) == 0x000020, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, Temp_object_Variable) == 0x000028, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, Temp_object_Variable_1) == 0x000030, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, Temp_bool_Variable_1) == 0x000038, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, Temp_object_Variable_2) == 0x000040, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, Temp_object_Variable_3) == 0x000048, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, Temp_bool_Variable_2) == 0x000050, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, Temp_object_Variable_4) == 0x000058, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, Temp_object_Variable_5) == 0x000060, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_CreateDelegate_OutputDelegate_1) == 0x000068, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000078, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_CustomEvent_MinigameJustStartedOrStopped) == 0x000079, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_CustomEvent_MinigameJustStartedOrStopped' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_CanPopUp_CanPopUp) == 0x00007A, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_CanPopUp_CanPopUp' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_IsValid_ReturnValue) == 0x00007B, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_GetMaxHealth_ReturnValue) == 0x00007C, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_GetMaxHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000080, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_Event_Damage) == 0x000084, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_Event_DamageTags) == 0x000088, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_Event_Momentum) == 0x0000A8, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_Event_HitInfo) == 0x0000B4, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_Event_InstigatedBy) == 0x000140, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_Event_DamageCauser) == 0x000148, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_Event_EffectContext) == 0x000150, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_Event_EffectContext' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_DynamicCast_AsFort_Player_Controller) == 0x000168, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_DynamicCast_bSuccess) == 0x000170, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_WeakPointWasHit_HitComponent) == 0x000178, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_WeakPointWasHit_HitComponent' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_WeakPointWasHit_ReturnValue) == 0x000180, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_WeakPointWasHit_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_AwardScore_ScoreAwarded) == 0x000184, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_AwardScore_ScoreAwarded' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_AwardScore_TeamAwardedPoints) == 0x000188, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_AwardScore_TeamAwardedPoints' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_Add_IntInt_ReturnValue) == 0x00018C, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_CreateDelegate_OutputDelegate_2) == 0x000190, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_IsDedicatedServer_ReturnValue) == 0x0001A0, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x0001A1, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, Temp_int_Variable) == 0x0001A4, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x0001A8, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_ComponentBoundEvent_OtherActor) == 0x0001B0, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_ComponentBoundEvent_OtherComp) == 0x0001B8, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x0001C0, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_ComponentBoundEvent_bFromSweep) == 0x0001C4, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_ComponentBoundEvent_SweepResult) == 0x0001C8, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000254, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_ShouldTriggerTarget_Result) == 0x000258, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_ShouldTriggerTarget_Result' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_MatchReadyAsync_ReturnValue) == 0x000260, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_MatchReadyAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000268, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_IsValid_ReturnValue_1) == 0x000269, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000270, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x000278, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_TargetShouldFall_ReturnValue) == 0x000279, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_TargetShouldFall_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_CreateDelegate_OutputDelegate_3) == 0x00027C, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, Temp_object_Variable_6) == 0x000290, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::Temp_object_Variable_6' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_DynamicCast_AsStatic_Mesh) == 0x000298, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_DynamicCast_AsStatic_Mesh' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_DynamicCast_bSuccess_1) == 0x0002A0, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_CustomEvent_TimerDuration) == 0x0002A4, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_CustomEvent_TimerDuration' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x0002A8, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_CustomEvent_InJumpUpPosition) == 0x0002B0, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_CustomEvent_InJumpUpPosition' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x0002B4, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_K2_SetTimerDelegate_ReturnValue_2) == 0x000340, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_K2_SetTimerDelegate_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_CustomEvent_Loaded) == 0x000348, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_Array_Get_Item) == 0x000350, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000378, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_SetStaticMesh_ReturnValue) == 0x000380, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_DynamicCast_AsStatic_Mesh_1) == 0x000388, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_DynamicCast_AsStatic_Mesh_1' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_DynamicCast_bSuccess_2) == 0x000390, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000391, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_SetStaticMesh_ReturnValue_1) == 0x000392, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_SetStaticMesh_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_IsValid_ReturnValue_2) == 0x000393, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_Array_Get_Item_1) == 0x000398, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0003A0, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_CustomEvent_Knocked_Down_) == 0x0003AC, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_CustomEvent_Knocked_Down_' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_Select_Default) == 0x0003B0, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0003B8, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_CustomEvent_Check_for_Positive_Score) == 0x0003C4, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_CustomEvent_Check_for_Positive_Score' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_CustomEvent_Instigator) == 0x0003C8, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_CustomEvent_Instigator' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_IsLocalController_ReturnValue) == 0x0003D0, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_IsLocalController_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_Select_Default_1) == 0x0003D8, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_BooleanAND_ReturnValue) == 0x0003E0, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0003E1, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_CustomEvent_ImpactTransform) == 0x0003F0, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_CustomEvent_ImpactTransform' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_BreakTransform_Location) == 0x000420, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_BreakTransform_Rotation) == 0x00042C, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_BreakTransform_Scale) == 0x000438, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000448, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_MakeRotator_ReturnValue) == 0x000450, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x00045C, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_CustomEvent_Jump_Up_) == 0x0004E8, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_CustomEvent_Jump_Up_' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_MakeRotator_ReturnValue_1) == 0x0004EC, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_K2_SetRelativeRotation_SweepHitResult_1) == 0x0004F8, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_K2_SetRelativeRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_Select_Default_2) == 0x000588, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000590, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, K2Node_CreateDelegate_OutputDelegate_4) == 0x00059C, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master, CallFunc_WeakPointArrayContainsItems_ArrayContainsItems) == 0x0005AC, "Member 'B_ShootingTarget_Master_C_ExecuteUbergraph_B_ShootingTarget_Master::CallFunc_WeakPointArrayContainsItems_ArrayContainsItems' has a wrong offset!");

// Function B_ShootingTarget_Master.B_ShootingTarget_Master_C.Target Movement Audio
// 0x0001 (0x0001 - 0x0000)
struct B_ShootingTarget_Master_C_Target_Movement_Audio final
{
public:
	bool                                          Jump_Up_;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_ShootingTarget_Master_C_Target_Movement_Audio) == 0x000001, "Wrong alignment on B_ShootingTarget_Master_C_Target_Movement_Audio");
static_assert(sizeof(B_ShootingTarget_Master_C_Target_Movement_Audio) == 0x000001, "Wrong size on B_ShootingTarget_Master_C_Target_Movement_Audio");
static_assert(offsetof(B_ShootingTarget_Master_C_Target_Movement_Audio, Jump_Up_) == 0x000000, "Member 'B_ShootingTarget_Master_C_Target_Movement_Audio::Jump_Up_' has a wrong offset!");

// Function B_ShootingTarget_Master.B_ShootingTarget_Master_C.SpawnWeakpointFX
// 0x0030 (0x0030 - 0x0000)
struct B_ShootingTarget_Master_C_SpawnWeakpointFX final
{
public:
	struct FTransform                             ImpactTransform;                                   // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_ShootingTarget_Master_C_SpawnWeakpointFX) == 0x000010, "Wrong alignment on B_ShootingTarget_Master_C_SpawnWeakpointFX");
static_assert(sizeof(B_ShootingTarget_Master_C_SpawnWeakpointFX) == 0x000030, "Wrong size on B_ShootingTarget_Master_C_SpawnWeakpointFX");
static_assert(offsetof(B_ShootingTarget_Master_C_SpawnWeakpointFX, ImpactTransform) == 0x000000, "Member 'B_ShootingTarget_Master_C_SpawnWeakpointFX::ImpactTransform' has a wrong offset!");

// Function B_ShootingTarget_Master.B_ShootingTarget_Master_C.Impact Audio
// 0x0010 (0x0010 - 0x0000)
struct B_ShootingTarget_Master_C_Impact_Audio final
{
public:
	int32                                         Check_for_Positive_Score;                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            Instigator_0;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_ShootingTarget_Master_C_Impact_Audio) == 0x000008, "Wrong alignment on B_ShootingTarget_Master_C_Impact_Audio");
static_assert(sizeof(B_ShootingTarget_Master_C_Impact_Audio) == 0x000010, "Wrong size on B_ShootingTarget_Master_C_Impact_Audio");
static_assert(offsetof(B_ShootingTarget_Master_C_Impact_Audio, Check_for_Positive_Score) == 0x000000, "Member 'B_ShootingTarget_Master_C_Impact_Audio::Check_for_Positive_Score' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_Impact_Audio, Instigator_0) == 0x000008, "Member 'B_ShootingTarget_Master_C_Impact_Audio::Instigator_0' has a wrong offset!");

// Function B_ShootingTarget_Master.B_ShootingTarget_Master_C.Knock Down Audio
// 0x0001 (0x0001 - 0x0000)
struct B_ShootingTarget_Master_C_Knock_Down_Audio final
{
public:
	bool                                          Knocked_Down_;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_ShootingTarget_Master_C_Knock_Down_Audio) == 0x000001, "Wrong alignment on B_ShootingTarget_Master_C_Knock_Down_Audio");
static_assert(sizeof(B_ShootingTarget_Master_C_Knock_Down_Audio) == 0x000001, "Wrong size on B_ShootingTarget_Master_C_Knock_Down_Audio");
static_assert(offsetof(B_ShootingTarget_Master_C_Knock_Down_Audio, Knocked_Down_) == 0x000000, "Member 'B_ShootingTarget_Master_C_Knock_Down_Audio::Knocked_Down_' has a wrong offset!");

// Function B_ShootingTarget_Master.B_ShootingTarget_Master_C.Hop
// 0x0001 (0x0001 - 0x0000)
struct B_ShootingTarget_Master_C_Hop final
{
public:
	bool                                          InJumpUpPosition_0;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_ShootingTarget_Master_C_Hop) == 0x000001, "Wrong alignment on B_ShootingTarget_Master_C_Hop");
static_assert(sizeof(B_ShootingTarget_Master_C_Hop) == 0x000001, "Wrong size on B_ShootingTarget_Master_C_Hop");
static_assert(offsetof(B_ShootingTarget_Master_C_Hop, InJumpUpPosition_0) == 0x000000, "Member 'B_ShootingTarget_Master_C_Hop::InJumpUpPosition_0' has a wrong offset!");

// Function B_ShootingTarget_Master.B_ShootingTarget_Master_C.SetHideTargetTimer
// 0x0004 (0x0004 - 0x0000)
struct B_ShootingTarget_Master_C_SetHideTargetTimer final
{
public:
	float                                         TimerDuration;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_ShootingTarget_Master_C_SetHideTargetTimer) == 0x000004, "Wrong alignment on B_ShootingTarget_Master_C_SetHideTargetTimer");
static_assert(sizeof(B_ShootingTarget_Master_C_SetHideTargetTimer) == 0x000004, "Wrong size on B_ShootingTarget_Master_C_SetHideTargetTimer");
static_assert(offsetof(B_ShootingTarget_Master_C_SetHideTargetTimer, TimerDuration) == 0x000000, "Member 'B_ShootingTarget_Master_C_SetHideTargetTimer::TimerDuration' has a wrong offset!");

// Function B_ShootingTarget_Master.B_ShootingTarget_Master_C.BndEvt__ProximityTrigger_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature
// 0x00B0 (0x00B0 - 0x0000)
struct B_ShootingTarget_Master_C_BndEvt__ProximityTrigger_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(B_ShootingTarget_Master_C_BndEvt__ProximityTrigger_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on B_ShootingTarget_Master_C_BndEvt__ProximityTrigger_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(B_ShootingTarget_Master_C_BndEvt__ProximityTrigger_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000B0, "Wrong size on B_ShootingTarget_Master_C_BndEvt__ProximityTrigger_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(B_ShootingTarget_Master_C_BndEvt__ProximityTrigger_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'B_ShootingTarget_Master_C_BndEvt__ProximityTrigger_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_BndEvt__ProximityTrigger_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'B_ShootingTarget_Master_C_BndEvt__ProximityTrigger_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_BndEvt__ProximityTrigger_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'B_ShootingTarget_Master_C_BndEvt__ProximityTrigger_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_BndEvt__ProximityTrigger_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'B_ShootingTarget_Master_C_BndEvt__ProximityTrigger_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_BndEvt__ProximityTrigger_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'B_ShootingTarget_Master_C_BndEvt__ProximityTrigger_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_BndEvt__ProximityTrigger_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'B_ShootingTarget_Master_C_BndEvt__ProximityTrigger_K2Node_ComponentBoundEvent_3_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function B_ShootingTarget_Master.B_ShootingTarget_Master_C.OnDamageServer
// 0x00E8 (0x00E8 - 0x0000)
struct B_ShootingTarget_Master_C_OnDamageServer final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  DamageTags;                                        // 0x0008(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FVector                                Momentum;                                          // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitInfo;                                           // 0x0034(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AController*                            InstigatedBy;                                      // 0x00C0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x00C8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           EffectContext;                                     // 0x00D0(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(B_ShootingTarget_Master_C_OnDamageServer) == 0x000008, "Wrong alignment on B_ShootingTarget_Master_C_OnDamageServer");
static_assert(sizeof(B_ShootingTarget_Master_C_OnDamageServer) == 0x0000E8, "Wrong size on B_ShootingTarget_Master_C_OnDamageServer");
static_assert(offsetof(B_ShootingTarget_Master_C_OnDamageServer, Damage) == 0x000000, "Member 'B_ShootingTarget_Master_C_OnDamageServer::Damage' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_OnDamageServer, DamageTags) == 0x000008, "Member 'B_ShootingTarget_Master_C_OnDamageServer::DamageTags' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_OnDamageServer, Momentum) == 0x000028, "Member 'B_ShootingTarget_Master_C_OnDamageServer::Momentum' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_OnDamageServer, HitInfo) == 0x000034, "Member 'B_ShootingTarget_Master_C_OnDamageServer::HitInfo' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_OnDamageServer, InstigatedBy) == 0x0000C0, "Member 'B_ShootingTarget_Master_C_OnDamageServer::InstigatedBy' has a wrong offset!");
static_assert(offsetof(B_ShootingTarget_Master_C_OnDamageServer, DamageCauser) == 0x0000C8, "Member 'B_ShootingTarget_Master_C_OnDamageServer::DamageCauser' has a wrong offset!");
