#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Uncle_Brolly_Block_Collision

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function B_Uncle_Brolly_Block_Collision.B_Uncle_Brolly_Block_Collision_C.ExecuteUbergraph_B_Uncle_Brolly_Block_Collision
// 0x0970 (0x0970 - 0x0000)
struct B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameplayCueEvent                             K2Node_GameplayCueEvent_EventType;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 K2Node_GameplayCueEvent_Parameters;                // 0x0008(0x00B8)(ContainsInstancedReference)
	float                                         K2Node_Event_Damage_1;                             // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_Event_DamageTags_1;                         // 0x00C8(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum_1;                           // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo_1;                            // 0x00F4(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AController*                            K2Node_Event_InstigatedBy_1;                       // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser_1;                       // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext_1;                      // 0x0190(0x0018)()
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x01B0(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x01C8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x01D0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x01D8(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x01F8(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x0218(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x0224(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x0258(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ExecuteBlockGameplayCue_WasGalileoBun;    // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0268(0x00B8)(ContainsInstancedReference)
	struct FHitResult                             CallFunc_EffectContextGetHitResult_ReturnValue;    // 0x0320(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x03AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x03AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AE[0x2];                                      // 0x03AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x03B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x03B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x03C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x03D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x03DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x03F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0408(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x040C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0410(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x041C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_IncrementAnalyticMatchCount_ReturnValue;  // 0x042C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0430(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayEffectContextHandle           K2Node_MakeStruct_GameplayEffectContextHandle;     // 0x0440(0x0018)()
	class UFortAbilitySystemComponent*            CallFunc_GetFortAbilitySystemComponent_ReturnValue; // 0x0458(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue; // 0x0460(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0468(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Damage;                               // 0x046C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x0470(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x0490(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x049C(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AController*                            K2Node_Event_InstigatedBy;                         // 0x0528(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x0530(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x0538(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0550(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_551[0x7];                                      // 0x0551(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0558(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0560(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_561[0x7];                                      // 0x0561(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena;           // 0x0568(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0570(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_571[0x7];                                      // 0x0571(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0578(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0580(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamagedActor;                   // 0x0588(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Damage;                         // 0x0590(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_594[0x4];                                      // 0x0594(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            K2Node_CustomEvent_InstigatedBy;                   // 0x0598(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DamageCauser;                   // 0x05A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_HitLocation;                    // 0x05A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B4[0x4];                                      // 0x05B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_CustomEvent_FHitComponent;                  // 0x05B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_BoneName;                       // 0x05C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_Momentum;                       // 0x05C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D4[0x4];                                      // 0x05D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x05D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x05E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E1[0x7];                                      // 0x05E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_CustomEvent_PlayerPawn;                     // 0x05E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAbilitySystemComponent*            CallFunc_GetFortAbilitySystemComponent_ReturnValue_1; // 0x05F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x05F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_1; // 0x0600(0x0008)(NoDestructor, HasGetValueTypeHash)
	EFortTeamAffiliation                          CallFunc_GetTeamAffiliation_ReturnValue;           // 0x0608(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0609(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_60A[0x2];                                      // 0x060A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetHealth_ReturnValue;                    // 0x060C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxHealth_ReturnValue;                 // 0x0610(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0614(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_NormalizeToRange_ReturnValue;             // 0x0624(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0628(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_629[0x3];                                      // 0x0629(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x062C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x063C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x063D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_63E[0x2];                                      // 0x063E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0640(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x064C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_64D[0x3];                                      // 0x064D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0650(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0654(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0655(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_656[0x2];                                      // 0x0656(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x0658(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65C[0x4];                                      // 0x065C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0660(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UFortAbilitySystemComponent*            CallFunc_GetFortAbilitySystemComponent_ReturnValue_2; // 0x0668(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_MakeStruct_GameplayEffectContextHandle_1;   // 0x0670(0x0018)()
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_1;  // 0x0688(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_2;  // 0x0690(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_2; // 0x0698(0x0008)(NoDestructor, HasGetValueTypeHash)
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_GetActiveEffectsWithAllTags_ReturnValue;  // 0x06A0(0x0010)(ZeroConstructor, ReferenceParm)
	struct FActiveGameplayEffectHandle            CallFunc_Array_Get_Item;                           // 0x06B0(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x06B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetActiveGameplayEffectRemainingDuration_ReturnValue; // 0x06BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x06C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C1[0x3];                                      // 0x06C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MapRangeClamped_ReturnValue_1;            // 0x06C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetActorTeam_ReturnValue;                 // 0x06C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C9[0x7];                                      // 0x06C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AB_UncleBrolly_C*                       K2Node_DynamicCast_AsB_Uncle_Brolly;               // 0x06D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x06D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x06D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DA[0x6];                                      // 0x06DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_3;  // 0x06E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_3; // 0x06E8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x06F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F1[0x3];                                      // 0x06F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x06F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable;                              // 0x06F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_1;                            // 0x0700(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0708(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x070C(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue_1;       // 0x0798(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x079C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79D[0x3];                                      // 0x079D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue_2;       // 0x07A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x07A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x07A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x07A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7AA[0x6];                                      // 0x07AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_Select_Default;                             // 0x07B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x07B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B9[0x3];                                      // 0x07B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_1;                           // 0x07BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_1;        // 0x07C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C1[0x7];                                      // 0x07C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UForceFeedbackComponent*                CallFunc_SpawnForceFeedbackAtLocation_ReturnValue; // 0x07C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_MultiGate_FirstRun;                         // 0x07D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D1[0x3];                                      // 0x07D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_MultiGate_Data;                             // 0x07D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_MultiGate_ScratchBool;                      // 0x07D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D9[0x3];                                      // 0x07D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_MultiGate_ScratchIndex;                     // 0x07DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult_1;     // 0x07E0(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult_2;     // 0x086C(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x08F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8F9[0x3];                                      // 0x08F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_4; // 0x08FC(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0904(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x0905(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_906[0x2];                                      // 0x0906(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0908(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x0914(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0924(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue_1;   // 0x0930(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_2;    // 0x0940(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue_2;   // 0x094C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x095C(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision) == 0x000008, "Wrong alignment on B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision");
static_assert(sizeof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision) == 0x000970, "Wrong size on B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, EntryPoint) == 0x000000, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, K2Node_GameplayCueEvent_EventType) == 0x000004, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::K2Node_GameplayCueEvent_EventType' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, K2Node_GameplayCueEvent_Parameters) == 0x000008, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::K2Node_GameplayCueEvent_Parameters' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, K2Node_Event_Damage_1) == 0x0000C0, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::K2Node_Event_Damage_1' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, K2Node_Event_DamageTags_1) == 0x0000C8, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::K2Node_Event_DamageTags_1' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, K2Node_Event_Momentum_1) == 0x0000E8, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::K2Node_Event_Momentum_1' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, K2Node_Event_HitInfo_1) == 0x0000F4, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::K2Node_Event_HitInfo_1' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, K2Node_Event_InstigatedBy_1) == 0x000180, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::K2Node_Event_InstigatedBy_1' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, K2Node_Event_DamageCauser_1) == 0x000188, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::K2Node_Event_DamageCauser_1' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, K2Node_Event_EffectContext_1) == 0x000190, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::K2Node_Event_EffectContext_1' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x0001A8, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x0001AC, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x0001B0, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x0001C8, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x0001D0, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x0001D8, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x0001F8, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, CallFunc_BreakGameplayCueParameters_Location) == 0x000218, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, CallFunc_BreakGameplayCueParameters_Normal) == 0x000224, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, CallFunc_BreakGameplayCueParameters_Instigator) == 0x000230, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x000238, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x000240, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x000248, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x000250, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x000254, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x000258, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, CallFunc_ExecuteBlockGameplayCue_WasGalileoBun) == 0x000260, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::CallFunc_ExecuteBlockGameplayCue_WasGalileoBun' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x000268, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, CallFunc_EffectContextGetHitResult_ReturnValue) == 0x000320, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::CallFunc_EffectContextGetHitResult_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, CallFunc_BreakHitResult_bBlockingHit) == 0x0003AC, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, CallFunc_BreakHitResult_bInitialOverlap) == 0x0003AD, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, CallFunc_BreakHitResult_Time) == 0x0003B0, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, CallFunc_BreakHitResult_Distance) == 0x0003B4, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, CallFunc_BreakHitResult_Location) == 0x0003B8, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, CallFunc_BreakHitResult_ImpactPoint) == 0x0003C4, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, CallFunc_BreakHitResult_Normal) == 0x0003D0, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, CallFunc_BreakHitResult_ImpactNormal) == 0x0003DC, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, CallFunc_BreakHitResult_PhysMat) == 0x0003E8, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, CallFunc_BreakHitResult_HitActor) == 0x0003F0, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, CallFunc_BreakHitResult_HitComponent) == 0x0003F8, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, CallFunc_BreakHitResult_HitBoneName) == 0x000400, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, CallFunc_BreakHitResult_HitItem) == 0x000408, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, CallFunc_BreakHitResult_FaceIndex) == 0x00040C, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, CallFunc_BreakHitResult_TraceStart) == 0x000410, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, CallFunc_BreakHitResult_TraceEnd) == 0x00041C, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, CallFunc_FTrunc_ReturnValue) == 0x000428, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, CallFunc_IncrementAnalyticMatchCount_ReturnValue) == 0x00042C, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::CallFunc_IncrementAnalyticMatchCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, K2Node_CreateDelegate_OutputDelegate) == 0x000430, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, K2Node_MakeStruct_GameplayEffectContextHandle) == 0x000440, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::K2Node_MakeStruct_GameplayEffectContextHandle' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, CallFunc_GetFortAbilitySystemComponent_ReturnValue) == 0x000458, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::CallFunc_GetFortAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue) == 0x000460, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, CallFunc_GetValueAtLevel_ReturnValue) == 0x000468, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, K2Node_Event_Damage) == 0x00046C, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, K2Node_Event_DamageTags) == 0x000470, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, K2Node_Event_Momentum) == 0x000490, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, K2Node_Event_HitInfo) == 0x00049C, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, K2Node_Event_InstigatedBy) == 0x000528, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, K2Node_Event_DamageCauser) == 0x000530, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, K2Node_Event_EffectContext) == 0x000538, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::K2Node_Event_EffectContext' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, CallFunc_IsValid_ReturnValue) == 0x000550, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, CallFunc_GetOwner_ReturnValue) == 0x000558, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, CallFunc_IsValid_ReturnValue_1) == 0x000560, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, K2Node_DynamicCast_AsPlayer_Pawn_Athena) == 0x000568, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::K2Node_DynamicCast_AsPlayer_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, K2Node_DynamicCast_bSuccess) == 0x000570, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000578, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, CallFunc_GetOwner_ReturnValue_1) == 0x000580, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, K2Node_CustomEvent_DamagedActor) == 0x000588, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::K2Node_CustomEvent_DamagedActor' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, K2Node_CustomEvent_Damage) == 0x000590, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::K2Node_CustomEvent_Damage' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, K2Node_CustomEvent_InstigatedBy) == 0x000598, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::K2Node_CustomEvent_InstigatedBy' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, K2Node_CustomEvent_DamageCauser) == 0x0005A0, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::K2Node_CustomEvent_DamageCauser' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, K2Node_CustomEvent_HitLocation) == 0x0005A8, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::K2Node_CustomEvent_HitLocation' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, K2Node_CustomEvent_FHitComponent) == 0x0005B8, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::K2Node_CustomEvent_FHitComponent' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, K2Node_CustomEvent_BoneName) == 0x0005C0, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::K2Node_CustomEvent_BoneName' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, K2Node_CustomEvent_Momentum) == 0x0005C8, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::K2Node_CustomEvent_Momentum' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x0005D8, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, K2Node_DynamicCast_bSuccess_1) == 0x0005E0, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, K2Node_CustomEvent_PlayerPawn) == 0x0005E8, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::K2Node_CustomEvent_PlayerPawn' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, CallFunc_GetFortAbilitySystemComponent_ReturnValue_1) == 0x0005F0, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::CallFunc_GetFortAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, CallFunc_GetOwner_ReturnValue_2) == 0x0005F8, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::CallFunc_GetOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_1) == 0x000600, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::CallFunc_BP_ApplyGameplayEffectToSelf_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, CallFunc_GetTeamAffiliation_ReturnValue) == 0x000608, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::CallFunc_GetTeamAffiliation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, K2Node_SwitchEnum_CmpSuccess) == 0x000609, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, CallFunc_GetHealth_ReturnValue) == 0x00060C, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::CallFunc_GetHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, CallFunc_GetMaxHealth_ReturnValue) == 0x000610, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::CallFunc_GetMaxHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, K2Node_CreateDelegate_OutputDelegate_1) == 0x000614, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, CallFunc_NormalizeToRange_ReturnValue) == 0x000624, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::CallFunc_NormalizeToRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, CallFunc_IsDedicatedServer_ReturnValue) == 0x000628, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, K2Node_CreateDelegate_OutputDelegate_2) == 0x00062C, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, CallFunc_Less_FloatFloat_ReturnValue) == 0x00063C, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, CallFunc_IsLocallyControlled_ReturnValue) == 0x00063D, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000640, "Member 'B_Uncle_Brolly_Block_Collision_C_ExecuteUbergraph_B_Uncle_Brolly_Block_Collision::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
