#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattlePassLeaderboardListEntry

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BattlePassLeaderboardListEntry.BattlePassLeaderboardListEntry_C
// 0x0040 (0x02B8 - 0x0278)
class UBattlePassLeaderboardListEntry_C final : public UBattlePassLeaderboardListEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0278(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonBorder*                          Border_DisplayNameTeamColor;                       // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          Border_Entry;                                      // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          Border_HeaderDisplayName;                          // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          Border_HeaderLevel;                                // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          Border_LocalPlayer;                                // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          Border_NameLevelDivider;                           // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher_Rank;                                     // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BattlePassLeaderboardListEntry(int32 EntryPoint);
	void UpdateEntryVisibility();
	void OnEntryInitialized(int32 Rank, bool bIsLocalPlayer);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BattlePassLeaderboardListEntry_C">();
	}
	static class UBattlePassLeaderboardListEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattlePassLeaderboardListEntry_C>();
	}
};
static_assert(alignof(UBattlePassLeaderboardListEntry_C) == 0x000008, "Wrong alignment on UBattlePassLeaderboardListEntry_C");
static_assert(sizeof(UBattlePassLeaderboardListEntry_C) == 0x0002B8, "Wrong size on UBattlePassLeaderboardListEntry_C");
static_assert(offsetof(UBattlePassLeaderboardListEntry_C, UberGraphFrame) == 0x000278, "Member 'UBattlePassLeaderboardListEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBattlePassLeaderboardListEntry_C, Border_DisplayNameTeamColor) == 0x000280, "Member 'UBattlePassLeaderboardListEntry_C::Border_DisplayNameTeamColor' has a wrong offset!");
static_assert(offsetof(UBattlePassLeaderboardListEntry_C, Border_Entry) == 0x000288, "Member 'UBattlePassLeaderboardListEntry_C::Border_Entry' has a wrong offset!");
static_assert(offsetof(UBattlePassLeaderboardListEntry_C, Border_HeaderDisplayName) == 0x000290, "Member 'UBattlePassLeaderboardListEntry_C::Border_HeaderDisplayName' has a wrong offset!");
static_assert(offsetof(UBattlePassLeaderboardListEntry_C, Border_HeaderLevel) == 0x000298, "Member 'UBattlePassLeaderboardListEntry_C::Border_HeaderLevel' has a wrong offset!");
static_assert(offsetof(UBattlePassLeaderboardListEntry_C, Border_LocalPlayer) == 0x0002A0, "Member 'UBattlePassLeaderboardListEntry_C::Border_LocalPlayer' has a wrong offset!");
static_assert(offsetof(UBattlePassLeaderboardListEntry_C, Border_NameLevelDivider) == 0x0002A8, "Member 'UBattlePassLeaderboardListEntry_C::Border_NameLevelDivider' has a wrong offset!");
static_assert(offsetof(UBattlePassLeaderboardListEntry_C, Switcher_Rank) == 0x0002B0, "Member 'UBattlePassLeaderboardListEntry_C::Switcher_Rank' has a wrong offset!");

}

