#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattlePassDirectAcquisitionScreen

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function BattlePassDirectAcquisitionScreen.BattlePassDirectAcquisitionScreen_C.ExecuteUbergraph_BattlePassDirectAcquisitionScreen
// 0x0070 (0x0070 - 0x0000)
struct BattlePassDirectAcquisitionScreen_C_ExecuteUbergraph_BattlePassDirectAcquisitionScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue_1;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x0020(0x0010)(NoDestructor)
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	struct FDateTime                              CallFunc_GetSeasonStoreEndDate_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button_1;               // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetSeasonEndLabelText_Result;             // 0x0050(0x0018)()
	bool                                          CallFunc_HandleBack_bPassThrough;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattlePassDirectAcquisitionScreen_C_ExecuteUbergraph_BattlePassDirectAcquisitionScreen) == 0x000008, "Wrong alignment on BattlePassDirectAcquisitionScreen_C_ExecuteUbergraph_BattlePassDirectAcquisitionScreen");
static_assert(sizeof(BattlePassDirectAcquisitionScreen_C_ExecuteUbergraph_BattlePassDirectAcquisitionScreen) == 0x000070, "Wrong size on BattlePassDirectAcquisitionScreen_C_ExecuteUbergraph_BattlePassDirectAcquisitionScreen");
static_assert(offsetof(BattlePassDirectAcquisitionScreen_C_ExecuteUbergraph_BattlePassDirectAcquisitionScreen, EntryPoint) == 0x000000, "Member 'BattlePassDirectAcquisitionScreen_C_ExecuteUbergraph_BattlePassDirectAcquisitionScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(BattlePassDirectAcquisitionScreen_C_ExecuteUbergraph_BattlePassDirectAcquisitionScreen, K2Node_ComponentBoundEvent_Button) == 0x000008, "Member 'BattlePassDirectAcquisitionScreen_C_ExecuteUbergraph_BattlePassDirectAcquisitionScreen::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(BattlePassDirectAcquisitionScreen_C_ExecuteUbergraph_BattlePassDirectAcquisitionScreen, CallFunc_GetContext_ReturnValue) == 0x000010, "Member 'BattlePassDirectAcquisitionScreen_C_ExecuteUbergraph_BattlePassDirectAcquisitionScreen::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePassDirectAcquisitionScreen_C_ExecuteUbergraph_BattlePassDirectAcquisitionScreen, CallFunc_GetContext_ReturnValue_1) == 0x000018, "Member 'BattlePassDirectAcquisitionScreen_C_ExecuteUbergraph_BattlePassDirectAcquisitionScreen::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattlePassDirectAcquisitionScreen_C_ExecuteUbergraph_BattlePassDirectAcquisitionScreen, K2Node_MakeStruct_DataTableRowHandle) == 0x000020, "Member 'BattlePassDirectAcquisitionScreen_C_ExecuteUbergraph_BattlePassDirectAcquisitionScreen::K2Node_MakeStruct_DataTableRowHandle' has a wrong offset!");
static_assert(offsetof(BattlePassDirectAcquisitionScreen_C_ExecuteUbergraph_BattlePassDirectAcquisitionScreen, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'BattlePassDirectAcquisitionScreen_C_ExecuteUbergraph_BattlePassDirectAcquisitionScreen::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BattlePassDirectAcquisitionScreen_C_ExecuteUbergraph_BattlePassDirectAcquisitionScreen, CallFunc_GetSeasonStoreEndDate_ReturnValue) == 0x000040, "Member 'BattlePassDirectAcquisitionScreen_C_ExecuteUbergraph_BattlePassDirectAcquisitionScreen::CallFunc_GetSeasonStoreEndDate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePassDirectAcquisitionScreen_C_ExecuteUbergraph_BattlePassDirectAcquisitionScreen, K2Node_ComponentBoundEvent_Button_1) == 0x000048, "Member 'BattlePassDirectAcquisitionScreen_C_ExecuteUbergraph_BattlePassDirectAcquisitionScreen::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(BattlePassDirectAcquisitionScreen_C_ExecuteUbergraph_BattlePassDirectAcquisitionScreen, CallFunc_GetSeasonEndLabelText_Result) == 0x000050, "Member 'BattlePassDirectAcquisitionScreen_C_ExecuteUbergraph_BattlePassDirectAcquisitionScreen::CallFunc_GetSeasonEndLabelText_Result' has a wrong offset!");
static_assert(offsetof(BattlePassDirectAcquisitionScreen_C_ExecuteUbergraph_BattlePassDirectAcquisitionScreen, CallFunc_HandleBack_bPassThrough) == 0x000068, "Member 'BattlePassDirectAcquisitionScreen_C_ExecuteUbergraph_BattlePassDirectAcquisitionScreen::CallFunc_HandleBack_bPassThrough' has a wrong offset!");

// Function BattlePassDirectAcquisitionScreen.BattlePassDirectAcquisitionScreen_C.BndEvt__CloseButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BattlePassDirectAcquisitionScreen_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattlePassDirectAcquisitionScreen_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on BattlePassDirectAcquisitionScreen_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(BattlePassDirectAcquisitionScreen_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on BattlePassDirectAcquisitionScreen_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(BattlePassDirectAcquisitionScreen_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'BattlePassDirectAcquisitionScreen_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function BattlePassDirectAcquisitionScreen.BattlePassDirectAcquisitionScreen_C.BndEvt__PanelButton_K2Node_ComponentBoundEvent_97_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BattlePassDirectAcquisitionScreen_C_BndEvt__PanelButton_K2Node_ComponentBoundEvent_97_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattlePassDirectAcquisitionScreen_C_BndEvt__PanelButton_K2Node_ComponentBoundEvent_97_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on BattlePassDirectAcquisitionScreen_C_BndEvt__PanelButton_K2Node_ComponentBoundEvent_97_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(BattlePassDirectAcquisitionScreen_C_BndEvt__PanelButton_K2Node_ComponentBoundEvent_97_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on BattlePassDirectAcquisitionScreen_C_BndEvt__PanelButton_K2Node_ComponentBoundEvent_97_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(BattlePassDirectAcquisitionScreen_C_BndEvt__PanelButton_K2Node_ComponentBoundEvent_97_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'BattlePassDirectAcquisitionScreen_C_BndEvt__PanelButton_K2Node_ComponentBoundEvent_97_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function BattlePassDirectAcquisitionScreen.BattlePassDirectAcquisitionScreen_C.GenerateOfferWidget
// 0x0040 (0x0040 - 0x0000)
struct BattlePassDirectAcquisitionScreen_C_GenerateOfferWidget final
{
public:
	class UFortStoreFrontOfferInfo*               OfferData;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGiftOnly_ReturnValue;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasDisplayAsset_ReturnValue;              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         K2Node_Select_Default;                             // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaDirectAcquisitionOfferWidget_C*  CallFunc_Create_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattlePassDirectAcquisitionScreen_C_GenerateOfferWidget) == 0x000008, "Wrong alignment on BattlePassDirectAcquisitionScreen_C_GenerateOfferWidget");
static_assert(sizeof(BattlePassDirectAcquisitionScreen_C_GenerateOfferWidget) == 0x000040, "Wrong size on BattlePassDirectAcquisitionScreen_C_GenerateOfferWidget");
static_assert(offsetof(BattlePassDirectAcquisitionScreen_C_GenerateOfferWidget, OfferData) == 0x000000, "Member 'BattlePassDirectAcquisitionScreen_C_GenerateOfferWidget::OfferData' has a wrong offset!");
static_assert(offsetof(BattlePassDirectAcquisitionScreen_C_GenerateOfferWidget, CallFunc_IsGiftOnly_ReturnValue) == 0x000008, "Member 'BattlePassDirectAcquisitionScreen_C_GenerateOfferWidget::CallFunc_IsGiftOnly_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePassDirectAcquisitionScreen_C_GenerateOfferWidget, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'BattlePassDirectAcquisitionScreen_C_GenerateOfferWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePassDirectAcquisitionScreen_C_GenerateOfferWidget, CallFunc_Not_PreBool_ReturnValue) == 0x00000A, "Member 'BattlePassDirectAcquisitionScreen_C_GenerateOfferWidget::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePassDirectAcquisitionScreen_C_GenerateOfferWidget, CallFunc_HasDisplayAsset_ReturnValue) == 0x00000B, "Member 'BattlePassDirectAcquisitionScreen_C_GenerateOfferWidget::CallFunc_HasDisplayAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePassDirectAcquisitionScreen_C_GenerateOfferWidget, CallFunc_BooleanAND_ReturnValue) == 0x00000C, "Member 'BattlePassDirectAcquisitionScreen_C_GenerateOfferWidget::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePassDirectAcquisitionScreen_C_GenerateOfferWidget, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BattlePassDirectAcquisitionScreen_C_GenerateOfferWidget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePassDirectAcquisitionScreen_C_GenerateOfferWidget, CallFunc_Percent_IntInt_ReturnValue) == 0x000014, "Member 'BattlePassDirectAcquisitionScreen_C_GenerateOfferWidget::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePassDirectAcquisitionScreen_C_GenerateOfferWidget, Temp_int_Variable) == 0x000018, "Member 'BattlePassDirectAcquisitionScreen_C_GenerateOfferWidget::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BattlePassDirectAcquisitionScreen_C_GenerateOfferWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x000020, "Member 'BattlePassDirectAcquisitionScreen_C_GenerateOfferWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePassDirectAcquisitionScreen_C_GenerateOfferWidget, K2Node_Select_Default) == 0x000028, "Member 'BattlePassDirectAcquisitionScreen_C_GenerateOfferWidget::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BattlePassDirectAcquisitionScreen_C_GenerateOfferWidget, CallFunc_Create_ReturnValue) == 0x000030, "Member 'BattlePassDirectAcquisitionScreen_C_GenerateOfferWidget::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePassDirectAcquisitionScreen_C_GenerateOfferWidget, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000038, "Member 'BattlePassDirectAcquisitionScreen_C_GenerateOfferWidget::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");

// Function BattlePassDirectAcquisitionScreen.BattlePassDirectAcquisitionScreen_C.HandleBack
// 0x0001 (0x0001 - 0x0000)
struct BattlePassDirectAcquisitionScreen_C_HandleBack final
{
public:
	bool                                          bPassThrough;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattlePassDirectAcquisitionScreen_C_HandleBack) == 0x000001, "Wrong alignment on BattlePassDirectAcquisitionScreen_C_HandleBack");
static_assert(sizeof(BattlePassDirectAcquisitionScreen_C_HandleBack) == 0x000001, "Wrong size on BattlePassDirectAcquisitionScreen_C_HandleBack");
static_assert(offsetof(BattlePassDirectAcquisitionScreen_C_HandleBack, bPassThrough) == 0x000000, "Member 'BattlePassDirectAcquisitionScreen_C_HandleBack::bPassThrough' has a wrong offset!");

// Function BattlePassDirectAcquisitionScreen.BattlePassDirectAcquisitionScreen_C.On_CommonBorderTouchToClose_MouseButtonUp
// 0x0228 (0x0228 - 0x0000)
struct BattlePassDirectAcquisitionScreen_C_On_CommonBorderTouchToClose_MouseButtonUp final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	bool                                          CallFunc_IsMobileGame_ReturnValue;                 // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0168(0x00B8)()
	bool                                          CallFunc_HandleBack_bPassThrough;                  // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattlePassDirectAcquisitionScreen_C_On_CommonBorderTouchToClose_MouseButtonUp) == 0x000008, "Wrong alignment on BattlePassDirectAcquisitionScreen_C_On_CommonBorderTouchToClose_MouseButtonUp");
static_assert(sizeof(BattlePassDirectAcquisitionScreen_C_On_CommonBorderTouchToClose_MouseButtonUp) == 0x000228, "Wrong size on BattlePassDirectAcquisitionScreen_C_On_CommonBorderTouchToClose_MouseButtonUp");
static_assert(offsetof(BattlePassDirectAcquisitionScreen_C_On_CommonBorderTouchToClose_MouseButtonUp, MyGeometry) == 0x000000, "Member 'BattlePassDirectAcquisitionScreen_C_On_CommonBorderTouchToClose_MouseButtonUp::MyGeometry' has a wrong offset!");
static_assert(offsetof(BattlePassDirectAcquisitionScreen_C_On_CommonBorderTouchToClose_MouseButtonUp, MouseEvent) == 0x000038, "Member 'BattlePassDirectAcquisitionScreen_C_On_CommonBorderTouchToClose_MouseButtonUp::MouseEvent' has a wrong offset!");
static_assert(offsetof(BattlePassDirectAcquisitionScreen_C_On_CommonBorderTouchToClose_MouseButtonUp, ReturnValue) == 0x0000A8, "Member 'BattlePassDirectAcquisitionScreen_C_On_CommonBorderTouchToClose_MouseButtonUp::ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePassDirectAcquisitionScreen_C_On_CommonBorderTouchToClose_MouseButtonUp, CallFunc_IsMobileGame_ReturnValue) == 0x000160, "Member 'BattlePassDirectAcquisitionScreen_C_On_CommonBorderTouchToClose_MouseButtonUp::CallFunc_IsMobileGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePassDirectAcquisitionScreen_C_On_CommonBorderTouchToClose_MouseButtonUp, CallFunc_Handled_ReturnValue) == 0x000168, "Member 'BattlePassDirectAcquisitionScreen_C_On_CommonBorderTouchToClose_MouseButtonUp::CallFunc_Handled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePassDirectAcquisitionScreen_C_On_CommonBorderTouchToClose_MouseButtonUp, CallFunc_HandleBack_bPassThrough) == 0x000220, "Member 'BattlePassDirectAcquisitionScreen_C_On_CommonBorderTouchToClose_MouseButtonUp::CallFunc_HandleBack_bPassThrough' has a wrong offset!");

// Function BattlePassDirectAcquisitionScreen.BattlePassDirectAcquisitionScreen_C.Intro Anim "OR"
// 0x0008 (0x0008 - 0x0000)
struct BattlePassDirectAcquisitionScreen_C_Intro_Anim__OR_ final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattlePassDirectAcquisitionScreen_C_Intro_Anim__OR_) == 0x000008, "Wrong alignment on BattlePassDirectAcquisitionScreen_C_Intro_Anim__OR_");
static_assert(sizeof(BattlePassDirectAcquisitionScreen_C_Intro_Anim__OR_) == 0x000008, "Wrong size on BattlePassDirectAcquisitionScreen_C_Intro_Anim__OR_");
static_assert(offsetof(BattlePassDirectAcquisitionScreen_C_Intro_Anim__OR_, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'BattlePassDirectAcquisitionScreen_C_Intro_Anim__OR_::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function BattlePassDirectAcquisitionScreen.BattlePassDirectAcquisitionScreen_C.Intro Anim "Tiles"
// 0x0008 (0x0008 - 0x0000)
struct BattlePassDirectAcquisitionScreen_C_Intro_Anim__Tiles_ final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattlePassDirectAcquisitionScreen_C_Intro_Anim__Tiles_) == 0x000008, "Wrong alignment on BattlePassDirectAcquisitionScreen_C_Intro_Anim__Tiles_");
static_assert(sizeof(BattlePassDirectAcquisitionScreen_C_Intro_Anim__Tiles_) == 0x000008, "Wrong size on BattlePassDirectAcquisitionScreen_C_Intro_Anim__Tiles_");
static_assert(offsetof(BattlePassDirectAcquisitionScreen_C_Intro_Anim__Tiles_, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'BattlePassDirectAcquisitionScreen_C_Intro_Anim__Tiles_::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function BattlePassDirectAcquisitionScreen.BattlePassDirectAcquisitionScreen_C.Intro Anim Reset
// 0x0008 (0x0008 - 0x0000)
struct BattlePassDirectAcquisitionScreen_C_Intro_Anim_Reset final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattlePassDirectAcquisitionScreen_C_Intro_Anim_Reset) == 0x000008, "Wrong alignment on BattlePassDirectAcquisitionScreen_C_Intro_Anim_Reset");
static_assert(sizeof(BattlePassDirectAcquisitionScreen_C_Intro_Anim_Reset) == 0x000008, "Wrong size on BattlePassDirectAcquisitionScreen_C_Intro_Anim_Reset");
static_assert(offsetof(BattlePassDirectAcquisitionScreen_C_Intro_Anim_Reset, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'BattlePassDirectAcquisitionScreen_C_Intro_Anim_Reset::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function BattlePassDirectAcquisitionScreen.BattlePassDirectAcquisitionScreen_C.Intro Anim "Header"
// 0x0008 (0x0008 - 0x0000)
struct BattlePassDirectAcquisitionScreen_C_Intro_Anim__Header_ final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattlePassDirectAcquisitionScreen_C_Intro_Anim__Header_) == 0x000008, "Wrong alignment on BattlePassDirectAcquisitionScreen_C_Intro_Anim__Header_");
static_assert(sizeof(BattlePassDirectAcquisitionScreen_C_Intro_Anim__Header_) == 0x000008, "Wrong size on BattlePassDirectAcquisitionScreen_C_Intro_Anim__Header_");
static_assert(offsetof(BattlePassDirectAcquisitionScreen_C_Intro_Anim__Header_, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'BattlePassDirectAcquisitionScreen_C_Intro_Anim__Header_::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function BattlePassDirectAcquisitionScreen.BattlePassDirectAcquisitionScreen_C.GetSeasonEndLabelText
// 0x00A0 (0x00A0 - 0x0000)
struct BattlePassDirectAcquisitionScreen_C_GetSeasonEndLabelText final
{
public:
	class FText                                   Result;                                            // 0x0000(0x0018)(Parm, OutParm)
	class UAthenaAccountContext*                  CallFunc_GetContext_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetCurrentChapterAndSeasonText_ReturnValue; // 0x0020(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0038(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0078(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0088(0x0018)()
};
static_assert(alignof(BattlePassDirectAcquisitionScreen_C_GetSeasonEndLabelText) == 0x000008, "Wrong alignment on BattlePassDirectAcquisitionScreen_C_GetSeasonEndLabelText");
static_assert(sizeof(BattlePassDirectAcquisitionScreen_C_GetSeasonEndLabelText) == 0x0000A0, "Wrong size on BattlePassDirectAcquisitionScreen_C_GetSeasonEndLabelText");
static_assert(offsetof(BattlePassDirectAcquisitionScreen_C_GetSeasonEndLabelText, Result) == 0x000000, "Member 'BattlePassDirectAcquisitionScreen_C_GetSeasonEndLabelText::Result' has a wrong offset!");
static_assert(offsetof(BattlePassDirectAcquisitionScreen_C_GetSeasonEndLabelText, CallFunc_GetContext_ReturnValue) == 0x000018, "Member 'BattlePassDirectAcquisitionScreen_C_GetSeasonEndLabelText::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePassDirectAcquisitionScreen_C_GetSeasonEndLabelText, CallFunc_GetCurrentChapterAndSeasonText_ReturnValue) == 0x000020, "Member 'BattlePassDirectAcquisitionScreen_C_GetSeasonEndLabelText::CallFunc_GetCurrentChapterAndSeasonText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePassDirectAcquisitionScreen_C_GetSeasonEndLabelText, K2Node_MakeStruct_FormatArgumentData) == 0x000038, "Member 'BattlePassDirectAcquisitionScreen_C_GetSeasonEndLabelText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BattlePassDirectAcquisitionScreen_C_GetSeasonEndLabelText, K2Node_MakeArray_Array) == 0x000078, "Member 'BattlePassDirectAcquisitionScreen_C_GetSeasonEndLabelText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BattlePassDirectAcquisitionScreen_C_GetSeasonEndLabelText, CallFunc_Format_ReturnValue) == 0x000088, "Member 'BattlePassDirectAcquisitionScreen_C_GetSeasonEndLabelText::CallFunc_Format_ReturnValue' has a wrong offset!");

}

