#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattlePassScreen

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BattlePassScreen.BattlePassScreen_C
// 0x0128 (0x0AE0 - 0x09B8)
class UBattlePassScreen_C final : public UBattlePassScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x09B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ShowVariantLabel;                                  // 0x09C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HideRightSideActionButtons_2;                      // 0x09C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       RevealRightSideActionButtons;                      // 0x09D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SeasonInformation;                                 // 0x09D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       RightFriendCountCollapse;                          // 0x09E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       LeftFriendCountCollapse;                           // 0x09E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnViewReward;                                      // 0x09F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USizeBox*                               AdditionalStyles;                                  // 0x09F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              BackButton_SZ;                                     // 0x0A00(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBattlePassScreen_SideMessaging_NewTech_C* BattlePassScreen_SideMessaging_NewTech;            // 0x0A08(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               DetailsContainer;                                  // 0x0A10(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         EndingDate;                                        // 0x0A18(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FakeHackGradient;                                  // 0x0A20(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               ItemDescriptionSizeBox;                            // 0x0A28(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              ItemDetails_SZ;                                    // 0x0A30(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               ItemDetailsContainer;                              // 0x0A38(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               ItemSetSizeBox;                                    // 0x0A40(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OwnsBattlePassContainer;                           // 0x0A48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ScreenNoise;                                       // 0x0A50(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SeasonDetails_SZ;                                  // 0x0A58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           SeasonDetailsContainer;                            // 0x0A60(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SetItems_SZ;                                       // 0x0A68(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher_Rewards;                                  // 0x0A70(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SZDisclaimers;                                     // 0x0A78(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_ChapterNumber_1;                              // 0x0A80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_ChapterNumber_2;                              // 0x0A88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               TrackViewContainer;                                // 0x0A90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          VariantLabel;                                      // 0x0A98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       VariantUnlockPreviewSet;                           // 0x0AA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bOwnsBattlePass;                                   // 0x0AA8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AA9[0x7];                                      // 0x0AA9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UActivatableMovieWidget_C*              ActivatableMovieWidget;                            // 0x0AB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortStreamMediaSource*                 ElectraMediaSource;                                // 0x0AB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           StreamedVideoOpeningTimer;                         // 0x0AC0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMediaPlayer*                           StreamedMediaPlayer;                               // 0x0AC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           StreamedVideoPlayingTimer;                         // 0x0AD0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bAnimateRewardTimeline;                            // 0x0AD8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          RightSideActionsHidden;                            // 0x0AD9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          AutoPlayVideo;                                     // 0x0ADA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ForceAutoPlayVideo;                                // 0x0ADB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BattlePassScreen(int32 EntryPoint);
	void OnSetDifferentBPText();
	void Destruct();
	void HandleOnInputMethodChanged(ECommonInputType bNewInputType);
	void Construct();
	void OnBattlePassViewChanged(EBattlePassView NewView);
	void OnVariantUpdate(int32 CurrentIndex, int32 TotalNumVariants);
	void OnRequestViewRewardComplete();
	void OnRequestViewReward();
	void OnHandleViewAllRewards();
	void BP_OnActivated();
	void OnHandleWatchVideo();
	void OnHandleAboutBattlePass();
	void OnHandleReplayCinematic();
	void HandleOnUpdatedVisibleFriendCount(int32 LeftFriendCount, int32 RightFriendCount);
	void OnSetupPurchaseSeasonLevel(const TMap<int32, class UFortSeasonPassLevelInfo*>& SeasonLevelInfos, class UAthenaSeasonItemDefinition* CurrentSeasonData, class UFortSeasonPassLevelInfo* CurrentLevel, int32 MaxLevelToPurchase, int32 LevelToBePurchased);
	void HandleOnViewReward(const struct FFortRarityItemData& Rarity, bool bNoReward, int32 NumRewardsToPurchase, const class UFortItemDefinition* RewardItem);
	void HandleViewReward(bool bInNoReward, int32 InNumRewardsToPurchase);
	void HandleWatchVideoRequest(bool PlayFromDisc);
	void HandleRewardTimelineAnimation(bool bAnimateRewardTimeline_0);
	void HandleOffscreenIndicatorAnimations(int32 LeftFriendCount, int32 RightFriendCount);
	void HandleShowVariantCycleLabel(bool bShowCycleLabel);
	void HideRightSideActions();
	void RevealRightSideActions();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BattlePassScreen_C">();
	}
	static class UBattlePassScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattlePassScreen_C>();
	}
};
static_assert(alignof(UBattlePassScreen_C) == 0x000008, "Wrong alignment on UBattlePassScreen_C");
static_assert(sizeof(UBattlePassScreen_C) == 0x000AE0, "Wrong size on UBattlePassScreen_C");
static_assert(offsetof(UBattlePassScreen_C, UberGraphFrame) == 0x0009B8, "Member 'UBattlePassScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBattlePassScreen_C, ShowVariantLabel) == 0x0009C0, "Member 'UBattlePassScreen_C::ShowVariantLabel' has a wrong offset!");
static_assert(offsetof(UBattlePassScreen_C, HideRightSideActionButtons_2) == 0x0009C8, "Member 'UBattlePassScreen_C::HideRightSideActionButtons_2' has a wrong offset!");
static_assert(offsetof(UBattlePassScreen_C, RevealRightSideActionButtons) == 0x0009D0, "Member 'UBattlePassScreen_C::RevealRightSideActionButtons' has a wrong offset!");
static_assert(offsetof(UBattlePassScreen_C, SeasonInformation) == 0x0009D8, "Member 'UBattlePassScreen_C::SeasonInformation' has a wrong offset!");
static_assert(offsetof(UBattlePassScreen_C, RightFriendCountCollapse) == 0x0009E0, "Member 'UBattlePassScreen_C::RightFriendCountCollapse' has a wrong offset!");
static_assert(offsetof(UBattlePassScreen_C, LeftFriendCountCollapse) == 0x0009E8, "Member 'UBattlePassScreen_C::LeftFriendCountCollapse' has a wrong offset!");
static_assert(offsetof(UBattlePassScreen_C, OnViewReward) == 0x0009F0, "Member 'UBattlePassScreen_C::OnViewReward' has a wrong offset!");
static_assert(offsetof(UBattlePassScreen_C, AdditionalStyles) == 0x0009F8, "Member 'UBattlePassScreen_C::AdditionalStyles' has a wrong offset!");
static_assert(offsetof(UBattlePassScreen_C, BackButton_SZ) == 0x000A00, "Member 'UBattlePassScreen_C::BackButton_SZ' has a wrong offset!");
static_assert(offsetof(UBattlePassScreen_C, BattlePassScreen_SideMessaging_NewTech) == 0x000A08, "Member 'UBattlePassScreen_C::BattlePassScreen_SideMessaging_NewTech' has a wrong offset!");
static_assert(offsetof(UBattlePassScreen_C, DetailsContainer) == 0x000A10, "Member 'UBattlePassScreen_C::DetailsContainer' has a wrong offset!");
static_assert(offsetof(UBattlePassScreen_C, EndingDate) == 0x000A18, "Member 'UBattlePassScreen_C::EndingDate' has a wrong offset!");
static_assert(offsetof(UBattlePassScreen_C, FakeHackGradient) == 0x000A20, "Member 'UBattlePassScreen_C::FakeHackGradient' has a wrong offset!");
static_assert(offsetof(UBattlePassScreen_C, ItemDescriptionSizeBox) == 0x000A28, "Member 'UBattlePassScreen_C::ItemDescriptionSizeBox' has a wrong offset!");
static_assert(offsetof(UBattlePassScreen_C, ItemDetails_SZ) == 0x000A30, "Member 'UBattlePassScreen_C::ItemDetails_SZ' has a wrong offset!");
static_assert(offsetof(UBattlePassScreen_C, ItemDetailsContainer) == 0x000A38, "Member 'UBattlePassScreen_C::ItemDetailsContainer' has a wrong offset!");
static_assert(offsetof(UBattlePassScreen_C, ItemSetSizeBox) == 0x000A40, "Member 'UBattlePassScreen_C::ItemSetSizeBox' has a wrong offset!");
static_assert(offsetof(UBattlePassScreen_C, OwnsBattlePassContainer) == 0x000A48, "Member 'UBattlePassScreen_C::OwnsBattlePassContainer' has a wrong offset!");
static_assert(offsetof(UBattlePassScreen_C, ScreenNoise) == 0x000A50, "Member 'UBattlePassScreen_C::ScreenNoise' has a wrong offset!");
static_assert(offsetof(UBattlePassScreen_C, SeasonDetails_SZ) == 0x000A58, "Member 'UBattlePassScreen_C::SeasonDetails_SZ' has a wrong offset!");
static_assert(offsetof(UBattlePassScreen_C, SeasonDetailsContainer) == 0x000A60, "Member 'UBattlePassScreen_C::SeasonDetailsContainer' has a wrong offset!");
static_assert(offsetof(UBattlePassScreen_C, SetItems_SZ) == 0x000A68, "Member 'UBattlePassScreen_C::SetItems_SZ' has a wrong offset!");
static_assert(offsetof(UBattlePassScreen_C, Switcher_Rewards) == 0x000A70, "Member 'UBattlePassScreen_C::Switcher_Rewards' has a wrong offset!");
static_assert(offsetof(UBattlePassScreen_C, SZDisclaimers) == 0x000A78, "Member 'UBattlePassScreen_C::SZDisclaimers' has a wrong offset!");
static_assert(offsetof(UBattlePassScreen_C, Text_ChapterNumber_1) == 0x000A80, "Member 'UBattlePassScreen_C::Text_ChapterNumber_1' has a wrong offset!");
static_assert(offsetof(UBattlePassScreen_C, Text_ChapterNumber_2) == 0x000A88, "Member 'UBattlePassScreen_C::Text_ChapterNumber_2' has a wrong offset!");
static_assert(offsetof(UBattlePassScreen_C, TrackViewContainer) == 0x000A90, "Member 'UBattlePassScreen_C::TrackViewContainer' has a wrong offset!");
static_assert(offsetof(UBattlePassScreen_C, VariantLabel) == 0x000A98, "Member 'UBattlePassScreen_C::VariantLabel' has a wrong offset!");
static_assert(offsetof(UBattlePassScreen_C, VariantUnlockPreviewSet) == 0x000AA0, "Member 'UBattlePassScreen_C::VariantUnlockPreviewSet' has a wrong offset!");
static_assert(offsetof(UBattlePassScreen_C, bOwnsBattlePass) == 0x000AA8, "Member 'UBattlePassScreen_C::bOwnsBattlePass' has a wrong offset!");
static_assert(offsetof(UBattlePassScreen_C, ActivatableMovieWidget) == 0x000AB0, "Member 'UBattlePassScreen_C::ActivatableMovieWidget' has a wrong offset!");
static_assert(offsetof(UBattlePassScreen_C, ElectraMediaSource) == 0x000AB8, "Member 'UBattlePassScreen_C::ElectraMediaSource' has a wrong offset!");
static_assert(offsetof(UBattlePassScreen_C, StreamedVideoOpeningTimer) == 0x000AC0, "Member 'UBattlePassScreen_C::StreamedVideoOpeningTimer' has a wrong offset!");
static_assert(offsetof(UBattlePassScreen_C, StreamedMediaPlayer) == 0x000AC8, "Member 'UBattlePassScreen_C::StreamedMediaPlayer' has a wrong offset!");
static_assert(offsetof(UBattlePassScreen_C, StreamedVideoPlayingTimer) == 0x000AD0, "Member 'UBattlePassScreen_C::StreamedVideoPlayingTimer' has a wrong offset!");
static_assert(offsetof(UBattlePassScreen_C, bAnimateRewardTimeline) == 0x000AD8, "Member 'UBattlePassScreen_C::bAnimateRewardTimeline' has a wrong offset!");
static_assert(offsetof(UBattlePassScreen_C, RightSideActionsHidden) == 0x000AD9, "Member 'UBattlePassScreen_C::RightSideActionsHidden' has a wrong offset!");
static_assert(offsetof(UBattlePassScreen_C, AutoPlayVideo) == 0x000ADA, "Member 'UBattlePassScreen_C::AutoPlayVideo' has a wrong offset!");
static_assert(offsetof(UBattlePassScreen_C, ForceAutoPlayVideo) == 0x000ADB, "Member 'UBattlePassScreen_C::ForceAutoPlayVideo' has a wrong offset!");

}

