#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Frontend_EventLevel_NavObject_Doors

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Frontend_EventLevel_NavObject_Doors.BP_Frontend_EventLevel_NavObject_Doors_C.ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_Doors
// 0x0098 (0x0098 - 0x0000)
struct BP_Frontend_EventLevel_NavObject_Doors_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_Doors final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_1;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable_2;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable_3;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_43[0x5];                                       // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_Event_ButtonPressed;                        // 0x0048(0x0018)(HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_66[0x2];                                       // 0x0066(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_Select_Default;                             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             K2Node_Select_Default_1;                           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue_1;       // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Frontend_EventLevel_NavObject_Doors_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_Doors) == 0x000008, "Wrong alignment on BP_Frontend_EventLevel_NavObject_Doors_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_Doors");
static_assert(sizeof(BP_Frontend_EventLevel_NavObject_Doors_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_Doors) == 0x000098, "Wrong size on BP_Frontend_EventLevel_NavObject_Doors_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_Doors");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_Doors_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_Doors, EntryPoint) == 0x000000, "Member 'BP_Frontend_EventLevel_NavObject_Doors_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_Doors::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_Doors_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_Doors, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000004, "Member 'BP_Frontend_EventLevel_NavObject_Doors_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_Doors::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_Doors_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_Doors, Temp_bool_Variable) == 0x000010, "Member 'BP_Frontend_EventLevel_NavObject_Doors_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_Doors::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_Doors_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_Doors, Temp_object_Variable) == 0x000018, "Member 'BP_Frontend_EventLevel_NavObject_Doors_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_Doors::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_Doors_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_Doors, Temp_object_Variable_1) == 0x000020, "Member 'BP_Frontend_EventLevel_NavObject_Doors_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_Doors::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_Doors_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_Doors, Temp_bool_Variable_1) == 0x000028, "Member 'BP_Frontend_EventLevel_NavObject_Doors_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_Doors::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_Doors_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_Doors, Temp_object_Variable_2) == 0x000030, "Member 'BP_Frontend_EventLevel_NavObject_Doors_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_Doors::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_Doors_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_Doors, Temp_object_Variable_3) == 0x000038, "Member 'BP_Frontend_EventLevel_NavObject_Doors_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_Doors::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_Doors_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_Doors, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000040, "Member 'BP_Frontend_EventLevel_NavObject_Doors_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_Doors::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_Doors_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_Doors, Temp_bool_Has_Been_Initd_Variable) == 0x000041, "Member 'BP_Frontend_EventLevel_NavObject_Doors_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_Doors::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_Doors_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_Doors, Temp_bool_IsClosed_Variable) == 0x000042, "Member 'BP_Frontend_EventLevel_NavObject_Doors_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_Doors::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_Doors_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_Doors, K2Node_Event_ButtonPressed) == 0x000048, "Member 'BP_Frontend_EventLevel_NavObject_Doors_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_Doors::K2Node_Event_ButtonPressed' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_Doors_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_Doors, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000060, "Member 'BP_Frontend_EventLevel_NavObject_Doors_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_Doors::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_Doors_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_Doors, CallFunc_IsValid_ReturnValue) == 0x000064, "Member 'BP_Frontend_EventLevel_NavObject_Doors_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_Doors::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_Doors_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_Doors, CallFunc_IsValid_ReturnValue_1) == 0x000065, "Member 'BP_Frontend_EventLevel_NavObject_Doors_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_Doors::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_Doors_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_Doors, K2Node_Select_Default) == 0x000068, "Member 'BP_Frontend_EventLevel_NavObject_Doors_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_Doors::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_Doors_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_Doors, K2Node_Select_Default_1) == 0x000070, "Member 'BP_Frontend_EventLevel_NavObject_Doors_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_Doors::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_Doors_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_Doors, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000078, "Member 'BP_Frontend_EventLevel_NavObject_Doors_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_Doors::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_Doors_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_Doors, CallFunc_SpawnSoundAtLocation_ReturnValue) == 0x000088, "Member 'BP_Frontend_EventLevel_NavObject_Doors_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_Doors::CallFunc_SpawnSoundAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_Doors_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_Doors, CallFunc_SpawnSoundAtLocation_ReturnValue_1) == 0x000090, "Member 'BP_Frontend_EventLevel_NavObject_Doors_C_ExecuteUbergraph_BP_Frontend_EventLevel_NavObject_Doors::CallFunc_SpawnSoundAtLocation_ReturnValue_1' has a wrong offset!");

// Function BP_Frontend_EventLevel_NavObject_Doors.BP_Frontend_EventLevel_NavObject_Doors_C.ReceiveActorOnClicked
// 0x0018 (0x0018 - 0x0000)
struct BP_Frontend_EventLevel_NavObject_Doors_C_ReceiveActorOnClicked final
{
public:
	struct FKey                                   ButtonPressed;                                     // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_Frontend_EventLevel_NavObject_Doors_C_ReceiveActorOnClicked) == 0x000008, "Wrong alignment on BP_Frontend_EventLevel_NavObject_Doors_C_ReceiveActorOnClicked");
static_assert(sizeof(BP_Frontend_EventLevel_NavObject_Doors_C_ReceiveActorOnClicked) == 0x000018, "Wrong size on BP_Frontend_EventLevel_NavObject_Doors_C_ReceiveActorOnClicked");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_Doors_C_ReceiveActorOnClicked, ButtonPressed) == 0x000000, "Member 'BP_Frontend_EventLevel_NavObject_Doors_C_ReceiveActorOnClicked::ButtonPressed' has a wrong offset!");

// Function BP_Frontend_EventLevel_NavObject_Doors.BP_Frontend_EventLevel_NavObject_Doors_C.UserConstructionScript
// 0x0028 (0x0028 - 0x0000)
struct BP_Frontend_EventLevel_NavObject_Doors_C_UserConstructionScript final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Frontend_EventLevel_NavObject_Doors_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_Frontend_EventLevel_NavObject_Doors_C_UserConstructionScript");
static_assert(sizeof(BP_Frontend_EventLevel_NavObject_Doors_C_UserConstructionScript) == 0x000028, "Wrong size on BP_Frontend_EventLevel_NavObject_Doors_C_UserConstructionScript");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_Doors_C_UserConstructionScript, Temp_bool_Variable) == 0x000000, "Member 'BP_Frontend_EventLevel_NavObject_Doors_C_UserConstructionScript::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_Doors_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'BP_Frontend_EventLevel_NavObject_Doors_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_Doors_C_UserConstructionScript, CallFunc_GetMaterial_ReturnValue) == 0x000008, "Member 'BP_Frontend_EventLevel_NavObject_Doors_C_UserConstructionScript::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_Doors_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000010, "Member 'BP_Frontend_EventLevel_NavObject_Doors_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_Doors_C_UserConstructionScript, K2Node_Select_Default) == 0x000018, "Member 'BP_Frontend_EventLevel_NavObject_Doors_C_UserConstructionScript::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_Frontend_EventLevel_NavObject_Doors_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000020, "Member 'BP_Frontend_EventLevel_NavObject_Doors_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");

}

