#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Frontend_InteractiveDartboard

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "BP_Frontend_EventLevel_NavObject_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Frontend_InteractiveDartboard.BP_Frontend_InteractiveDartboard_C
// 0x00D8 (0x05A8 - 0x04D0)
class ABP_Frontend_InteractiveDartboard_C final : public ABP_Frontend_EventLevel_NavObject_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Frontend_InteractiveDartboard_C; // 0x04D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               PFX_Dart2;                                         // 0x04D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PFX_Dart1;                                         // 0x04E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DartTarget3;                                       // 0x04E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DartTarget2;                                       // 0x04F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Dart3;                                             // 0x04F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Dart2;                                             // 0x0500(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DartTarget1;                                       // 0x0508(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Dart1;                                             // 0x0510(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PFX_Dart;                                          // 0x0518(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CISFixMesh;                                        // 0x0520(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0528(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_1_FlightFloat_8D3268CB46F18FB290969CAE7D5A455E; // 0x0530(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_1__Direction_8D3268CB46F18FB290969CAE7D5A455E; // 0x0534(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_535[0x3];                                      // 0x0535(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_1;                                        // 0x0538(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_FlightFloat_28F1BF134B1C6BB8492631A6C6CF5F87; // 0x0540(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_28F1BF134B1C6BB8492631A6C6CF5F87; // 0x0544(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_545[0x3];                                      // 0x0545(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0548(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AnimateDart_FlightFloat_45E7E99F4D9445C0100D76B4A98CC2A9; // 0x0550(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            AnimateDart__Direction_45E7E99F4D9445C0100D76B4A98CC2A9; // 0x0554(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_555[0x3];                                      // 0x0555(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     AnimateDart;                                       // 0x0558(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInteractAllowed;                                 // 0x0560(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_561[0x7];                                      // 0x0561(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               Dart_;                                             // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               DartTrail;                                         // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Dart1Source;                                       // 0x0578(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseResetTimer;                                    // 0x0584(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_585[0x3];                                      // 0x0585(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Dart2Source;                                       // 0x0588(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Dart3Source;                                       // 0x0594(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DartInt;                                           // 0x05A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Frontend_InteractiveDartboard(int32 EntryPoint);
	void ResetAll();
	void HandleObjectSpecialInteraction(const struct FGameplayTag& ActionTag, const struct FGameplayTag& CameraTag);
	void Commit_OnSpecialInteraction();
	void ReceiveBeginPlay();
	void Timeline_1__DisableFX__EventFunc();
	void Timeline_1__UpdateFunc();
	void Timeline_1__FinishedFunc();
	void Timeline_0__DisableFX__EventFunc();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void AnimateDart__DisableFX__EventFunc();
	void AnimateDart__UpdateFunc();
	void AnimateDart__FinishedFunc();

	bool CanCommitNavigationRequest() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Frontend_InteractiveDartboard_C">();
	}
	static class ABP_Frontend_InteractiveDartboard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Frontend_InteractiveDartboard_C>();
	}
};
static_assert(alignof(ABP_Frontend_InteractiveDartboard_C) == 0x000008, "Wrong alignment on ABP_Frontend_InteractiveDartboard_C");
static_assert(sizeof(ABP_Frontend_InteractiveDartboard_C) == 0x0005A8, "Wrong size on ABP_Frontend_InteractiveDartboard_C");
static_assert(offsetof(ABP_Frontend_InteractiveDartboard_C, UberGraphFrame_BP_Frontend_InteractiveDartboard_C) == 0x0004D0, "Member 'ABP_Frontend_InteractiveDartboard_C::UberGraphFrame_BP_Frontend_InteractiveDartboard_C' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_InteractiveDartboard_C, PFX_Dart2) == 0x0004D8, "Member 'ABP_Frontend_InteractiveDartboard_C::PFX_Dart2' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_InteractiveDartboard_C, PFX_Dart1) == 0x0004E0, "Member 'ABP_Frontend_InteractiveDartboard_C::PFX_Dart1' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_InteractiveDartboard_C, DartTarget3) == 0x0004E8, "Member 'ABP_Frontend_InteractiveDartboard_C::DartTarget3' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_InteractiveDartboard_C, DartTarget2) == 0x0004F0, "Member 'ABP_Frontend_InteractiveDartboard_C::DartTarget2' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_InteractiveDartboard_C, Dart3) == 0x0004F8, "Member 'ABP_Frontend_InteractiveDartboard_C::Dart3' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_InteractiveDartboard_C, Dart2) == 0x000500, "Member 'ABP_Frontend_InteractiveDartboard_C::Dart2' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_InteractiveDartboard_C, DartTarget1) == 0x000508, "Member 'ABP_Frontend_InteractiveDartboard_C::DartTarget1' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_InteractiveDartboard_C, Dart1) == 0x000510, "Member 'ABP_Frontend_InteractiveDartboard_C::Dart1' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_InteractiveDartboard_C, PFX_Dart) == 0x000518, "Member 'ABP_Frontend_InteractiveDartboard_C::PFX_Dart' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_InteractiveDartboard_C, CISFixMesh) == 0x000520, "Member 'ABP_Frontend_InteractiveDartboard_C::CISFixMesh' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_InteractiveDartboard_C, SkeletalMesh) == 0x000528, "Member 'ABP_Frontend_InteractiveDartboard_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_InteractiveDartboard_C, Timeline_1_FlightFloat_8D3268CB46F18FB290969CAE7D5A455E) == 0x000530, "Member 'ABP_Frontend_InteractiveDartboard_C::Timeline_1_FlightFloat_8D3268CB46F18FB290969CAE7D5A455E' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_InteractiveDartboard_C, Timeline_1__Direction_8D3268CB46F18FB290969CAE7D5A455E) == 0x000534, "Member 'ABP_Frontend_InteractiveDartboard_C::Timeline_1__Direction_8D3268CB46F18FB290969CAE7D5A455E' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_InteractiveDartboard_C, Timeline_1) == 0x000538, "Member 'ABP_Frontend_InteractiveDartboard_C::Timeline_1' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_InteractiveDartboard_C, Timeline_0_FlightFloat_28F1BF134B1C6BB8492631A6C6CF5F87) == 0x000540, "Member 'ABP_Frontend_InteractiveDartboard_C::Timeline_0_FlightFloat_28F1BF134B1C6BB8492631A6C6CF5F87' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_InteractiveDartboard_C, Timeline_0__Direction_28F1BF134B1C6BB8492631A6C6CF5F87) == 0x000544, "Member 'ABP_Frontend_InteractiveDartboard_C::Timeline_0__Direction_28F1BF134B1C6BB8492631A6C6CF5F87' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_InteractiveDartboard_C, Timeline_0) == 0x000548, "Member 'ABP_Frontend_InteractiveDartboard_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_InteractiveDartboard_C, AnimateDart_FlightFloat_45E7E99F4D9445C0100D76B4A98CC2A9) == 0x000550, "Member 'ABP_Frontend_InteractiveDartboard_C::AnimateDart_FlightFloat_45E7E99F4D9445C0100D76B4A98CC2A9' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_InteractiveDartboard_C, AnimateDart__Direction_45E7E99F4D9445C0100D76B4A98CC2A9) == 0x000554, "Member 'ABP_Frontend_InteractiveDartboard_C::AnimateDart__Direction_45E7E99F4D9445C0100D76B4A98CC2A9' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_InteractiveDartboard_C, AnimateDart) == 0x000558, "Member 'ABP_Frontend_InteractiveDartboard_C::AnimateDart' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_InteractiveDartboard_C, IsInteractAllowed) == 0x000560, "Member 'ABP_Frontend_InteractiveDartboard_C::IsInteractAllowed' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_InteractiveDartboard_C, Dart_) == 0x000568, "Member 'ABP_Frontend_InteractiveDartboard_C::Dart_' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_InteractiveDartboard_C, DartTrail) == 0x000570, "Member 'ABP_Frontend_InteractiveDartboard_C::DartTrail' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_InteractiveDartboard_C, Dart1Source) == 0x000578, "Member 'ABP_Frontend_InteractiveDartboard_C::Dart1Source' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_InteractiveDartboard_C, bUseResetTimer) == 0x000584, "Member 'ABP_Frontend_InteractiveDartboard_C::bUseResetTimer' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_InteractiveDartboard_C, Dart2Source) == 0x000588, "Member 'ABP_Frontend_InteractiveDartboard_C::Dart2Source' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_InteractiveDartboard_C, Dart3Source) == 0x000594, "Member 'ABP_Frontend_InteractiveDartboard_C::Dart3Source' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_InteractiveDartboard_C, DartInt) == 0x0005A0, "Member 'ABP_Frontend_InteractiveDartboard_C::DartInt' has a wrong offset!");

}

