#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Frontend_ShopBG

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Frontend_ShopBG.BP_Frontend_ShopBG_C
// 0x0130 (0x0348 - 0x0218)
class ABP_Frontend_ShopBG_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0218(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDirectionalLightComponent*             DonutLight1;                                       // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   DonutRope;                                         // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDirectionalLightComponent*             DonutLight;                                        // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StandardBackgroundPlane1;                          // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Donut_2;                                           // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Donut_1;                                           // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       Widget;                                            // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StandardBackgroundPlane;                           // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cone;                                              // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Plane;                                             // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BackgroundTexturePlane;                            // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   VeryLargeBackgroundPlane;                          // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene_Signal;                                      // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         BackGroundKick_NewTrack_0_1612A2094921AFF57F2DDFA9887BBD74; // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            BackGroundKick__Direction_1612A2094921AFF57F2DDFA9887BBD74; // 0x029C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29D[0x3];                                      // 0x029D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     BackGroundKick;                                    // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DonutPushUI_UIRotation_5128FA4A4559607489F03FBBB3D15791; // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DonutPushUI_SecondPush_5128FA4A4559607489F03FBBB3D15791; // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DonutPushUI_FirstPush_5128FA4A4559607489F03FBBB3D15791; // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            DonutPushUI__Direction_5128FA4A4559607489F03FBBB3D15791; // 0x02B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B5[0x3];                                      // 0x02B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     DonutPushUI;                                       // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rot_Intro;                                         // 0x02C0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               NextRot;                                           // 0x02CC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               Rot_0;                                             // 0x02D8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               Rot_2;                                             // 0x02E4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         PlayRate;                                          // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rot_IntroStart;                                    // 0x02F4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bHasEvent;                                         // 0x0300(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_301[0x3];                                      // 0x0301(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         YInitial;                                          // 0x0304(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         YEnd;                                              // 0x0308(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               Mid;                                               // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACMSLobbyDirector_C*                    CMSDirector;                                       // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 BPEnvName;                                         // 0x0320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          ShopEntered;                                       // 0x0330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           DonutSeqTimerHandle;                               // 0x0338(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DomeObstruction;                                   // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void DonutPushUI__FinishedFunc();
	void DonutPushUI__UpdateFunc();
	void DonutPushUI__Background__EventFunc();
	void BackGroundKick__FinishedFunc();
	void BackGroundKick__UpdateFunc();
	void ReceiveBeginPlay();
	void SetDynamicBG(class UTexture* InTexture);
	void EnableDynamicShopBG();
	void SetDynamicEnvironmentEvent(const class FString& InPresetEnvName);
	void DebugShopBG();
	void PlayDonutSequenceAnimation();
	void DonutSequenceHeartbeatOver();
	void HandleRequestHide();
	void HandleItemShopEntered();
	void HandleStoreEntered();
	void ResetDonut();
	void ExecuteUbergraph_BP_Frontend_ShopBG(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Frontend_ShopBG_C">();
	}
	static class ABP_Frontend_ShopBG_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Frontend_ShopBG_C>();
	}
};
static_assert(alignof(ABP_Frontend_ShopBG_C) == 0x000008, "Wrong alignment on ABP_Frontend_ShopBG_C");
static_assert(sizeof(ABP_Frontend_ShopBG_C) == 0x000348, "Wrong size on ABP_Frontend_ShopBG_C");
static_assert(offsetof(ABP_Frontend_ShopBG_C, UberGraphFrame) == 0x000218, "Member 'ABP_Frontend_ShopBG_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_ShopBG_C, DonutLight1) == 0x000220, "Member 'ABP_Frontend_ShopBG_C::DonutLight1' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_ShopBG_C, DonutRope) == 0x000228, "Member 'ABP_Frontend_ShopBG_C::DonutRope' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_ShopBG_C, DonutLight) == 0x000230, "Member 'ABP_Frontend_ShopBG_C::DonutLight' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_ShopBG_C, StandardBackgroundPlane1) == 0x000238, "Member 'ABP_Frontend_ShopBG_C::StandardBackgroundPlane1' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_ShopBG_C, Donut_2) == 0x000240, "Member 'ABP_Frontend_ShopBG_C::Donut_2' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_ShopBG_C, Donut_1) == 0x000248, "Member 'ABP_Frontend_ShopBG_C::Donut_1' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_ShopBG_C, Widget) == 0x000250, "Member 'ABP_Frontend_ShopBG_C::Widget' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_ShopBG_C, StandardBackgroundPlane) == 0x000258, "Member 'ABP_Frontend_ShopBG_C::StandardBackgroundPlane' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_ShopBG_C, Cone) == 0x000260, "Member 'ABP_Frontend_ShopBG_C::Cone' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_ShopBG_C, Plane) == 0x000268, "Member 'ABP_Frontend_ShopBG_C::Plane' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_ShopBG_C, Scene) == 0x000270, "Member 'ABP_Frontend_ShopBG_C::Scene' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_ShopBG_C, BackgroundTexturePlane) == 0x000278, "Member 'ABP_Frontend_ShopBG_C::BackgroundTexturePlane' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_ShopBG_C, VeryLargeBackgroundPlane) == 0x000280, "Member 'ABP_Frontend_ShopBG_C::VeryLargeBackgroundPlane' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_ShopBG_C, Scene_Signal) == 0x000288, "Member 'ABP_Frontend_ShopBG_C::Scene_Signal' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_ShopBG_C, DefaultSceneRoot) == 0x000290, "Member 'ABP_Frontend_ShopBG_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_ShopBG_C, BackGroundKick_NewTrack_0_1612A2094921AFF57F2DDFA9887BBD74) == 0x000298, "Member 'ABP_Frontend_ShopBG_C::BackGroundKick_NewTrack_0_1612A2094921AFF57F2DDFA9887BBD74' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_ShopBG_C, BackGroundKick__Direction_1612A2094921AFF57F2DDFA9887BBD74) == 0x00029C, "Member 'ABP_Frontend_ShopBG_C::BackGroundKick__Direction_1612A2094921AFF57F2DDFA9887BBD74' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_ShopBG_C, BackGroundKick) == 0x0002A0, "Member 'ABP_Frontend_ShopBG_C::BackGroundKick' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_ShopBG_C, DonutPushUI_UIRotation_5128FA4A4559607489F03FBBB3D15791) == 0x0002A8, "Member 'ABP_Frontend_ShopBG_C::DonutPushUI_UIRotation_5128FA4A4559607489F03FBBB3D15791' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_ShopBG_C, DonutPushUI_SecondPush_5128FA4A4559607489F03FBBB3D15791) == 0x0002AC, "Member 'ABP_Frontend_ShopBG_C::DonutPushUI_SecondPush_5128FA4A4559607489F03FBBB3D15791' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_ShopBG_C, DonutPushUI_FirstPush_5128FA4A4559607489F03FBBB3D15791) == 0x0002B0, "Member 'ABP_Frontend_ShopBG_C::DonutPushUI_FirstPush_5128FA4A4559607489F03FBBB3D15791' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_ShopBG_C, DonutPushUI__Direction_5128FA4A4559607489F03FBBB3D15791) == 0x0002B4, "Member 'ABP_Frontend_ShopBG_C::DonutPushUI__Direction_5128FA4A4559607489F03FBBB3D15791' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_ShopBG_C, DonutPushUI) == 0x0002B8, "Member 'ABP_Frontend_ShopBG_C::DonutPushUI' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_ShopBG_C, Rot_Intro) == 0x0002C0, "Member 'ABP_Frontend_ShopBG_C::Rot_Intro' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_ShopBG_C, NextRot) == 0x0002CC, "Member 'ABP_Frontend_ShopBG_C::NextRot' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_ShopBG_C, Rot_0) == 0x0002D8, "Member 'ABP_Frontend_ShopBG_C::Rot_0' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_ShopBG_C, Rot_2) == 0x0002E4, "Member 'ABP_Frontend_ShopBG_C::Rot_2' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_ShopBG_C, PlayRate) == 0x0002F0, "Member 'ABP_Frontend_ShopBG_C::PlayRate' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_ShopBG_C, Rot_IntroStart) == 0x0002F4, "Member 'ABP_Frontend_ShopBG_C::Rot_IntroStart' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_ShopBG_C, bHasEvent) == 0x000300, "Member 'ABP_Frontend_ShopBG_C::bHasEvent' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_ShopBG_C, YInitial) == 0x000304, "Member 'ABP_Frontend_ShopBG_C::YInitial' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_ShopBG_C, YEnd) == 0x000308, "Member 'ABP_Frontend_ShopBG_C::YEnd' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_ShopBG_C, Mid) == 0x000310, "Member 'ABP_Frontend_ShopBG_C::Mid' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_ShopBG_C, CMSDirector) == 0x000318, "Member 'ABP_Frontend_ShopBG_C::CMSDirector' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_ShopBG_C, BPEnvName) == 0x000320, "Member 'ABP_Frontend_ShopBG_C::BPEnvName' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_ShopBG_C, ShopEntered) == 0x000330, "Member 'ABP_Frontend_ShopBG_C::ShopEntered' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_ShopBG_C, DonutSeqTimerHandle) == 0x000338, "Member 'ABP_Frontend_ShopBG_C::DonutSeqTimerHandle' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_ShopBG_C, DomeObstruction) == 0x000340, "Member 'ABP_Frontend_ShopBG_C::DomeObstruction' has a wrong offset!");

}

