#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Frontend_ShopBG

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Frontend_ShopBG.BP_Frontend_ShopBG_C.SetDynamicBG
// 0x0008 (0x0008 - 0x0000)
struct BP_Frontend_ShopBG_C_SetDynamicBG final
{
public:
	class UTexture*                               InTexture;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Frontend_ShopBG_C_SetDynamicBG) == 0x000008, "Wrong alignment on BP_Frontend_ShopBG_C_SetDynamicBG");
static_assert(sizeof(BP_Frontend_ShopBG_C_SetDynamicBG) == 0x000008, "Wrong size on BP_Frontend_ShopBG_C_SetDynamicBG");
static_assert(offsetof(BP_Frontend_ShopBG_C_SetDynamicBG, InTexture) == 0x000000, "Member 'BP_Frontend_ShopBG_C_SetDynamicBG::InTexture' has a wrong offset!");

// Function BP_Frontend_ShopBG.BP_Frontend_ShopBG_C.SetDynamicEnvironmentEvent
// 0x0010 (0x0010 - 0x0000)
struct BP_Frontend_ShopBG_C_SetDynamicEnvironmentEvent final
{
public:
	class FString                                 InPresetEnvName;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Frontend_ShopBG_C_SetDynamicEnvironmentEvent) == 0x000008, "Wrong alignment on BP_Frontend_ShopBG_C_SetDynamicEnvironmentEvent");
static_assert(sizeof(BP_Frontend_ShopBG_C_SetDynamicEnvironmentEvent) == 0x000010, "Wrong size on BP_Frontend_ShopBG_C_SetDynamicEnvironmentEvent");
static_assert(offsetof(BP_Frontend_ShopBG_C_SetDynamicEnvironmentEvent, InPresetEnvName) == 0x000000, "Member 'BP_Frontend_ShopBG_C_SetDynamicEnvironmentEvent::InPresetEnvName' has a wrong offset!");

// Function BP_Frontend_ShopBG.BP_Frontend_ShopBG_C.ExecuteUbergraph_BP_Frontend_ShopBG
// 0x0348 (0x0348 - 0x0000)
struct BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture*                               K2Node_CustomEvent_InTexture;                      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_InPresetEnvName;                // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerMannequin*                   K2Node_DynamicCast_AsFort_Player_Mannequin;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0070(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerMannequin*                   K2Node_DynamicCast_AsFort_Player_Mannequin_1;      // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult; // 0x010C(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TArray<class ACMSLobbyDirector_C*>            CallFunc_GetAllActorsOfClass_OutActors;            // 0x0198(0x0010)(ZeroConstructor, ReferenceParm)
	class ACMSLobbyDirector_C*                    CallFunc_Array_Get_Item;                           // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x01B0(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x01C0(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1CE[0x2];                                      // 0x01CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_2;                       // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x01DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x01E8(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_SwitchString_CmpSuccess_1;                  // 0x0274(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0275(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0276(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_277[0x1];                                      // 0x0277(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetAllActorsWithTag_OutActors;            // 0x0278(0x0010)(ZeroConstructor, ReferenceParm)
	struct FHitResult                             CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult_1; // 0x0288(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_314[0x4];                                      // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0324(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0325(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0326(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchString_CmpSuccess_2;                  // 0x0327(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ASkeletalMeshActor*                     K2Node_DynamicCast_AsSkeletal_Mesh_Actor;          // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0331(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0332(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetHasDonutShopSequenceBeenSeen_ReturnValue; // 0x0333(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0334(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0335(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_336[0x2];                                      // 0x0336(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_2; // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x0341(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x0342(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_12;                   // 0x0343(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetHasDonutShopSequenceBeenSeen_ReturnValue_1; // 0x0344(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0345(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG) == 0x000008, "Wrong alignment on BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG");
static_assert(sizeof(BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG) == 0x000348, "Wrong size on BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG");
static_assert(offsetof(BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG, EntryPoint) == 0x000000, "Member 'BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG, CallFunc_Lerp_ReturnValue) == 0x000004, "Member 'BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG, CallFunc_Conv_FloatToVector_ReturnValue) == 0x000008, "Member 'BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG, K2Node_CustomEvent_InTexture) == 0x000018, "Member 'BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG::K2Node_CustomEvent_InTexture' has a wrong offset!");
static_assert(offsetof(BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000028, "Member 'BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG, K2Node_CustomEvent_InPresetEnvName) == 0x000030, "Member 'BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG::K2Node_CustomEvent_InPresetEnvName' has a wrong offset!");
static_assert(offsetof(BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG, K2Node_SwitchString_CmpSuccess) == 0x000040, "Member 'BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG::K2Node_SwitchString_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG, K2Node_DynamicCast_AsFort_Player_Mannequin) == 0x000048, "Member 'BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG::K2Node_DynamicCast_AsFort_Player_Mannequin' has a wrong offset!");
static_assert(offsetof(BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG, CallFunc_BreakVector_X) == 0x000054, "Member 'BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG, CallFunc_BreakVector_Y) == 0x000058, "Member 'BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG, CallFunc_BreakVector_Z) == 0x00005C, "Member 'BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG, CallFunc_Lerp_ReturnValue_1) == 0x000060, "Member 'BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG, CallFunc_MakeVector_ReturnValue) == 0x000064, "Member 'BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000070, "Member 'BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG, K2Node_DynamicCast_AsFort_Player_Mannequin_1) == 0x000100, "Member 'BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG::K2Node_DynamicCast_AsFort_Player_Mannequin_1' has a wrong offset!");
static_assert(offsetof(BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG, K2Node_DynamicCast_bSuccess_1) == 0x000108, "Member 'BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG, CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult) == 0x00010C, "Member 'BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG::CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG, CallFunc_GetAllActorsOfClass_OutActors) == 0x000198, "Member 'BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG, CallFunc_Array_Get_Item) == 0x0001A8, "Member 'BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG, K2Node_CreateDelegate_OutputDelegate) == 0x0001B0, "Member 'BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0001C0, "Member 'BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG, CallFunc_Array_Length_ReturnValue) == 0x0001C8, "Member 'BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG, CallFunc_Greater_IntInt_ReturnValue) == 0x0001CC, "Member 'BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG, CallFunc_IsValid_ReturnValue_1) == 0x0001CD, "Member 'BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x0001D0, "Member 'BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG, CallFunc_Lerp_ReturnValue_2) == 0x0001D8, "Member 'BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG::CallFunc_Lerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG, CallFunc_MakeRotator_ReturnValue) == 0x0001DC, "Member 'BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x0001E8, "Member 'BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG, K2Node_SwitchString_CmpSuccess_1) == 0x000274, "Member 'BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG::K2Node_SwitchString_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG, CallFunc_IsValid_ReturnValue_2) == 0x000275, "Member 'BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG, CallFunc_IsValid_ReturnValue_3) == 0x000276, "Member 'BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG, CallFunc_GetAllActorsWithTag_OutActors) == 0x000278, "Member 'BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG::CallFunc_GetAllActorsWithTag_OutActors' has a wrong offset!");
static_assert(offsetof(BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG, CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult_1) == 0x000288, "Member 'BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG::CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG, CallFunc_Array_Get_Item_1) == 0x000318, "Member 'BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG, CallFunc_Array_Length_ReturnValue_1) == 0x000320, "Member 'BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000324, "Member 'BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG, CallFunc_IsValid_ReturnValue_4) == 0x000325, "Member 'BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG, CallFunc_IsValid_ReturnValue_5) == 0x000326, "Member 'BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG, K2Node_SwitchString_CmpSuccess_2) == 0x000327, "Member 'BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG::K2Node_SwitchString_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG, K2Node_DynamicCast_AsSkeletal_Mesh_Actor) == 0x000328, "Member 'BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG::K2Node_DynamicCast_AsSkeletal_Mesh_Actor' has a wrong offset!");
static_assert(offsetof(BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG, K2Node_DynamicCast_bSuccess_2) == 0x000330, "Member 'BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG, CallFunc_IsValid_ReturnValue_6) == 0x000331, "Member 'BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG, CallFunc_IsValid_ReturnValue_7) == 0x000332, "Member 'BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG, CallFunc_GetHasDonutShopSequenceBeenSeen_ReturnValue) == 0x000333, "Member 'BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG::CallFunc_GetHasDonutShopSequenceBeenSeen_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG, CallFunc_Not_PreBool_ReturnValue) == 0x000334, "Member 'BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG, CallFunc_IsValid_ReturnValue_8) == 0x000335, "Member 'BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG, CallFunc_CreateDynamicMaterialInstance_ReturnValue_2) == 0x000338, "Member 'BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG::CallFunc_CreateDynamicMaterialInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG, CallFunc_IsValid_ReturnValue_9) == 0x000340, "Member 'BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG, CallFunc_IsValid_ReturnValue_10) == 0x000341, "Member 'BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG::CallFunc_IsValid_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG, CallFunc_IsValid_ReturnValue_11) == 0x000342, "Member 'BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG::CallFunc_IsValid_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG, CallFunc_IsValid_ReturnValue_12) == 0x000343, "Member 'BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG::CallFunc_IsValid_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG, CallFunc_GetHasDonutShopSequenceBeenSeen_ReturnValue_1) == 0x000344, "Member 'BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG::CallFunc_GetHasDonutShopSequenceBeenSeen_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG, CallFunc_Not_PreBool_ReturnValue_1) == 0x000345, "Member 'BP_Frontend_ShopBG_C_ExecuteUbergraph_BP_Frontend_ShopBG::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");

}

