#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Frontend_IntertiveCatToy

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "BP_Frontend_EventLevel_NavObject_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Frontend_IntertiveCatToy.BP_Frontend_IntertiveCatToy_C
// 0x00F8 (0x05C8 - 0x04D0)
class ABP_Frontend_IntertiveCatToy_C final : public ABP_Frontend_EventLevel_NavObject_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Frontend_IntertiveCatToy_C;      // 0x04D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Pos3;                                              // 0x04D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Pos4;                                              // 0x04E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Pos2;                                              // 0x04E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Pos1;                                              // 0x04F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CISFixMesh;                                        // 0x04F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0500(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Push3_RockTime_EC0F7F6A4F039D5A2F66DD8AE7477ADD;   // 0x0508(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Push3_MoveTime_EC0F7F6A4F039D5A2F66DD8AE7477ADD;   // 0x050C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Push3__Direction_EC0F7F6A4F039D5A2F66DD8AE7477ADD; // 0x0510(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_511[0x7];                                      // 0x0511(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Push3;                                             // 0x0518(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_3_RockTime_DC597C454D6B05C41C831F80B32AE6A3; // 0x0520(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_3_MoveTime_DC597C454D6B05C41C831F80B32AE6A3; // 0x0524(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_3__Direction_DC597C454D6B05C41C831F80B32AE6A3; // 0x0528(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_529[0x7];                                      // 0x0529(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_3;                                        // 0x0530(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_2_RockTime_DB3E20E44180C7EAF30442BEAE0AE14F; // 0x0538(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_2_MoveTime_DB3E20E44180C7EAF30442BEAE0AE14F; // 0x053C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_2__Direction_DB3E20E44180C7EAF30442BEAE0AE14F; // 0x0540(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_541[0x7];                                      // 0x0541(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_2;                                        // 0x0548(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_RockTime_9CEFB72D44D6ACCE162516BD5BE60B1F; // 0x0550(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_MoveTime_9CEFB72D44D6ACCE162516BD5BE60B1F; // 0x0554(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_9CEFB72D44D6ACCE162516BD5BE60B1F; // 0x0558(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_559[0x7];                                      // 0x0559(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0560(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInteractAllowed;                                 // 0x0568(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_569[0x7];                                      // 0x0569(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               Dart_;                                             // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               DartTrail;                                         // 0x0578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Dart1Source;                                       // 0x0580(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseResetTimer;                                    // 0x058C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_58D[0x3];                                      // 0x058D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Dart2Source;                                       // 0x0590(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Dart3Source;                                       // 0x059C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DartInt;                                           // 0x05A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AC[0x4];                                      // 0x05AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             FinalPushDone;                                     // 0x05B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class USoundBase*                             StingerSound;                                      // 0x05C0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void FinalPushDone__DelegateSignature();
	void ExecuteUbergraph_BP_Frontend_IntertiveCatToy(int32 EntryPoint);
	void HandleObjectSpecialInteraction(const struct FGameplayTag& ActionTag, const struct FGameplayTag& CameraTag);
	void Commit_OnSpecialInteraction();
	void ReceiveBeginPlay();
	void Timeline_3__UpdateFunc();
	void Timeline_3__FinishedFunc();
	void Push3__UpdateFunc();
	void Push3__FinishedFunc();
	void Timeline_2__UpdateFunc();
	void Timeline_2__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();

	bool CanCommitNavigationRequest() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Frontend_IntertiveCatToy_C">();
	}
	static class ABP_Frontend_IntertiveCatToy_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Frontend_IntertiveCatToy_C>();
	}
};
static_assert(alignof(ABP_Frontend_IntertiveCatToy_C) == 0x000008, "Wrong alignment on ABP_Frontend_IntertiveCatToy_C");
static_assert(sizeof(ABP_Frontend_IntertiveCatToy_C) == 0x0005C8, "Wrong size on ABP_Frontend_IntertiveCatToy_C");
static_assert(offsetof(ABP_Frontend_IntertiveCatToy_C, UberGraphFrame_BP_Frontend_IntertiveCatToy_C) == 0x0004D0, "Member 'ABP_Frontend_IntertiveCatToy_C::UberGraphFrame_BP_Frontend_IntertiveCatToy_C' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_IntertiveCatToy_C, Pos3) == 0x0004D8, "Member 'ABP_Frontend_IntertiveCatToy_C::Pos3' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_IntertiveCatToy_C, Pos4) == 0x0004E0, "Member 'ABP_Frontend_IntertiveCatToy_C::Pos4' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_IntertiveCatToy_C, Pos2) == 0x0004E8, "Member 'ABP_Frontend_IntertiveCatToy_C::Pos2' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_IntertiveCatToy_C, Pos1) == 0x0004F0, "Member 'ABP_Frontend_IntertiveCatToy_C::Pos1' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_IntertiveCatToy_C, CISFixMesh) == 0x0004F8, "Member 'ABP_Frontend_IntertiveCatToy_C::CISFixMesh' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_IntertiveCatToy_C, SkeletalMesh) == 0x000500, "Member 'ABP_Frontend_IntertiveCatToy_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_IntertiveCatToy_C, Push3_RockTime_EC0F7F6A4F039D5A2F66DD8AE7477ADD) == 0x000508, "Member 'ABP_Frontend_IntertiveCatToy_C::Push3_RockTime_EC0F7F6A4F039D5A2F66DD8AE7477ADD' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_IntertiveCatToy_C, Push3_MoveTime_EC0F7F6A4F039D5A2F66DD8AE7477ADD) == 0x00050C, "Member 'ABP_Frontend_IntertiveCatToy_C::Push3_MoveTime_EC0F7F6A4F039D5A2F66DD8AE7477ADD' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_IntertiveCatToy_C, Push3__Direction_EC0F7F6A4F039D5A2F66DD8AE7477ADD) == 0x000510, "Member 'ABP_Frontend_IntertiveCatToy_C::Push3__Direction_EC0F7F6A4F039D5A2F66DD8AE7477ADD' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_IntertiveCatToy_C, Push3) == 0x000518, "Member 'ABP_Frontend_IntertiveCatToy_C::Push3' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_IntertiveCatToy_C, Timeline_3_RockTime_DC597C454D6B05C41C831F80B32AE6A3) == 0x000520, "Member 'ABP_Frontend_IntertiveCatToy_C::Timeline_3_RockTime_DC597C454D6B05C41C831F80B32AE6A3' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_IntertiveCatToy_C, Timeline_3_MoveTime_DC597C454D6B05C41C831F80B32AE6A3) == 0x000524, "Member 'ABP_Frontend_IntertiveCatToy_C::Timeline_3_MoveTime_DC597C454D6B05C41C831F80B32AE6A3' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_IntertiveCatToy_C, Timeline_3__Direction_DC597C454D6B05C41C831F80B32AE6A3) == 0x000528, "Member 'ABP_Frontend_IntertiveCatToy_C::Timeline_3__Direction_DC597C454D6B05C41C831F80B32AE6A3' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_IntertiveCatToy_C, Timeline_3) == 0x000530, "Member 'ABP_Frontend_IntertiveCatToy_C::Timeline_3' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_IntertiveCatToy_C, Timeline_2_RockTime_DB3E20E44180C7EAF30442BEAE0AE14F) == 0x000538, "Member 'ABP_Frontend_IntertiveCatToy_C::Timeline_2_RockTime_DB3E20E44180C7EAF30442BEAE0AE14F' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_IntertiveCatToy_C, Timeline_2_MoveTime_DB3E20E44180C7EAF30442BEAE0AE14F) == 0x00053C, "Member 'ABP_Frontend_IntertiveCatToy_C::Timeline_2_MoveTime_DB3E20E44180C7EAF30442BEAE0AE14F' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_IntertiveCatToy_C, Timeline_2__Direction_DB3E20E44180C7EAF30442BEAE0AE14F) == 0x000540, "Member 'ABP_Frontend_IntertiveCatToy_C::Timeline_2__Direction_DB3E20E44180C7EAF30442BEAE0AE14F' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_IntertiveCatToy_C, Timeline_2) == 0x000548, "Member 'ABP_Frontend_IntertiveCatToy_C::Timeline_2' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_IntertiveCatToy_C, Timeline_0_RockTime_9CEFB72D44D6ACCE162516BD5BE60B1F) == 0x000550, "Member 'ABP_Frontend_IntertiveCatToy_C::Timeline_0_RockTime_9CEFB72D44D6ACCE162516BD5BE60B1F' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_IntertiveCatToy_C, Timeline_0_MoveTime_9CEFB72D44D6ACCE162516BD5BE60B1F) == 0x000554, "Member 'ABP_Frontend_IntertiveCatToy_C::Timeline_0_MoveTime_9CEFB72D44D6ACCE162516BD5BE60B1F' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_IntertiveCatToy_C, Timeline_0__Direction_9CEFB72D44D6ACCE162516BD5BE60B1F) == 0x000558, "Member 'ABP_Frontend_IntertiveCatToy_C::Timeline_0__Direction_9CEFB72D44D6ACCE162516BD5BE60B1F' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_IntertiveCatToy_C, Timeline_0) == 0x000560, "Member 'ABP_Frontend_IntertiveCatToy_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_IntertiveCatToy_C, IsInteractAllowed) == 0x000568, "Member 'ABP_Frontend_IntertiveCatToy_C::IsInteractAllowed' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_IntertiveCatToy_C, Dart_) == 0x000570, "Member 'ABP_Frontend_IntertiveCatToy_C::Dart_' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_IntertiveCatToy_C, DartTrail) == 0x000578, "Member 'ABP_Frontend_IntertiveCatToy_C::DartTrail' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_IntertiveCatToy_C, Dart1Source) == 0x000580, "Member 'ABP_Frontend_IntertiveCatToy_C::Dart1Source' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_IntertiveCatToy_C, bUseResetTimer) == 0x00058C, "Member 'ABP_Frontend_IntertiveCatToy_C::bUseResetTimer' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_IntertiveCatToy_C, Dart2Source) == 0x000590, "Member 'ABP_Frontend_IntertiveCatToy_C::Dart2Source' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_IntertiveCatToy_C, Dart3Source) == 0x00059C, "Member 'ABP_Frontend_IntertiveCatToy_C::Dart3Source' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_IntertiveCatToy_C, DartInt) == 0x0005A8, "Member 'ABP_Frontend_IntertiveCatToy_C::DartInt' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_IntertiveCatToy_C, FinalPushDone) == 0x0005B0, "Member 'ABP_Frontend_IntertiveCatToy_C::FinalPushDone' has a wrong offset!");
static_assert(offsetof(ABP_Frontend_IntertiveCatToy_C, StingerSound) == 0x0005C0, "Member 'ABP_Frontend_IntertiveCatToy_C::StingerSound' has a wrong offset!");

}

