#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RoundSplineMesh_LightChannel2

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_RoundSplineMesh_LightChannel2.BP_RoundSplineMesh_LightChannel2_C.UserConstructionScript
// 0x00E0 (0x00E0 - 0x0000)
struct BP_RoundSplineMesh_LightChannel2_C_UserConstructionScript final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Temp_struct_Variable;                              // 0x0010(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USplineMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_1;          // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue_1;            // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue;           // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue_1;         // 0x00AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x00C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x00D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RoundSplineMesh_LightChannel2_C_UserConstructionScript) == 0x000010, "Wrong alignment on BP_RoundSplineMesh_LightChannel2_C_UserConstructionScript");
static_assert(sizeof(BP_RoundSplineMesh_LightChannel2_C_UserConstructionScript) == 0x0000E0, "Wrong size on BP_RoundSplineMesh_LightChannel2_C_UserConstructionScript");
static_assert(offsetof(BP_RoundSplineMesh_LightChannel2_C_UserConstructionScript, Temp_int_Variable) == 0x000000, "Member 'BP_RoundSplineMesh_LightChannel2_C_UserConstructionScript::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_RoundSplineMesh_LightChannel2_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'BP_RoundSplineMesh_LightChannel2_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoundSplineMesh_LightChannel2_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_RoundSplineMesh_LightChannel2_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoundSplineMesh_LightChannel2_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue_1) == 0x00000C, "Member 'BP_RoundSplineMesh_LightChannel2_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RoundSplineMesh_LightChannel2_C_UserConstructionScript, Temp_struct_Variable) == 0x000010, "Member 'BP_RoundSplineMesh_LightChannel2_C_UserConstructionScript::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_RoundSplineMesh_LightChannel2_C_UserConstructionScript, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000040, "Member 'BP_RoundSplineMesh_LightChannel2_C_UserConstructionScript::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoundSplineMesh_LightChannel2_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue) == 0x000048, "Member 'BP_RoundSplineMesh_LightChannel2_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoundSplineMesh_LightChannel2_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x000050, "Member 'BP_RoundSplineMesh_LightChannel2_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoundSplineMesh_LightChannel2_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x000054, "Member 'BP_RoundSplineMesh_LightChannel2_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoundSplineMesh_LightChannel2_C_UserConstructionScript, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000060, "Member 'BP_RoundSplineMesh_LightChannel2_C_UserConstructionScript::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RoundSplineMesh_LightChannel2_C_UserConstructionScript, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000064, "Member 'BP_RoundSplineMesh_LightChannel2_C_UserConstructionScript::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoundSplineMesh_LightChannel2_C_UserConstructionScript, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000068, "Member 'BP_RoundSplineMesh_LightChannel2_C_UserConstructionScript::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoundSplineMesh_LightChannel2_C_UserConstructionScript, CallFunc_Multiply_IntFloat_ReturnValue) == 0x00006C, "Member 'BP_RoundSplineMesh_LightChannel2_C_UserConstructionScript::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoundSplineMesh_LightChannel2_C_UserConstructionScript, CallFunc_Multiply_IntFloat_ReturnValue_1) == 0x000070, "Member 'BP_RoundSplineMesh_LightChannel2_C_UserConstructionScript::CallFunc_Multiply_IntFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RoundSplineMesh_LightChannel2_C_UserConstructionScript, CallFunc_RotateAngleAxis_ReturnValue) == 0x000074, "Member 'BP_RoundSplineMesh_LightChannel2_C_UserConstructionScript::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoundSplineMesh_LightChannel2_C_UserConstructionScript, CallFunc_RotateAngleAxis_ReturnValue_1) == 0x000080, "Member 'BP_RoundSplineMesh_LightChannel2_C_UserConstructionScript::CallFunc_RotateAngleAxis_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RoundSplineMesh_LightChannel2_C_UserConstructionScript, CallFunc_Cross_VectorVector_ReturnValue) == 0x00008C, "Member 'BP_RoundSplineMesh_LightChannel2_C_UserConstructionScript::CallFunc_Cross_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoundSplineMesh_LightChannel2_C_UserConstructionScript, CallFunc_Vector_Distance_ReturnValue) == 0x000098, "Member 'BP_RoundSplineMesh_LightChannel2_C_UserConstructionScript::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoundSplineMesh_LightChannel2_C_UserConstructionScript, CallFunc_Normal_ReturnValue) == 0x00009C, "Member 'BP_RoundSplineMesh_LightChannel2_C_UserConstructionScript::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoundSplineMesh_LightChannel2_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000A8, "Member 'BP_RoundSplineMesh_LightChannel2_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoundSplineMesh_LightChannel2_C_UserConstructionScript, CallFunc_Cross_VectorVector_ReturnValue_1) == 0x0000AC, "Member 'BP_RoundSplineMesh_LightChannel2_C_UserConstructionScript::CallFunc_Cross_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RoundSplineMesh_LightChannel2_C_UserConstructionScript, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000B8, "Member 'BP_RoundSplineMesh_LightChannel2_C_UserConstructionScript::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoundSplineMesh_LightChannel2_C_UserConstructionScript, CallFunc_Normal_ReturnValue_1) == 0x0000C4, "Member 'BP_RoundSplineMesh_LightChannel2_C_UserConstructionScript::CallFunc_Normal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RoundSplineMesh_LightChannel2_C_UserConstructionScript, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x0000D0, "Member 'BP_RoundSplineMesh_LightChannel2_C_UserConstructionScript::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");

}

