#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Soldier_Minigun

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Soldier_Minigun.BP_Soldier_Minigun_C.ExecuteUbergraph_BP_Soldier_Minigun
// 0x0058 (0x0058 - 0x0000)
struct BP_Soldier_Minigun_C_ExecuteUbergraph_BP_Soldier_Minigun final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_Ranged_Generic_C*                    K2Node_DynamicCast_AsB_Ranged_Generic;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetChargeTime_ReturnValue;                // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsChargingWeapon_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTimeSeconds_ReturnValue;               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeSeconds_ReturnValue_1;             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Soldier_Minigun_C_ExecuteUbergraph_BP_Soldier_Minigun) == 0x000008, "Wrong alignment on BP_Soldier_Minigun_C_ExecuteUbergraph_BP_Soldier_Minigun");
static_assert(sizeof(BP_Soldier_Minigun_C_ExecuteUbergraph_BP_Soldier_Minigun) == 0x000058, "Wrong size on BP_Soldier_Minigun_C_ExecuteUbergraph_BP_Soldier_Minigun");
static_assert(offsetof(BP_Soldier_Minigun_C_ExecuteUbergraph_BP_Soldier_Minigun, EntryPoint) == 0x000000, "Member 'BP_Soldier_Minigun_C_ExecuteUbergraph_BP_Soldier_Minigun::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Soldier_Minigun_C_ExecuteUbergraph_BP_Soldier_Minigun, CallFunc_MakeRotator_ReturnValue) == 0x000004, "Member 'BP_Soldier_Minigun_C_ExecuteUbergraph_BP_Soldier_Minigun::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Soldier_Minigun_C_ExecuteUbergraph_BP_Soldier_Minigun, K2Node_Event_DeltaTimeX) == 0x000010, "Member 'BP_Soldier_Minigun_C_ExecuteUbergraph_BP_Soldier_Minigun::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(BP_Soldier_Minigun_C_ExecuteUbergraph_BP_Soldier_Minigun, CallFunc_GetOwningActor_ReturnValue) == 0x000018, "Member 'BP_Soldier_Minigun_C_ExecuteUbergraph_BP_Soldier_Minigun::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Soldier_Minigun_C_ExecuteUbergraph_BP_Soldier_Minigun, K2Node_DynamicCast_AsB_Ranged_Generic) == 0x000020, "Member 'BP_Soldier_Minigun_C_ExecuteUbergraph_BP_Soldier_Minigun::K2Node_DynamicCast_AsB_Ranged_Generic' has a wrong offset!");
static_assert(offsetof(BP_Soldier_Minigun_C_ExecuteUbergraph_BP_Soldier_Minigun, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_Soldier_Minigun_C_ExecuteUbergraph_BP_Soldier_Minigun::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Soldier_Minigun_C_ExecuteUbergraph_BP_Soldier_Minigun, CallFunc_GetChargeTime_ReturnValue) == 0x00002C, "Member 'BP_Soldier_Minigun_C_ExecuteUbergraph_BP_Soldier_Minigun::CallFunc_GetChargeTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Soldier_Minigun_C_ExecuteUbergraph_BP_Soldier_Minigun, CallFunc_GetIsChargingWeapon_ReturnValue) == 0x000030, "Member 'BP_Soldier_Minigun_C_ExecuteUbergraph_BP_Soldier_Minigun::CallFunc_GetIsChargingWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Soldier_Minigun_C_ExecuteUbergraph_BP_Soldier_Minigun, CallFunc_GetTimeSeconds_ReturnValue) == 0x000034, "Member 'BP_Soldier_Minigun_C_ExecuteUbergraph_BP_Soldier_Minigun::CallFunc_GetTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Soldier_Minigun_C_ExecuteUbergraph_BP_Soldier_Minigun, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000038, "Member 'BP_Soldier_Minigun_C_ExecuteUbergraph_BP_Soldier_Minigun::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Soldier_Minigun_C_ExecuteUbergraph_BP_Soldier_Minigun, CallFunc_GetTimeSeconds_ReturnValue_1) == 0x00003C, "Member 'BP_Soldier_Minigun_C_ExecuteUbergraph_BP_Soldier_Minigun::CallFunc_GetTimeSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Soldier_Minigun_C_ExecuteUbergraph_BP_Soldier_Minigun, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000040, "Member 'BP_Soldier_Minigun_C_ExecuteUbergraph_BP_Soldier_Minigun::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Soldier_Minigun_C_ExecuteUbergraph_BP_Soldier_Minigun, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000044, "Member 'BP_Soldier_Minigun_C_ExecuteUbergraph_BP_Soldier_Minigun::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Soldier_Minigun_C_ExecuteUbergraph_BP_Soldier_Minigun, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000048, "Member 'BP_Soldier_Minigun_C_ExecuteUbergraph_BP_Soldier_Minigun::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Soldier_Minigun_C_ExecuteUbergraph_BP_Soldier_Minigun, CallFunc_Add_FloatFloat_ReturnValue) == 0x00004C, "Member 'BP_Soldier_Minigun_C_ExecuteUbergraph_BP_Soldier_Minigun::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Soldier_Minigun_C_ExecuteUbergraph_BP_Soldier_Minigun, CallFunc_FInterpTo_ReturnValue) == 0x000050, "Member 'BP_Soldier_Minigun_C_ExecuteUbergraph_BP_Soldier_Minigun::CallFunc_FInterpTo_ReturnValue' has a wrong offset!");

// Function BP_Soldier_Minigun.BP_Soldier_Minigun_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct BP_Soldier_Minigun_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Soldier_Minigun_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on BP_Soldier_Minigun_C_BlueprintUpdateAnimation");
static_assert(sizeof(BP_Soldier_Minigun_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on BP_Soldier_Minigun_C_BlueprintUpdateAnimation");
static_assert(offsetof(BP_Soldier_Minigun_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'BP_Soldier_Minigun_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function BP_Soldier_Minigun.BP_Soldier_Minigun_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct BP_Soldier_Minigun_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(BP_Soldier_Minigun_C_AnimGraph) == 0x000008, "Wrong alignment on BP_Soldier_Minigun_C_AnimGraph");
static_assert(sizeof(BP_Soldier_Minigun_C_AnimGraph) == 0x000010, "Wrong size on BP_Soldier_Minigun_C_AnimGraph");
static_assert(offsetof(BP_Soldier_Minigun_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'BP_Soldier_Minigun_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

