#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SplineSheerMesh

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_SplineSheerMesh.BP_SplineSheerMesh_C.UserConstructionScript
// 0x004C (0x004C - 0x0000)
struct BP_SplineSheerMesh_C_UserConstructionScript final
{
public:
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SplineSheerMesh_C_UserConstructionScript) == 0x000004, "Wrong alignment on BP_SplineSheerMesh_C_UserConstructionScript");
static_assert(sizeof(BP_SplineSheerMesh_C_UserConstructionScript) == 0x00004C, "Wrong size on BP_SplineSheerMesh_C_UserConstructionScript");
static_assert(offsetof(BP_SplineSheerMesh_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x000000, "Member 'BP_SplineSheerMesh_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineSheerMesh_C_UserConstructionScript, CallFunc_MakeVector2D_ReturnValue) == 0x00000C, "Member 'BP_SplineSheerMesh_C_UserConstructionScript::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineSheerMesh_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue_1) == 0x000014, "Member 'BP_SplineSheerMesh_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SplineSheerMesh_C_UserConstructionScript, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000020, "Member 'BP_SplineSheerMesh_C_UserConstructionScript::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineSheerMesh_C_UserConstructionScript, CallFunc_VSize_ReturnValue) == 0x00002C, "Member 'BP_SplineSheerMesh_C_UserConstructionScript::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineSheerMesh_C_UserConstructionScript, CallFunc_Normal_ReturnValue) == 0x000030, "Member 'BP_SplineSheerMesh_C_UserConstructionScript::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineSheerMesh_C_UserConstructionScript, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x00003C, "Member 'BP_SplineSheerMesh_C_UserConstructionScript::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineSheerMesh_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'BP_SplineSheerMesh_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SplineSheerMesh_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x000049, "Member 'BP_SplineSheerMesh_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

}

