#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Spybase_Q_Room_Preview

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Spybase_Q_Room_Preview.BP_Spybase_Q_Room_Preview_C
// 0x0088 (0x02A0 - 0x0218)
class ABP_Spybase_Q_Room_Preview_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0218(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_03F56DBA49B07A13BB985B9A204F0C97; // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Gunfire_Timeline__Direction_3C529FB04D9FB4235565208E51286CFA; // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Gunfire_Timeline;                                  // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Explosions_Timeline__Direction_9620817D4BBB98B288BFF3BBF0AFB5A5; // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Explosions_Timeline;                               // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EffectIndex;                                       // 0x0258(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALevelSequenceActor*                    PeelyAnimGliderLoop;                               // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPlaying;                                         // 0x0268(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_269[0x3];                                      // 0x0269(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxValue;                                          // 0x026C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             HomeTransform;                                     // 0x0270(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_Spybase_Q_Room_Preview(int32 EntryPoint);
	void Spawn_Peely();
	void Spawn_Klaxon();
	void Spawn_Explosions();
	void Spawn_Electric_Arcs();
	void Spawn_GunFire();
	void SpawnRandomEffect();
	void Spawn_Shield_Effect();
	void ReceiveBeginPlay();
	void Timeline_0__NewTrack_0__EventFunc();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void Gunfire_Timeline__NewTrack_0__EventFunc();
	void Gunfire_Timeline__UpdateFunc();
	void Gunfire_Timeline__FinishedFunc();
	void Explosions_Timeline__NewTrack_0__EventFunc();
	void Explosions_Timeline__UpdateFunc();
	void Explosions_Timeline__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Spybase_Q_Room_Preview_C">();
	}
	static class ABP_Spybase_Q_Room_Preview_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Spybase_Q_Room_Preview_C>();
	}
};
static_assert(alignof(ABP_Spybase_Q_Room_Preview_C) == 0x000010, "Wrong alignment on ABP_Spybase_Q_Room_Preview_C");
static_assert(sizeof(ABP_Spybase_Q_Room_Preview_C) == 0x0002A0, "Wrong size on ABP_Spybase_Q_Room_Preview_C");
static_assert(offsetof(ABP_Spybase_Q_Room_Preview_C, UberGraphFrame) == 0x000218, "Member 'ABP_Spybase_Q_Room_Preview_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Spybase_Q_Room_Preview_C, DefaultSceneRoot) == 0x000220, "Member 'ABP_Spybase_Q_Room_Preview_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Spybase_Q_Room_Preview_C, Timeline_0__Direction_03F56DBA49B07A13BB985B9A204F0C97) == 0x000228, "Member 'ABP_Spybase_Q_Room_Preview_C::Timeline_0__Direction_03F56DBA49B07A13BB985B9A204F0C97' has a wrong offset!");
static_assert(offsetof(ABP_Spybase_Q_Room_Preview_C, Timeline_0) == 0x000230, "Member 'ABP_Spybase_Q_Room_Preview_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ABP_Spybase_Q_Room_Preview_C, Gunfire_Timeline__Direction_3C529FB04D9FB4235565208E51286CFA) == 0x000238, "Member 'ABP_Spybase_Q_Room_Preview_C::Gunfire_Timeline__Direction_3C529FB04D9FB4235565208E51286CFA' has a wrong offset!");
static_assert(offsetof(ABP_Spybase_Q_Room_Preview_C, Gunfire_Timeline) == 0x000240, "Member 'ABP_Spybase_Q_Room_Preview_C::Gunfire_Timeline' has a wrong offset!");
static_assert(offsetof(ABP_Spybase_Q_Room_Preview_C, Explosions_Timeline__Direction_9620817D4BBB98B288BFF3BBF0AFB5A5) == 0x000248, "Member 'ABP_Spybase_Q_Room_Preview_C::Explosions_Timeline__Direction_9620817D4BBB98B288BFF3BBF0AFB5A5' has a wrong offset!");
static_assert(offsetof(ABP_Spybase_Q_Room_Preview_C, Explosions_Timeline) == 0x000250, "Member 'ABP_Spybase_Q_Room_Preview_C::Explosions_Timeline' has a wrong offset!");
static_assert(offsetof(ABP_Spybase_Q_Room_Preview_C, EffectIndex) == 0x000258, "Member 'ABP_Spybase_Q_Room_Preview_C::EffectIndex' has a wrong offset!");
static_assert(offsetof(ABP_Spybase_Q_Room_Preview_C, PeelyAnimGliderLoop) == 0x000260, "Member 'ABP_Spybase_Q_Room_Preview_C::PeelyAnimGliderLoop' has a wrong offset!");
static_assert(offsetof(ABP_Spybase_Q_Room_Preview_C, IsPlaying) == 0x000268, "Member 'ABP_Spybase_Q_Room_Preview_C::IsPlaying' has a wrong offset!");
static_assert(offsetof(ABP_Spybase_Q_Room_Preview_C, MaxValue) == 0x00026C, "Member 'ABP_Spybase_Q_Room_Preview_C::MaxValue' has a wrong offset!");
static_assert(offsetof(ABP_Spybase_Q_Room_Preview_C, HomeTransform) == 0x000270, "Member 'ABP_Spybase_Q_Room_Preview_C::HomeTransform' has a wrong offset!");

}

