#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPS12_AboutModal_Entry

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function BPS12_AboutModal_Entry.BPS12_AboutModal_Entry_C.ExecuteUbergraph_BPS12_AboutModal_Entry
// 0x00B8 (0x00B8 - 0x0000)
struct BPS12_AboutModal_Entry_C_ExecuteUbergraph_BPS12_AboutModal_Entry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x002C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0040(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0068(0x0028)()
	struct FSlateColor                            K2Node_Select_Default_1;                           // 0x0090(0x0028)()
};
static_assert(alignof(BPS12_AboutModal_Entry_C_ExecuteUbergraph_BPS12_AboutModal_Entry) == 0x000008, "Wrong alignment on BPS12_AboutModal_Entry_C_ExecuteUbergraph_BPS12_AboutModal_Entry");
static_assert(sizeof(BPS12_AboutModal_Entry_C_ExecuteUbergraph_BPS12_AboutModal_Entry) == 0x0000B8, "Wrong size on BPS12_AboutModal_Entry_C_ExecuteUbergraph_BPS12_AboutModal_Entry");
static_assert(offsetof(BPS12_AboutModal_Entry_C_ExecuteUbergraph_BPS12_AboutModal_Entry, EntryPoint) == 0x000000, "Member 'BPS12_AboutModal_Entry_C_ExecuteUbergraph_BPS12_AboutModal_Entry::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPS12_AboutModal_Entry_C_ExecuteUbergraph_BPS12_AboutModal_Entry, Temp_bool_Variable) == 0x000004, "Member 'BPS12_AboutModal_Entry_C_ExecuteUbergraph_BPS12_AboutModal_Entry::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BPS12_AboutModal_Entry_C_ExecuteUbergraph_BPS12_AboutModal_Entry, Temp_bool_Variable_1) == 0x000005, "Member 'BPS12_AboutModal_Entry_C_ExecuteUbergraph_BPS12_AboutModal_Entry::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BPS12_AboutModal_Entry_C_ExecuteUbergraph_BPS12_AboutModal_Entry, Temp_struct_Variable) == 0x000008, "Member 'BPS12_AboutModal_Entry_C_ExecuteUbergraph_BPS12_AboutModal_Entry::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BPS12_AboutModal_Entry_C_ExecuteUbergraph_BPS12_AboutModal_Entry, Temp_struct_Variable_1) == 0x000018, "Member 'BPS12_AboutModal_Entry_C_ExecuteUbergraph_BPS12_AboutModal_Entry::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BPS12_AboutModal_Entry_C_ExecuteUbergraph_BPS12_AboutModal_Entry, K2Node_Event_IsDesignTime) == 0x000028, "Member 'BPS12_AboutModal_Entry_C_ExecuteUbergraph_BPS12_AboutModal_Entry::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BPS12_AboutModal_Entry_C_ExecuteUbergraph_BPS12_AboutModal_Entry, K2Node_Select_Default) == 0x00002C, "Member 'BPS12_AboutModal_Entry_C_ExecuteUbergraph_BPS12_AboutModal_Entry::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BPS12_AboutModal_Entry_C_ExecuteUbergraph_BPS12_AboutModal_Entry, K2Node_MakeStruct_SlateColor) == 0x000040, "Member 'BPS12_AboutModal_Entry_C_ExecuteUbergraph_BPS12_AboutModal_Entry::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(BPS12_AboutModal_Entry_C_ExecuteUbergraph_BPS12_AboutModal_Entry, K2Node_MakeStruct_SlateColor_1) == 0x000068, "Member 'BPS12_AboutModal_Entry_C_ExecuteUbergraph_BPS12_AboutModal_Entry::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(BPS12_AboutModal_Entry_C_ExecuteUbergraph_BPS12_AboutModal_Entry, K2Node_Select_Default_1) == 0x000090, "Member 'BPS12_AboutModal_Entry_C_ExecuteUbergraph_BPS12_AboutModal_Entry::K2Node_Select_Default_1' has a wrong offset!");

// Function BPS12_AboutModal_Entry.BPS12_AboutModal_Entry_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BPS12_AboutModal_Entry_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPS12_AboutModal_Entry_C_PreConstruct) == 0x000001, "Wrong alignment on BPS12_AboutModal_Entry_C_PreConstruct");
static_assert(sizeof(BPS12_AboutModal_Entry_C_PreConstruct) == 0x000001, "Wrong size on BPS12_AboutModal_Entry_C_PreConstruct");
static_assert(offsetof(BPS12_AboutModal_Entry_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BPS12_AboutModal_Entry_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

