#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPS12_AboutModal_Entry

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPS12_AboutModal_Entry.BPS12_AboutModal_Entry_C
// 0x0038 (0x0268 - 0x0230)
class UBPS12_AboutModal_Entry_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonRichTextBlock*                   CommonRichTextBlock_96;                            // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_27;                                          // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x0248(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          GoldnBlack;                                        // 0x0260(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_BPS12_AboutModal_Entry(int32 EntryPoint);
	void Construct();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPS12_AboutModal_Entry_C">();
	}
	static class UBPS12_AboutModal_Entry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPS12_AboutModal_Entry_C>();
	}
};
static_assert(alignof(UBPS12_AboutModal_Entry_C) == 0x000008, "Wrong alignment on UBPS12_AboutModal_Entry_C");
static_assert(sizeof(UBPS12_AboutModal_Entry_C) == 0x000268, "Wrong size on UBPS12_AboutModal_Entry_C");
static_assert(offsetof(UBPS12_AboutModal_Entry_C, UberGraphFrame) == 0x000230, "Member 'UBPS12_AboutModal_Entry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPS12_AboutModal_Entry_C, CommonRichTextBlock_96) == 0x000238, "Member 'UBPS12_AboutModal_Entry_C::CommonRichTextBlock_96' has a wrong offset!");
static_assert(offsetof(UBPS12_AboutModal_Entry_C, Image_27) == 0x000240, "Member 'UBPS12_AboutModal_Entry_C::Image_27' has a wrong offset!");
static_assert(offsetof(UBPS12_AboutModal_Entry_C, Text) == 0x000248, "Member 'UBPS12_AboutModal_Entry_C::Text' has a wrong offset!");
static_assert(offsetof(UBPS12_AboutModal_Entry_C, GoldnBlack) == 0x000260, "Member 'UBPS12_AboutModal_Entry_C::GoldnBlack' has a wrong offset!");

}

