#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPS12_AboutModal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPS12_AboutModal.BPS12_AboutModal_C
// 0x0090 (0x0400 - 0x0370)
class UBPS12_AboutModal_C final : public UAthenaAboutModal
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ShowUp;                                            // 0x0378(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Backing;                                           // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPS12_AboutModal_Entry_C*              BPS12_AboutModal_Entry;                            // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPS12_AboutModal_Entry_C*              BPS12_AboutModal_Entry_1;                          // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPS12_AboutModal_Entry_C*              BPS12_AboutModal_Entry_107;                        // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_69;                                // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_42;                                          // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_73;                                          // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_64;                                       // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_210;                                       // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Title_Blue;                                        // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Title_red;                                         // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Title_white;                                       // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_DescriptionReceiver;                   // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             CloseAbout;                                        // 0x03E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          GoldnBlack;                                        // 0x03F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_3F9[0x3];                                      // 0x03F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Height_Override;                                   // 0x03FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void CloseAbout__DelegateSignature();
	void ExecuteUbergraph_BPS12_AboutModal(int32 EntryPoint);
	void BndEvt__Button_CloseMobile_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void OnSetContent(const class FText& InTitle, const TArray<class FText>& InEntries);
	void Play_Intro_Animation_Sound();
	void Construct();
	void Play_open_anim();
	void BP_OnActivated();
	void BndEvt__Button_Accept_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void PreConstruct(bool IsDesignTime);
	void SetupEntries(TArray<class FText>& InEntries);
	void SetupStyling();
	void SetupContent(const class FText& InTitle, TArray<class FText>& InEntries);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPS12_AboutModal_C">();
	}
	static class UBPS12_AboutModal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPS12_AboutModal_C>();
	}
};
static_assert(alignof(UBPS12_AboutModal_C) == 0x000008, "Wrong alignment on UBPS12_AboutModal_C");
static_assert(sizeof(UBPS12_AboutModal_C) == 0x000400, "Wrong size on UBPS12_AboutModal_C");
static_assert(offsetof(UBPS12_AboutModal_C, UberGraphFrame) == 0x000370, "Member 'UBPS12_AboutModal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPS12_AboutModal_C, ShowUp) == 0x000378, "Member 'UBPS12_AboutModal_C::ShowUp' has a wrong offset!");
static_assert(offsetof(UBPS12_AboutModal_C, Backing) == 0x000380, "Member 'UBPS12_AboutModal_C::Backing' has a wrong offset!");
static_assert(offsetof(UBPS12_AboutModal_C, BPS12_AboutModal_Entry) == 0x000388, "Member 'UBPS12_AboutModal_C::BPS12_AboutModal_Entry' has a wrong offset!");
static_assert(offsetof(UBPS12_AboutModal_C, BPS12_AboutModal_Entry_1) == 0x000390, "Member 'UBPS12_AboutModal_C::BPS12_AboutModal_Entry_1' has a wrong offset!");
static_assert(offsetof(UBPS12_AboutModal_C, BPS12_AboutModal_Entry_107) == 0x000398, "Member 'UBPS12_AboutModal_C::BPS12_AboutModal_Entry_107' has a wrong offset!");
static_assert(offsetof(UBPS12_AboutModal_C, CommonTextBlock_69) == 0x0003A0, "Member 'UBPS12_AboutModal_C::CommonTextBlock_69' has a wrong offset!");
static_assert(offsetof(UBPS12_AboutModal_C, Image_42) == 0x0003A8, "Member 'UBPS12_AboutModal_C::Image_42' has a wrong offset!");
static_assert(offsetof(UBPS12_AboutModal_C, Image_73) == 0x0003B0, "Member 'UBPS12_AboutModal_C::Image_73' has a wrong offset!");
static_assert(offsetof(UBPS12_AboutModal_C, SafeZone_64) == 0x0003B8, "Member 'UBPS12_AboutModal_C::SafeZone_64' has a wrong offset!");
static_assert(offsetof(UBPS12_AboutModal_C, SizeBox_210) == 0x0003C0, "Member 'UBPS12_AboutModal_C::SizeBox_210' has a wrong offset!");
static_assert(offsetof(UBPS12_AboutModal_C, Title_Blue) == 0x0003C8, "Member 'UBPS12_AboutModal_C::Title_Blue' has a wrong offset!");
static_assert(offsetof(UBPS12_AboutModal_C, Title_red) == 0x0003D0, "Member 'UBPS12_AboutModal_C::Title_red' has a wrong offset!");
static_assert(offsetof(UBPS12_AboutModal_C, Title_white) == 0x0003D8, "Member 'UBPS12_AboutModal_C::Title_white' has a wrong offset!");
static_assert(offsetof(UBPS12_AboutModal_C, VerticalBox_DescriptionReceiver) == 0x0003E0, "Member 'UBPS12_AboutModal_C::VerticalBox_DescriptionReceiver' has a wrong offset!");
static_assert(offsetof(UBPS12_AboutModal_C, CloseAbout) == 0x0003E8, "Member 'UBPS12_AboutModal_C::CloseAbout' has a wrong offset!");
static_assert(offsetof(UBPS12_AboutModal_C, GoldnBlack) == 0x0003F8, "Member 'UBPS12_AboutModal_C::GoldnBlack' has a wrong offset!");
static_assert(offsetof(UBPS12_AboutModal_C, Height_Override) == 0x0003FC, "Member 'UBPS12_AboutModal_C::Height_Override' has a wrong offset!");

}

