#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BuildWatermark

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function BuildWatermark.BuildWatermark_C.ExecuteUbergraph_BuildWatermark
// 0x0230 (0x0230 - 0x0000)
struct BuildWatermark_C_ExecuteUbergraph_BuildWatermark final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortTeamMemberInfo                    K2Node_CustomEvent_PlayerInfo;                     // 0x0008(0x0200)(ConstParm, HasGetValueTypeHash)
	TDelegate<void(struct FFortTeamMemberInfo& PlayerInfo)> K2Node_CreateDelegate_OutputDelegate;              // 0x0208(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0218(0x0010)(ZeroConstructor, NoDestructor)
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BuildWatermark_C_ExecuteUbergraph_BuildWatermark) == 0x000008, "Wrong alignment on BuildWatermark_C_ExecuteUbergraph_BuildWatermark");
static_assert(sizeof(BuildWatermark_C_ExecuteUbergraph_BuildWatermark) == 0x000230, "Wrong size on BuildWatermark_C_ExecuteUbergraph_BuildWatermark");
static_assert(offsetof(BuildWatermark_C_ExecuteUbergraph_BuildWatermark, EntryPoint) == 0x000000, "Member 'BuildWatermark_C_ExecuteUbergraph_BuildWatermark::EntryPoint' has a wrong offset!");
static_assert(offsetof(BuildWatermark_C_ExecuteUbergraph_BuildWatermark, K2Node_CustomEvent_PlayerInfo) == 0x000008, "Member 'BuildWatermark_C_ExecuteUbergraph_BuildWatermark::K2Node_CustomEvent_PlayerInfo' has a wrong offset!");
static_assert(offsetof(BuildWatermark_C_ExecuteUbergraph_BuildWatermark, K2Node_CreateDelegate_OutputDelegate) == 0x000208, "Member 'BuildWatermark_C_ExecuteUbergraph_BuildWatermark::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BuildWatermark_C_ExecuteUbergraph_BuildWatermark, K2Node_CreateDelegate_OutputDelegate_1) == 0x000218, "Member 'BuildWatermark_C_ExecuteUbergraph_BuildWatermark::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BuildWatermark_C_ExecuteUbergraph_BuildWatermark, CallFunc_GetContext_ReturnValue) == 0x000228, "Member 'BuildWatermark_C_ExecuteUbergraph_BuildWatermark::CallFunc_GetContext_ReturnValue' has a wrong offset!");

// Function BuildWatermark.BuildWatermark_C.HandlePlayerStateChanged
// 0x0200 (0x0200 - 0x0000)
struct BuildWatermark_C_HandlePlayerStateChanged final
{
public:
	struct FFortTeamMemberInfo                    PlayerInfo;                                        // 0x0000(0x0200)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(BuildWatermark_C_HandlePlayerStateChanged) == 0x000008, "Wrong alignment on BuildWatermark_C_HandlePlayerStateChanged");
static_assert(sizeof(BuildWatermark_C_HandlePlayerStateChanged) == 0x000200, "Wrong size on BuildWatermark_C_HandlePlayerStateChanged");
static_assert(offsetof(BuildWatermark_C_HandlePlayerStateChanged, PlayerInfo) == 0x000000, "Member 'BuildWatermark_C_HandlePlayerStateChanged::PlayerInfo' has a wrong offset!");

// Function BuildWatermark.BuildWatermark_C.Update Watermark
// 0x0030 (0x0030 - 0x0000)
struct BuildWatermark_C_Update_Watermark final
{
public:
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetWatermark_ReturnValue;                 // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue_1;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetAppName_ReturnValue;                   // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BuildWatermark_C_Update_Watermark) == 0x000008, "Wrong alignment on BuildWatermark_C_Update_Watermark");
static_assert(sizeof(BuildWatermark_C_Update_Watermark) == 0x000030, "Wrong size on BuildWatermark_C_Update_Watermark");
static_assert(offsetof(BuildWatermark_C_Update_Watermark, CallFunc_GetContext_ReturnValue) == 0x000000, "Member 'BuildWatermark_C_Update_Watermark::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BuildWatermark_C_Update_Watermark, CallFunc_GetWatermark_ReturnValue) == 0x000008, "Member 'BuildWatermark_C_Update_Watermark::CallFunc_GetWatermark_ReturnValue' has a wrong offset!");
static_assert(offsetof(BuildWatermark_C_Update_Watermark, CallFunc_GetContext_ReturnValue_1) == 0x000018, "Member 'BuildWatermark_C_Update_Watermark::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BuildWatermark_C_Update_Watermark, CallFunc_GetAppName_ReturnValue) == 0x000020, "Member 'BuildWatermark_C_Update_Watermark::CallFunc_GetAppName_ReturnValue' has a wrong offset!");

// Function BuildWatermark.BuildWatermark_C.SetTextCollapseIfDefault
// 0x0048 (0x0048 - 0x0000)
struct BuildWatermark_C_SetTextCollapseIfDefault final
{
public:
	class UTextBlock*                             Text_Widget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 InputText;                                         // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 DefaultText;                                       // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StriStri_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0030(0x0018)()
};
static_assert(alignof(BuildWatermark_C_SetTextCollapseIfDefault) == 0x000008, "Wrong alignment on BuildWatermark_C_SetTextCollapseIfDefault");
static_assert(sizeof(BuildWatermark_C_SetTextCollapseIfDefault) == 0x000048, "Wrong size on BuildWatermark_C_SetTextCollapseIfDefault");
static_assert(offsetof(BuildWatermark_C_SetTextCollapseIfDefault, Text_Widget) == 0x000000, "Member 'BuildWatermark_C_SetTextCollapseIfDefault::Text_Widget' has a wrong offset!");
static_assert(offsetof(BuildWatermark_C_SetTextCollapseIfDefault, InputText) == 0x000008, "Member 'BuildWatermark_C_SetTextCollapseIfDefault::InputText' has a wrong offset!");
static_assert(offsetof(BuildWatermark_C_SetTextCollapseIfDefault, DefaultText) == 0x000018, "Member 'BuildWatermark_C_SetTextCollapseIfDefault::DefaultText' has a wrong offset!");
static_assert(offsetof(BuildWatermark_C_SetTextCollapseIfDefault, CallFunc_EqualEqual_StriStri_ReturnValue) == 0x000028, "Member 'BuildWatermark_C_SetTextCollapseIfDefault::CallFunc_EqualEqual_StriStri_ReturnValue' has a wrong offset!");
static_assert(offsetof(BuildWatermark_C_SetTextCollapseIfDefault, CallFunc_Conv_StringToText_ReturnValue) == 0x000030, "Member 'BuildWatermark_C_SetTextCollapseIfDefault::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function BuildWatermark.BuildWatermark_C.UpdateCalenderOffset
// 0x0040 (0x0040 - 0x0000)
struct BuildWatermark_C_UpdateCalenderOffset final
{
public:
	class UFortMcpContext*                        CallFunc_GetContext_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESubGame                                      CallFunc_GetCurrentSubGame_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetServerOffsetString_OutString;          // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetServerOffsetString_ReturnValue;        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0028(0x0018)()
};
static_assert(alignof(BuildWatermark_C_UpdateCalenderOffset) == 0x000008, "Wrong alignment on BuildWatermark_C_UpdateCalenderOffset");
static_assert(sizeof(BuildWatermark_C_UpdateCalenderOffset) == 0x000040, "Wrong size on BuildWatermark_C_UpdateCalenderOffset");
static_assert(offsetof(BuildWatermark_C_UpdateCalenderOffset, CallFunc_GetContext_ReturnValue) == 0x000000, "Member 'BuildWatermark_C_UpdateCalenderOffset::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(BuildWatermark_C_UpdateCalenderOffset, CallFunc_GetCurrentSubGame_ReturnValue) == 0x000008, "Member 'BuildWatermark_C_UpdateCalenderOffset::CallFunc_GetCurrentSubGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(BuildWatermark_C_UpdateCalenderOffset, CallFunc_GetServerOffsetString_OutString) == 0x000010, "Member 'BuildWatermark_C_UpdateCalenderOffset::CallFunc_GetServerOffsetString_OutString' has a wrong offset!");
static_assert(offsetof(BuildWatermark_C_UpdateCalenderOffset, CallFunc_GetServerOffsetString_ReturnValue) == 0x000020, "Member 'BuildWatermark_C_UpdateCalenderOffset::CallFunc_GetServerOffsetString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BuildWatermark_C_UpdateCalenderOffset, K2Node_SwitchEnum_CmpSuccess) == 0x000021, "Member 'BuildWatermark_C_UpdateCalenderOffset::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BuildWatermark_C_UpdateCalenderOffset, CallFunc_Conv_StringToText_ReturnValue) == 0x000028, "Member 'BuildWatermark_C_UpdateCalenderOffset::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

}

