#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BundleProgressDisplay

#include "Basic.hpp"


namespace SDK::Params
{

// Function BundleProgressDisplay.BundleProgressDisplay_C.ExecuteUbergraph_BundleProgressDisplay
// 0x0014 (0x0014 - 0x0000)
struct BundleProgressDisplay_C_ExecuteUbergraph_BundleProgressDisplay final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MakeLiteralFloat_ReturnValue_1;           // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BundleProgressDisplay_C_ExecuteUbergraph_BundleProgressDisplay) == 0x000004, "Wrong alignment on BundleProgressDisplay_C_ExecuteUbergraph_BundleProgressDisplay");
static_assert(sizeof(BundleProgressDisplay_C_ExecuteUbergraph_BundleProgressDisplay) == 0x000014, "Wrong size on BundleProgressDisplay_C_ExecuteUbergraph_BundleProgressDisplay");
static_assert(offsetof(BundleProgressDisplay_C_ExecuteUbergraph_BundleProgressDisplay, EntryPoint) == 0x000000, "Member 'BundleProgressDisplay_C_ExecuteUbergraph_BundleProgressDisplay::EntryPoint' has a wrong offset!");
static_assert(offsetof(BundleProgressDisplay_C_ExecuteUbergraph_BundleProgressDisplay, CallFunc_MakeLiteralFloat_ReturnValue) == 0x000004, "Member 'BundleProgressDisplay_C_ExecuteUbergraph_BundleProgressDisplay::CallFunc_MakeLiteralFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BundleProgressDisplay_C_ExecuteUbergraph_BundleProgressDisplay, K2Node_Event_IsDesignTime) == 0x000008, "Member 'BundleProgressDisplay_C_ExecuteUbergraph_BundleProgressDisplay::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BundleProgressDisplay_C_ExecuteUbergraph_BundleProgressDisplay, CallFunc_MakeLiteralFloat_ReturnValue_1) == 0x00000C, "Member 'BundleProgressDisplay_C_ExecuteUbergraph_BundleProgressDisplay::CallFunc_MakeLiteralFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BundleProgressDisplay_C_ExecuteUbergraph_BundleProgressDisplay, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000010, "Member 'BundleProgressDisplay_C_ExecuteUbergraph_BundleProgressDisplay::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");

// Function BundleProgressDisplay.BundleProgressDisplay_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BundleProgressDisplay_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BundleProgressDisplay_C_PreConstruct) == 0x000001, "Wrong alignment on BundleProgressDisplay_C_PreConstruct");
static_assert(sizeof(BundleProgressDisplay_C_PreConstruct) == 0x000001, "Wrong size on BundleProgressDisplay_C_PreConstruct");
static_assert(offsetof(BundleProgressDisplay_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BundleProgressDisplay_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

