#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CCPM_Parent_WatchCosmeticStat

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CCPM_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CCPM_Parent_WatchCosmeticStat.CCPM_Parent_WatchCosmeticStat_C
// 0x0050 (0x0408 - 0x03B8)
class ACCPM_Parent_WatchCosmeticStat_C : public ACCPM_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_CCPM_Parent_WatchCosmeticStat_C;    // 0x03B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          Allow_FULL_DEBUG;                                  // 0x03C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C1[0x7];                                      // 0x03C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               Mid;                                               // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	int32                                         Which_Stage_to_Debug;                              // 0x03D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Allow_STAT_DEBUG;                                  // 0x03D4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D5[0x3];                                      // 0x03D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortStatManagerTag                    Stat_01;                                           // 0x03D8(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentActiveStage;                                // 0x03E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E4[0x4];                                      // 0x03E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 StatThresholds;                                    // 0x03E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<int32>                                 PlayerLeft_Threshold;                              // 0x03F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_CCPM_Parent_WatchCosmeticStat(int32 EntryPoint);
	void CosmeticStateChanged(int32 Stat_Value);
	void OnPawnAndPartChanged();
	void TrackPlayersLeft(int32 NumPlayersLeft);
	void ReceiveBeginPlay();
	void ActivatingCosmeticState(int32 StageNumBeingActivated);
	void OnStatChanged_2FF2B90E4ECEA7F5E9202F98FFE39A48(class FName StatName, int32 StatValue);
	void Cosmetic_Stat_Check(int32 Value_to_Check, TArray<int32>& StatThresholds_0, class FName DEBUG_Minus_Stat_Checked);
	void Array_Is_Valid(TArray<class FName>& Name_Array, bool* Vaild);
	void PlayersLeftCheck(int32 Value_to_Check, TArray<int32>& Player_Left_Thresholds, class FName DEBUG_Minus_Stat_Checked);
	void IsStageStatReuirementsMet(int32 InStageNumberBeingTested, int32 InStageThreshold, int32 InStatValue, int32 CurrentActiveStageNumber, bool* PassedRequirements);
	void IsStagePlayerLeftAliveReuirementsMet(int32 InStageNumberBeingTested, int32 InStageThreshold, int32 InStatValue, int32 CurrentActiveStageNumber, bool* PassedRequirements);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CCPM_Parent_WatchCosmeticStat_C">();
	}
	static class ACCPM_Parent_WatchCosmeticStat_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACCPM_Parent_WatchCosmeticStat_C>();
	}
};
static_assert(alignof(ACCPM_Parent_WatchCosmeticStat_C) == 0x000008, "Wrong alignment on ACCPM_Parent_WatchCosmeticStat_C");
static_assert(sizeof(ACCPM_Parent_WatchCosmeticStat_C) == 0x000408, "Wrong size on ACCPM_Parent_WatchCosmeticStat_C");
static_assert(offsetof(ACCPM_Parent_WatchCosmeticStat_C, UberGraphFrame_CCPM_Parent_WatchCosmeticStat_C) == 0x0003B8, "Member 'ACCPM_Parent_WatchCosmeticStat_C::UberGraphFrame_CCPM_Parent_WatchCosmeticStat_C' has a wrong offset!");
static_assert(offsetof(ACCPM_Parent_WatchCosmeticStat_C, Allow_FULL_DEBUG) == 0x0003C0, "Member 'ACCPM_Parent_WatchCosmeticStat_C::Allow_FULL_DEBUG' has a wrong offset!");
static_assert(offsetof(ACCPM_Parent_WatchCosmeticStat_C, Mid) == 0x0003C8, "Member 'ACCPM_Parent_WatchCosmeticStat_C::Mid' has a wrong offset!");
static_assert(offsetof(ACCPM_Parent_WatchCosmeticStat_C, Which_Stage_to_Debug) == 0x0003D0, "Member 'ACCPM_Parent_WatchCosmeticStat_C::Which_Stage_to_Debug' has a wrong offset!");
static_assert(offsetof(ACCPM_Parent_WatchCosmeticStat_C, Allow_STAT_DEBUG) == 0x0003D4, "Member 'ACCPM_Parent_WatchCosmeticStat_C::Allow_STAT_DEBUG' has a wrong offset!");
static_assert(offsetof(ACCPM_Parent_WatchCosmeticStat_C, Stat_01) == 0x0003D8, "Member 'ACCPM_Parent_WatchCosmeticStat_C::Stat_01' has a wrong offset!");
static_assert(offsetof(ACCPM_Parent_WatchCosmeticStat_C, CurrentActiveStage) == 0x0003E0, "Member 'ACCPM_Parent_WatchCosmeticStat_C::CurrentActiveStage' has a wrong offset!");
static_assert(offsetof(ACCPM_Parent_WatchCosmeticStat_C, StatThresholds) == 0x0003E8, "Member 'ACCPM_Parent_WatchCosmeticStat_C::StatThresholds' has a wrong offset!");
static_assert(offsetof(ACCPM_Parent_WatchCosmeticStat_C, PlayerLeft_Threshold) == 0x0003F8, "Member 'ACCPM_Parent_WatchCosmeticStat_C::PlayerLeft_Threshold' has a wrong offset!");

}

