#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CCPM_Parent_WatchCosmeticStat

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function CCPM_Parent_WatchCosmeticStat.CCPM_Parent_WatchCosmeticStat_C.ExecuteUbergraph_CCPM_Parent_WatchCosmeticStat
// 0x0080 (0x0080 - 0x0000)
struct CCPM_Parent_WatchCosmeticStat_C_ExecuteUbergraph_CCPM_Parent_WatchCosmeticStat final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Stat_Value;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_StatName;                       // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_StatValue;                      // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_StageNumBeingActivated;         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NumPlayersLeft;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        CallFunc_GetAssociatedPlayerPawn_ReturnValue;      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName StatName, int32 StatValue)> K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	class UFortAsyncAction_CosmeticAdaptiveStatWatcher* CallFunc_WatchCosmeticStat_ReturnValue;            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAthena_GameState_C*                    K2Node_DynamicCast_AsAthena_Game_State;            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayersLeft                           CallFunc_GetPlayersLeft_ReturnValue;               // 0x005C(0x000C)(NoDestructor)
	bool                                          CallFunc_GreaterEqual_ByteByte_ReturnValue;        // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_ByteByte_ReturnValue_1;      // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B[0x1];                                       // 0x006B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 NumPlayersLeft)>         K2Node_CreateDelegate_OutputDelegate_1;            // 0x006C(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(CCPM_Parent_WatchCosmeticStat_C_ExecuteUbergraph_CCPM_Parent_WatchCosmeticStat) == 0x000008, "Wrong alignment on CCPM_Parent_WatchCosmeticStat_C_ExecuteUbergraph_CCPM_Parent_WatchCosmeticStat");
static_assert(sizeof(CCPM_Parent_WatchCosmeticStat_C_ExecuteUbergraph_CCPM_Parent_WatchCosmeticStat) == 0x000080, "Wrong size on CCPM_Parent_WatchCosmeticStat_C_ExecuteUbergraph_CCPM_Parent_WatchCosmeticStat");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_ExecuteUbergraph_CCPM_Parent_WatchCosmeticStat, EntryPoint) == 0x000000, "Member 'CCPM_Parent_WatchCosmeticStat_C_ExecuteUbergraph_CCPM_Parent_WatchCosmeticStat::EntryPoint' has a wrong offset!");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_ExecuteUbergraph_CCPM_Parent_WatchCosmeticStat, K2Node_CustomEvent_Stat_Value) == 0x000004, "Member 'CCPM_Parent_WatchCosmeticStat_C_ExecuteUbergraph_CCPM_Parent_WatchCosmeticStat::K2Node_CustomEvent_Stat_Value' has a wrong offset!");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_ExecuteUbergraph_CCPM_Parent_WatchCosmeticStat, Temp_int_Variable) == 0x000008, "Member 'CCPM_Parent_WatchCosmeticStat_C_ExecuteUbergraph_CCPM_Parent_WatchCosmeticStat::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_ExecuteUbergraph_CCPM_Parent_WatchCosmeticStat, Temp_name_Variable) == 0x00000C, "Member 'CCPM_Parent_WatchCosmeticStat_C_ExecuteUbergraph_CCPM_Parent_WatchCosmeticStat::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_ExecuteUbergraph_CCPM_Parent_WatchCosmeticStat, K2Node_CustomEvent_StatName) == 0x000014, "Member 'CCPM_Parent_WatchCosmeticStat_C_ExecuteUbergraph_CCPM_Parent_WatchCosmeticStat::K2Node_CustomEvent_StatName' has a wrong offset!");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_ExecuteUbergraph_CCPM_Parent_WatchCosmeticStat, K2Node_CustomEvent_StatValue) == 0x00001C, "Member 'CCPM_Parent_WatchCosmeticStat_C_ExecuteUbergraph_CCPM_Parent_WatchCosmeticStat::K2Node_CustomEvent_StatValue' has a wrong offset!");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_ExecuteUbergraph_CCPM_Parent_WatchCosmeticStat, K2Node_CustomEvent_StageNumBeingActivated) == 0x000020, "Member 'CCPM_Parent_WatchCosmeticStat_C_ExecuteUbergraph_CCPM_Parent_WatchCosmeticStat::K2Node_CustomEvent_StageNumBeingActivated' has a wrong offset!");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_ExecuteUbergraph_CCPM_Parent_WatchCosmeticStat, K2Node_CustomEvent_NumPlayersLeft) == 0x000024, "Member 'CCPM_Parent_WatchCosmeticStat_C_ExecuteUbergraph_CCPM_Parent_WatchCosmeticStat::K2Node_CustomEvent_NumPlayersLeft' has a wrong offset!");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_ExecuteUbergraph_CCPM_Parent_WatchCosmeticStat, CallFunc_GetAssociatedPlayerPawn_ReturnValue) == 0x000028, "Member 'CCPM_Parent_WatchCosmeticStat_C_ExecuteUbergraph_CCPM_Parent_WatchCosmeticStat::CallFunc_GetAssociatedPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_ExecuteUbergraph_CCPM_Parent_WatchCosmeticStat, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'CCPM_Parent_WatchCosmeticStat_C_ExecuteUbergraph_CCPM_Parent_WatchCosmeticStat::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_ExecuteUbergraph_CCPM_Parent_WatchCosmeticStat, CallFunc_WatchCosmeticStat_ReturnValue) == 0x000040, "Member 'CCPM_Parent_WatchCosmeticStat_C_ExecuteUbergraph_CCPM_Parent_WatchCosmeticStat::CallFunc_WatchCosmeticStat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_ExecuteUbergraph_CCPM_Parent_WatchCosmeticStat, CallFunc_GetGameState_ReturnValue) == 0x000048, "Member 'CCPM_Parent_WatchCosmeticStat_C_ExecuteUbergraph_CCPM_Parent_WatchCosmeticStat::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_ExecuteUbergraph_CCPM_Parent_WatchCosmeticStat, K2Node_DynamicCast_AsAthena_Game_State) == 0x000050, "Member 'CCPM_Parent_WatchCosmeticStat_C_ExecuteUbergraph_CCPM_Parent_WatchCosmeticStat::K2Node_DynamicCast_AsAthena_Game_State' has a wrong offset!");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_ExecuteUbergraph_CCPM_Parent_WatchCosmeticStat, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'CCPM_Parent_WatchCosmeticStat_C_ExecuteUbergraph_CCPM_Parent_WatchCosmeticStat::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_ExecuteUbergraph_CCPM_Parent_WatchCosmeticStat, CallFunc_GetPlayersLeft_ReturnValue) == 0x00005C, "Member 'CCPM_Parent_WatchCosmeticStat_C_ExecuteUbergraph_CCPM_Parent_WatchCosmeticStat::CallFunc_GetPlayersLeft_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_ExecuteUbergraph_CCPM_Parent_WatchCosmeticStat, CallFunc_GreaterEqual_ByteByte_ReturnValue) == 0x000068, "Member 'CCPM_Parent_WatchCosmeticStat_C_ExecuteUbergraph_CCPM_Parent_WatchCosmeticStat::CallFunc_GreaterEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_ExecuteUbergraph_CCPM_Parent_WatchCosmeticStat, CallFunc_GreaterEqual_ByteByte_ReturnValue_1) == 0x000069, "Member 'CCPM_Parent_WatchCosmeticStat_C_ExecuteUbergraph_CCPM_Parent_WatchCosmeticStat::CallFunc_GreaterEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_ExecuteUbergraph_CCPM_Parent_WatchCosmeticStat, CallFunc_IsValid_ReturnValue) == 0x00006A, "Member 'CCPM_Parent_WatchCosmeticStat_C_ExecuteUbergraph_CCPM_Parent_WatchCosmeticStat::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_ExecuteUbergraph_CCPM_Parent_WatchCosmeticStat, K2Node_CreateDelegate_OutputDelegate_1) == 0x00006C, "Member 'CCPM_Parent_WatchCosmeticStat_C_ExecuteUbergraph_CCPM_Parent_WatchCosmeticStat::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function CCPM_Parent_WatchCosmeticStat.CCPM_Parent_WatchCosmeticStat_C.CosmeticStateChanged
// 0x0004 (0x0004 - 0x0000)
struct CCPM_Parent_WatchCosmeticStat_C_CosmeticStateChanged final
{
public:
	int32                                         Stat_Value;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CCPM_Parent_WatchCosmeticStat_C_CosmeticStateChanged) == 0x000004, "Wrong alignment on CCPM_Parent_WatchCosmeticStat_C_CosmeticStateChanged");
static_assert(sizeof(CCPM_Parent_WatchCosmeticStat_C_CosmeticStateChanged) == 0x000004, "Wrong size on CCPM_Parent_WatchCosmeticStat_C_CosmeticStateChanged");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_CosmeticStateChanged, Stat_Value) == 0x000000, "Member 'CCPM_Parent_WatchCosmeticStat_C_CosmeticStateChanged::Stat_Value' has a wrong offset!");

// Function CCPM_Parent_WatchCosmeticStat.CCPM_Parent_WatchCosmeticStat_C.TrackPlayersLeft
// 0x0004 (0x0004 - 0x0000)
struct CCPM_Parent_WatchCosmeticStat_C_TrackPlayersLeft final
{
public:
	int32                                         NumPlayersLeft;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CCPM_Parent_WatchCosmeticStat_C_TrackPlayersLeft) == 0x000004, "Wrong alignment on CCPM_Parent_WatchCosmeticStat_C_TrackPlayersLeft");
static_assert(sizeof(CCPM_Parent_WatchCosmeticStat_C_TrackPlayersLeft) == 0x000004, "Wrong size on CCPM_Parent_WatchCosmeticStat_C_TrackPlayersLeft");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_TrackPlayersLeft, NumPlayersLeft) == 0x000000, "Member 'CCPM_Parent_WatchCosmeticStat_C_TrackPlayersLeft::NumPlayersLeft' has a wrong offset!");

// Function CCPM_Parent_WatchCosmeticStat.CCPM_Parent_WatchCosmeticStat_C.ActivatingCosmeticState
// 0x0004 (0x0004 - 0x0000)
struct CCPM_Parent_WatchCosmeticStat_C_ActivatingCosmeticState final
{
public:
	int32                                         StageNumBeingActivated;                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CCPM_Parent_WatchCosmeticStat_C_ActivatingCosmeticState) == 0x000004, "Wrong alignment on CCPM_Parent_WatchCosmeticStat_C_ActivatingCosmeticState");
static_assert(sizeof(CCPM_Parent_WatchCosmeticStat_C_ActivatingCosmeticState) == 0x000004, "Wrong size on CCPM_Parent_WatchCosmeticStat_C_ActivatingCosmeticState");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_ActivatingCosmeticState, StageNumBeingActivated) == 0x000000, "Member 'CCPM_Parent_WatchCosmeticStat_C_ActivatingCosmeticState::StageNumBeingActivated' has a wrong offset!");

// Function CCPM_Parent_WatchCosmeticStat.CCPM_Parent_WatchCosmeticStat_C.OnStatChanged_2FF2B90E4ECEA7F5E9202F98FFE39A48
// 0x000C (0x000C - 0x0000)
struct CCPM_Parent_WatchCosmeticStat_C_OnStatChanged_2FF2B90E4ECEA7F5E9202F98FFE39A48 final
{
public:
	class FName                                   StatName;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StatValue;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CCPM_Parent_WatchCosmeticStat_C_OnStatChanged_2FF2B90E4ECEA7F5E9202F98FFE39A48) == 0x000004, "Wrong alignment on CCPM_Parent_WatchCosmeticStat_C_OnStatChanged_2FF2B90E4ECEA7F5E9202F98FFE39A48");
static_assert(sizeof(CCPM_Parent_WatchCosmeticStat_C_OnStatChanged_2FF2B90E4ECEA7F5E9202F98FFE39A48) == 0x00000C, "Wrong size on CCPM_Parent_WatchCosmeticStat_C_OnStatChanged_2FF2B90E4ECEA7F5E9202F98FFE39A48");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_OnStatChanged_2FF2B90E4ECEA7F5E9202F98FFE39A48, StatName) == 0x000000, "Member 'CCPM_Parent_WatchCosmeticStat_C_OnStatChanged_2FF2B90E4ECEA7F5E9202F98FFE39A48::StatName' has a wrong offset!");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_OnStatChanged_2FF2B90E4ECEA7F5E9202F98FFE39A48, StatValue) == 0x000008, "Member 'CCPM_Parent_WatchCosmeticStat_C_OnStatChanged_2FF2B90E4ECEA7F5E9202F98FFE39A48::StatValue' has a wrong offset!");

// Function CCPM_Parent_WatchCosmeticStat.CCPM_Parent_WatchCosmeticStat_C.Cosmetic Stat Check
// 0x0058 (0x0058 - 0x0000)
struct CCPM_Parent_WatchCosmeticStat_C_Cosmetic_Stat_Check final
{
public:
	int32                                         Value_to_Check;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 StatThresholds_0;                                  // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	class FName                                   DEBUG_Minus_Stat_Checked;                          // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item;                           // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStageStatReuirementsMet_PassedRequirements; // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CCPM_Parent_WatchCosmeticStat_C_Cosmetic_Stat_Check) == 0x000008, "Wrong alignment on CCPM_Parent_WatchCosmeticStat_C_Cosmetic_Stat_Check");
static_assert(sizeof(CCPM_Parent_WatchCosmeticStat_C_Cosmetic_Stat_Check) == 0x000058, "Wrong size on CCPM_Parent_WatchCosmeticStat_C_Cosmetic_Stat_Check");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_Cosmetic_Stat_Check, Value_to_Check) == 0x000000, "Member 'CCPM_Parent_WatchCosmeticStat_C_Cosmetic_Stat_Check::Value_to_Check' has a wrong offset!");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_Cosmetic_Stat_Check, StatThresholds_0) == 0x000008, "Member 'CCPM_Parent_WatchCosmeticStat_C_Cosmetic_Stat_Check::StatThresholds_0' has a wrong offset!");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_Cosmetic_Stat_Check, DEBUG_Minus_Stat_Checked) == 0x000018, "Member 'CCPM_Parent_WatchCosmeticStat_C_Cosmetic_Stat_Check::DEBUG_Minus_Stat_Checked' has a wrong offset!");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_Cosmetic_Stat_Check, Temp_bool_True_if_break_was_hit_Variable) == 0x000020, "Member 'CCPM_Parent_WatchCosmeticStat_C_Cosmetic_Stat_Check::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_Cosmetic_Stat_Check, CallFunc_Not_PreBool_ReturnValue) == 0x000021, "Member 'CCPM_Parent_WatchCosmeticStat_C_Cosmetic_Stat_Check::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_Cosmetic_Stat_Check, Temp_int_Array_Index_Variable) == 0x000024, "Member 'CCPM_Parent_WatchCosmeticStat_C_Cosmetic_Stat_Check::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_Cosmetic_Stat_Check, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'CCPM_Parent_WatchCosmeticStat_C_Cosmetic_Stat_Check::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_Cosmetic_Stat_Check, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'CCPM_Parent_WatchCosmeticStat_C_Cosmetic_Stat_Check::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_Cosmetic_Stat_Check, CallFunc_Array_Get_Item) == 0x000030, "Member 'CCPM_Parent_WatchCosmeticStat_C_Cosmetic_Stat_Check::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_Cosmetic_Stat_Check, CallFunc_Conv_NameToString_ReturnValue) == 0x000038, "Member 'CCPM_Parent_WatchCosmeticStat_C_Cosmetic_Stat_Check::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_Cosmetic_Stat_Check, CallFunc_IsStageStatReuirementsMet_PassedRequirements) == 0x000048, "Member 'CCPM_Parent_WatchCosmeticStat_C_Cosmetic_Stat_Check::CallFunc_IsStageStatReuirementsMet_PassedRequirements' has a wrong offset!");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_Cosmetic_Stat_Check, CallFunc_Array_Length_ReturnValue) == 0x00004C, "Member 'CCPM_Parent_WatchCosmeticStat_C_Cosmetic_Stat_Check::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_Cosmetic_Stat_Check, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'CCPM_Parent_WatchCosmeticStat_C_Cosmetic_Stat_Check::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_Cosmetic_Stat_Check, CallFunc_BooleanAND_ReturnValue) == 0x000051, "Member 'CCPM_Parent_WatchCosmeticStat_C_Cosmetic_Stat_Check::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function CCPM_Parent_WatchCosmeticStat.CCPM_Parent_WatchCosmeticStat_C.Array Is Valid
// 0x0020 (0x0020 - 0x0000)
struct CCPM_Parent_WatchCosmeticStat_C_Array_Is_Valid final
{
public:
	TArray<class FName>                           Name_Array;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	bool                                          Vaild;                                             // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CCPM_Parent_WatchCosmeticStat_C_Array_Is_Valid) == 0x000008, "Wrong alignment on CCPM_Parent_WatchCosmeticStat_C_Array_Is_Valid");
static_assert(sizeof(CCPM_Parent_WatchCosmeticStat_C_Array_Is_Valid) == 0x000020, "Wrong size on CCPM_Parent_WatchCosmeticStat_C_Array_Is_Valid");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_Array_Is_Valid, Name_Array) == 0x000000, "Member 'CCPM_Parent_WatchCosmeticStat_C_Array_Is_Valid::Name_Array' has a wrong offset!");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_Array_Is_Valid, Vaild) == 0x000010, "Member 'CCPM_Parent_WatchCosmeticStat_C_Array_Is_Valid::Vaild' has a wrong offset!");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_Array_Is_Valid, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'CCPM_Parent_WatchCosmeticStat_C_Array_Is_Valid::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_Array_Is_Valid, CallFunc_Greater_IntInt_ReturnValue) == 0x000018, "Member 'CCPM_Parent_WatchCosmeticStat_C_Array_Is_Valid::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function CCPM_Parent_WatchCosmeticStat.CCPM_Parent_WatchCosmeticStat_C.PlayersLeftCheck
// 0x0060 (0x0060 - 0x0000)
struct CCPM_Parent_WatchCosmeticStat_C_PlayersLeftCheck final
{
public:
	int32                                         Value_to_Check;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 Player_Left_Thresholds;                            // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	class FName                                   DEBUG_Minus_Stat_Checked;                          // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item;                           // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStagePlayerLeftAliveReuirementsMet_PassedRequirements; // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CCPM_Parent_WatchCosmeticStat_C_PlayersLeftCheck) == 0x000008, "Wrong alignment on CCPM_Parent_WatchCosmeticStat_C_PlayersLeftCheck");
static_assert(sizeof(CCPM_Parent_WatchCosmeticStat_C_PlayersLeftCheck) == 0x000060, "Wrong size on CCPM_Parent_WatchCosmeticStat_C_PlayersLeftCheck");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_PlayersLeftCheck, Value_to_Check) == 0x000000, "Member 'CCPM_Parent_WatchCosmeticStat_C_PlayersLeftCheck::Value_to_Check' has a wrong offset!");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_PlayersLeftCheck, Player_Left_Thresholds) == 0x000008, "Member 'CCPM_Parent_WatchCosmeticStat_C_PlayersLeftCheck::Player_Left_Thresholds' has a wrong offset!");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_PlayersLeftCheck, DEBUG_Minus_Stat_Checked) == 0x000018, "Member 'CCPM_Parent_WatchCosmeticStat_C_PlayersLeftCheck::DEBUG_Minus_Stat_Checked' has a wrong offset!");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_PlayersLeftCheck, Temp_bool_True_if_break_was_hit_Variable) == 0x000020, "Member 'CCPM_Parent_WatchCosmeticStat_C_PlayersLeftCheck::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_PlayersLeftCheck, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'CCPM_Parent_WatchCosmeticStat_C_PlayersLeftCheck::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_PlayersLeftCheck, CallFunc_Not_PreBool_ReturnValue) == 0x000028, "Member 'CCPM_Parent_WatchCosmeticStat_C_PlayersLeftCheck::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_PlayersLeftCheck, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'CCPM_Parent_WatchCosmeticStat_C_PlayersLeftCheck::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_PlayersLeftCheck, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'CCPM_Parent_WatchCosmeticStat_C_PlayersLeftCheck::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_PlayersLeftCheck, CallFunc_Array_Get_Item) == 0x000034, "Member 'CCPM_Parent_WatchCosmeticStat_C_PlayersLeftCheck::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_PlayersLeftCheck, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'CCPM_Parent_WatchCosmeticStat_C_PlayersLeftCheck::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_PlayersLeftCheck, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'CCPM_Parent_WatchCosmeticStat_C_PlayersLeftCheck::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_PlayersLeftCheck, CallFunc_BooleanAND_ReturnValue) == 0x000040, "Member 'CCPM_Parent_WatchCosmeticStat_C_PlayersLeftCheck::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_PlayersLeftCheck, CallFunc_Conv_NameToString_ReturnValue) == 0x000048, "Member 'CCPM_Parent_WatchCosmeticStat_C_PlayersLeftCheck::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_PlayersLeftCheck, CallFunc_IsStagePlayerLeftAliveReuirementsMet_PassedRequirements) == 0x000058, "Member 'CCPM_Parent_WatchCosmeticStat_C_PlayersLeftCheck::CallFunc_IsStagePlayerLeftAliveReuirementsMet_PassedRequirements' has a wrong offset!");

// Function CCPM_Parent_WatchCosmeticStat.CCPM_Parent_WatchCosmeticStat_C.IsStageStatReuirementsMet
// 0x0018 (0x0018 - 0x0000)
struct CCPM_Parent_WatchCosmeticStat_C_IsStageStatReuirementsMet final
{
public:
	int32                                         InStageNumberBeingTested;                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InStageThreshold;                                  // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InStatValue;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentActiveStageNumber;                          // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PassedRequirements;                                // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CCPM_Parent_WatchCosmeticStat_C_IsStageStatReuirementsMet) == 0x000004, "Wrong alignment on CCPM_Parent_WatchCosmeticStat_C_IsStageStatReuirementsMet");
static_assert(sizeof(CCPM_Parent_WatchCosmeticStat_C_IsStageStatReuirementsMet) == 0x000018, "Wrong size on CCPM_Parent_WatchCosmeticStat_C_IsStageStatReuirementsMet");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_IsStageStatReuirementsMet, InStageNumberBeingTested) == 0x000000, "Member 'CCPM_Parent_WatchCosmeticStat_C_IsStageStatReuirementsMet::InStageNumberBeingTested' has a wrong offset!");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_IsStageStatReuirementsMet, InStageThreshold) == 0x000004, "Member 'CCPM_Parent_WatchCosmeticStat_C_IsStageStatReuirementsMet::InStageThreshold' has a wrong offset!");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_IsStageStatReuirementsMet, InStatValue) == 0x000008, "Member 'CCPM_Parent_WatchCosmeticStat_C_IsStageStatReuirementsMet::InStatValue' has a wrong offset!");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_IsStageStatReuirementsMet, CurrentActiveStageNumber) == 0x00000C, "Member 'CCPM_Parent_WatchCosmeticStat_C_IsStageStatReuirementsMet::CurrentActiveStageNumber' has a wrong offset!");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_IsStageStatReuirementsMet, PassedRequirements) == 0x000010, "Member 'CCPM_Parent_WatchCosmeticStat_C_IsStageStatReuirementsMet::PassedRequirements' has a wrong offset!");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_IsStageStatReuirementsMet, CallFunc_Greater_IntInt_ReturnValue) == 0x000011, "Member 'CCPM_Parent_WatchCosmeticStat_C_IsStageStatReuirementsMet::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_IsStageStatReuirementsMet, CallFunc_Less_IntInt_ReturnValue) == 0x000012, "Member 'CCPM_Parent_WatchCosmeticStat_C_IsStageStatReuirementsMet::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_IsStageStatReuirementsMet, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000013, "Member 'CCPM_Parent_WatchCosmeticStat_C_IsStageStatReuirementsMet::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_IsStageStatReuirementsMet, CallFunc_BooleanAND_ReturnValue) == 0x000014, "Member 'CCPM_Parent_WatchCosmeticStat_C_IsStageStatReuirementsMet::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_IsStageStatReuirementsMet, CallFunc_BooleanAND_ReturnValue_1) == 0x000015, "Member 'CCPM_Parent_WatchCosmeticStat_C_IsStageStatReuirementsMet::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function CCPM_Parent_WatchCosmeticStat.CCPM_Parent_WatchCosmeticStat_C.IsStagePlayerLeftAliveReuirementsMet
// 0x0018 (0x0018 - 0x0000)
struct CCPM_Parent_WatchCosmeticStat_C_IsStagePlayerLeftAliveReuirementsMet final
{
public:
	int32                                         InStageNumberBeingTested;                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InStageThreshold;                                  // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InStatValue;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentActiveStageNumber;                          // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PassedRequirements;                                // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CCPM_Parent_WatchCosmeticStat_C_IsStagePlayerLeftAliveReuirementsMet) == 0x000004, "Wrong alignment on CCPM_Parent_WatchCosmeticStat_C_IsStagePlayerLeftAliveReuirementsMet");
static_assert(sizeof(CCPM_Parent_WatchCosmeticStat_C_IsStagePlayerLeftAliveReuirementsMet) == 0x000018, "Wrong size on CCPM_Parent_WatchCosmeticStat_C_IsStagePlayerLeftAliveReuirementsMet");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_IsStagePlayerLeftAliveReuirementsMet, InStageNumberBeingTested) == 0x000000, "Member 'CCPM_Parent_WatchCosmeticStat_C_IsStagePlayerLeftAliveReuirementsMet::InStageNumberBeingTested' has a wrong offset!");
static_assert(offsetof(CCPM_Parent_WatchCosmeticStat_C_IsStagePlayerLeftAliveReuirementsMet, InStageThreshold) == 0x000004, "Member 'CCPM_Parent_WatchCosmeticStat_C_IsStagePlayerLeftAliveReuirementsMet::InStageThreshold' has a wrong offset!");
