#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChallengeListEntry_Challenge

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ChallengeListEntry_Challenge.ChallengeListEntry_Challenge_C
// 0x0068 (0x0358 - 0x02F0)
class UChallengeListEntry_Challenge_C final : public UAthenaChallengeListEntry_DetailedChallenge
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnActivate;                                        // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnHover;                                           // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 AnimBound_Activation_FX_Backing;                   // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               AnimBoundActionsOvr;                               // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         AnimBoundContentHB;                                // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               BoxActionWidgetWrapper;                            // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        ChallengeBulletSwitcher;                           // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HBoxPartyAssist;                                   // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageLockIcon;                                     // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Reward;                                    // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextDoneIndicator;                                 // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               TextWrapSB;                                        // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ChallengeListEntry_Challenge(int32 EntryPoint);
	void BndEvt__Button_PartyAssist_K2Node_ComponentBoundEvent_3_CommonSelectedStateChanged__DelegateSignature(class UCommonButton* Button, bool Selected);
	void BndEvt__Button_PartyAssist_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void OnPartyAssistEnabledChanged(bool bIsPartyAssistEnabled);
	void BndEvt__SimpleButton_TopClickArea_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__SimpleButton_TopClickArea_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void OnChallengeInfoSet(bool bIsComplete, bool bIsLocked, bool bCompact, bool HideRewards);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ChallengeListEntry_Challenge_C">();
	}
	static class UChallengeListEntry_Challenge_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChallengeListEntry_Challenge_C>();
	}
};
static_assert(alignof(UChallengeListEntry_Challenge_C) == 0x000008, "Wrong alignment on UChallengeListEntry_Challenge_C");
static_assert(sizeof(UChallengeListEntry_Challenge_C) == 0x000358, "Wrong size on UChallengeListEntry_Challenge_C");
static_assert(offsetof(UChallengeListEntry_Challenge_C, UberGraphFrame) == 0x0002F0, "Member 'UChallengeListEntry_Challenge_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UChallengeListEntry_Challenge_C, OnActivate) == 0x0002F8, "Member 'UChallengeListEntry_Challenge_C::OnActivate' has a wrong offset!");
static_assert(offsetof(UChallengeListEntry_Challenge_C, OnHover) == 0x000300, "Member 'UChallengeListEntry_Challenge_C::OnHover' has a wrong offset!");
static_assert(offsetof(UChallengeListEntry_Challenge_C, AnimBound_Activation_FX_Backing) == 0x000308, "Member 'UChallengeListEntry_Challenge_C::AnimBound_Activation_FX_Backing' has a wrong offset!");
static_assert(offsetof(UChallengeListEntry_Challenge_C, AnimBoundActionsOvr) == 0x000310, "Member 'UChallengeListEntry_Challenge_C::AnimBoundActionsOvr' has a wrong offset!");
static_assert(offsetof(UChallengeListEntry_Challenge_C, AnimBoundContentHB) == 0x000318, "Member 'UChallengeListEntry_Challenge_C::AnimBoundContentHB' has a wrong offset!");
static_assert(offsetof(UChallengeListEntry_Challenge_C, BoxActionWidgetWrapper) == 0x000320, "Member 'UChallengeListEntry_Challenge_C::BoxActionWidgetWrapper' has a wrong offset!");
static_assert(offsetof(UChallengeListEntry_Challenge_C, ChallengeBulletSwitcher) == 0x000328, "Member 'UChallengeListEntry_Challenge_C::ChallengeBulletSwitcher' has a wrong offset!");
static_assert(offsetof(UChallengeListEntry_Challenge_C, HBoxPartyAssist) == 0x000330, "Member 'UChallengeListEntry_Challenge_C::HBoxPartyAssist' has a wrong offset!");
static_assert(offsetof(UChallengeListEntry_Challenge_C, ImageLockIcon) == 0x000338, "Member 'UChallengeListEntry_Challenge_C::ImageLockIcon' has a wrong offset!");
static_assert(offsetof(UChallengeListEntry_Challenge_C, Overlay_Reward) == 0x000340, "Member 'UChallengeListEntry_Challenge_C::Overlay_Reward' has a wrong offset!");
static_assert(offsetof(UChallengeListEntry_Challenge_C, TextDoneIndicator) == 0x000348, "Member 'UChallengeListEntry_Challenge_C::TextDoneIndicator' has a wrong offset!");
static_assert(offsetof(UChallengeListEntry_Challenge_C, TextWrapSB) == 0x000350, "Member 'UChallengeListEntry_Challenge_C::TextWrapSB' has a wrong offset!");

}

