#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChallengeSetDetails

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ChallengeSetDetails.ChallengeSetDetails_C.ExecuteUbergraph_ChallengeSetDetails
// 0x0130 (0x0130 - 0x0000)
struct ChallengeSetDetails_C_ExecuteUbergraph_ChallengeSetDetails final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCircleArrowButton_C*                   K2Node_DynamicCast_AsCircle_Arrow_Button;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCircleArrowButton_C*                   K2Node_DynamicCast_AsCircle_Arrow_Button_1;        // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCircleArrowButton_C*                   K2Node_DynamicCast_AsCircle_Arrow_Button_2;        // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortChallengeSetStyle                 K2Node_Event_DisplayStyle;                         // 0x0040(0x00A0)(ConstParm)
	bool                                          K2Node_Event_bIsComplete;                          // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetChallengeStyleLightAccentColor_ReturnValue; // 0x00E4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HandleBack_PassThrough;                   // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UItemInfoHeaderWidget_C*                K2Node_DynamicCast_AsItem_Info_Header_Widget;      // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x0108(0x0010)(NoDestructor)
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0118(0x0010)(ZeroConstructor, NoDestructor)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChallengeSetDetails_C_ExecuteUbergraph_ChallengeSetDetails) == 0x000008, "Wrong alignment on ChallengeSetDetails_C_ExecuteUbergraph_ChallengeSetDetails");
static_assert(sizeof(ChallengeSetDetails_C_ExecuteUbergraph_ChallengeSetDetails) == 0x000130, "Wrong size on ChallengeSetDetails_C_ExecuteUbergraph_ChallengeSetDetails");
static_assert(offsetof(ChallengeSetDetails_C_ExecuteUbergraph_ChallengeSetDetails, EntryPoint) == 0x000000, "Member 'ChallengeSetDetails_C_ExecuteUbergraph_ChallengeSetDetails::EntryPoint' has a wrong offset!");
static_assert(offsetof(ChallengeSetDetails_C_ExecuteUbergraph_ChallengeSetDetails, K2Node_DynamicCast_AsCircle_Arrow_Button) == 0x000008, "Member 'ChallengeSetDetails_C_ExecuteUbergraph_ChallengeSetDetails::K2Node_DynamicCast_AsCircle_Arrow_Button' has a wrong offset!");
static_assert(offsetof(ChallengeSetDetails_C_ExecuteUbergraph_ChallengeSetDetails, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'ChallengeSetDetails_C_ExecuteUbergraph_ChallengeSetDetails::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ChallengeSetDetails_C_ExecuteUbergraph_ChallengeSetDetails, K2Node_DynamicCast_AsCircle_Arrow_Button_1) == 0x000018, "Member 'ChallengeSetDetails_C_ExecuteUbergraph_ChallengeSetDetails::K2Node_DynamicCast_AsCircle_Arrow_Button_1' has a wrong offset!");
static_assert(offsetof(ChallengeSetDetails_C_ExecuteUbergraph_ChallengeSetDetails, K2Node_DynamicCast_bSuccess_1) == 0x000020, "Member 'ChallengeSetDetails_C_ExecuteUbergraph_ChallengeSetDetails::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ChallengeSetDetails_C_ExecuteUbergraph_ChallengeSetDetails, CallFunc_PlayAnimationForward_ReturnValue) == 0x000028, "Member 'ChallengeSetDetails_C_ExecuteUbergraph_ChallengeSetDetails::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChallengeSetDetails_C_ExecuteUbergraph_ChallengeSetDetails, K2Node_DynamicCast_AsCircle_Arrow_Button_2) == 0x000030, "Member 'ChallengeSetDetails_C_ExecuteUbergraph_ChallengeSetDetails::K2Node_DynamicCast_AsCircle_Arrow_Button_2' has a wrong offset!");
static_assert(offsetof(ChallengeSetDetails_C_ExecuteUbergraph_ChallengeSetDetails, K2Node_DynamicCast_bSuccess_2) == 0x000038, "Member 'ChallengeSetDetails_C_ExecuteUbergraph_ChallengeSetDetails::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(ChallengeSetDetails_C_ExecuteUbergraph_ChallengeSetDetails, K2Node_Event_DisplayStyle) == 0x000040, "Member 'ChallengeSetDetails_C_ExecuteUbergraph_ChallengeSetDetails::K2Node_Event_DisplayStyle' has a wrong offset!");
static_assert(offsetof(ChallengeSetDetails_C_ExecuteUbergraph_ChallengeSetDetails, K2Node_Event_bIsComplete) == 0x0000E0, "Member 'ChallengeSetDetails_C_ExecuteUbergraph_ChallengeSetDetails::K2Node_Event_bIsComplete' has a wrong offset!");
static_assert(offsetof(ChallengeSetDetails_C_ExecuteUbergraph_ChallengeSetDetails, CallFunc_GetChallengeStyleLightAccentColor_ReturnValue) == 0x0000E4, "Member 'ChallengeSetDetails_C_ExecuteUbergraph_ChallengeSetDetails::CallFunc_GetChallengeStyleLightAccentColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChallengeSetDetails_C_ExecuteUbergraph_ChallengeSetDetails, CallFunc_HandleBack_PassThrough) == 0x0000F4, "Member 'ChallengeSetDetails_C_ExecuteUbergraph_ChallengeSetDetails::CallFunc_HandleBack_PassThrough' has a wrong offset!");
static_assert(offsetof(ChallengeSetDetails_C_ExecuteUbergraph_ChallengeSetDetails, K2Node_DynamicCast_AsItem_Info_Header_Widget) == 0x0000F8, "Member 'ChallengeSetDetails_C_ExecuteUbergraph_ChallengeSetDetails::K2Node_DynamicCast_AsItem_Info_Header_Widget' has a wrong offset!");
static_assert(offsetof(ChallengeSetDetails_C_ExecuteUbergraph_ChallengeSetDetails, K2Node_DynamicCast_bSuccess_3) == 0x000100, "Member 'ChallengeSetDetails_C_ExecuteUbergraph_ChallengeSetDetails::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(ChallengeSetDetails_C_ExecuteUbergraph_ChallengeSetDetails, K2Node_MakeStruct_DataTableRowHandle) == 0x000108, "Member 'ChallengeSetDetails_C_ExecuteUbergraph_ChallengeSetDetails::K2Node_MakeStruct_DataTableRowHandle' has a wrong offset!");
static_assert(offsetof(ChallengeSetDetails_C_ExecuteUbergraph_ChallengeSetDetails, K2Node_CreateDelegate_OutputDelegate) == 0x000118, "Member 'ChallengeSetDetails_C_ExecuteUbergraph_ChallengeSetDetails::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ChallengeSetDetails_C_ExecuteUbergraph_ChallengeSetDetails, K2Node_ComponentBoundEvent_Button) == 0x000128, "Member 'ChallengeSetDetails_C_ExecuteUbergraph_ChallengeSetDetails::K2Node_ComponentBoundEvent_Button' has a wrong offset!");

// Function ChallengeSetDetails.ChallengeSetDetails_C.BndEvt__CloseButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ChallengeSetDetails_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChallengeSetDetails_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on ChallengeSetDetails_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(ChallengeSetDetails_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on ChallengeSetDetails_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(ChallengeSetDetails_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'ChallengeSetDetails_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function ChallengeSetDetails.ChallengeSetDetails_C.OnChallengeSetEstablished
// 0x00A8 (0x00A8 - 0x0000)
struct ChallengeSetDetails_C_OnChallengeSetEstablished final
{
public:
	struct FFortChallengeSetStyle                 DisplayStyle;                                      // 0x0000(0x00A0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          bIsComplete;                                       // 0x00A0(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ChallengeSetDetails_C_OnChallengeSetEstablished) == 0x000008, "Wrong alignment on ChallengeSetDetails_C_OnChallengeSetEstablished");
static_assert(sizeof(ChallengeSetDetails_C_OnChallengeSetEstablished) == 0x0000A8, "Wrong size on ChallengeSetDetails_C_OnChallengeSetEstablished");
static_assert(offsetof(ChallengeSetDetails_C_OnChallengeSetEstablished, DisplayStyle) == 0x000000, "Member 'ChallengeSetDetails_C_OnChallengeSetEstablished::DisplayStyle' has a wrong offset!");
static_assert(offsetof(ChallengeSetDetails_C_OnChallengeSetEstablished, bIsComplete) == 0x0000A0, "Member 'ChallengeSetDetails_C_OnChallengeSetEstablished::bIsComplete' has a wrong offset!");

// Function ChallengeSetDetails.ChallengeSetDetails_C.HandleBack
// 0x0001 (0x0001 - 0x0000)
struct ChallengeSetDetails_C_HandleBack final
{
public:
	bool                                          PassThrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ChallengeSetDetails_C_HandleBack) == 0x000001, "Wrong alignment on ChallengeSetDetails_C_HandleBack");
static_assert(sizeof(ChallengeSetDetails_C_HandleBack) == 0x000001, "Wrong size on ChallengeSetDetails_C_HandleBack");
static_assert(offsetof(ChallengeSetDetails_C_HandleBack, PassThrough) == 0x000000, "Member 'ChallengeSetDetails_C_HandleBack::PassThrough' has a wrong offset!");

// Function ChallengeSetDetails.ChallengeSetDetails_C.SetDynamicColors
// 0x00B0 (0x00B0 - 0x0000)
struct ChallengeSetDetails_C_SetDynamicColors final
{
public:
	class UImage*                                 DetailsDynamicMaterialTarget;                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortChallengeSetStyle                 FortChallengeSetStyle;                             // 0x0008(0x00A0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChallengeSetDetails_C_SetDynamicColors) == 0x000008, "Wrong alignment on ChallengeSetDetails_C_SetDynamicColors");
static_assert(sizeof(ChallengeSetDetails_C_SetDynamicColors) == 0x0000B0, "Wrong size on ChallengeSetDetails_C_SetDynamicColors");
static_assert(offsetof(ChallengeSetDetails_C_SetDynamicColors, DetailsDynamicMaterialTarget) == 0x000000, "Member 'ChallengeSetDetails_C_SetDynamicColors::DetailsDynamicMaterialTarget' has a wrong offset!");
static_assert(offsetof(ChallengeSetDetails_C_SetDynamicColors, FortChallengeSetStyle) == 0x000008, "Member 'ChallengeSetDetails_C_SetDynamicColors::FortChallengeSetStyle' has a wrong offset!");
static_assert(offsetof(ChallengeSetDetails_C_SetDynamicColors, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0000A8, "Member 'ChallengeSetDetails_C_SetDynamicColors::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function ChallengeSetDetails.ChallengeSetDetails_C.GetWidgetForFramingViewedItem
// 0x0008 (0x0008 - 0x0000)
struct ChallengeSetDetails_C_GetWidgetForFramingViewedItem final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChallengeSetDetails_C_GetWidgetForFramingViewedItem) == 0x000008, "Wrong alignment on ChallengeSetDetails_C_GetWidgetForFramingViewedItem");
static_assert(sizeof(ChallengeSetDetails_C_GetWidgetForFramingViewedItem) == 0x000008, "Wrong size on ChallengeSetDetails_C_GetWidgetForFramingViewedItem");
static_assert(offsetof(ChallengeSetDetails_C_GetWidgetForFramingViewedItem, ReturnValue) == 0x000000, "Member 'ChallengeSetDetails_C_GetWidgetForFramingViewedItem::ReturnValue' has a wrong offset!");

}

