#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChallengeTile_Mission

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ChallengeTile_Mission.ChallengeTile_Mission_C
// 0x0080 (0x0C90 - 0x0C10)
class UChallengeTile_Mission_C final : public UAthenaChallengeSetTile_Mission
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C10(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       AmbientPartyAssistAttention;                       // 0x0C18(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Outro;                                             // 0x0C20(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnHover;                                           // 0x0C28(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USizeBox*                               CountdownSB;                                       // 0x0C30(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_BattlePass;                                   // 0x0C38(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_LimitedTime;                                  // 0x0C40(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Prestige;                                     // 0x0C48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortLazyImage*                         LazyImage_Background;                              // 0x0C50(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlayPartyAssist;                                // 0x0C58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PrestigeBorder;                                    // 0x0C60(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBoxTextScale;                                 // 0x0C68(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Reward;                                    // 0x0C70(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_ChallengeContext_1;                           // 0x0C78(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UnavailableBox;                                    // 0x0C80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               UnavailableOvr;                                    // 0x0C88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ChallengeTile_Mission(int32 EntryPoint);
	void ResetToLocked();
	void OnContainsPartyAssistedChallengeChanged(bool bHasPartyAssistedChallenge);
	void BP_OnUnhovered();
	void BP_OnHovered();
	void OnChallengeSetEstablished(const struct FFortChallengeSetStyle& DisplayStyle, bool bIsComplete, bool bIsLocked);
	void SetDynamicColors(class UImage* EventDynamicMaterialTarget, const struct FFortChallengeSetStyle& FortChallengeSetStyle);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ChallengeTile_Mission_C">();
	}
	static class UChallengeTile_Mission_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChallengeTile_Mission_C>();
	}
};
static_assert(alignof(UChallengeTile_Mission_C) == 0x000008, "Wrong alignment on UChallengeTile_Mission_C");
static_assert(sizeof(UChallengeTile_Mission_C) == 0x000C90, "Wrong size on UChallengeTile_Mission_C");
static_assert(offsetof(UChallengeTile_Mission_C, UberGraphFrame) == 0x000C10, "Member 'UChallengeTile_Mission_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UChallengeTile_Mission_C, AmbientPartyAssistAttention) == 0x000C18, "Member 'UChallengeTile_Mission_C::AmbientPartyAssistAttention' has a wrong offset!");
static_assert(offsetof(UChallengeTile_Mission_C, Outro) == 0x000C20, "Member 'UChallengeTile_Mission_C::Outro' has a wrong offset!");
static_assert(offsetof(UChallengeTile_Mission_C, OnHover) == 0x000C28, "Member 'UChallengeTile_Mission_C::OnHover' has a wrong offset!");
static_assert(offsetof(UChallengeTile_Mission_C, CountdownSB) == 0x000C30, "Member 'UChallengeTile_Mission_C::CountdownSB' has a wrong offset!");
static_assert(offsetof(UChallengeTile_Mission_C, Icon_BattlePass) == 0x000C38, "Member 'UChallengeTile_Mission_C::Icon_BattlePass' has a wrong offset!");
static_assert(offsetof(UChallengeTile_Mission_C, Icon_LimitedTime) == 0x000C40, "Member 'UChallengeTile_Mission_C::Icon_LimitedTime' has a wrong offset!");
static_assert(offsetof(UChallengeTile_Mission_C, Icon_Prestige) == 0x000C48, "Member 'UChallengeTile_Mission_C::Icon_Prestige' has a wrong offset!");
static_assert(offsetof(UChallengeTile_Mission_C, LazyImage_Background) == 0x000C50, "Member 'UChallengeTile_Mission_C::LazyImage_Background' has a wrong offset!");
static_assert(offsetof(UChallengeTile_Mission_C, OverlayPartyAssist) == 0x000C58, "Member 'UChallengeTile_Mission_C::OverlayPartyAssist' has a wrong offset!");
static_assert(offsetof(UChallengeTile_Mission_C, PrestigeBorder) == 0x000C60, "Member 'UChallengeTile_Mission_C::PrestigeBorder' has a wrong offset!");
static_assert(offsetof(UChallengeTile_Mission_C, ScaleBoxTextScale) == 0x000C68, "Member 'UChallengeTile_Mission_C::ScaleBoxTextScale' has a wrong offset!");
static_assert(offsetof(UChallengeTile_Mission_C, SizeBox_Reward) == 0x000C70, "Member 'UChallengeTile_Mission_C::SizeBox_Reward' has a wrong offset!");
static_assert(offsetof(UChallengeTile_Mission_C, Text_ChallengeContext_1) == 0x000C78, "Member 'UChallengeTile_Mission_C::Text_ChallengeContext_1' has a wrong offset!");
static_assert(offsetof(UChallengeTile_Mission_C, UnavailableBox) == 0x000C80, "Member 'UChallengeTile_Mission_C::UnavailableBox' has a wrong offset!");
static_assert(offsetof(UChallengeTile_Mission_C, UnavailableOvr) == 0x000C88, "Member 'UChallengeTile_Mission_C::UnavailableOvr' has a wrong offset!");

}

