#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChallengeImageGrid_Button

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function ChallengeImageGrid_Button.ChallengeImageGrid_Button_C.ExecuteUbergraph_ChallengeImageGrid_Button
// 0x00F0 (0x00F0 - 0x0000)
struct ChallengeImageGrid_Button_C_ExecuteUbergraph_ChallengeImageGrid_Button final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsComplete;                          // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsLocked;                            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0010(0x0018)()
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0030(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0078(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0088(0x0018)()
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_5;              // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChallengeImageGrid_Button_C_ExecuteUbergraph_ChallengeImageGrid_Button) == 0x000008, "Wrong alignment on ChallengeImageGrid_Button_C_ExecuteUbergraph_ChallengeImageGrid_Button");
static_assert(sizeof(ChallengeImageGrid_Button_C_ExecuteUbergraph_ChallengeImageGrid_Button) == 0x0000F0, "Wrong size on ChallengeImageGrid_Button_C_ExecuteUbergraph_ChallengeImageGrid_Button");
static_assert(offsetof(ChallengeImageGrid_Button_C_ExecuteUbergraph_ChallengeImageGrid_Button, EntryPoint) == 0x000000, "Member 'ChallengeImageGrid_Button_C_ExecuteUbergraph_ChallengeImageGrid_Button::EntryPoint' has a wrong offset!");
static_assert(offsetof(ChallengeImageGrid_Button_C_ExecuteUbergraph_ChallengeImageGrid_Button, Temp_bool_Variable) == 0x000004, "Member 'ChallengeImageGrid_Button_C_ExecuteUbergraph_ChallengeImageGrid_Button::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ChallengeImageGrid_Button_C_ExecuteUbergraph_ChallengeImageGrid_Button, Temp_byte_Variable) == 0x000005, "Member 'ChallengeImageGrid_Button_C_ExecuteUbergraph_ChallengeImageGrid_Button::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ChallengeImageGrid_Button_C_ExecuteUbergraph_ChallengeImageGrid_Button, Temp_byte_Variable_1) == 0x000006, "Member 'ChallengeImageGrid_Button_C_ExecuteUbergraph_ChallengeImageGrid_Button::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(ChallengeImageGrid_Button_C_ExecuteUbergraph_ChallengeImageGrid_Button, K2Node_Event_bIsComplete) == 0x000007, "Member 'ChallengeImageGrid_Button_C_ExecuteUbergraph_ChallengeImageGrid_Button::K2Node_Event_bIsComplete' has a wrong offset!");
static_assert(offsetof(ChallengeImageGrid_Button_C_ExecuteUbergraph_ChallengeImageGrid_Button, K2Node_Event_bIsLocked) == 0x000008, "Member 'ChallengeImageGrid_Button_C_ExecuteUbergraph_ChallengeImageGrid_Button::K2Node_Event_bIsLocked' has a wrong offset!");
static_assert(offsetof(ChallengeImageGrid_Button_C_ExecuteUbergraph_ChallengeImageGrid_Button, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'ChallengeImageGrid_Button_C_ExecuteUbergraph_ChallengeImageGrid_Button::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChallengeImageGrid_Button_C_ExecuteUbergraph_ChallengeImageGrid_Button, CallFunc_Conv_IntToText_ReturnValue) == 0x000010, "Member 'ChallengeImageGrid_Button_C_ExecuteUbergraph_ChallengeImageGrid_Button::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChallengeImageGrid_Button_C_ExecuteUbergraph_ChallengeImageGrid_Button, K2Node_Select_Default) == 0x000028, "Member 'ChallengeImageGrid_Button_C_ExecuteUbergraph_ChallengeImageGrid_Button::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ChallengeImageGrid_Button_C_ExecuteUbergraph_ChallengeImageGrid_Button, K2Node_MakeStruct_FormatArgumentData) == 0x000030, "Member 'ChallengeImageGrid_Button_C_ExecuteUbergraph_ChallengeImageGrid_Button::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(ChallengeImageGrid_Button_C_ExecuteUbergraph_ChallengeImageGrid_Button, CallFunc_Less_IntInt_ReturnValue) == 0x000070, "Member 'ChallengeImageGrid_Button_C_ExecuteUbergraph_ChallengeImageGrid_Button::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChallengeImageGrid_Button_C_ExecuteUbergraph_ChallengeImageGrid_Button, K2Node_MakeArray_Array) == 0x000078, "Member 'ChallengeImageGrid_Button_C_ExecuteUbergraph_ChallengeImageGrid_Button::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(ChallengeImageGrid_Button_C_ExecuteUbergraph_ChallengeImageGrid_Button, CallFunc_Format_ReturnValue) == 0x000088, "Member 'ChallengeImageGrid_Button_C_ExecuteUbergraph_ChallengeImageGrid_Button::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChallengeImageGrid_Button_C_ExecuteUbergraph_ChallengeImageGrid_Button, CallFunc_BooleanOR_ReturnValue) == 0x0000A0, "Member 'ChallengeImageGrid_Button_C_ExecuteUbergraph_ChallengeImageGrid_Button::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChallengeImageGrid_Button_C_ExecuteUbergraph_ChallengeImageGrid_Button, CallFunc_PlayAnimation_ReturnValue) == 0x0000A8, "Member 'ChallengeImageGrid_Button_C_ExecuteUbergraph_ChallengeImageGrid_Button::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChallengeImageGrid_Button_C_ExecuteUbergraph_ChallengeImageGrid_Button, CallFunc_PlayAnimation_ReturnValue_1) == 0x0000B0, "Member 'ChallengeImageGrid_Button_C_ExecuteUbergraph_ChallengeImageGrid_Button::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChallengeImageGrid_Button_C_ExecuteUbergraph_ChallengeImageGrid_Button, CallFunc_PlayAnimation_ReturnValue_2) == 0x0000B8, "Member 'ChallengeImageGrid_Button_C_ExecuteUbergraph_ChallengeImageGrid_Button::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ChallengeImageGrid_Button_C_ExecuteUbergraph_ChallengeImageGrid_Button, CallFunc_PlayAnimation_ReturnValue_3) == 0x0000C0, "Member 'ChallengeImageGrid_Button_C_ExecuteUbergraph_ChallengeImageGrid_Button::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ChallengeImageGrid_Button_C_ExecuteUbergraph_ChallengeImageGrid_Button, CallFunc_Multiply_IntInt_ReturnValue) == 0x0000C8, "Member 'ChallengeImageGrid_Button_C_ExecuteUbergraph_ChallengeImageGrid_Button::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChallengeImageGrid_Button_C_ExecuteUbergraph_ChallengeImageGrid_Button, CallFunc_Divide_IntInt_ReturnValue) == 0x0000CC, "Member 'ChallengeImageGrid_Button_C_ExecuteUbergraph_ChallengeImageGrid_Button::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChallengeImageGrid_Button_C_ExecuteUbergraph_ChallengeImageGrid_Button, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0000D0, "Member 'ChallengeImageGrid_Button_C_ExecuteUbergraph_ChallengeImageGrid_Button::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChallengeImageGrid_Button_C_ExecuteUbergraph_ChallengeImageGrid_Button, CallFunc_Percent_IntInt_ReturnValue) == 0x0000D8, "Member 'ChallengeImageGrid_Button_C_ExecuteUbergraph_ChallengeImageGrid_Button::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChallengeImageGrid_Button_C_ExecuteUbergraph_ChallengeImageGrid_Button, CallFunc_Conv_IntToFloat_ReturnValue) == 0x0000DC, "Member 'ChallengeImageGrid_Button_C_ExecuteUbergraph_ChallengeImageGrid_Button::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChallengeImageGrid_Button_C_ExecuteUbergraph_ChallengeImageGrid_Button, CallFunc_PlayAnimation_ReturnValue_4) == 0x0000E0, "Member 'ChallengeImageGrid_Button_C_ExecuteUbergraph_ChallengeImageGrid_Button::CallFunc_PlayAnimation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ChallengeImageGrid_Button_C_ExecuteUbergraph_ChallengeImageGrid_Button, CallFunc_PlayAnimation_ReturnValue_5) == 0x0000E8, "Member 'ChallengeImageGrid_Button_C_ExecuteUbergraph_ChallengeImageGrid_Button::CallFunc_PlayAnimation_ReturnValue_5' has a wrong offset!");

// Function ChallengeImageGrid_Button.ChallengeImageGrid_Button_C.OnChallengeSet
// 0x0002 (0x0002 - 0x0000)
struct ChallengeImageGrid_Button_C_OnChallengeSet final
{
public:
	bool                                          bIsComplete;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIsLocked;                                         // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ChallengeImageGrid_Button_C_OnChallengeSet) == 0x000001, "Wrong alignment on ChallengeImageGrid_Button_C_OnChallengeSet");
static_assert(sizeof(ChallengeImageGrid_Button_C_OnChallengeSet) == 0x000002, "Wrong size on ChallengeImageGrid_Button_C_OnChallengeSet");
static_assert(offsetof(ChallengeImageGrid_Button_C_OnChallengeSet, bIsComplete) == 0x000000, "Member 'ChallengeImageGrid_Button_C_OnChallengeSet::bIsComplete' has a wrong offset!");
static_assert(offsetof(ChallengeImageGrid_Button_C_OnChallengeSet, bIsLocked) == 0x000001, "Member 'ChallengeImageGrid_Button_C_OnChallengeSet::bIsLocked' has a wrong offset!");

}

