#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChallengeSetDetails

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ChallengeSetDetails.ChallengeSetDetails_C
// 0x0048 (0x0650 - 0x0608)
class UChallengeSetDetails_C final : public UAthenaChallengeSetDetails
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0608(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ItemInfoIntroOutro;                                // 0x0610(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x0618(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USizeBox*                               CameraFramingWidget;                               // 0x0620(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCloseButton_C*                         CloseButton;                                       // 0x0628(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HeaderBase;                                        // 0x0630(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HeaderBolt;                                        // 0x0638(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           ItemInfo;                                          // 0x0640(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x0648(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ChallengeSetDetails(int32 EntryPoint);
	void BndEvt__CloseButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void Construct();
	void OnChallengeSetEstablished(const struct FFortChallengeSetStyle& DisplayStyle, bool bIsComplete);
	void HandleBack(bool* PassThrough);
	void SetDynamicColors(class UImage* DetailsDynamicMaterialTarget, const struct FFortChallengeSetStyle& FortChallengeSetStyle);
	class UWidget* GetWidgetForFramingViewedItem();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ChallengeSetDetails_C">();
	}
	static class UChallengeSetDetails_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChallengeSetDetails_C>();
	}
};
static_assert(alignof(UChallengeSetDetails_C) == 0x000008, "Wrong alignment on UChallengeSetDetails_C");
static_assert(sizeof(UChallengeSetDetails_C) == 0x000650, "Wrong size on UChallengeSetDetails_C");
static_assert(offsetof(UChallengeSetDetails_C, UberGraphFrame) == 0x000608, "Member 'UChallengeSetDetails_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UChallengeSetDetails_C, ItemInfoIntroOutro) == 0x000610, "Member 'UChallengeSetDetails_C::ItemInfoIntroOutro' has a wrong offset!");
static_assert(offsetof(UChallengeSetDetails_C, Intro) == 0x000618, "Member 'UChallengeSetDetails_C::Intro' has a wrong offset!");
static_assert(offsetof(UChallengeSetDetails_C, CameraFramingWidget) == 0x000620, "Member 'UChallengeSetDetails_C::CameraFramingWidget' has a wrong offset!");
static_assert(offsetof(UChallengeSetDetails_C, CloseButton) == 0x000628, "Member 'UChallengeSetDetails_C::CloseButton' has a wrong offset!");
static_assert(offsetof(UChallengeSetDetails_C, HeaderBase) == 0x000630, "Member 'UChallengeSetDetails_C::HeaderBase' has a wrong offset!");
static_assert(offsetof(UChallengeSetDetails_C, HeaderBolt) == 0x000638, "Member 'UChallengeSetDetails_C::HeaderBolt' has a wrong offset!");
static_assert(offsetof(UChallengeSetDetails_C, ItemInfo) == 0x000640, "Member 'UChallengeSetDetails_C::ItemInfo' has a wrong offset!");
static_assert(offsetof(UChallengeSetDetails_C, SafeZone_0) == 0x000648, "Member 'UChallengeSetDetails_C::SafeZone_0' has a wrong offset!");

}

