#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChallengeTile_Style

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ChallengeTile_Style.ChallengeTile_Style_C
// 0x0038 (0x0BF0 - 0x0BB8)
class UChallengeTile_Style_C final : public UAthenaChallengeSetTile_Style
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BB8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Outro;                                             // 0x0BC0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnHover;                                           // 0x0BC8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_Background;                                  // 0x0BD0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BoltBorder;                                  // 0x0BD8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UnavailableBox;                                    // 0x0BE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               UnavailableOvr;                                    // 0x0BE8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ChallengeTile_Style(int32 EntryPoint);
	void OnChallengeSetEstablished(const struct FFortChallengeSetStyle& DisplayStyle, bool bIsComplete, bool bIsLocked);
	void BP_OnUnhovered();
	void BP_OnHovered();
	void SetDynamicColors(class UImage* StyleDynamicMaterialTarget, const struct FFortChallengeSetStyle& FortChallengeSetStyle);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ChallengeTile_Style_C">();
	}
	static class UChallengeTile_Style_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChallengeTile_Style_C>();
	}
};
static_assert(alignof(UChallengeTile_Style_C) == 0x000008, "Wrong alignment on UChallengeTile_Style_C");
static_assert(sizeof(UChallengeTile_Style_C) == 0x000BF0, "Wrong size on UChallengeTile_Style_C");
static_assert(offsetof(UChallengeTile_Style_C, UberGraphFrame) == 0x000BB8, "Member 'UChallengeTile_Style_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UChallengeTile_Style_C, Outro) == 0x000BC0, "Member 'UChallengeTile_Style_C::Outro' has a wrong offset!");
static_assert(offsetof(UChallengeTile_Style_C, OnHover) == 0x000BC8, "Member 'UChallengeTile_Style_C::OnHover' has a wrong offset!");
static_assert(offsetof(UChallengeTile_Style_C, Image_Background) == 0x000BD0, "Member 'UChallengeTile_Style_C::Image_Background' has a wrong offset!");
static_assert(offsetof(UChallengeTile_Style_C, Image_BoltBorder) == 0x000BD8, "Member 'UChallengeTile_Style_C::Image_BoltBorder' has a wrong offset!");
static_assert(offsetof(UChallengeTile_Style_C, UnavailableBox) == 0x000BE0, "Member 'UChallengeTile_Style_C::UnavailableBox' has a wrong offset!");
static_assert(offsetof(UChallengeTile_Style_C, UnavailableOvr) == 0x000BE8, "Member 'UChallengeTile_Style_C::UnavailableOvr' has a wrong offset!");

}

