#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChallengeListEntry_SpecialOffer

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function ChallengeListEntry_SpecialOffer.ChallengeListEntry_SpecialOffer_C.ExecuteUbergraph_ChallengeListEntry_SpecialOffer
// 0x0130 (0x0130 - 0x0000)
struct ChallengeListEntry_SpecialOffer_C_ExecuteUbergraph_ChallengeListEntry_SpecialOffer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0040(0x0070)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00B0(0x0070)(ConstParm)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChallengeListEntry_SpecialOffer_C_ExecuteUbergraph_ChallengeListEntry_SpecialOffer) == 0x000008, "Wrong alignment on ChallengeListEntry_SpecialOffer_C_ExecuteUbergraph_ChallengeListEntry_SpecialOffer");
static_assert(sizeof(ChallengeListEntry_SpecialOffer_C_ExecuteUbergraph_ChallengeListEntry_SpecialOffer) == 0x000130, "Wrong size on ChallengeListEntry_SpecialOffer_C_ExecuteUbergraph_ChallengeListEntry_SpecialOffer");
static_assert(offsetof(ChallengeListEntry_SpecialOffer_C_ExecuteUbergraph_ChallengeListEntry_SpecialOffer, EntryPoint) == 0x000000, "Member 'ChallengeListEntry_SpecialOffer_C_ExecuteUbergraph_ChallengeListEntry_SpecialOffer::EntryPoint' has a wrong offset!");
static_assert(offsetof(ChallengeListEntry_SpecialOffer_C_ExecuteUbergraph_ChallengeListEntry_SpecialOffer, K2Node_Event_MyGeometry) == 0x000004, "Member 'ChallengeListEntry_SpecialOffer_C_ExecuteUbergraph_ChallengeListEntry_SpecialOffer::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(ChallengeListEntry_SpecialOffer_C_ExecuteUbergraph_ChallengeListEntry_SpecialOffer, K2Node_Event_MouseEvent_1) == 0x000040, "Member 'ChallengeListEntry_SpecialOffer_C_ExecuteUbergraph_ChallengeListEntry_SpecialOffer::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(ChallengeListEntry_SpecialOffer_C_ExecuteUbergraph_ChallengeListEntry_SpecialOffer, K2Node_Event_MouseEvent) == 0x0000B0, "Member 'ChallengeListEntry_SpecialOffer_C_ExecuteUbergraph_ChallengeListEntry_SpecialOffer::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(ChallengeListEntry_SpecialOffer_C_ExecuteUbergraph_ChallengeListEntry_SpecialOffer, CallFunc_PlayAnimationForward_ReturnValue) == 0x000120, "Member 'ChallengeListEntry_SpecialOffer_C_ExecuteUbergraph_ChallengeListEntry_SpecialOffer::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChallengeListEntry_SpecialOffer_C_ExecuteUbergraph_ChallengeListEntry_SpecialOffer, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000128, "Member 'ChallengeListEntry_SpecialOffer_C_ExecuteUbergraph_ChallengeListEntry_SpecialOffer::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");

// Function ChallengeListEntry_SpecialOffer.ChallengeListEntry_SpecialOffer_C.OnMouseLeave
// 0x0070 (0x0070 - 0x0000)
struct ChallengeListEntry_SpecialOffer_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(ChallengeListEntry_SpecialOffer_C_OnMouseLeave) == 0x000008, "Wrong alignment on ChallengeListEntry_SpecialOffer_C_OnMouseLeave");
static_assert(sizeof(ChallengeListEntry_SpecialOffer_C_OnMouseLeave) == 0x000070, "Wrong size on ChallengeListEntry_SpecialOffer_C_OnMouseLeave");
static_assert(offsetof(ChallengeListEntry_SpecialOffer_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'ChallengeListEntry_SpecialOffer_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function ChallengeListEntry_SpecialOffer.ChallengeListEntry_SpecialOffer_C.OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct ChallengeListEntry_SpecialOffer_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(ChallengeListEntry_SpecialOffer_C_OnMouseEnter) == 0x000008, "Wrong alignment on ChallengeListEntry_SpecialOffer_C_OnMouseEnter");
static_assert(sizeof(ChallengeListEntry_SpecialOffer_C_OnMouseEnter) == 0x0000A8, "Wrong size on ChallengeListEntry_SpecialOffer_C_OnMouseEnter");
static_assert(offsetof(ChallengeListEntry_SpecialOffer_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'ChallengeListEntry_SpecialOffer_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(ChallengeListEntry_SpecialOffer_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'ChallengeListEntry_SpecialOffer_C_OnMouseEnter::MouseEvent' has a wrong offset!");

}

