#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChallengeSetImageGrid

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ChallengeSetImageGrid.ChallengeSetImageGrid_C
// 0x0058 (0x0668 - 0x0610)
class UChallengeSetImageGrid_C final : public UAthenaChallengeSetImageGrid
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0610(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x0618(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCloseButton_C*                         CloseButton;                                       // 0x0620(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   CommonRichTextBlock_110;                           // 0x0628(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 GridBackFill;                                      // 0x0630(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HeaderBase;                                        // 0x0638(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HeaderBolt;                                        // 0x0640(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               NoBattlePassContainer;                             // 0x0648(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NoBattlePassImage;                                 // 0x0650(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   NoBattlePassText;                                  // 0x0658(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x0660(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ChallengeSetImageGrid(int32 EntryPoint);
	void BndEvt__CloseButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void Construct();
	void OnChallengeSetEstablished(const struct FFortChallengeSetStyle& DisplayStyle, bool bIsComplete);
	void HandleBack(bool* PassThrough);
	void SetDynamicColors(class UImage* DetailsDynamicMaterialTarget, const struct FFortChallengeSetStyle& FortChallengeSetStyle);
	class UWidget* GetWidgetForFramingViewedItem();
	void ChangeSortFunction(bool* PassThrough);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ChallengeSetImageGrid_C">();
	}
	static class UChallengeSetImageGrid_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChallengeSetImageGrid_C>();
	}
};
static_assert(alignof(UChallengeSetImageGrid_C) == 0x000008, "Wrong alignment on UChallengeSetImageGrid_C");
static_assert(sizeof(UChallengeSetImageGrid_C) == 0x000668, "Wrong size on UChallengeSetImageGrid_C");
static_assert(offsetof(UChallengeSetImageGrid_C, UberGraphFrame) == 0x000610, "Member 'UChallengeSetImageGrid_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UChallengeSetImageGrid_C, Intro) == 0x000618, "Member 'UChallengeSetImageGrid_C::Intro' has a wrong offset!");
static_assert(offsetof(UChallengeSetImageGrid_C, CloseButton) == 0x000620, "Member 'UChallengeSetImageGrid_C::CloseButton' has a wrong offset!");
static_assert(offsetof(UChallengeSetImageGrid_C, CommonRichTextBlock_110) == 0x000628, "Member 'UChallengeSetImageGrid_C::CommonRichTextBlock_110' has a wrong offset!");
static_assert(offsetof(UChallengeSetImageGrid_C, GridBackFill) == 0x000630, "Member 'UChallengeSetImageGrid_C::GridBackFill' has a wrong offset!");
static_assert(offsetof(UChallengeSetImageGrid_C, HeaderBase) == 0x000638, "Member 'UChallengeSetImageGrid_C::HeaderBase' has a wrong offset!");
static_assert(offsetof(UChallengeSetImageGrid_C, HeaderBolt) == 0x000640, "Member 'UChallengeSetImageGrid_C::HeaderBolt' has a wrong offset!");
static_assert(offsetof(UChallengeSetImageGrid_C, NoBattlePassContainer) == 0x000648, "Member 'UChallengeSetImageGrid_C::NoBattlePassContainer' has a wrong offset!");
static_assert(offsetof(UChallengeSetImageGrid_C, NoBattlePassImage) == 0x000650, "Member 'UChallengeSetImageGrid_C::NoBattlePassImage' has a wrong offset!");
static_assert(offsetof(UChallengeSetImageGrid_C, NoBattlePassText) == 0x000658, "Member 'UChallengeSetImageGrid_C::NoBattlePassText' has a wrong offset!");
static_assert(offsetof(UChallengeSetImageGrid_C, SafeZone_0) == 0x000660, "Member 'UChallengeSetImageGrid_C::SafeZone_0' has a wrong offset!");

}

