#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ColorPicker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ColorPicker.ColorPicker_C
// 0x0050 (0x0440 - 0x03F0)
class UColorPicker_C final : public UFortColorPicker
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UColorSwatch_C*                         ColorSwatch;                                       // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UColorSwatch_C*                         ColorSwatch_97;                                    // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UColorSwatch_C*                         ColorSwatch_169;                                   // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UColorSwatch_C*                         ColorSwatch_240;                                   // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_190;                                         // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  Switcher_PickerType;                               // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBox_CustomColor;                                  // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBox_Swatches;                                     // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ColorPicker(int32 EntryPoint);
	void BP_OnSwapColorPickerType(bool bToSwatch);
	void OnSetupColorPicker(EColorPickerType InColorPickerType);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ColorPicker_C">();
	}
	static class UColorPicker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UColorPicker_C>();
	}
};
static_assert(alignof(UColorPicker_C) == 0x000008, "Wrong alignment on UColorPicker_C");
static_assert(sizeof(UColorPicker_C) == 0x000440, "Wrong size on UColorPicker_C");
static_assert(offsetof(UColorPicker_C, UberGraphFrame) == 0x0003F0, "Member 'UColorPicker_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UColorPicker_C, ColorSwatch) == 0x0003F8, "Member 'UColorPicker_C::ColorSwatch' has a wrong offset!");
static_assert(offsetof(UColorPicker_C, ColorSwatch_97) == 0x000400, "Member 'UColorPicker_C::ColorSwatch_97' has a wrong offset!");
static_assert(offsetof(UColorPicker_C, ColorSwatch_169) == 0x000408, "Member 'UColorPicker_C::ColorSwatch_169' has a wrong offset!");
static_assert(offsetof(UColorPicker_C, ColorSwatch_240) == 0x000410, "Member 'UColorPicker_C::ColorSwatch_240' has a wrong offset!");
static_assert(offsetof(UColorPicker_C, Image) == 0x000418, "Member 'UColorPicker_C::Image' has a wrong offset!");
static_assert(offsetof(UColorPicker_C, Image_190) == 0x000420, "Member 'UColorPicker_C::Image_190' has a wrong offset!");
static_assert(offsetof(UColorPicker_C, Switcher_PickerType) == 0x000428, "Member 'UColorPicker_C::Switcher_PickerType' has a wrong offset!");
static_assert(offsetof(UColorPicker_C, VBox_CustomColor) == 0x000430, "Member 'UColorPicker_C::VBox_CustomColor' has a wrong offset!");
static_assert(offsetof(UColorPicker_C, VBox_Swatches) == 0x000438, "Member 'UColorPicker_C::VBox_Swatches' has a wrong offset!");

}

