#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CosmeticLoadoutScreen

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CosmeticLoadoutScreen.CosmeticLoadoutScreen_C
// 0x0028 (0x05C0 - 0x0598)
class UCosmeticLoadoutScreen_C final : public UFortCosmeticLoadoutScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0598(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x05A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       NewPresetDisclaimerText;                           // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Panel;                                             // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       RandomDisclaimertext;                              // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CosmeticLoadoutScreen(int32 EntryPoint);
	void OnPreviewTile(EFortLoadoutCardType CardType);
	void BP_OnActivated();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CosmeticLoadoutScreen_C">();
	}
	static class UCosmeticLoadoutScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCosmeticLoadoutScreen_C>();
	}
};
static_assert(alignof(UCosmeticLoadoutScreen_C) == 0x000008, "Wrong alignment on UCosmeticLoadoutScreen_C");
static_assert(sizeof(UCosmeticLoadoutScreen_C) == 0x0005C0, "Wrong size on UCosmeticLoadoutScreen_C");
static_assert(offsetof(UCosmeticLoadoutScreen_C, UberGraphFrame) == 0x000598, "Member 'UCosmeticLoadoutScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCosmeticLoadoutScreen_C, Intro) == 0x0005A0, "Member 'UCosmeticLoadoutScreen_C::Intro' has a wrong offset!");
static_assert(offsetof(UCosmeticLoadoutScreen_C, NewPresetDisclaimerText) == 0x0005A8, "Member 'UCosmeticLoadoutScreen_C::NewPresetDisclaimerText' has a wrong offset!");
static_assert(offsetof(UCosmeticLoadoutScreen_C, Panel) == 0x0005B0, "Member 'UCosmeticLoadoutScreen_C::Panel' has a wrong offset!");
static_assert(offsetof(UCosmeticLoadoutScreen_C, RandomDisclaimertext) == 0x0005B8, "Member 'UCosmeticLoadoutScreen_C::RandomDisclaimertext' has a wrong offset!");

}

