#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DailyChallengeRerollButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DailyChallengeRerollButton.DailyChallengeRerollButton_C
// 0x0020 (0x0B90 - 0x0B70)
class UDailyChallengeRerollButton_C final : public UCommonButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_Pressed;                                      // 0x0B78(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_Hovered;                                      // 0x0B80(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   RichText_RerollChallenge;                          // 0x0B88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_DailyChallengeRerollButton(int32 EntryPoint);
	void BP_OnClicked();
	void BP_OnUnhovered();
	void BP_OnHovered();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DailyChallengeRerollButton_C">();
	}
	static class UDailyChallengeRerollButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDailyChallengeRerollButton_C>();
	}
};
static_assert(alignof(UDailyChallengeRerollButton_C) == 0x000008, "Wrong alignment on UDailyChallengeRerollButton_C");
static_assert(sizeof(UDailyChallengeRerollButton_C) == 0x000B90, "Wrong size on UDailyChallengeRerollButton_C");
static_assert(offsetof(UDailyChallengeRerollButton_C, UberGraphFrame) == 0x000B70, "Member 'UDailyChallengeRerollButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDailyChallengeRerollButton_C, Anim_Pressed) == 0x000B78, "Member 'UDailyChallengeRerollButton_C::Anim_Pressed' has a wrong offset!");
static_assert(offsetof(UDailyChallengeRerollButton_C, Anim_Hovered) == 0x000B80, "Member 'UDailyChallengeRerollButton_C::Anim_Hovered' has a wrong offset!");
static_assert(offsetof(UDailyChallengeRerollButton_C, RichText_RerollChallenge) == 0x000B88, "Member 'UDailyChallengeRerollButton_C::RichText_RerollChallenge' has a wrong offset!");

}

