#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DonutChallengesTimer

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DonutChallengesTimer.DonutChallengesTimer_C
// 0x0030 (0x0380 - 0x0350)
class UDonutChallengesTimer_C final : public UAthenaChallengeCountdownDisplay
{
public:
	class UImage*                                 Clock;                                             // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         PaddingHB;                                         // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Slashes;                                           // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_TimeRemainingTag;                             // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              TextScale;                                         // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               TransformOvr;                                      // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DonutChallengesTimer_C">();
	}
	static class UDonutChallengesTimer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDonutChallengesTimer_C>();
	}
};
static_assert(alignof(UDonutChallengesTimer_C) == 0x000008, "Wrong alignment on UDonutChallengesTimer_C");
static_assert(sizeof(UDonutChallengesTimer_C) == 0x000380, "Wrong size on UDonutChallengesTimer_C");
static_assert(offsetof(UDonutChallengesTimer_C, Clock) == 0x000350, "Member 'UDonutChallengesTimer_C::Clock' has a wrong offset!");
static_assert(offsetof(UDonutChallengesTimer_C, PaddingHB) == 0x000358, "Member 'UDonutChallengesTimer_C::PaddingHB' has a wrong offset!");
static_assert(offsetof(UDonutChallengesTimer_C, Slashes) == 0x000360, "Member 'UDonutChallengesTimer_C::Slashes' has a wrong offset!");
static_assert(offsetof(UDonutChallengesTimer_C, Text_TimeRemainingTag) == 0x000368, "Member 'UDonutChallengesTimer_C::Text_TimeRemainingTag' has a wrong offset!");
static_assert(offsetof(UDonutChallengesTimer_C, TextScale) == 0x000370, "Member 'UDonutChallengesTimer_C::TextScale' has a wrong offset!");
static_assert(offsetof(UDonutChallengesTimer_C, TransformOvr) == 0x000378, "Member 'UDonutChallengesTimer_C::TransformOvr' has a wrong offset!");

}

