#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Donut_fui_AcquisitionOffer

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function Donut_fui_AcquisitionOffer.Donut_fui_AcquisitionOffer_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct Donut_fui_AcquisitionOffer_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Donut_fui_AcquisitionOffer_C_PreConstruct) == 0x000001, "Wrong alignment on Donut_fui_AcquisitionOffer_C_PreConstruct");
static_assert(sizeof(Donut_fui_AcquisitionOffer_C_PreConstruct) == 0x000001, "Wrong size on Donut_fui_AcquisitionOffer_C_PreConstruct");
static_assert(offsetof(Donut_fui_AcquisitionOffer_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'Donut_fui_AcquisitionOffer_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function Donut_fui_AcquisitionOffer.Donut_fui_AcquisitionOffer_C.ExecuteUbergraph_Donut_fui_AcquisitionOffer
// 0x00A8 (0x00A8 - 0x0000)
struct Donut_fui_AcquisitionOffer_C_ExecuteUbergraph_Donut_fui_AcquisitionOffer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0010(0x0018)()
	bool                                          Temp_bool_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortColorPalette                      CallFunc_BPGetRarityColorPalette_ReturnValue;      // 0x0048(0x0050)(NoDestructor)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_2;         // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_3;         // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Donut_fui_AcquisitionOffer_C_ExecuteUbergraph_Donut_fui_AcquisitionOffer) == 0x000008, "Wrong alignment on Donut_fui_AcquisitionOffer_C_ExecuteUbergraph_Donut_fui_AcquisitionOffer");
static_assert(sizeof(Donut_fui_AcquisitionOffer_C_ExecuteUbergraph_Donut_fui_AcquisitionOffer) == 0x0000A8, "Wrong size on Donut_fui_AcquisitionOffer_C_ExecuteUbergraph_Donut_fui_AcquisitionOffer");
static_assert(offsetof(Donut_fui_AcquisitionOffer_C_ExecuteUbergraph_Donut_fui_AcquisitionOffer, EntryPoint) == 0x000000, "Member 'Donut_fui_AcquisitionOffer_C_ExecuteUbergraph_Donut_fui_AcquisitionOffer::EntryPoint' has a wrong offset!");
static_assert(offsetof(Donut_fui_AcquisitionOffer_C_ExecuteUbergraph_Donut_fui_AcquisitionOffer, Temp_int_Variable) == 0x000004, "Member 'Donut_fui_AcquisitionOffer_C_ExecuteUbergraph_Donut_fui_AcquisitionOffer::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Donut_fui_AcquisitionOffer_C_ExecuteUbergraph_Donut_fui_AcquisitionOffer, K2Node_Event_IsDesignTime) == 0x000008, "Member 'Donut_fui_AcquisitionOffer_C_ExecuteUbergraph_Donut_fui_AcquisitionOffer::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(Donut_fui_AcquisitionOffer_C_ExecuteUbergraph_Donut_fui_AcquisitionOffer, Temp_int_Variable_1) == 0x00000C, "Member 'Donut_fui_AcquisitionOffer_C_ExecuteUbergraph_Donut_fui_AcquisitionOffer::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(Donut_fui_AcquisitionOffer_C_ExecuteUbergraph_Donut_fui_AcquisitionOffer, CallFunc_Conv_IntToText_ReturnValue) == 0x000010, "Member 'Donut_fui_AcquisitionOffer_C_ExecuteUbergraph_Donut_fui_AcquisitionOffer::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Donut_fui_AcquisitionOffer_C_ExecuteUbergraph_Donut_fui_AcquisitionOffer, Temp_bool_Variable) == 0x000028, "Member 'Donut_fui_AcquisitionOffer_C_ExecuteUbergraph_Donut_fui_AcquisitionOffer::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Donut_fui_AcquisitionOffer_C_ExecuteUbergraph_Donut_fui_AcquisitionOffer, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000030, "Member 'Donut_fui_AcquisitionOffer_C_ExecuteUbergraph_Donut_fui_AcquisitionOffer::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(Donut_fui_AcquisitionOffer_C_ExecuteUbergraph_Donut_fui_AcquisitionOffer, K2Node_Select_Default) == 0x000038, "Member 'Donut_fui_AcquisitionOffer_C_ExecuteUbergraph_Donut_fui_AcquisitionOffer::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Donut_fui_AcquisitionOffer_C_ExecuteUbergraph_Donut_fui_AcquisitionOffer, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000040, "Member 'Donut_fui_AcquisitionOffer_C_ExecuteUbergraph_Donut_fui_AcquisitionOffer::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Donut_fui_AcquisitionOffer_C_ExecuteUbergraph_Donut_fui_AcquisitionOffer, CallFunc_BPGetRarityColorPalette_ReturnValue) == 0x000048, "Member 'Donut_fui_AcquisitionOffer_C_ExecuteUbergraph_Donut_fui_AcquisitionOffer::CallFunc_BPGetRarityColorPalette_ReturnValue' has a wrong offset!");
static_assert(offsetof(Donut_fui_AcquisitionOffer_C_ExecuteUbergraph_Donut_fui_AcquisitionOffer, CallFunc_GetDynamicMaterial_ReturnValue_2) == 0x000098, "Member 'Donut_fui_AcquisitionOffer_C_ExecuteUbergraph_Donut_fui_AcquisitionOffer::CallFunc_GetDynamicMaterial_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Donut_fui_AcquisitionOffer_C_ExecuteUbergraph_Donut_fui_AcquisitionOffer, CallFunc_GetDynamicMaterial_ReturnValue_3) == 0x0000A0, "Member 'Donut_fui_AcquisitionOffer_C_ExecuteUbergraph_Donut_fui_AcquisitionOffer::CallFunc_GetDynamicMaterial_ReturnValue_3' has a wrong offset!");

}

