#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Donut_fui_AcquisitionRow

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Donut_fui_AcquisitionRow.Donut_fui_AcquisitionRow_C
// 0x0088 (0x02B8 - 0x0230)
class UDonut_fui_AcquisitionRow_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border_NoCV;                                       // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_NoCV_1;                                     // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_NoCV_2;                                     // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDonut_fui_AcquisitionOffer_C*          Donut_fui_AcquisitionOffer;                        // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDonut_fui_AcquisitionOffer_C*          Donut_fui_AcquisitionOffer_1;                      // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDonut_fui_AcquisitionOffer_C*          Donut_fui_AcquisitionOffer_2;                      // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDonut_fui_AcquisitionOffer_C*          Donut_fui_AcquisitionOffer_271;                    // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDonut_fui_AcquisitionOffer_C*          Donut_fui_AcquisitionOffer_408;                    // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDonut_fui_AcquisitionOffer_C*          Donut_fui_AcquisitionOffer_576;                    // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDonut_fui_AcquisitionOffer_C*          Donut_fui_AcquisitionOffer_659;                    // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDynamicEntryBox*                       EntryBox_OfferEntries;                             // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_TimeRemaining;                                // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_TimeRemaining_1;                              // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          NoOffersBox;                                       // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_EntryBox_Offers;                           // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher_Offers;                                   // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_Donut_fui_AcquisitionRow(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Donut_fui_AcquisitionRow_C">();
	}
	static class UDonut_fui_AcquisitionRow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDonut_fui_AcquisitionRow_C>();
	}
};
static_assert(alignof(UDonut_fui_AcquisitionRow_C) == 0x000008, "Wrong alignment on UDonut_fui_AcquisitionRow_C");
static_assert(sizeof(UDonut_fui_AcquisitionRow_C) == 0x0002B8, "Wrong size on UDonut_fui_AcquisitionRow_C");
static_assert(offsetof(UDonut_fui_AcquisitionRow_C, UberGraphFrame) == 0x000230, "Member 'UDonut_fui_AcquisitionRow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDonut_fui_AcquisitionRow_C, Border_NoCV) == 0x000238, "Member 'UDonut_fui_AcquisitionRow_C::Border_NoCV' has a wrong offset!");
static_assert(offsetof(UDonut_fui_AcquisitionRow_C, Border_NoCV_1) == 0x000240, "Member 'UDonut_fui_AcquisitionRow_C::Border_NoCV_1' has a wrong offset!");
static_assert(offsetof(UDonut_fui_AcquisitionRow_C, Border_NoCV_2) == 0x000248, "Member 'UDonut_fui_AcquisitionRow_C::Border_NoCV_2' has a wrong offset!");
static_assert(offsetof(UDonut_fui_AcquisitionRow_C, Donut_fui_AcquisitionOffer) == 0x000250, "Member 'UDonut_fui_AcquisitionRow_C::Donut_fui_AcquisitionOffer' has a wrong offset!");
static_assert(offsetof(UDonut_fui_AcquisitionRow_C, Donut_fui_AcquisitionOffer_1) == 0x000258, "Member 'UDonut_fui_AcquisitionRow_C::Donut_fui_AcquisitionOffer_1' has a wrong offset!");
static_assert(offsetof(UDonut_fui_AcquisitionRow_C, Donut_fui_AcquisitionOffer_2) == 0x000260, "Member 'UDonut_fui_AcquisitionRow_C::Donut_fui_AcquisitionOffer_2' has a wrong offset!");
static_assert(offsetof(UDonut_fui_AcquisitionRow_C, Donut_fui_AcquisitionOffer_271) == 0x000268, "Member 'UDonut_fui_AcquisitionRow_C::Donut_fui_AcquisitionOffer_271' has a wrong offset!");
static_assert(offsetof(UDonut_fui_AcquisitionRow_C, Donut_fui_AcquisitionOffer_408) == 0x000270, "Member 'UDonut_fui_AcquisitionRow_C::Donut_fui_AcquisitionOffer_408' has a wrong offset!");
static_assert(offsetof(UDonut_fui_AcquisitionRow_C, Donut_fui_AcquisitionOffer_576) == 0x000278, "Member 'UDonut_fui_AcquisitionRow_C::Donut_fui_AcquisitionOffer_576' has a wrong offset!");
static_assert(offsetof(UDonut_fui_AcquisitionRow_C, Donut_fui_AcquisitionOffer_659) == 0x000280, "Member 'UDonut_fui_AcquisitionRow_C::Donut_fui_AcquisitionOffer_659' has a wrong offset!");
static_assert(offsetof(UDonut_fui_AcquisitionRow_C, EntryBox_OfferEntries) == 0x000288, "Member 'UDonut_fui_AcquisitionRow_C::EntryBox_OfferEntries' has a wrong offset!");
static_assert(offsetof(UDonut_fui_AcquisitionRow_C, Icon_TimeRemaining) == 0x000290, "Member 'UDonut_fui_AcquisitionRow_C::Icon_TimeRemaining' has a wrong offset!");
static_assert(offsetof(UDonut_fui_AcquisitionRow_C, Icon_TimeRemaining_1) == 0x000298, "Member 'UDonut_fui_AcquisitionRow_C::Icon_TimeRemaining_1' has a wrong offset!");
static_assert(offsetof(UDonut_fui_AcquisitionRow_C, NoOffersBox) == 0x0002A0, "Member 'UDonut_fui_AcquisitionRow_C::NoOffersBox' has a wrong offset!");
static_assert(offsetof(UDonut_fui_AcquisitionRow_C, Overlay_EntryBox_Offers) == 0x0002A8, "Member 'UDonut_fui_AcquisitionRow_C::Overlay_EntryBox_Offers' has a wrong offset!");
static_assert(offsetof(UDonut_fui_AcquisitionRow_C, Switcher_Offers) == 0x0002B0, "Member 'UDonut_fui_AcquisitionRow_C::Switcher_Offers' has a wrong offset!");

}

