#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_MED_Photographer_FaceAcc_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "ControlRig_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass F_MED_Photographer_FaceAcc_AnimBP.F_MED_Photographer_FaceAcc_AnimBP_C
// 0x1050 (0x1470 - 0x0420)
class UF_MED_Photographer_FaceAcc_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	uint8                                         Pad_418[0x8];                                      // 0x0418(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0420(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0428(0x0030)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x0458(0x0140)(ContainsInstancedReference)
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0x0598(0x0348)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_1;                         // 0x08E0(0x05A0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0E80(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0EA0(0x0020)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x0EC0(0x05A0)()
	bool                                          PhotoTraverse;                                     // 0x1460(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          PhotoTraverseINV;                                  // 0x1461(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_F_MED_Photographer_FaceAcc_AnimBP(int32 EntryPoint);
	void OnParachuteClosed();
	void OnNotifyPartsStopped(class FName Context);
	void OnNotifyPartsStarted(class FName Context);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"F_MED_Photographer_FaceAcc_AnimBP_C">();
	}
	static class UF_MED_Photographer_FaceAcc_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UF_MED_Photographer_FaceAcc_AnimBP_C>();
	}
};
static_assert(alignof(UF_MED_Photographer_FaceAcc_AnimBP_C) == 0x000010, "Wrong alignment on UF_MED_Photographer_FaceAcc_AnimBP_C");
static_assert(sizeof(UF_MED_Photographer_FaceAcc_AnimBP_C) == 0x001470, "Wrong size on UF_MED_Photographer_FaceAcc_AnimBP_C");
static_assert(offsetof(UF_MED_Photographer_FaceAcc_AnimBP_C, UberGraphFrame) == 0x000420, "Member 'UF_MED_Photographer_FaceAcc_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_FaceAcc_AnimBP_C, AnimGraphNode_Root) == 0x000428, "Member 'UF_MED_Photographer_FaceAcc_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_FaceAcc_AnimBP_C, AnimGraphNode_CopyPoseFromMesh) == 0x000458, "Member 'UF_MED_Photographer_FaceAcc_AnimBP_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_FaceAcc_AnimBP_C, AnimGraphNode_ControlRig) == 0x000598, "Member 'UF_MED_Photographer_FaceAcc_AnimBP_C::AnimGraphNode_ControlRig' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_FaceAcc_AnimBP_C, AnimGraphNode_RigidBody_1) == 0x0008E0, "Member 'UF_MED_Photographer_FaceAcc_AnimBP_C::AnimGraphNode_RigidBody_1' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_FaceAcc_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x000E80, "Member 'UF_MED_Photographer_FaceAcc_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_FaceAcc_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x000EA0, "Member 'UF_MED_Photographer_FaceAcc_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_FaceAcc_AnimBP_C, AnimGraphNode_RigidBody) == 0x000EC0, "Member 'UF_MED_Photographer_FaceAcc_AnimBP_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_FaceAcc_AnimBP_C, PhotoTraverse) == 0x001460, "Member 'UF_MED_Photographer_FaceAcc_AnimBP_C::PhotoTraverse' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_FaceAcc_AnimBP_C, PhotoTraverseINV) == 0x001461, "Member 'UF_MED_Photographer_FaceAcc_AnimBP_C::PhotoTraverseINV' has a wrong offset!");

}

