#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_MED_Desert_Ops_Camo_Hair_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function F_MED_Desert_Ops_Camo_Hair_AnimBP.F_MED_Desert_Ops_Camo_Hair_AnimBP_C.ExecuteUbergraph_F_MED_Desert_Ops_Camo_Hair_AnimBP
// 0x00A8 (0x00A8 - 0x0000)
struct F_MED_Desert_Ops_Camo_Hair_AnimBP_C_ExecuteUbergraph_F_MED_Desert_Ops_Camo_Hair_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTag>                   K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TArray<struct FGameplayTag>                   K2Node_MakeArray_Array_1;                          // 0x0018(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_CharacterItemDefinitionHasAnyMetaTag_ReturnValue; // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CharacterItemDefinitionHasAnyMetaTag_ReturnValue_1; // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTag>                   K2Node_MakeArray_Array_2;                          // 0x0030(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_CharacterItemDefinitionHasAnyMetaTag_ReturnValue_2; // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTag>                   K2Node_MakeArray_Array_3;                          // 0x0048(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_CharacterItemDefinitionHasAnyMetaTag_ReturnValue_3; // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTag>                   K2Node_MakeArray_Array_4;                          // 0x0060(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_CharacterItemDefinitionHasAnyMetaTag_ReturnValue_4; // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTag>                   K2Node_MakeArray_Array_5;                          // 0x0078(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_CharacterItemDefinitionHasAnyMetaTag_ReturnValue_5; // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTag>                   K2Node_MakeArray_Array_6;                          // 0x0090(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_CharacterItemDefinitionHasAnyMetaTag_ReturnValue_6; // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(F_MED_Desert_Ops_Camo_Hair_AnimBP_C_ExecuteUbergraph_F_MED_Desert_Ops_Camo_Hair_AnimBP) == 0x000008, "Wrong alignment on F_MED_Desert_Ops_Camo_Hair_AnimBP_C_ExecuteUbergraph_F_MED_Desert_Ops_Camo_Hair_AnimBP");
static_assert(sizeof(F_MED_Desert_Ops_Camo_Hair_AnimBP_C_ExecuteUbergraph_F_MED_Desert_Ops_Camo_Hair_AnimBP) == 0x0000A8, "Wrong size on F_MED_Desert_Ops_Camo_Hair_AnimBP_C_ExecuteUbergraph_F_MED_Desert_Ops_Camo_Hair_AnimBP");
static_assert(offsetof(F_MED_Desert_Ops_Camo_Hair_AnimBP_C_ExecuteUbergraph_F_MED_Desert_Ops_Camo_Hair_AnimBP, EntryPoint) == 0x000000, "Member 'F_MED_Desert_Ops_Camo_Hair_AnimBP_C_ExecuteUbergraph_F_MED_Desert_Ops_Camo_Hair_AnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(F_MED_Desert_Ops_Camo_Hair_AnimBP_C_ExecuteUbergraph_F_MED_Desert_Ops_Camo_Hair_AnimBP, K2Node_MakeArray_Array) == 0x000008, "Member 'F_MED_Desert_Ops_Camo_Hair_AnimBP_C_ExecuteUbergraph_F_MED_Desert_Ops_Camo_Hair_AnimBP::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(F_MED_Desert_Ops_Camo_Hair_AnimBP_C_ExecuteUbergraph_F_MED_Desert_Ops_Camo_Hair_AnimBP, K2Node_MakeArray_Array_1) == 0x000018, "Member 'F_MED_Desert_Ops_Camo_Hair_AnimBP_C_ExecuteUbergraph_F_MED_Desert_Ops_Camo_Hair_AnimBP::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(F_MED_Desert_Ops_Camo_Hair_AnimBP_C_ExecuteUbergraph_F_MED_Desert_Ops_Camo_Hair_AnimBP, CallFunc_CharacterItemDefinitionHasAnyMetaTag_ReturnValue) == 0x000028, "Member 'F_MED_Desert_Ops_Camo_Hair_AnimBP_C_ExecuteUbergraph_F_MED_Desert_Ops_Camo_Hair_AnimBP::CallFunc_CharacterItemDefinitionHasAnyMetaTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(F_MED_Desert_Ops_Camo_Hair_AnimBP_C_ExecuteUbergraph_F_MED_Desert_Ops_Camo_Hair_AnimBP, CallFunc_CharacterItemDefinitionHasAnyMetaTag_ReturnValue_1) == 0x000029, "Member 'F_MED_Desert_Ops_Camo_Hair_AnimBP_C_ExecuteUbergraph_F_MED_Desert_Ops_Camo_Hair_AnimBP::CallFunc_CharacterItemDefinitionHasAnyMetaTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(F_MED_Desert_Ops_Camo_Hair_AnimBP_C_ExecuteUbergraph_F_MED_Desert_Ops_Camo_Hair_AnimBP, K2Node_MakeArray_Array_2) == 0x000030, "Member 'F_MED_Desert_Ops_Camo_Hair_AnimBP_C_ExecuteUbergraph_F_MED_Desert_Ops_Camo_Hair_AnimBP::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(F_MED_Desert_Ops_Camo_Hair_AnimBP_C_ExecuteUbergraph_F_MED_Desert_Ops_Camo_Hair_AnimBP, CallFunc_CharacterItemDefinitionHasAnyMetaTag_ReturnValue_2) == 0x000040, "Member 'F_MED_Desert_Ops_Camo_Hair_AnimBP_C_ExecuteUbergraph_F_MED_Desert_Ops_Camo_Hair_AnimBP::CallFunc_CharacterItemDefinitionHasAnyMetaTag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(F_MED_Desert_Ops_Camo_Hair_AnimBP_C_ExecuteUbergraph_F_MED_Desert_Ops_Camo_Hair_AnimBP, K2Node_MakeArray_Array_3) == 0x000048, "Member 'F_MED_Desert_Ops_Camo_Hair_AnimBP_C_ExecuteUbergraph_F_MED_Desert_Ops_Camo_Hair_AnimBP::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(F_MED_Desert_Ops_Camo_Hair_AnimBP_C_ExecuteUbergraph_F_MED_Desert_Ops_Camo_Hair_AnimBP, CallFunc_CharacterItemDefinitionHasAnyMetaTag_ReturnValue_3) == 0x000058, "Member 'F_MED_Desert_Ops_Camo_Hair_AnimBP_C_ExecuteUbergraph_F_MED_Desert_Ops_Camo_Hair_AnimBP::CallFunc_CharacterItemDefinitionHasAnyMetaTag_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(F_MED_Desert_Ops_Camo_Hair_AnimBP_C_ExecuteUbergraph_F_MED_Desert_Ops_Camo_Hair_AnimBP, K2Node_MakeArray_Array_4) == 0x000060, "Member 'F_MED_Desert_Ops_Camo_Hair_AnimBP_C_ExecuteUbergraph_F_MED_Desert_Ops_Camo_Hair_AnimBP::K2Node_MakeArray_Array_4' has a wrong offset!");
static_assert(offsetof(F_MED_Desert_Ops_Camo_Hair_AnimBP_C_ExecuteUbergraph_F_MED_Desert_Ops_Camo_Hair_AnimBP, CallFunc_CharacterItemDefinitionHasAnyMetaTag_ReturnValue_4) == 0x000070, "Member 'F_MED_Desert_Ops_Camo_Hair_AnimBP_C_ExecuteUbergraph_F_MED_Desert_Ops_Camo_Hair_AnimBP::CallFunc_CharacterItemDefinitionHasAnyMetaTag_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(F_MED_Desert_Ops_Camo_Hair_AnimBP_C_ExecuteUbergraph_F_MED_Desert_Ops_Camo_Hair_AnimBP, K2Node_MakeArray_Array_5) == 0x000078, "Member 'F_MED_Desert_Ops_Camo_Hair_AnimBP_C_ExecuteUbergraph_F_MED_Desert_Ops_Camo_Hair_AnimBP::K2Node_MakeArray_Array_5' has a wrong offset!");
static_assert(offsetof(F_MED_Desert_Ops_Camo_Hair_AnimBP_C_ExecuteUbergraph_F_MED_Desert_Ops_Camo_Hair_AnimBP, CallFunc_CharacterItemDefinitionHasAnyMetaTag_ReturnValue_5) == 0x000088, "Member 'F_MED_Desert_Ops_Camo_Hair_AnimBP_C_ExecuteUbergraph_F_MED_Desert_Ops_Camo_Hair_AnimBP::CallFunc_CharacterItemDefinitionHasAnyMetaTag_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(F_MED_Desert_Ops_Camo_Hair_AnimBP_C_ExecuteUbergraph_F_MED_Desert_Ops_Camo_Hair_AnimBP, K2Node_MakeArray_Array_6) == 0x000090, "Member 'F_MED_Desert_Ops_Camo_Hair_AnimBP_C_ExecuteUbergraph_F_MED_Desert_Ops_Camo_Hair_AnimBP::K2Node_MakeArray_Array_6' has a wrong offset!");
static_assert(offsetof(F_MED_Desert_Ops_Camo_Hair_AnimBP_C_ExecuteUbergraph_F_MED_Desert_Ops_Camo_Hair_AnimBP, CallFunc_CharacterItemDefinitionHasAnyMetaTag_ReturnValue_6) == 0x0000A0, "Member 'F_MED_Desert_Ops_Camo_Hair_AnimBP_C_ExecuteUbergraph_F_MED_Desert_Ops_Camo_Hair_AnimBP::CallFunc_CharacterItemDefinitionHasAnyMetaTag_ReturnValue_6' has a wrong offset!");

// Function F_MED_Desert_Ops_Camo_Hair_AnimBP.F_MED_Desert_Ops_Camo_Hair_AnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct F_MED_Desert_Ops_Camo_Hair_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(F_MED_Desert_Ops_Camo_Hair_AnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on F_MED_Desert_Ops_Camo_Hair_AnimBP_C_AnimGraph");
static_assert(sizeof(F_MED_Desert_Ops_Camo_Hair_AnimBP_C_AnimGraph) == 0x000010, "Wrong size on F_MED_Desert_Ops_Camo_Hair_AnimBP_C_AnimGraph");
static_assert(offsetof(F_MED_Desert_Ops_Camo_Hair_AnimBP_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'F_MED_Desert_Ops_Camo_Hair_AnimBP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

