#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_MED_TNTina_FaceAcc_AnimBp

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function F_MED_TNTina_FaceAcc_AnimBp.F_MED_TNTina_FaceAcc_AnimBp_C.ExecuteUbergraph_F_MED_TNTina_FaceAcc_AnimBp
// 0x0008 (0x0008 - 0x0000)
struct F_MED_TNTina_FaceAcc_AnimBp_C_ExecuteUbergraph_F_MED_TNTina_FaceAcc_AnimBp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(F_MED_TNTina_FaceAcc_AnimBp_C_ExecuteUbergraph_F_MED_TNTina_FaceAcc_AnimBp) == 0x000004, "Wrong alignment on F_MED_TNTina_FaceAcc_AnimBp_C_ExecuteUbergraph_F_MED_TNTina_FaceAcc_AnimBp");
static_assert(sizeof(F_MED_TNTina_FaceAcc_AnimBp_C_ExecuteUbergraph_F_MED_TNTina_FaceAcc_AnimBp) == 0x000008, "Wrong size on F_MED_TNTina_FaceAcc_AnimBp_C_ExecuteUbergraph_F_MED_TNTina_FaceAcc_AnimBp");
static_assert(offsetof(F_MED_TNTina_FaceAcc_AnimBp_C_ExecuteUbergraph_F_MED_TNTina_FaceAcc_AnimBp, EntryPoint) == 0x000000, "Member 'F_MED_TNTina_FaceAcc_AnimBp_C_ExecuteUbergraph_F_MED_TNTina_FaceAcc_AnimBp::EntryPoint' has a wrong offset!");
static_assert(offsetof(F_MED_TNTina_FaceAcc_AnimBp_C_ExecuteUbergraph_F_MED_TNTina_FaceAcc_AnimBp, K2Node_Event_DeltaTimeX) == 0x000004, "Member 'F_MED_TNTina_FaceAcc_AnimBp_C_ExecuteUbergraph_F_MED_TNTina_FaceAcc_AnimBp::K2Node_Event_DeltaTimeX' has a wrong offset!");

// Function F_MED_TNTina_FaceAcc_AnimBp.F_MED_TNTina_FaceAcc_AnimBp_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct F_MED_TNTina_FaceAcc_AnimBp_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(F_MED_TNTina_FaceAcc_AnimBp_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on F_MED_TNTina_FaceAcc_AnimBp_C_BlueprintUpdateAnimation");
static_assert(sizeof(F_MED_TNTina_FaceAcc_AnimBp_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on F_MED_TNTina_FaceAcc_AnimBp_C_BlueprintUpdateAnimation");
static_assert(offsetof(F_MED_TNTina_FaceAcc_AnimBp_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'F_MED_TNTina_FaceAcc_AnimBp_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function F_MED_TNTina_FaceAcc_AnimBp.F_MED_TNTina_FaceAcc_AnimBp_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct F_MED_TNTina_FaceAcc_AnimBp_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(F_MED_TNTina_FaceAcc_AnimBp_C_AnimGraph) == 0x000008, "Wrong alignment on F_MED_TNTina_FaceAcc_AnimBp_C_AnimGraph");
static_assert(sizeof(F_MED_TNTina_FaceAcc_AnimBp_C_AnimGraph) == 0x000010, "Wrong size on F_MED_TNTina_FaceAcc_AnimBp_C_AnimGraph");
static_assert(offsetof(F_MED_TNTina_FaceAcc_AnimBp_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'F_MED_TNTina_FaceAcc_AnimBp_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

