#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_MED_HIS_Ramirez_Head_01_Dyn_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass F_MED_HIS_Ramirez_Head_01_Dyn_AnimBP.F_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C
// 0x23D0 (0x27F0 - 0x0420)
class UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	uint8                                         Pad_418[0x8];                                      // 0x0418(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0420(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0428(0x0030)()
	uint8                                         Pad_458[0x8];                                      // 0x0458(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x0460(0x05A0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_SubInput;                            // 0x0A00(0x0070)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_4;                      // 0x0A70(0x0440)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3;             // 0x0EB0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3;             // 0x0ED0(0x0020)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_3;                      // 0x0EF0(0x0440)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_2;                      // 0x1330(0x0440)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_1;                      // 0x1770(0x0440)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x1BB0(0x00B8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x1C68(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x1C90(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x1D30(0x0028)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x1D58(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x1E60(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x1E80(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x1EA0(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x1F40(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x1F68(0x00B8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x2020(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x2048(0x00A0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x20E8(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x2108(0x0028)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x2130(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x2150(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x2170(0x0020)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics;                        // 0x2190(0x0440)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x25D0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x26D8(0x0108)()
	class USkeletalMeshComponent*                 MeshToCopy;                                        // 0x27E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GetPlayerListUsesCustomCharacterParts;             // 0x27E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Rigids_active;                                     // 0x27E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27EA[0x2];                                     // 0x27EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Head_rot_back;                                     // 0x27EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_F_MED_HIS_Ramirez_Head_01_Dyn_AnimBP(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void BlueprintInitializeAnimation();
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"F_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C">();
	}
	static class UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C>();
	}
};
static_assert(alignof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C) == 0x000010, "Wrong alignment on UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C");
static_assert(sizeof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C) == 0x0027F0, "Wrong size on UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, UberGraphFrame) == 0x000420, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, AnimGraphNode_Root) == 0x000428, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, AnimGraphNode_RigidBody) == 0x000460, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, AnimGraphNode_SubInput) == 0x000A00, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::AnimGraphNode_SubInput' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, AnimGraphNode_AnimDynamics_4) == 0x000A70, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::AnimGraphNode_AnimDynamics_4' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, AnimGraphNode_LocalToComponentSpace_3) == 0x000EB0, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::AnimGraphNode_LocalToComponentSpace_3' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, AnimGraphNode_ComponentToLocalSpace_3) == 0x000ED0, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::AnimGraphNode_ComponentToLocalSpace_3' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, AnimGraphNode_AnimDynamics_3) == 0x000EF0, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::AnimGraphNode_AnimDynamics_3' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, AnimGraphNode_AnimDynamics_2) == 0x001330, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::AnimGraphNode_AnimDynamics_2' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, AnimGraphNode_AnimDynamics_1) == 0x001770, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::AnimGraphNode_AnimDynamics_1' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, AnimGraphNode_SaveCachedPose_1) == 0x001BB0, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::AnimGraphNode_SaveCachedPose_1' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, AnimGraphNode_UseCachedPose_4) == 0x001C68, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::AnimGraphNode_UseCachedPose_4' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, AnimGraphNode_BlendListByBool_2) == 0x001C90, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::AnimGraphNode_BlendListByBool_2' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, AnimGraphNode_UseCachedPose_3) == 0x001D30, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::AnimGraphNode_UseCachedPose_3' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, AnimGraphNode_ModifyBone_2) == 0x001D58, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, AnimGraphNode_LocalToComponentSpace_2) == 0x001E60, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::AnimGraphNode_LocalToComponentSpace_2' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, AnimGraphNode_ComponentToLocalSpace_2) == 0x001E80, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::AnimGraphNode_ComponentToLocalSpace_2' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, AnimGraphNode_BlendListByBool_1) == 0x001EA0, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, AnimGraphNode_UseCachedPose_2) == 0x001F40, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::AnimGraphNode_UseCachedPose_2' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, AnimGraphNode_SaveCachedPose) == 0x001F68, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, AnimGraphNode_UseCachedPose_1) == 0x002020, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, AnimGraphNode_BlendListByBool) == 0x002048, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, AnimGraphNode_LocalToComponentSpace_1) == 0x0020E8, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::AnimGraphNode_LocalToComponentSpace_1' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, AnimGraphNode_UseCachedPose) == 0x002108, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, AnimGraphNode_ComponentToLocalSpace_1) == 0x002130, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::AnimGraphNode_ComponentToLocalSpace_1' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x002150, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x002170, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, AnimGraphNode_AnimDynamics) == 0x002190, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::AnimGraphNode_AnimDynamics' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, AnimGraphNode_ModifyBone_1) == 0x0025D0, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, AnimGraphNode_ModifyBone) == 0x0026D8, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, MeshToCopy) == 0x0027E0, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::MeshToCopy' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, GetPlayerListUsesCustomCharacterParts) == 0x0027E8, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::GetPlayerListUsesCustomCharacterParts' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, Rigids_active) == 0x0027E9, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::Rigids_active' has a wrong offset!");
static_assert(offsetof(UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C, Head_rot_back) == 0x0027EC, "Member 'UF_MED_HIS_Ramirez_Head_01_Dyn_AnimBP_C::Head_rot_back' has a wrong offset!");

}

