#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_MED_TNTina_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass F_MED_TNTina_AnimBP.F_MED_TNTina_AnimBP_C
// 0x26E0 (0x2B00 - 0x0420)
class UF_MED_TNTina_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	uint8                                         Pad_418[0x8];                                      // 0x0418(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0420(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0428(0x0030)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x0458(0x0140)(ContainsInstancedReference)
	uint8                                         Pad_598[0x8];                                      // 0x0598(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_7;                      // 0x05A0(0x0440)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x09E0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0A00(0x0020)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_6;                      // 0x0A20(0x0440)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_2;                        // 0x0E60(0x0108)()
	uint8                                         Pad_F68[0x8];                                      // 0x0F68(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_5;                      // 0x0F70(0x0440)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_4;                      // 0x13B0(0x0440)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_3;                      // 0x17F0(0x0440)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_2;                      // 0x1C30(0x0440)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_1;                        // 0x2070(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint;                          // 0x2178(0x0108)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_1;                      // 0x2280(0x0440)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics;                        // 0x26C0(0x0440)()

public:
	void ExecuteUbergraph_F_MED_TNTina_AnimBP(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"F_MED_TNTina_AnimBP_C">();
	}
	static class UF_MED_TNTina_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UF_MED_TNTina_AnimBP_C>();
	}
};
static_assert(alignof(UF_MED_TNTina_AnimBP_C) == 0x000010, "Wrong alignment on UF_MED_TNTina_AnimBP_C");
static_assert(sizeof(UF_MED_TNTina_AnimBP_C) == 0x002B00, "Wrong size on UF_MED_TNTina_AnimBP_C");
static_assert(offsetof(UF_MED_TNTina_AnimBP_C, UberGraphFrame) == 0x000420, "Member 'UF_MED_TNTina_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UF_MED_TNTina_AnimBP_C, AnimGraphNode_Root) == 0x000428, "Member 'UF_MED_TNTina_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UF_MED_TNTina_AnimBP_C, AnimGraphNode_CopyPoseFromMesh) == 0x000458, "Member 'UF_MED_TNTina_AnimBP_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UF_MED_TNTina_AnimBP_C, AnimGraphNode_AnimDynamics_7) == 0x0005A0, "Member 'UF_MED_TNTina_AnimBP_C::AnimGraphNode_AnimDynamics_7' has a wrong offset!");
static_assert(offsetof(UF_MED_TNTina_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x0009E0, "Member 'UF_MED_TNTina_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_TNTina_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x000A00, "Member 'UF_MED_TNTina_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_TNTina_AnimBP_C, AnimGraphNode_AnimDynamics_6) == 0x000A20, "Member 'UF_MED_TNTina_AnimBP_C::AnimGraphNode_AnimDynamics_6' has a wrong offset!");
static_assert(offsetof(UF_MED_TNTina_AnimBP_C, AnimGraphNode_Constraint_2) == 0x000E60, "Member 'UF_MED_TNTina_AnimBP_C::AnimGraphNode_Constraint_2' has a wrong offset!");
static_assert(offsetof(UF_MED_TNTina_AnimBP_C, AnimGraphNode_AnimDynamics_5) == 0x000F70, "Member 'UF_MED_TNTina_AnimBP_C::AnimGraphNode_AnimDynamics_5' has a wrong offset!");
static_assert(offsetof(UF_MED_TNTina_AnimBP_C, AnimGraphNode_AnimDynamics_4) == 0x0013B0, "Member 'UF_MED_TNTina_AnimBP_C::AnimGraphNode_AnimDynamics_4' has a wrong offset!");
static_assert(offsetof(UF_MED_TNTina_AnimBP_C, AnimGraphNode_AnimDynamics_3) == 0x0017F0, "Member 'UF_MED_TNTina_AnimBP_C::AnimGraphNode_AnimDynamics_3' has a wrong offset!");
static_assert(offsetof(UF_MED_TNTina_AnimBP_C, AnimGraphNode_AnimDynamics_2) == 0x001C30, "Member 'UF_MED_TNTina_AnimBP_C::AnimGraphNode_AnimDynamics_2' has a wrong offset!");
static_assert(offsetof(UF_MED_TNTina_AnimBP_C, AnimGraphNode_Constraint_1) == 0x002070, "Member 'UF_MED_TNTina_AnimBP_C::AnimGraphNode_Constraint_1' has a wrong offset!");
static_assert(offsetof(UF_MED_TNTina_AnimBP_C, AnimGraphNode_Constraint) == 0x002178, "Member 'UF_MED_TNTina_AnimBP_C::AnimGraphNode_Constraint' has a wrong offset!");
static_assert(offsetof(UF_MED_TNTina_AnimBP_C, AnimGraphNode_AnimDynamics_1) == 0x002280, "Member 'UF_MED_TNTina_AnimBP_C::AnimGraphNode_AnimDynamics_1' has a wrong offset!");
static_assert(offsetof(UF_MED_TNTina_AnimBP_C, AnimGraphNode_AnimDynamics) == 0x0026C0, "Member 'UF_MED_TNTina_AnimBP_C::AnimGraphNode_AnimDynamics' has a wrong offset!");

}

