#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_MED_Photographer_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "ControlRig_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass F_MED_Photographer_AnimBP.F_MED_Photographer_AnimBP_C
// 0x3440 (0x3890 - 0x0450)
class UF_MED_Photographer_AnimBP_C final : public UCustomCharacterPartAnimInstance_PhotographerBody
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0450(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	uint8                                         Pad_458[0x8];                                      // 0x0458(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_4;                         // 0x0460(0x05A0)()
	float                                         __CustomProperty_notDancing_1E7D465A42A2EF956A98858DC0EC1B68; // 0x0A00(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __CustomProperty_crouching_1E7D465A42A2EF956A98858DC0EC1B68; // 0x0A04(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0x0A08(0x0348)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_1;                        // 0x0D50(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint;                          // 0x0E58(0x0108)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0F60(0x00A0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x1000(0x00B8)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3;             // 0x10B8(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x10D8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x1100(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3;             // 0x1128(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x1148(0x0020)()
	uint8                                         Pad_1168[0x8];                                     // 0x1168(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_3;                         // 0x1170(0x05A0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x1710(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x1730(0x0020)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_2;                         // 0x1750(0x05A0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x1CF0(0x0020)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_1;                         // 0x1D10(0x05A0)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x22B0(0x0140)(ContainsInstancedReference)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x23F0(0x0030)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_13;                       // 0x2420(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_12;                       // 0x2528(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_11;                       // 0x2630(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_10;                       // 0x2738(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_9;                        // 0x2840(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_8;                        // 0x2948(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x2A50(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x2A70(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_7;                        // 0x2A90(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6;                        // 0x2B98(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x2CA0(0x0108)()
	uint8                                         Pad_2DA8[0x8];                                     // 0x2DA8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x2DB0(0x05A0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x3350(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x3458(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x3560(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x3668(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x3770(0x0108)()
	class USkeletalMeshComponent*                 MeshToCopy_0;                                      // 0x3878(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ParachuteClosed;                                   // 0x3880(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_F_MED_Photographer_AnimBP(int32 EntryPoint);
	void BlueprintInitializeAnimation();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"F_MED_Photographer_AnimBP_C">();
	}
	static class UF_MED_Photographer_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UF_MED_Photographer_AnimBP_C>();
	}
};
static_assert(alignof(UF_MED_Photographer_AnimBP_C) == 0x000010, "Wrong alignment on UF_MED_Photographer_AnimBP_C");
static_assert(sizeof(UF_MED_Photographer_AnimBP_C) == 0x003890, "Wrong size on UF_MED_Photographer_AnimBP_C");
static_assert(offsetof(UF_MED_Photographer_AnimBP_C, UberGraphFrame) == 0x000450, "Member 'UF_MED_Photographer_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_AnimBP_C, AnimGraphNode_RigidBody_4) == 0x000460, "Member 'UF_MED_Photographer_AnimBP_C::AnimGraphNode_RigidBody_4' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_AnimBP_C, __CustomProperty_notDancing_1E7D465A42A2EF956A98858DC0EC1B68) == 0x000A00, "Member 'UF_MED_Photographer_AnimBP_C::__CustomProperty_notDancing_1E7D465A42A2EF956A98858DC0EC1B68' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_AnimBP_C, __CustomProperty_crouching_1E7D465A42A2EF956A98858DC0EC1B68) == 0x000A04, "Member 'UF_MED_Photographer_AnimBP_C::__CustomProperty_crouching_1E7D465A42A2EF956A98858DC0EC1B68' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_AnimBP_C, AnimGraphNode_ControlRig) == 0x000A08, "Member 'UF_MED_Photographer_AnimBP_C::AnimGraphNode_ControlRig' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_AnimBP_C, AnimGraphNode_Constraint_1) == 0x000D50, "Member 'UF_MED_Photographer_AnimBP_C::AnimGraphNode_Constraint_1' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_AnimBP_C, AnimGraphNode_Constraint) == 0x000E58, "Member 'UF_MED_Photographer_AnimBP_C::AnimGraphNode_Constraint' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_AnimBP_C, AnimGraphNode_BlendListByBool) == 0x000F60, "Member 'UF_MED_Photographer_AnimBP_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_AnimBP_C, AnimGraphNode_SaveCachedPose) == 0x001000, "Member 'UF_MED_Photographer_AnimBP_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_AnimBP_C, AnimGraphNode_ComponentToLocalSpace_3) == 0x0010B8, "Member 'UF_MED_Photographer_AnimBP_C::AnimGraphNode_ComponentToLocalSpace_3' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_AnimBP_C, AnimGraphNode_UseCachedPose_1) == 0x0010D8, "Member 'UF_MED_Photographer_AnimBP_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_AnimBP_C, AnimGraphNode_UseCachedPose) == 0x001100, "Member 'UF_MED_Photographer_AnimBP_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_AnimBP_C, AnimGraphNode_LocalToComponentSpace_3) == 0x001128, "Member 'UF_MED_Photographer_AnimBP_C::AnimGraphNode_LocalToComponentSpace_3' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_AnimBP_C, AnimGraphNode_ComponentToLocalSpace_2) == 0x001148, "Member 'UF_MED_Photographer_AnimBP_C::AnimGraphNode_ComponentToLocalSpace_2' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_AnimBP_C, AnimGraphNode_RigidBody_3) == 0x001170, "Member 'UF_MED_Photographer_AnimBP_C::AnimGraphNode_RigidBody_3' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_AnimBP_C, AnimGraphNode_LocalToComponentSpace_2) == 0x001710, "Member 'UF_MED_Photographer_AnimBP_C::AnimGraphNode_LocalToComponentSpace_2' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_AnimBP_C, AnimGraphNode_ComponentToLocalSpace_1) == 0x001730, "Member 'UF_MED_Photographer_AnimBP_C::AnimGraphNode_ComponentToLocalSpace_1' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_AnimBP_C, AnimGraphNode_RigidBody_2) == 0x001750, "Member 'UF_MED_Photographer_AnimBP_C::AnimGraphNode_RigidBody_2' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_AnimBP_C, AnimGraphNode_LocalToComponentSpace_1) == 0x001CF0, "Member 'UF_MED_Photographer_AnimBP_C::AnimGraphNode_LocalToComponentSpace_1' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_AnimBP_C, AnimGraphNode_RigidBody_1) == 0x001D10, "Member 'UF_MED_Photographer_AnimBP_C::AnimGraphNode_RigidBody_1' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_AnimBP_C, AnimGraphNode_CopyPoseFromMesh) == 0x0022B0, "Member 'UF_MED_Photographer_AnimBP_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_AnimBP_C, AnimGraphNode_Root) == 0x0023F0, "Member 'UF_MED_Photographer_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_AnimBP_C, AnimGraphNode_ModifyBone_13) == 0x002420, "Member 'UF_MED_Photographer_AnimBP_C::AnimGraphNode_ModifyBone_13' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_AnimBP_C, AnimGraphNode_ModifyBone_12) == 0x002528, "Member 'UF_MED_Photographer_AnimBP_C::AnimGraphNode_ModifyBone_12' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_AnimBP_C, AnimGraphNode_ModifyBone_11) == 0x002630, "Member 'UF_MED_Photographer_AnimBP_C::AnimGraphNode_ModifyBone_11' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_AnimBP_C, AnimGraphNode_ModifyBone_10) == 0x002738, "Member 'UF_MED_Photographer_AnimBP_C::AnimGraphNode_ModifyBone_10' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_AnimBP_C, AnimGraphNode_ModifyBone_9) == 0x002840, "Member 'UF_MED_Photographer_AnimBP_C::AnimGraphNode_ModifyBone_9' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_AnimBP_C, AnimGraphNode_ModifyBone_8) == 0x002948, "Member 'UF_MED_Photographer_AnimBP_C::AnimGraphNode_ModifyBone_8' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x002A50, "Member 'UF_MED_Photographer_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x002A70, "Member 'UF_MED_Photographer_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_AnimBP_C, AnimGraphNode_ModifyBone_7) == 0x002A90, "Member 'UF_MED_Photographer_AnimBP_C::AnimGraphNode_ModifyBone_7' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_AnimBP_C, AnimGraphNode_ModifyBone_6) == 0x002B98, "Member 'UF_MED_Photographer_AnimBP_C::AnimGraphNode_ModifyBone_6' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_AnimBP_C, AnimGraphNode_ModifyBone_5) == 0x002CA0, "Member 'UF_MED_Photographer_AnimBP_C::AnimGraphNode_ModifyBone_5' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_AnimBP_C, AnimGraphNode_RigidBody) == 0x002DB0, "Member 'UF_MED_Photographer_AnimBP_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_AnimBP_C, AnimGraphNode_ModifyBone_4) == 0x003350, "Member 'UF_MED_Photographer_AnimBP_C::AnimGraphNode_ModifyBone_4' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_AnimBP_C, AnimGraphNode_ModifyBone_3) == 0x003458, "Member 'UF_MED_Photographer_AnimBP_C::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_AnimBP_C, AnimGraphNode_ModifyBone_2) == 0x003560, "Member 'UF_MED_Photographer_AnimBP_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_AnimBP_C, AnimGraphNode_ModifyBone_1) == 0x003668, "Member 'UF_MED_Photographer_AnimBP_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_AnimBP_C, AnimGraphNode_ModifyBone) == 0x003770, "Member 'UF_MED_Photographer_AnimBP_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_AnimBP_C, MeshToCopy_0) == 0x003878, "Member 'UF_MED_Photographer_AnimBP_C::MeshToCopy_0' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_AnimBP_C, ParachuteClosed) == 0x003880, "Member 'UF_MED_Photographer_AnimBP_C::ParachuteClosed' has a wrong offset!");

}

