#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_MED_ASN_Sarah_Head_01_Dyn_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass F_MED_ASN_Sarah_Head_01_Dyn_AnimBP.F_MED_ASN_Sarah_Head_01_Dyn_AnimBP_C
// 0x0840 (0x0C60 - 0x0420)
class UF_MED_ASN_Sarah_Head_01_Dyn_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	uint8                                         Pad_418[0x8];                                      // 0x0418(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0420(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0428(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_SubInput;                            // 0x0448(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x04B8(0x0030)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x04E8(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0508(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x05A8(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x05D0(0x00B8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0688(0x0028)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x06B0(0x05A0)()
	class USkeletalMeshComponent*                 MeshToCopy;                                        // 0x0C50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_F_MED_ASN_Sarah_Head_01_Dyn_AnimBP(int32 EntryPoint);
	void BlueprintInitializeAnimation();
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"F_MED_ASN_Sarah_Head_01_Dyn_AnimBP_C">();
	}
	static class UF_MED_ASN_Sarah_Head_01_Dyn_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UF_MED_ASN_Sarah_Head_01_Dyn_AnimBP_C>();
	}
};
static_assert(alignof(UF_MED_ASN_Sarah_Head_01_Dyn_AnimBP_C) == 0x000010, "Wrong alignment on UF_MED_ASN_Sarah_Head_01_Dyn_AnimBP_C");
static_assert(sizeof(UF_MED_ASN_Sarah_Head_01_Dyn_AnimBP_C) == 0x000C60, "Wrong size on UF_MED_ASN_Sarah_Head_01_Dyn_AnimBP_C");
static_assert(offsetof(UF_MED_ASN_Sarah_Head_01_Dyn_AnimBP_C, UberGraphFrame) == 0x000420, "Member 'UF_MED_ASN_Sarah_Head_01_Dyn_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UF_MED_ASN_Sarah_Head_01_Dyn_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x000428, "Member 'UF_MED_ASN_Sarah_Head_01_Dyn_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_ASN_Sarah_Head_01_Dyn_AnimBP_C, AnimGraphNode_SubInput) == 0x000448, "Member 'UF_MED_ASN_Sarah_Head_01_Dyn_AnimBP_C::AnimGraphNode_SubInput' has a wrong offset!");
static_assert(offsetof(UF_MED_ASN_Sarah_Head_01_Dyn_AnimBP_C, AnimGraphNode_Root) == 0x0004B8, "Member 'UF_MED_ASN_Sarah_Head_01_Dyn_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UF_MED_ASN_Sarah_Head_01_Dyn_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x0004E8, "Member 'UF_MED_ASN_Sarah_Head_01_Dyn_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_ASN_Sarah_Head_01_Dyn_AnimBP_C, AnimGraphNode_BlendListByBool) == 0x000508, "Member 'UF_MED_ASN_Sarah_Head_01_Dyn_AnimBP_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UF_MED_ASN_Sarah_Head_01_Dyn_AnimBP_C, AnimGraphNode_UseCachedPose_1) == 0x0005A8, "Member 'UF_MED_ASN_Sarah_Head_01_Dyn_AnimBP_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UF_MED_ASN_Sarah_Head_01_Dyn_AnimBP_C, AnimGraphNode_SaveCachedPose) == 0x0005D0, "Member 'UF_MED_ASN_Sarah_Head_01_Dyn_AnimBP_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UF_MED_ASN_Sarah_Head_01_Dyn_AnimBP_C, AnimGraphNode_UseCachedPose) == 0x000688, "Member 'UF_MED_ASN_Sarah_Head_01_Dyn_AnimBP_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UF_MED_ASN_Sarah_Head_01_Dyn_AnimBP_C, AnimGraphNode_RigidBody) == 0x0006B0, "Member 'UF_MED_ASN_Sarah_Head_01_Dyn_AnimBP_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(UF_MED_ASN_Sarah_Head_01_Dyn_AnimBP_C, MeshToCopy) == 0x000C50, "Member 'UF_MED_ASN_Sarah_Head_01_Dyn_AnimBP_C::MeshToCopy' has a wrong offset!");

}

