#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FN_NiagaraNotify

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function FN_NiagaraNotify.FN_NiagaraNotify_C.Received_Notify
// 0x01C0 (0x01C0 - 0x0000)
struct FN_NiagaraNotify_C_Received_Notify final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                WaterSurfaceNormal;                                // 0x0014(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                WaterSurfaceLocation;                              // 0x0020(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WaterImmersionDepth;                               // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         WaveParamTextureOffset;                            // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInWater;                                         // 0x0034(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMovementComp_Character*            FortMovementComp;                                  // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerPawn_Athena_C*                   PlayerPawn;                                        // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NiagaraSystem;                                     // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMovementComp_Character*            K2Node_DynamicCast_AsFort_Movement_Comp_Character; // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_VectorToString_ReturnValue;          // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_VectorToString_ReturnValue_1;        // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         K2Node_MakeArray_Array;                            // 0x00E0(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue;            // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_JoinStringArray_ReturnValue;              // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSurfaceSwimming_ReturnValue;            // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortWaterBodyActor*                    CallFunc_GetCurrentWaterBody_ReturnValue;          // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_132[0x6];                                      // 0x0132(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortWaterBodyActor*                    CallFunc_GetCurrentWaterBody_ReturnValue_1;        // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetWaterSurfaceNormal_ReturnValue;        // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetWaterSurfaceLocation_ReturnValue;      // 0x014C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWaterImmersionDepth_ReturnValue;       // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSurfaceSwimming_ReturnValue_1;          // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15D[0x3];                                      // 0x015D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortWaterBodyActor*                    CallFunc_GetCurrentWaterBody_ReturnValue_2;        // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16A[0x6];                                      // 0x016A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue_1;          // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UFXSystemComponent*                     CallFunc_GetSpawnedEffect_ReturnValue;             // 0x0190(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      K2Node_DynamicCast_AsNiagara_Particle_System;      // 0x0198(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena;           // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FN_NiagaraNotify_C_Received_Notify) == 0x000008, "Wrong alignment on FN_NiagaraNotify_C_Received_Notify");
static_assert(sizeof(FN_NiagaraNotify_C_Received_Notify) == 0x0001C0, "Wrong size on FN_NiagaraNotify_C_Received_Notify");
static_assert(offsetof(FN_NiagaraNotify_C_Received_Notify, MeshComp) == 0x000000, "Member 'FN_NiagaraNotify_C_Received_Notify::MeshComp' has a wrong offset!");
static_assert(offsetof(FN_NiagaraNotify_C_Received_Notify, Animation) == 0x000008, "Member 'FN_NiagaraNotify_C_Received_Notify::Animation' has a wrong offset!");
static_assert(offsetof(FN_NiagaraNotify_C_Received_Notify, ReturnValue) == 0x000010, "Member 'FN_NiagaraNotify_C_Received_Notify::ReturnValue' has a wrong offset!");
static_assert(offsetof(FN_NiagaraNotify_C_Received_Notify, WaterSurfaceNormal) == 0x000014, "Member 'FN_NiagaraNotify_C_Received_Notify::WaterSurfaceNormal' has a wrong offset!");
static_assert(offsetof(FN_NiagaraNotify_C_Received_Notify, WaterSurfaceLocation) == 0x000020, "Member 'FN_NiagaraNotify_C_Received_Notify::WaterSurfaceLocation' has a wrong offset!");
static_assert(offsetof(FN_NiagaraNotify_C_Received_Notify, WaterImmersionDepth) == 0x00002C, "Member 'FN_NiagaraNotify_C_Received_Notify::WaterImmersionDepth' has a wrong offset!");
static_assert(offsetof(FN_NiagaraNotify_C_Received_Notify, WaveParamTextureOffset) == 0x000030, "Member 'FN_NiagaraNotify_C_Received_Notify::WaveParamTextureOffset' has a wrong offset!");
static_assert(offsetof(FN_NiagaraNotify_C_Received_Notify, IsInWater) == 0x000034, "Member 'FN_NiagaraNotify_C_Received_Notify::IsInWater' has a wrong offset!");
static_assert(offsetof(FN_NiagaraNotify_C_Received_Notify, FortMovementComp) == 0x000038, "Member 'FN_NiagaraNotify_C_Received_Notify::FortMovementComp' has a wrong offset!");
static_assert(offsetof(FN_NiagaraNotify_C_Received_Notify, PlayerPawn) == 0x000040, "Member 'FN_NiagaraNotify_C_Received_Notify::PlayerPawn' has a wrong offset!");
static_assert(offsetof(FN_NiagaraNotify_C_Received_Notify, NiagaraSystem) == 0x000048, "Member 'FN_NiagaraNotify_C_Received_Notify::NiagaraSystem' has a wrong offset!");
static_assert(offsetof(FN_NiagaraNotify_C_Received_Notify, K2Node_DynamicCast_AsFort_Movement_Comp_Character) == 0x000050, "Member 'FN_NiagaraNotify_C_Received_Notify::K2Node_DynamicCast_AsFort_Movement_Comp_Character' has a wrong offset!");
static_assert(offsetof(FN_NiagaraNotify_C_Received_Notify, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'FN_NiagaraNotify_C_Received_Notify::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(FN_NiagaraNotify_C_Received_Notify, CallFunc_Conv_VectorToString_ReturnValue) == 0x000060, "Member 'FN_NiagaraNotify_C_Received_Notify::CallFunc_Conv_VectorToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(FN_NiagaraNotify_C_Received_Notify, CallFunc_Conv_VectorToString_ReturnValue_1) == 0x000070, "Member 'FN_NiagaraNotify_C_Received_Notify::CallFunc_Conv_VectorToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FN_NiagaraNotify_C_Received_Notify, CallFunc_Concat_StrStr_ReturnValue) == 0x000080, "Member 'FN_NiagaraNotify_C_Received_Notify::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(FN_NiagaraNotify_C_Received_Notify, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000090, "Member 'FN_NiagaraNotify_C_Received_Notify::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FN_NiagaraNotify_C_Received_Notify, CallFunc_Conv_FloatToString_ReturnValue) == 0x0000A0, "Member 'FN_NiagaraNotify_C_Received_Notify::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(FN_NiagaraNotify_C_Received_Notify, CallFunc_Conv_IntToString_ReturnValue) == 0x0000B0, "Member 'FN_NiagaraNotify_C_Received_Notify::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(FN_NiagaraNotify_C_Received_Notify, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0000C0, "Member 'FN_NiagaraNotify_C_Received_Notify::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FN_NiagaraNotify_C_Received_Notify, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0000D0, "Member 'FN_NiagaraNotify_C_Received_Notify::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FN_NiagaraNotify_C_Received_Notify, K2Node_MakeArray_Array) == 0x0000E0, "Member 'FN_NiagaraNotify_C_Received_Notify::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(FN_NiagaraNotify_C_Received_Notify, CallFunc_Conv_BoolToString_ReturnValue) == 0x0000F0, "Member 'FN_NiagaraNotify_C_Received_Notify::CallFunc_Conv_BoolToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(FN_NiagaraNotify_C_Received_Notify, CallFunc_JoinStringArray_ReturnValue) == 0x000100, "Member 'FN_NiagaraNotify_C_Received_Notify::CallFunc_JoinStringArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(FN_NiagaraNotify_C_Received_Notify, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000110, "Member 'FN_NiagaraNotify_C_Received_Notify::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(FN_NiagaraNotify_C_Received_Notify, CallFunc_IsSurfaceSwimming_ReturnValue) == 0x000120, "Member 'FN_NiagaraNotify_C_Received_Notify::CallFunc_IsSurfaceSwimming_ReturnValue' has a wrong offset!");
static_assert(offsetof(FN_NiagaraNotify_C_Received_Notify, CallFunc_GetCurrentWaterBody_ReturnValue) == 0x000128, "Member 'FN_NiagaraNotify_C_Received_Notify::CallFunc_GetCurrentWaterBody_ReturnValue' has a wrong offset!");
static_assert(offsetof(FN_NiagaraNotify_C_Received_Notify, CallFunc_IsValid_ReturnValue) == 0x000130, "Member 'FN_NiagaraNotify_C_Received_Notify::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(FN_NiagaraNotify_C_Received_Notify, CallFunc_BooleanOR_ReturnValue) == 0x000131, "Member 'FN_NiagaraNotify_C_Received_Notify::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(FN_NiagaraNotify_C_Received_Notify, CallFunc_GetCurrentWaterBody_ReturnValue_1) == 0x000138, "Member 'FN_NiagaraNotify_C_Received_Notify::CallFunc_GetCurrentWaterBody_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FN_NiagaraNotify_C_Received_Notify, CallFunc_GetWaterSurfaceNormal_ReturnValue) == 0x000140, "Member 'FN_NiagaraNotify_C_Received_Notify::CallFunc_GetWaterSurfaceNormal_ReturnValue' has a wrong offset!");
static_assert(offsetof(FN_NiagaraNotify_C_Received_Notify, CallFunc_GetWaterSurfaceLocation_ReturnValue) == 0x00014C, "Member 'FN_NiagaraNotify_C_Received_Notify::CallFunc_GetWaterSurfaceLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(FN_NiagaraNotify_C_Received_Notify, CallFunc_GetWaterImmersionDepth_ReturnValue) == 0x000158, "Member 'FN_NiagaraNotify_C_Received_Notify::CallFunc_GetWaterImmersionDepth_ReturnValue' has a wrong offset!");
static_assert(offsetof(FN_NiagaraNotify_C_Received_Notify, CallFunc_IsSurfaceSwimming_ReturnValue_1) == 0x00015C, "Member 'FN_NiagaraNotify_C_Received_Notify::CallFunc_IsSurfaceSwimming_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FN_NiagaraNotify_C_Received_Notify, CallFunc_GetCurrentWaterBody_ReturnValue_2) == 0x000160, "Member 'FN_NiagaraNotify_C_Received_Notify::CallFunc_GetCurrentWaterBody_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FN_NiagaraNotify_C_Received_Notify, CallFunc_IsValid_ReturnValue_1) == 0x000168, "Member 'FN_NiagaraNotify_C_Received_Notify::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FN_NiagaraNotify_C_Received_Notify, CallFunc_BooleanOR_ReturnValue_1) == 0x000169, "Member 'FN_NiagaraNotify_C_Received_Notify::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FN_NiagaraNotify_C_Received_Notify, CallFunc_Conv_BoolToString_ReturnValue_1) == 0x000170, "Member 'FN_NiagaraNotify_C_Received_Notify::CallFunc_Conv_BoolToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FN_NiagaraNotify_C_Received_Notify, CallFunc_Concat_StrStr_ReturnValue_5) == 0x000180, "Member 'FN_NiagaraNotify_C_Received_Notify::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(FN_NiagaraNotify_C_Received_Notify, CallFunc_GetSpawnedEffect_ReturnValue) == 0x000190, "Member 'FN_NiagaraNotify_C_Received_Notify::CallFunc_GetSpawnedEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(FN_NiagaraNotify_C_Received_Notify, K2Node_DynamicCast_AsNiagara_Particle_System) == 0x000198, "Member 'FN_NiagaraNotify_C_Received_Notify::K2Node_DynamicCast_AsNiagara_Particle_System' has a wrong offset!");
static_assert(offsetof(FN_NiagaraNotify_C_Received_Notify, K2Node_DynamicCast_bSuccess_1) == 0x0001A0, "Member 'FN_NiagaraNotify_C_Received_Notify::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(FN_NiagaraNotify_C_Received_Notify, CallFunc_GetOwner_ReturnValue) == 0x0001A8, "Member 'FN_NiagaraNotify_C_Received_Notify::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(FN_NiagaraNotify_C_Received_Notify, K2Node_DynamicCast_AsPlayer_Pawn_Athena) == 0x0001B0, "Member 'FN_NiagaraNotify_C_Received_Notify::K2Node_DynamicCast_AsPlayer_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(FN_NiagaraNotify_C_Received_Notify, K2Node_DynamicCast_bSuccess_2) == 0x0001B8, "Member 'FN_NiagaraNotify_C_Received_Notify::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

}

