#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Frontend_BP12_Room_M_Scripting

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Frontend_BP12_Room_M_Scripting.Frontend_BP12_Room_M_Scripting_C
// 0x0030 (0x0260 - 0x0230)
class AFrontend_BP12_Room_M_Scripting_C final : public AFortLevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortQuestManager*                      QuestManager;                                      // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    ObjectiveStatRow;                                  // 0x0240(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor)
	class APeelyBP12Mannequin_C*                  PeelyBP12Mannequin2_0_ExecuteUbergraph_Frontend_BP12_Room_M_Scripting_RefProperty; // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Frontend_IntertiveCatToy_C*         BP_Frontend_IntertiveCatToy_2_ExecuteUbergraph_Frontend_BP12_Room_M_Scripting_RefProperty; // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Frontend_BP12_Room_M_Scripting(int32 EntryPoint);
	void MakePeelyPeak();
	void ReceiveBeginPlay();
	void OnSuccess_43ED484A4E514CB6169D83955324F3DF();
	void OnIgnored_43ED484A4E514CB6169D83955324F3DF();
	void OnFailure_43ED484A4E514CB6169D83955324F3DF();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Frontend_BP12_Room_M_Scripting_C">();
	}
	static class AFrontend_BP12_Room_M_Scripting_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFrontend_BP12_Room_M_Scripting_C>();
	}
};
static_assert(alignof(AFrontend_BP12_Room_M_Scripting_C) == 0x000008, "Wrong alignment on AFrontend_BP12_Room_M_Scripting_C");
static_assert(sizeof(AFrontend_BP12_Room_M_Scripting_C) == 0x000260, "Wrong size on AFrontend_BP12_Room_M_Scripting_C");
static_assert(offsetof(AFrontend_BP12_Room_M_Scripting_C, UberGraphFrame) == 0x000230, "Member 'AFrontend_BP12_Room_M_Scripting_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AFrontend_BP12_Room_M_Scripting_C, QuestManager) == 0x000238, "Member 'AFrontend_BP12_Room_M_Scripting_C::QuestManager' has a wrong offset!");
static_assert(offsetof(AFrontend_BP12_Room_M_Scripting_C, ObjectiveStatRow) == 0x000240, "Member 'AFrontend_BP12_Room_M_Scripting_C::ObjectiveStatRow' has a wrong offset!");
static_assert(offsetof(AFrontend_BP12_Room_M_Scripting_C, PeelyBP12Mannequin2_0_ExecuteUbergraph_Frontend_BP12_Room_M_Scripting_RefProperty) == 0x000250, "Member 'AFrontend_BP12_Room_M_Scripting_C::PeelyBP12Mannequin2_0_ExecuteUbergraph_Frontend_BP12_Room_M_Scripting_RefProperty' has a wrong offset!");
static_assert(offsetof(AFrontend_BP12_Room_M_Scripting_C, BP_Frontend_IntertiveCatToy_2_ExecuteUbergraph_Frontend_BP12_Room_M_Scripting_RefProperty) == 0x000258, "Member 'AFrontend_BP12_Room_M_Scripting_C::BP_Frontend_IntertiveCatToy_2_ExecuteUbergraph_Frontend_BP12_Room_M_Scripting_RefProperty' has a wrong offset!");

}

