#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_AppleSun_RemoveFX

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Athena_AppleSun_RemoveFX.GA_Athena_AppleSun_RemoveFX_C
// 0x0028 (0x0A58 - 0x0A30)
class UGA_Athena_AppleSun_RemoveFX_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A30(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0A38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Looping_GC;                                        // 0x0A40(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Player_Landing_GC;                                 // 0x0A48(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           VehicleOnGroundTimer;                              // 0x0A50(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Athena_AppleSun_RemoveFX(int32 EntryPoint);
	void Remove();
	void VehicleLandedCheck();
	void K2_ActivateAbility();
	void OnChange_E50882E9463BCB5DDE04EE8407D66091(EMovementMode NewMovementMode);
	void OnChange_3DD8539A4FF5097BAD1292AD341357CA(EMovementMode NewMovementMode);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Athena_AppleSun_RemoveFX_C">();
	}
	static class UGA_Athena_AppleSun_RemoveFX_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_AppleSun_RemoveFX_C>();
	}
};
static_assert(alignof(UGA_Athena_AppleSun_RemoveFX_C) == 0x000008, "Wrong alignment on UGA_Athena_AppleSun_RemoveFX_C");
static_assert(sizeof(UGA_Athena_AppleSun_RemoveFX_C) == 0x000A58, "Wrong size on UGA_Athena_AppleSun_RemoveFX_C");
static_assert(offsetof(UGA_Athena_AppleSun_RemoveFX_C, UberGraphFrame) == 0x000A30, "Member 'UGA_Athena_AppleSun_RemoveFX_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Athena_AppleSun_RemoveFX_C, PlayerPawn) == 0x000A38, "Member 'UGA_Athena_AppleSun_RemoveFX_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(UGA_Athena_AppleSun_RemoveFX_C, Looping_GC) == 0x000A40, "Member 'UGA_Athena_AppleSun_RemoveFX_C::Looping_GC' has a wrong offset!");
static_assert(offsetof(UGA_Athena_AppleSun_RemoveFX_C, Player_Landing_GC) == 0x000A48, "Member 'UGA_Athena_AppleSun_RemoveFX_C::Player_Landing_GC' has a wrong offset!");
static_assert(offsetof(UGA_Athena_AppleSun_RemoveFX_C, VehicleOnGroundTimer) == 0x000A50, "Member 'UGA_Athena_AppleSun_RemoveFX_C::VehicleOnGroundTimer' has a wrong offset!");

}

