#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_C4_Passive

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Athena_C4_Passive.GA_Athena_C4_Passive_C.ExecuteUbergraph_GA_Athena_C4_Passive
// 0x01E0 (0x01E0 - 0x0000)
struct GA_Athena_C4_Passive_C_ExecuteUbergraph_GA_Athena_C4_Passive final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_Payload;                        // 0x0008(0x00B0)()
	struct FGameplayEventData                     Temp_struct_Variable;                              // 0x00B8(0x00B0)()
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue;            // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetTrackedGroupedActors_ReturnValue;      // 0x0178(0x0010)(ZeroConstructor, ReferenceParm)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A2[0x6];                                      // 0x01A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x3];                                      // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate;              // 0x01BC(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_K2_GetItemQuantityOnPlayer_ReturnValue;   // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x3];                                      // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_K2_RemoveItemFromPlayer_ReturnValue;      // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Athena_C4_Passive_C_ExecuteUbergraph_GA_Athena_C4_Passive) == 0x000008, "Wrong alignment on GA_Athena_C4_Passive_C_ExecuteUbergraph_GA_Athena_C4_Passive");
static_assert(sizeof(GA_Athena_C4_Passive_C_ExecuteUbergraph_GA_Athena_C4_Passive) == 0x0001E0, "Wrong size on GA_Athena_C4_Passive_C_ExecuteUbergraph_GA_Athena_C4_Passive");
static_assert(offsetof(GA_Athena_C4_Passive_C_ExecuteUbergraph_GA_Athena_C4_Passive, EntryPoint) == 0x000000, "Member 'GA_Athena_C4_Passive_C_ExecuteUbergraph_GA_Athena_C4_Passive::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_Passive_C_ExecuteUbergraph_GA_Athena_C4_Passive, K2Node_CustomEvent_Payload) == 0x000008, "Member 'GA_Athena_C4_Passive_C_ExecuteUbergraph_GA_Athena_C4_Passive::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_Passive_C_ExecuteUbergraph_GA_Athena_C4_Passive, Temp_struct_Variable) == 0x0000B8, "Member 'GA_Athena_C4_Passive_C_ExecuteUbergraph_GA_Athena_C4_Passive::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_Passive_C_ExecuteUbergraph_GA_Athena_C4_Passive, CallFunc_WaitGameplayEvent_ReturnValue) == 0x000168, "Member 'GA_Athena_C4_Passive_C_ExecuteUbergraph_GA_Athena_C4_Passive::CallFunc_WaitGameplayEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_Passive_C_ExecuteUbergraph_GA_Athena_C4_Passive, CallFunc_IsValid_ReturnValue) == 0x000170, "Member 'GA_Athena_C4_Passive_C_ExecuteUbergraph_GA_Athena_C4_Passive::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_Passive_C_ExecuteUbergraph_GA_Athena_C4_Passive, CallFunc_GetTrackedGroupedActors_ReturnValue) == 0x000178, "Member 'GA_Athena_C4_Passive_C_ExecuteUbergraph_GA_Athena_C4_Passive::CallFunc_GetTrackedGroupedActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_Passive_C_ExecuteUbergraph_GA_Athena_C4_Passive, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000188, "Member 'GA_Athena_C4_Passive_C_ExecuteUbergraph_GA_Athena_C4_Passive::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_Passive_C_ExecuteUbergraph_GA_Athena_C4_Passive, CallFunc_Array_Length_ReturnValue) == 0x000190, "Member 'GA_Athena_C4_Passive_C_ExecuteUbergraph_GA_Athena_C4_Passive::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_Passive_C_ExecuteUbergraph_GA_Athena_C4_Passive, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000198, "Member 'GA_Athena_C4_Passive_C_ExecuteUbergraph_GA_Athena_C4_Passive::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_Passive_C_ExecuteUbergraph_GA_Athena_C4_Passive, K2Node_DynamicCast_bSuccess) == 0x0001A0, "Member 'GA_Athena_C4_Passive_C_ExecuteUbergraph_GA_Athena_C4_Passive::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_Passive_C_ExecuteUbergraph_GA_Athena_C4_Passive, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0001A1, "Member 'GA_Athena_C4_Passive_C_ExecuteUbergraph_GA_Athena_C4_Passive::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_Passive_C_ExecuteUbergraph_GA_Athena_C4_Passive, CallFunc_GetController_ReturnValue) == 0x0001A8, "Member 'GA_Athena_C4_Passive_C_ExecuteUbergraph_GA_Athena_C4_Passive::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_Passive_C_ExecuteUbergraph_GA_Athena_C4_Passive, K2Node_DynamicCast_AsFort_Player_Controller) == 0x0001B0, "Member 'GA_Athena_C4_Passive_C_ExecuteUbergraph_GA_Athena_C4_Passive::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_Passive_C_ExecuteUbergraph_GA_Athena_C4_Passive, K2Node_DynamicCast_bSuccess_1) == 0x0001B8, "Member 'GA_Athena_C4_Passive_C_ExecuteUbergraph_GA_Athena_C4_Passive::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_Passive_C_ExecuteUbergraph_GA_Athena_C4_Passive, K2Node_CreateDelegate_OutputDelegate) == 0x0001BC, "Member 'GA_Athena_C4_Passive_C_ExecuteUbergraph_GA_Athena_C4_Passive::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_Passive_C_ExecuteUbergraph_GA_Athena_C4_Passive, CallFunc_K2_GetItemQuantityOnPlayer_ReturnValue) == 0x0001CC, "Member 'GA_Athena_C4_Passive_C_ExecuteUbergraph_GA_Athena_C4_Passive::CallFunc_K2_GetItemQuantityOnPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_Passive_C_ExecuteUbergraph_GA_Athena_C4_Passive, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0001D0, "Member 'GA_Athena_C4_Passive_C_ExecuteUbergraph_GA_Athena_C4_Passive::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_Passive_C_ExecuteUbergraph_GA_Athena_C4_Passive, CallFunc_K2_RemoveItemFromPlayer_ReturnValue) == 0x0001D4, "Member 'GA_Athena_C4_Passive_C_ExecuteUbergraph_GA_Athena_C4_Passive::CallFunc_K2_RemoveItemFromPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_C4_Passive_C_ExecuteUbergraph_GA_Athena_C4_Passive, CallFunc_K2_CommitAbility_ReturnValue) == 0x0001D8, "Member 'GA_Athena_C4_Passive_C_ExecuteUbergraph_GA_Athena_C4_Passive::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");

// Function GA_Athena_C4_Passive.GA_Athena_C4_Passive_C.EventReceived_66DB263A44E303CAE6B174AFF4094381
// 0x00B0 (0x00B0 - 0x0000)
struct GA_Athena_C4_Passive_C_EventReceived_66DB263A44E303CAE6B174AFF4094381 final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Athena_C4_Passive_C_EventReceived_66DB263A44E303CAE6B174AFF4094381) == 0x000008, "Wrong alignment on GA_Athena_C4_Passive_C_EventReceived_66DB263A44E303CAE6B174AFF4094381");
static_assert(sizeof(GA_Athena_C4_Passive_C_EventReceived_66DB263A44E303CAE6B174AFF4094381) == 0x0000B0, "Wrong size on GA_Athena_C4_Passive_C_EventReceived_66DB263A44E303CAE6B174AFF4094381");
static_assert(offsetof(GA_Athena_C4_Passive_C_EventReceived_66DB263A44E303CAE6B174AFF4094381, Payload) == 0x000000, "Member 'GA_Athena_C4_Passive_C_EventReceived_66DB263A44E303CAE6B174AFF4094381::Payload' has a wrong offset!");

}

