#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_Throw_SneakySnowmanV2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GA_ThrowConsumable_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Athena_Throw_SneakySnowmanV2.GA_Athena_Throw_SneakySnowmanV2_C
// 0x00A0 (0x0E40 - 0x0DA0)
class UGA_Athena_Throw_SneakySnowmanV2_C : public UGA_ThrowConsumable_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Athena_Throw_SneakySnowmanV2_C;  // 0x0DA0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTag                           TrackSnowmenTag;                                   // 0x0DA8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class AFortProjectileBase*>            SnowmenActors;                                     // 0x0DB0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)
	TSoftClassPtr<class UClass>                   GolfCartSoftClass;                                 // 0x0DC0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UFortWorldItemDefinition*               SnowmanItemDef;                                    // 0x0DE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UFortItem*>                      SnowmanItemInstances;                              // 0x0DF0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	struct FGameplayAttribute                     Attribute;                                         // 0x0E00(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UClass*                                 AttributeCostGE;                                   // 0x0E38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Athena_Throw_SneakySnowmanV2(int32 EntryPoint);
	void K2_CommitExecute();
	void K2_ActivateAbility();

	void SpawnLocationAndRotation(struct FVector* OutLoc, struct FRotator* OutRot) const;
	bool K2_CanActivateAbility(const struct FGameplayAbilityActorInfo& ActorInfo, struct FGameplayTagContainer* RelevantTags) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Athena_Throw_SneakySnowmanV2_C">();
	}
	static class UGA_Athena_Throw_SneakySnowmanV2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_Throw_SneakySnowmanV2_C>();
	}
};
static_assert(alignof(UGA_Athena_Throw_SneakySnowmanV2_C) == 0x000008, "Wrong alignment on UGA_Athena_Throw_SneakySnowmanV2_C");
static_assert(sizeof(UGA_Athena_Throw_SneakySnowmanV2_C) == 0x000E40, "Wrong size on UGA_Athena_Throw_SneakySnowmanV2_C");
static_assert(offsetof(UGA_Athena_Throw_SneakySnowmanV2_C, UberGraphFrame_GA_Athena_Throw_SneakySnowmanV2_C) == 0x000DA0, "Member 'UGA_Athena_Throw_SneakySnowmanV2_C::UberGraphFrame_GA_Athena_Throw_SneakySnowmanV2_C' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Throw_SneakySnowmanV2_C, TrackSnowmenTag) == 0x000DA8, "Member 'UGA_Athena_Throw_SneakySnowmanV2_C::TrackSnowmenTag' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Throw_SneakySnowmanV2_C, SnowmenActors) == 0x000DB0, "Member 'UGA_Athena_Throw_SneakySnowmanV2_C::SnowmenActors' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Throw_SneakySnowmanV2_C, GolfCartSoftClass) == 0x000DC0, "Member 'UGA_Athena_Throw_SneakySnowmanV2_C::GolfCartSoftClass' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Throw_SneakySnowmanV2_C, SnowmanItemDef) == 0x000DE8, "Member 'UGA_Athena_Throw_SneakySnowmanV2_C::SnowmanItemDef' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Throw_SneakySnowmanV2_C, SnowmanItemInstances) == 0x000DF0, "Member 'UGA_Athena_Throw_SneakySnowmanV2_C::SnowmanItemInstances' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Throw_SneakySnowmanV2_C, Attribute) == 0x000E00, "Member 'UGA_Athena_Throw_SneakySnowmanV2_C::Attribute' has a wrong offset!");
static_assert(offsetof(UGA_Athena_Throw_SneakySnowmanV2_C, AttributeCostGE) == 0x000E38, "Member 'UGA_Athena_Throw_SneakySnowmanV2_C::AttributeCostGE' has a wrong offset!");

}

