#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_HidingProp_Hide

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Athena_HidingProp_Hide.GA_Athena_HidingProp_Hide_C
// 0x0178 (0x0BA8 - 0x0A30)
class UGA_Athena_HidingProp_Hide_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A30(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0A38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_HidingProp_C*                        HidingProp;                                        // 0x0A40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Enter_Anim_Montage;                                // 0x0A48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           RustleCue;                                         // 0x0A50(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GC_Wobble;                                         // 0x0A58(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Exit_Anim_Montage;                                 // 0x0A60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         ExitBlockShootDelay;                               // 0x0A68(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRotator                               ControlRotation;                                   // 0x0A88(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A94[0x4];                                      // 0x0A94(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraModifier*                        CameraModifier;                                    // 0x0A98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  TC_Quest;                                          // 0x0AA0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  TC_PlayerOwned;                                    // 0x0AC0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         RustleMinDelay;                                    // 0x0AE0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         RustleMaxDelay;                                    // 0x0B00(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         RustlePerWobble;                                   // 0x0B20(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AFortPlayerController*                  PlayerController;                                  // 0x0B40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             NewEventDispatcher_0;                              // 0x0B48(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<struct FGameplayTag>                   BlockExitTags;                                     // 0x0B58(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	struct FGameplayTagContainer                  HidingInPropTag;                                   // 0x0B68(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  GettingInPropTag;                                  // 0x0B88(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void NewEventDispatcher_0__DelegateSignature();
	void ExecuteUbergraph_GA_Athena_HidingProp_Hide(int32 EntryPoint);
	void End();
	void RustleLoop();
	void K2_OnEndAbility(bool bWasCancelled);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void Added_CD24BC554E955808A88A5B809807A94E();
	void Added_35C56E354FE08855A837E0BDFB150F20();
	void Added_F049BFC743FE176042ECD98641AFE2B9();
	void OnTimedOut_8010F4C64221E8F497C6559558420C32();
	void OnTimedOutAndDestinationReached_8010F4C64221E8F497C6559558420C32();
	void OnTimedOut_859E251740F1C46B914344A9FC343B19();
	void OnTimedOutAndDestinationReached_859E251740F1C46B914344A9FC343B19();
	void Triggered_75B60D4B43DAA553E4C21EA3D2E3AD03(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Cancelled_75B60D4B43DAA553E4C21EA3D2E3AD03(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Completed_75B60D4B43DAA553E4C21EA3D2E3AD03(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Athena_HidingProp_Hide_C">();
	}
	static class UGA_Athena_HidingProp_Hide_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Athena_HidingProp_Hide_C>();
	}
};
static_assert(alignof(UGA_Athena_HidingProp_Hide_C) == 0x000008, "Wrong alignment on UGA_Athena_HidingProp_Hide_C");
static_assert(sizeof(UGA_Athena_HidingProp_Hide_C) == 0x000BA8, "Wrong size on UGA_Athena_HidingProp_Hide_C");
static_assert(offsetof(UGA_Athena_HidingProp_Hide_C, UberGraphFrame) == 0x000A30, "Member 'UGA_Athena_HidingProp_Hide_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HidingProp_Hide_C, PlayerPawn) == 0x000A38, "Member 'UGA_Athena_HidingProp_Hide_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HidingProp_Hide_C, HidingProp) == 0x000A40, "Member 'UGA_Athena_HidingProp_Hide_C::HidingProp' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HidingProp_Hide_C, Enter_Anim_Montage) == 0x000A48, "Member 'UGA_Athena_HidingProp_Hide_C::Enter_Anim_Montage' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HidingProp_Hide_C, RustleCue) == 0x000A50, "Member 'UGA_Athena_HidingProp_Hide_C::RustleCue' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HidingProp_Hide_C, GC_Wobble) == 0x000A58, "Member 'UGA_Athena_HidingProp_Hide_C::GC_Wobble' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HidingProp_Hide_C, Exit_Anim_Montage) == 0x000A60, "Member 'UGA_Athena_HidingProp_Hide_C::Exit_Anim_Montage' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HidingProp_Hide_C, ExitBlockShootDelay) == 0x000A68, "Member 'UGA_Athena_HidingProp_Hide_C::ExitBlockShootDelay' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HidingProp_Hide_C, ControlRotation) == 0x000A88, "Member 'UGA_Athena_HidingProp_Hide_C::ControlRotation' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HidingProp_Hide_C, CameraModifier) == 0x000A98, "Member 'UGA_Athena_HidingProp_Hide_C::CameraModifier' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HidingProp_Hide_C, TC_Quest) == 0x000AA0, "Member 'UGA_Athena_HidingProp_Hide_C::TC_Quest' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HidingProp_Hide_C, TC_PlayerOwned) == 0x000AC0, "Member 'UGA_Athena_HidingProp_Hide_C::TC_PlayerOwned' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HidingProp_Hide_C, RustleMinDelay) == 0x000AE0, "Member 'UGA_Athena_HidingProp_Hide_C::RustleMinDelay' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HidingProp_Hide_C, RustleMaxDelay) == 0x000B00, "Member 'UGA_Athena_HidingProp_Hide_C::RustleMaxDelay' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HidingProp_Hide_C, RustlePerWobble) == 0x000B20, "Member 'UGA_Athena_HidingProp_Hide_C::RustlePerWobble' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HidingProp_Hide_C, PlayerController) == 0x000B40, "Member 'UGA_Athena_HidingProp_Hide_C::PlayerController' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HidingProp_Hide_C, NewEventDispatcher_0) == 0x000B48, "Member 'UGA_Athena_HidingProp_Hide_C::NewEventDispatcher_0' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HidingProp_Hide_C, BlockExitTags) == 0x000B58, "Member 'UGA_Athena_HidingProp_Hide_C::BlockExitTags' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HidingProp_Hide_C, HidingInPropTag) == 0x000B68, "Member 'UGA_Athena_HidingProp_Hide_C::HidingInPropTag' has a wrong offset!");
static_assert(offsetof(UGA_Athena_HidingProp_Hide_C, GettingInPropTag) == 0x000B88, "Member 'UGA_Athena_HidingProp_Hide_C::GettingInPropTag' has a wrong offset!");

}

