#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_Apply_SneakySnowmanV2

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GA_Athena_Apply_SneakySnowmanV2.GA_Athena_Apply_SneakySnowmanV2_C.ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2
// 0x0B50 (0x0B50 - 0x0000)
struct GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_1;                   // 0x0018(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_1;               // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData;                     // 0x0058(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag;                 // 0x0080(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0088(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0098(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable_1;                            // 0x00A0(0x0028)()
	struct FGameplayEventData                     K2Node_CustomEvent_Payload_1;                      // 0x00C8(0x00B0)()
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0178(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayEventData                     Temp_struct_Variable_2;                            // 0x0188(0x00B0)()
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue;            // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortWeapon*                            K2Node_DynamicCast_AsFort_Weapon;                  // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AB_SneakySnowmanV2_Athena_C*            K2Node_DynamicCast_AsB_Sneaky_Snowman_V2_Athena;   // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortWeaponItemDefinition*              CallFunc_GetWeaponData_ReturnValue;                // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0270(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_Payload;                        // 0x0288(0x00B0)()
	struct FGameplayEventData                     Temp_struct_Variable_3;                            // 0x0338(0x00B0)()
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue_1;          // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F1[0x7];                                      // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_5;                   // 0x03F8(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_5;               // 0x0420(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0428(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_2;                   // 0x0438(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_2;               // 0x0460(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0468(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x046C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46D[0x3];                                      // 0x046D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x0470(0x0010)(ZeroConstructor, NoDestructor)
	class UFortAbilityTask_PlayMontageWaitTarget* CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue; // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0488(0x00B8)(ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0540(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_541[0x3];                                      // 0x0541(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0544(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x054C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x054D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_54E[0x2];                                      // 0x054E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0550(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortAthenaAIBotController*             K2Node_DynamicCast_AsFort_Athena_AIBot_Controller; // 0x0558(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0560(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_561[0x7];                                      // 0x0561(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0568(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0570(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_571[0x3];                                      // 0x0571(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0574(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0578(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57C[0x4];                                      // 0x057C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0580(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x05B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x05BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x05C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x05D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x05E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E1[0x7];                                      // 0x05E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilityTask_PlayMontageWaitTarget* CallFunc_PlayMontageWaitTarget_ReturnValue;        // 0x05E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPlayLength_ReturnValue;                // 0x05F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x05F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x05F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x05F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5FA[0x6];                                      // 0x05FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x0600(0x0040)(ContainsInstancedReference)
	struct FGameplayEffectContextHandle           CallFunc_GetGrantedByEffectContext_ReturnValue;    // 0x0640(0x0018)()
	struct FGameplayEffectContextHandle           CallFunc_GetGrantedByEffectContext_ReturnValue_1;  // 0x0658(0x0018)()
	class AActor*                                 CallFunc_EffectContextGetEffectCauser_ReturnValue; // 0x0670(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_EffectContextGetEffectCauser_ReturnValue_1; // 0x0678(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAthena_IGiveSneakySnowman_C> K2Node_DynamicCast_AsAthena_IGive_Sneaky_Snowman;  // 0x0680(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0690(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_691[0x7];                                      // 0x0691(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IAthena_IGiveSneakySnowman_C> K2Node_DynamicCast_AsAthena_IGive_Sneaky_Snowman_1; // 0x0698(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x06A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A9[0x7];                                      // 0x06A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetNewSnowmanTransform_Transform;         // 0x06B0(0x0030)(IsPlainOldData, NoDestructor)
	class AAthena_Prop_SneakySnowmanV2_C*         K2Node_DynamicCast_AsAthena_Prop_Sneaky_Snowman_V2; // 0x06E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x06E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E9[0x7];                                      // 0x06E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           CallFunc_GetGrantedByEffectContext_ReturnValue_2;  // 0x06F0(0x0018)()
	class AActor*                                 CallFunc_EffectContextGetEffectCauser_ReturnValue_2; // 0x0708(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAthena_IGiveSneakySnowman_C> K2Node_DynamicCast_AsAthena_IGive_Sneaky_Snowman_2; // 0x0710(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0720(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_721[0x7];                                      // 0x0721(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IAthena_IGiveSneakySnowman_C> K2Node_DynamicCast_AsAthena_IGive_Sneaky_Snowman_3; // 0x0728(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0738(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_739[0x7];                                      // 0x0739(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IAthena_IGiveSneakySnowman_C> K2Node_DynamicCast_AsAthena_IGive_Sneaky_Snowman_4; // 0x0740(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0750(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0751(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_752[0x6];                                      // 0x0752(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItem*                              CallFunc_Array_Get_Item;                           // 0x0758(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_K2_RemoveItemFromPlayer_ReturnValue;      // 0x0760(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumInStack_ReturnValue;                // 0x0764(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0768(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x076C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x076D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76E[0x2];                                      // 0x076E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue_1;              // 0x0770(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0778(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_779[0x7];                                      // 0x0779(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller_1;     // 0x0780(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x0788(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_789[0x3];                                      // 0x0789(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_K2_RemoveFortItemFromPlayer_ReturnValue;  // 0x078C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue_1;               // 0x0790(0x0040)(ContainsInstancedReference)
	bool                                          Temp_bool_Variable_2;                              // 0x07D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D1[0x7];                                      // 0x07D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x07D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x07E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E1[0x7];                                      // 0x07E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x07E8(0x0028)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0810(0x0010)(ZeroConstructor, ReferenceParm)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable_4;                            // 0x0820(0x0028)()
	struct FGameplayTag                           Temp_struct_Variable_5;                            // 0x0848(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AAthena_Player_SneakySnowmanV2_C*       K2Node_CustomEvent_PlayerSnowman_1;                // 0x0850(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorRelativeRotation_SweepHitResult; // 0x0858(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x08E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x08F0(0x0030)(IsPlainOldData, NoDestructor)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_3;                   // 0x0920(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_3;               // 0x0948(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0950(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0954(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_3;                              // 0x0955(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select_Default;                             // 0x0956(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0957(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData;               // 0x0958(0x00B0)()
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0A08(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0A10(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAthena_Player_SneakySnowmanV2_C*       CallFunc_FinishSpawningActor_ReturnValue;          // 0x0A18(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAthena_Player_SneakySnowmanV2_C*       CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0A20(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x0A28(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayEffectContextHandle           CallFunc_GetGrantedByEffectContext_ReturnValue_3;  // 0x0A38(0x0018)()
	class AAthena_Player_CoolCarpet_C*            K2Node_DynamicCast_AsAthena_Player_Cool_Carpet;    // 0x0A50(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_12;                    // 0x0A58(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A59[0x7];                                      // 0x0A59(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_EffectContextGetEffectCauser_ReturnValue_3; // 0x0A60(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAthena_IGiveSneakySnowman_C> K2Node_DynamicCast_AsAthena_IGive_Sneaky_Snowman_5; // 0x0A68(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_13;                    // 0x0A78(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A79[0x3];                                      // 0x0A79(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetMaterialInt_MatInt;                    // 0x0A7C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomInteger_ReturnValue;                // 0x0A80(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A84[0x4];                                      // 0x0A84(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAthena_Player_SneakySnowmanV2_C*       K2Node_CustomEvent_PlayerSnowman;                  // 0x0A88(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue_1;           // 0x0A90(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A91[0x7];                                      // 0x0A91(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AB_SneakySnowmanV2_Athena_C*            K2Node_DynamicCast_AsB_Sneaky_Snowman_V2_Athena_1; // 0x0A98(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_14;                    // 0x0AA0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AA1[0x7];                                      // 0x0AA1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortWeaponItemDefinition*              CallFunc_GetWeaponData_ReturnValue_1;              // 0x0AA8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue_1;                     // 0x0AB0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AB1[0x7];                                      // 0x0AB1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AB_SneakySnowmanV2_Athena_C*            K2Node_DynamicCast_AsB_Sneaky_Snowman_V2_Athena_2; // 0x0AB8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_15;                    // 0x0AC0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select_Default_1;                           // 0x0AC1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AC2[0x6];                                      // 0x0AC2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortWeaponItemDefinition*              CallFunc_GetWeaponData_ReturnValue_2;              // 0x0AC8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0AD0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_2;                     // 0x0AD1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select_Default_2;                           // 0x0AD2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0AD3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD4[0x4];                                      // 0x0AD4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AB_SneakySnowmanV2_Athena_C*            K2Node_DynamicCast_AsB_Sneaky_Snowman_V2_Athena_3; // 0x0AD8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_16;                    // 0x0AE0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AE1[0x7];                                      // 0x0AE1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortWeaponItemDefinition*              CallFunc_GetWeaponData_ReturnValue_3;              // 0x0AE8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1; // 0x0AF0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue_3;                     // 0x0AF8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AF9[0x7];                                      // 0x0AF9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_4;                   // 0x0B00(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_4;               // 0x0B28(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default_3;                           // 0x0B30(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0B31(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B32[0x6];                                      // 0x0B32(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2; // 0x0B38(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAthena_Player_SneakySnowmanV2_C*       CallFunc_FinishSpawningActor_ReturnValue_2;        // 0x0B40(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2) == 0x000010, "Wrong alignment on GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2");
static_assert(sizeof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2) == 0x000B50, "Wrong size on GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, EntryPoint) == 0x000000, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, K2Node_CustomEvent_TargetData_1) == 0x000018, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::K2Node_CustomEvent_TargetData_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, K2Node_CustomEvent_ApplicationTag_1) == 0x000040, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::K2Node_CustomEvent_ApplicationTag_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, K2Node_CreateDelegate_OutputDelegate_1) == 0x000048, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, K2Node_CustomEvent_TargetData) == 0x000058, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::K2Node_CustomEvent_TargetData' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, K2Node_CustomEvent_ApplicationTag) == 0x000080, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::K2Node_CustomEvent_ApplicationTag' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, K2Node_CreateDelegate_OutputDelegate_2) == 0x000088, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, Temp_struct_Variable) == 0x000098, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, Temp_struct_Variable_1) == 0x0000A0, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, K2Node_CustomEvent_Payload_1) == 0x0000C8, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::K2Node_CustomEvent_Payload_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, K2Node_CreateDelegate_OutputDelegate_3) == 0x000178, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, Temp_struct_Variable_2) == 0x000188, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, CallFunc_WaitGameplayEvent_ReturnValue) == 0x000238, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::CallFunc_WaitGameplayEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, CallFunc_IsValid_ReturnValue) == 0x000240, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, K2Node_DynamicCast_AsFort_Weapon) == 0x000248, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::K2Node_DynamicCast_AsFort_Weapon' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, K2Node_DynamicCast_bSuccess) == 0x000250, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, K2Node_DynamicCast_AsB_Sneaky_Snowman_V2_Athena) == 0x000258, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::K2Node_DynamicCast_AsB_Sneaky_Snowman_V2_Athena' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, K2Node_DynamicCast_bSuccess_1) == 0x000260, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, CallFunc_GetWeaponData_ReturnValue) == 0x000268, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::CallFunc_GetWeaponData_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, K2Node_CreateDelegate_OutputDelegate_4) == 0x000270, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, CallFunc_HasTag_ReturnValue) == 0x000280, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, K2Node_CustomEvent_Payload) == 0x000288, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, Temp_struct_Variable_3) == 0x000338, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, CallFunc_WaitGameplayEvent_ReturnValue_1) == 0x0003E8, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::CallFunc_WaitGameplayEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, CallFunc_IsValid_ReturnValue_1) == 0x0003F0, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, K2Node_CustomEvent_TargetData_5) == 0x0003F8, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::K2Node_CustomEvent_TargetData_5' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, K2Node_CustomEvent_ApplicationTag_5) == 0x000420, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::K2Node_CustomEvent_ApplicationTag_5' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, K2Node_CreateDelegate_OutputDelegate_5) == 0x000428, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, K2Node_CustomEvent_TargetData_2) == 0x000438, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::K2Node_CustomEvent_TargetData_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, K2Node_CustomEvent_ApplicationTag_2) == 0x000460, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::K2Node_CustomEvent_ApplicationTag_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, Temp_int_Array_Index_Variable) == 0x000468, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, CallFunc_K2_CommitAbility_ReturnValue) == 0x00046C, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, K2Node_CreateDelegate_OutputDelegate_6) == 0x000470, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue) == 0x000480, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x000488, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, CallFunc_IsValid_ReturnValue_2) == 0x000540, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000544, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, K2Node_Event_bWasCancelled) == 0x00054C, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, CallFunc_IsValid_ReturnValue_3) == 0x00054D, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, CallFunc_GetController_ReturnValue) == 0x000550, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, K2Node_DynamicCast_AsFort_Athena_AIBot_Controller) == 0x000558, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::K2Node_DynamicCast_AsFort_Athena_AIBot_Controller' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, K2Node_DynamicCast_bSuccess_2) == 0x000560, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, K2Node_DynamicCast_AsFort_Player_Controller) == 0x000568, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, K2Node_DynamicCast_bSuccess_3) == 0x000570, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, Temp_int_Loop_Counter_Variable) == 0x000574, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, CallFunc_Add_IntInt_ReturnValue) == 0x000578, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, CallFunc_GetTransform_ReturnValue) == 0x000580, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, CallFunc_BreakTransform_Location) == 0x0005B0, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, CallFunc_BreakTransform_Rotation) == 0x0005BC, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, CallFunc_BreakTransform_Scale) == 0x0005C8, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, CallFunc_GetSocketLocation_ReturnValue) == 0x0005D4, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, Temp_bool_Variable) == 0x0005E0, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, CallFunc_PlayMontageWaitTarget_ReturnValue) == 0x0005E8, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::CallFunc_PlayMontageWaitTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, CallFunc_GetPlayLength_ReturnValue) == 0x0005F0, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::CallFunc_GetPlayLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0005F4, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, CallFunc_IsValid_ReturnValue_4) == 0x0005F8, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, Temp_bool_Variable_1) == 0x0005F9, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, CallFunc_GetActorInfo_ReturnValue) == 0x000600, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, CallFunc_GetGrantedByEffectContext_ReturnValue) == 0x000640, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::CallFunc_GetGrantedByEffectContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, CallFunc_GetGrantedByEffectContext_ReturnValue_1) == 0x000658, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::CallFunc_GetGrantedByEffectContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, CallFunc_EffectContextGetEffectCauser_ReturnValue) == 0x000670, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::CallFunc_EffectContextGetEffectCauser_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, CallFunc_EffectContextGetEffectCauser_ReturnValue_1) == 0x000678, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::CallFunc_EffectContextGetEffectCauser_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, K2Node_DynamicCast_AsAthena_IGive_Sneaky_Snowman) == 0x000680, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::K2Node_DynamicCast_AsAthena_IGive_Sneaky_Snowman' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, K2Node_DynamicCast_bSuccess_4) == 0x000690, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, K2Node_DynamicCast_AsAthena_IGive_Sneaky_Snowman_1) == 0x000698, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::K2Node_DynamicCast_AsAthena_IGive_Sneaky_Snowman_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, K2Node_DynamicCast_bSuccess_5) == 0x0006A8, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, CallFunc_GetNewSnowmanTransform_Transform) == 0x0006B0, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::CallFunc_GetNewSnowmanTransform_Transform' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, K2Node_DynamicCast_AsAthena_Prop_Sneaky_Snowman_V2) == 0x0006E0, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::K2Node_DynamicCast_AsAthena_Prop_Sneaky_Snowman_V2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, K2Node_DynamicCast_bSuccess_6) == 0x0006E8, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, CallFunc_GetGrantedByEffectContext_ReturnValue_2) == 0x0006F0, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::CallFunc_GetGrantedByEffectContext_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, CallFunc_EffectContextGetEffectCauser_ReturnValue_2) == 0x000708, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::CallFunc_EffectContextGetEffectCauser_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, K2Node_DynamicCast_AsAthena_IGive_Sneaky_Snowman_2) == 0x000710, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::K2Node_DynamicCast_AsAthena_IGive_Sneaky_Snowman_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, K2Node_DynamicCast_bSuccess_7) == 0x000720, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, K2Node_DynamicCast_AsAthena_IGive_Sneaky_Snowman_3) == 0x000728, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::K2Node_DynamicCast_AsAthena_IGive_Sneaky_Snowman_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, K2Node_DynamicCast_bSuccess_8) == 0x000738, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, K2Node_DynamicCast_AsAthena_IGive_Sneaky_Snowman_4) == 0x000740, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::K2Node_DynamicCast_AsAthena_IGive_Sneaky_Snowman_4' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, K2Node_DynamicCast_bSuccess_9) == 0x000750, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::K2Node_DynamicCast_bSuccess_9' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, CallFunc_IsDedicatedServer_ReturnValue) == 0x000751, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, CallFunc_Array_Get_Item) == 0x000758, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, CallFunc_K2_RemoveItemFromPlayer_ReturnValue) == 0x000760, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::CallFunc_K2_RemoveItemFromPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, CallFunc_GetNumInStack_ReturnValue) == 0x000764, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::CallFunc_GetNumInStack_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, CallFunc_Array_Length_ReturnValue) == 0x000768, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00076C, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, CallFunc_Less_IntInt_ReturnValue) == 0x00076D, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, CallFunc_GetController_ReturnValue_1) == 0x000770, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::CallFunc_GetController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, CallFunc_IsValid_ReturnValue_5) == 0x000778, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, K2Node_DynamicCast_AsFort_Player_Controller_1) == 0x000780, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::K2Node_DynamicCast_AsFort_Player_Controller_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, K2Node_DynamicCast_bSuccess_10) == 0x000788, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::K2Node_DynamicCast_bSuccess_10' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, CallFunc_K2_RemoveFortItemFromPlayer_ReturnValue) == 0x00078C, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::CallFunc_K2_RemoveFortItemFromPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2, CallFunc_GetActorInfo_ReturnValue_1) == 0x000790, "Member 'GA_Athena_Apply_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Apply_SneakySnowmanV2::CallFunc_GetActorInfo_ReturnValue_1' has a wrong offset!");
