#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_DanceGrenade_Stun

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_DanceGrenade_Stun.GA_DanceGrenade_Stun_C.ExecuteUbergraph_GA_DanceGrenade_Stun
// 0x0148 (0x0148 - 0x0000)
struct GA_DanceGrenade_Stun_C_ExecuteUbergraph_GA_DanceGrenade_Stun final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x0008(0x0040)(ContainsInstancedReference)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAbilitySystemComponent*            K2Node_DynamicCast_AsFort_Ability_System_Component; // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B[0x5];                                       // 0x006B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue_1;               // 0x0070(0x0040)(ContainsInstancedReference)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn_1;                  // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x00D0(0x0028)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x00F8(0x0010)(ZeroConstructor, ReferenceParm)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn_1;           // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_PlayAnimMontage_ReturnValue;              // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSkydiving_ReturnValue;                  // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue_1;  // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAbilitySystemComponent*            K2Node_DynamicCast_AsFort_Ability_System_Component_1; // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_132[0x6];                                      // 0x0132(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAIPawn*                            K2Node_DynamicCast_AsFort_AIPawn;                  // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_DanceGrenade_Stun_C_ExecuteUbergraph_GA_DanceGrenade_Stun) == 0x000008, "Wrong alignment on GA_DanceGrenade_Stun_C_ExecuteUbergraph_GA_DanceGrenade_Stun");
static_assert(sizeof(GA_DanceGrenade_Stun_C_ExecuteUbergraph_GA_DanceGrenade_Stun) == 0x000148, "Wrong size on GA_DanceGrenade_Stun_C_ExecuteUbergraph_GA_DanceGrenade_Stun");
static_assert(offsetof(GA_DanceGrenade_Stun_C_ExecuteUbergraph_GA_DanceGrenade_Stun, EntryPoint) == 0x000000, "Member 'GA_DanceGrenade_Stun_C_ExecuteUbergraph_GA_DanceGrenade_Stun::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_DanceGrenade_Stun_C_ExecuteUbergraph_GA_DanceGrenade_Stun, CallFunc_GetActorInfo_ReturnValue) == 0x000008, "Member 'GA_DanceGrenade_Stun_C_ExecuteUbergraph_GA_DanceGrenade_Stun::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DanceGrenade_Stun_C_ExecuteUbergraph_GA_DanceGrenade_Stun, K2Node_DynamicCast_AsFort_Pawn) == 0x000048, "Member 'GA_DanceGrenade_Stun_C_ExecuteUbergraph_GA_DanceGrenade_Stun::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(GA_DanceGrenade_Stun_C_ExecuteUbergraph_GA_DanceGrenade_Stun, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'GA_DanceGrenade_Stun_C_ExecuteUbergraph_GA_DanceGrenade_Stun::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_DanceGrenade_Stun_C_ExecuteUbergraph_GA_DanceGrenade_Stun, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000058, "Member 'GA_DanceGrenade_Stun_C_ExecuteUbergraph_GA_DanceGrenade_Stun::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DanceGrenade_Stun_C_ExecuteUbergraph_GA_DanceGrenade_Stun, K2Node_DynamicCast_AsFort_Ability_System_Component) == 0x000060, "Member 'GA_DanceGrenade_Stun_C_ExecuteUbergraph_GA_DanceGrenade_Stun::K2Node_DynamicCast_AsFort_Ability_System_Component' has a wrong offset!");
static_assert(offsetof(GA_DanceGrenade_Stun_C_ExecuteUbergraph_GA_DanceGrenade_Stun, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'GA_DanceGrenade_Stun_C_ExecuteUbergraph_GA_DanceGrenade_Stun::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_DanceGrenade_Stun_C_ExecuteUbergraph_GA_DanceGrenade_Stun, K2Node_Event_bWasCancelled) == 0x000069, "Member 'GA_DanceGrenade_Stun_C_ExecuteUbergraph_GA_DanceGrenade_Stun::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_DanceGrenade_Stun_C_ExecuteUbergraph_GA_DanceGrenade_Stun, CallFunc_K2_CommitAbility_ReturnValue) == 0x00006A, "Member 'GA_DanceGrenade_Stun_C_ExecuteUbergraph_GA_DanceGrenade_Stun::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DanceGrenade_Stun_C_ExecuteUbergraph_GA_DanceGrenade_Stun, CallFunc_GetActorInfo_ReturnValue_1) == 0x000070, "Member 'GA_DanceGrenade_Stun_C_ExecuteUbergraph_GA_DanceGrenade_Stun::CallFunc_GetActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_DanceGrenade_Stun_C_ExecuteUbergraph_GA_DanceGrenade_Stun, K2Node_DynamicCast_AsFort_Pawn_1) == 0x0000B0, "Member 'GA_DanceGrenade_Stun_C_ExecuteUbergraph_GA_DanceGrenade_Stun::K2Node_DynamicCast_AsFort_Pawn_1' has a wrong offset!");
static_assert(offsetof(GA_DanceGrenade_Stun_C_ExecuteUbergraph_GA_DanceGrenade_Stun, K2Node_DynamicCast_bSuccess_2) == 0x0000B8, "Member 'GA_DanceGrenade_Stun_C_ExecuteUbergraph_GA_DanceGrenade_Stun::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GA_DanceGrenade_Stun_C_ExecuteUbergraph_GA_DanceGrenade_Stun, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x0000C0, "Member 'GA_DanceGrenade_Stun_C_ExecuteUbergraph_GA_DanceGrenade_Stun::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GA_DanceGrenade_Stun_C_ExecuteUbergraph_GA_DanceGrenade_Stun, K2Node_DynamicCast_bSuccess_3) == 0x0000C8, "Member 'GA_DanceGrenade_Stun_C_ExecuteUbergraph_GA_DanceGrenade_Stun::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(GA_DanceGrenade_Stun_C_ExecuteUbergraph_GA_DanceGrenade_Stun, CallFunc_IsValid_ReturnValue) == 0x0000C9, "Member 'GA_DanceGrenade_Stun_C_ExecuteUbergraph_GA_DanceGrenade_Stun::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DanceGrenade_Stun_C_ExecuteUbergraph_GA_DanceGrenade_Stun, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x0000D0, "Member 'GA_DanceGrenade_Stun_C_ExecuteUbergraph_GA_DanceGrenade_Stun::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DanceGrenade_Stun_C_ExecuteUbergraph_GA_DanceGrenade_Stun, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x0000F8, "Member 'GA_DanceGrenade_Stun_C_ExecuteUbergraph_GA_DanceGrenade_Stun::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DanceGrenade_Stun_C_ExecuteUbergraph_GA_DanceGrenade_Stun, K2Node_DynamicCast_AsFort_Player_Pawn_1) == 0x000108, "Member 'GA_DanceGrenade_Stun_C_ExecuteUbergraph_GA_DanceGrenade_Stun::K2Node_DynamicCast_AsFort_Player_Pawn_1' has a wrong offset!");
static_assert(offsetof(GA_DanceGrenade_Stun_C_ExecuteUbergraph_GA_DanceGrenade_Stun, K2Node_DynamicCast_bSuccess_4) == 0x000110, "Member 'GA_DanceGrenade_Stun_C_ExecuteUbergraph_GA_DanceGrenade_Stun::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(GA_DanceGrenade_Stun_C_ExecuteUbergraph_GA_DanceGrenade_Stun, CallFunc_PlayAnimMontage_ReturnValue) == 0x000114, "Member 'GA_DanceGrenade_Stun_C_ExecuteUbergraph_GA_DanceGrenade_Stun::CallFunc_PlayAnimMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DanceGrenade_Stun_C_ExecuteUbergraph_GA_DanceGrenade_Stun, CallFunc_IsSkydiving_ReturnValue) == 0x000118, "Member 'GA_DanceGrenade_Stun_C_ExecuteUbergraph_GA_DanceGrenade_Stun::CallFunc_IsSkydiving_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_DanceGrenade_Stun_C_ExecuteUbergraph_GA_DanceGrenade_Stun, CallFunc_GetAbilitySystemComponent_ReturnValue_1) == 0x000120, "Member 'GA_DanceGrenade_Stun_C_ExecuteUbergraph_GA_DanceGrenade_Stun::CallFunc_GetAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_DanceGrenade_Stun_C_ExecuteUbergraph_GA_DanceGrenade_Stun, K2Node_DynamicCast_AsFort_Ability_System_Component_1) == 0x000128, "Member 'GA_DanceGrenade_Stun_C_ExecuteUbergraph_GA_DanceGrenade_Stun::K2Node_DynamicCast_AsFort_Ability_System_Component_1' has a wrong offset!");
static_assert(offsetof(GA_DanceGrenade_Stun_C_ExecuteUbergraph_GA_DanceGrenade_Stun, K2Node_DynamicCast_bSuccess_5) == 0x000130, "Member 'GA_DanceGrenade_Stun_C_ExecuteUbergraph_GA_DanceGrenade_Stun::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(GA_DanceGrenade_Stun_C_ExecuteUbergraph_GA_DanceGrenade_Stun, CallFunc_IsValid_ReturnValue_1) == 0x000131, "Member 'GA_DanceGrenade_Stun_C_ExecuteUbergraph_GA_DanceGrenade_Stun::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_DanceGrenade_Stun_C_ExecuteUbergraph_GA_DanceGrenade_Stun, K2Node_DynamicCast_AsFort_AIPawn) == 0x000138, "Member 'GA_DanceGrenade_Stun_C_ExecuteUbergraph_GA_DanceGrenade_Stun::K2Node_DynamicCast_AsFort_AIPawn' has a wrong offset!");
static_assert(offsetof(GA_DanceGrenade_Stun_C_ExecuteUbergraph_GA_DanceGrenade_Stun, K2Node_DynamicCast_bSuccess_6) == 0x000140, "Member 'GA_DanceGrenade_Stun_C_ExecuteUbergraph_GA_DanceGrenade_Stun::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");

// Function GA_DanceGrenade_Stun.GA_DanceGrenade_Stun_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_DanceGrenade_Stun_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_DanceGrenade_Stun_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_DanceGrenade_Stun_C_K2_OnEndAbility");
static_assert(sizeof(GA_DanceGrenade_Stun_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_DanceGrenade_Stun_C_K2_OnEndAbility");
static_assert(offsetof(GA_DanceGrenade_Stun_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_DanceGrenade_Stun_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

}

