#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_SurfaceChange_Ice_IceCheckOnTimer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_SurfaceChange_Ice_IceCheckOnTimer.GA_SurfaceChange_Ice_IceCheckOnTimer_C
// 0x0020 (0x0A50 - 0x0A30)
class UGA_SurfaceChange_Ice_IceCheckOnTimer_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A30(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AFortPlayerPawn*                        FortPlayerPawn;                                    // 0x0A38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           TraceTimer;                                        // 0x0A40(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           OffIceTimer;                                       // 0x0A48(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_SurfaceChange_Ice_IceCheckOnTimer(int32 EntryPoint);
	void RemoveIceGE();
	void TraceForTerrain();
	void K2_OnEndAbility(bool bWasCancelled);
	void K2_ActivateAbility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_SurfaceChange_Ice_IceCheckOnTimer_C">();
	}
	static class UGA_SurfaceChange_Ice_IceCheckOnTimer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_SurfaceChange_Ice_IceCheckOnTimer_C>();
	}
};
static_assert(alignof(UGA_SurfaceChange_Ice_IceCheckOnTimer_C) == 0x000008, "Wrong alignment on UGA_SurfaceChange_Ice_IceCheckOnTimer_C");
static_assert(sizeof(UGA_SurfaceChange_Ice_IceCheckOnTimer_C) == 0x000A50, "Wrong size on UGA_SurfaceChange_Ice_IceCheckOnTimer_C");
static_assert(offsetof(UGA_SurfaceChange_Ice_IceCheckOnTimer_C, UberGraphFrame) == 0x000A30, "Member 'UGA_SurfaceChange_Ice_IceCheckOnTimer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_SurfaceChange_Ice_IceCheckOnTimer_C, FortPlayerPawn) == 0x000A38, "Member 'UGA_SurfaceChange_Ice_IceCheckOnTimer_C::FortPlayerPawn' has a wrong offset!");
static_assert(offsetof(UGA_SurfaceChange_Ice_IceCheckOnTimer_C, TraceTimer) == 0x000A40, "Member 'UGA_SurfaceChange_Ice_IceCheckOnTimer_C::TraceTimer' has a wrong offset!");
static_assert(offsetof(UGA_SurfaceChange_Ice_IceCheckOnTimer_C, OffIceTimer) == 0x000A48, "Member 'UGA_SurfaceChange_Ice_IceCheckOnTimer_C::OffIceTimer' has a wrong offset!");

}

