#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_SlamDoorOpen_Victim

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_SlamDoorOpen_Victim.GA_SlamDoorOpen_Victim_C
// 0x0018 (0x0A48 - 0x0A30)
class UGA_SlamDoorOpen_Victim_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A30(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABuildingWall*                          BuildingWall;                                      // 0x0A38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0A40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_SlamDoorOpen_Victim(int32 EntryPoint);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_SlamDoorOpen_Victim_C">();
	}
	static class UGA_SlamDoorOpen_Victim_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_SlamDoorOpen_Victim_C>();
	}
};
static_assert(alignof(UGA_SlamDoorOpen_Victim_C) == 0x000008, "Wrong alignment on UGA_SlamDoorOpen_Victim_C");
static_assert(sizeof(UGA_SlamDoorOpen_Victim_C) == 0x000A48, "Wrong size on UGA_SlamDoorOpen_Victim_C");
static_assert(offsetof(UGA_SlamDoorOpen_Victim_C, UberGraphFrame) == 0x000A30, "Member 'UGA_SlamDoorOpen_Victim_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_SlamDoorOpen_Victim_C, BuildingWall) == 0x000A38, "Member 'UGA_SlamDoorOpen_Victim_C::BuildingWall' has a wrong offset!");
static_assert(offsetof(UGA_SlamDoorOpen_Victim_C, PlayerPawn) == 0x000A40, "Member 'UGA_SlamDoorOpen_Victim_C::PlayerPawn' has a wrong offset!");

}

