#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Uncle_Block_Break

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Uncle_Block_Break.GA_Uncle_Block_Break_C
// 0x0018 (0x0A48 - 0x0A30)
class UGA_Uncle_Block_Break_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A30(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTag                           GC_BlockBreak;                                     // 0x0A38(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0A40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Uncle_Block_Break(int32 EntryPoint);
	void K2_ActivateAbility();
	void Triggered_E6CCD31D482409AA1A211EACE84E9E37(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Cancelled_E6CCD31D482409AA1A211EACE84E9E37(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);
	void Completed_E6CCD31D482409AA1A211EACE84E9E37(const struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Uncle_Block_Break_C">();
	}
	static class UGA_Uncle_Block_Break_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Uncle_Block_Break_C>();
	}
};
static_assert(alignof(UGA_Uncle_Block_Break_C) == 0x000008, "Wrong alignment on UGA_Uncle_Block_Break_C");
static_assert(sizeof(UGA_Uncle_Block_Break_C) == 0x000A48, "Wrong size on UGA_Uncle_Block_Break_C");
static_assert(offsetof(UGA_Uncle_Block_Break_C, UberGraphFrame) == 0x000A30, "Member 'UGA_Uncle_Block_Break_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_Uncle_Block_Break_C, GC_BlockBreak) == 0x000A38, "Member 'UGA_Uncle_Block_Break_C::GC_BlockBreak' has a wrong offset!");
static_assert(offsetof(UGA_Uncle_Block_Break_C, PlayerPawn) == 0x000A40, "Member 'UGA_Uncle_Block_Break_C::PlayerPawn' has a wrong offset!");

}

