#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Uncle_Brolly_Dash

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GA_Uncle_Brolly_Dash.GA_Uncle_Brolly_Dash_C.ExecuteUbergraph_GA_Uncle_Brolly_Dash
// 0x05C0 (0x05C0 - 0x0000)
struct GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_IncrementAnalyticMatchCount_ReturnValue;  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class UAbilityTask_NetworkSyncPoint*          CallFunc_WaitNetSync_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_StartAbilityState*         CallFunc_StartAbilityState_ReturnValue;            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& NotifyTag)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0060(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_NotifyTag_11;                   // 0x0074(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_NotifyTag_10;                   // 0x007C(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& NotifyTag)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0084(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_NotifyTag_9;                    // 0x0094(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& NotifyTag)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x009C(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_NotifyTag_8;                    // 0x00AC(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& NotifyTag)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x00B4(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_NotifyTag_7;                    // 0x00C4(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& NotifyTag)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x00CC(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_NotifyTag_6;                    // 0x00DC(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& NotifyTag)> K2Node_CreateDelegate_OutputDelegate_9;            // 0x00E4(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x00F4(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x00FC(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess;   // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_NetworkSyncPoint*          CallFunc_WaitNetSync_ReturnValue_1;                // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& NotifyTag)> K2Node_CreateDelegate_OutputDelegate_11;           // 0x0118(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_NotifyTag_5;                    // 0x012C(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_NotifyTag_4;                    // 0x0134(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& NotifyTag)> K2Node_CreateDelegate_OutputDelegate_12;           // 0x013C(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_NotifyTag_3;                    // 0x014C(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& NotifyTag)> K2Node_CreateDelegate_OutputDelegate_13;           // 0x0154(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_NotifyTag_2;                    // 0x0164(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& NotifyTag)> K2Node_CreateDelegate_OutputDelegate_14;           // 0x016C(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_NotifyTag_1;                    // 0x017C(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& NotifyTag)> K2Node_CreateDelegate_OutputDelegate_15;           // 0x0184(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_NotifyTag;                      // 0x0194(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& NotifyTag)> K2Node_CreateDelegate_OutputDelegate_16;           // 0x019C(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x01AC(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_17;           // 0x01B4(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x01C4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x01CC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_18;           // 0x01D4(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x01E4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_19;           // 0x01EC(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x01FC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_20;           // 0x0204(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x0214(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_21;           // 0x021C(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable;                                // 0x022C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0234(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_235[0x3];                                      // 0x0235(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x023C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x024C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24D[0x3];                                      // 0x024D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable_2;                            // 0x0250(0x0028)()
	struct FGameplayTag                           Temp_struct_Variable_3;                            // 0x0278(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_GetHitResultFromTargetData_ReturnValue;   // 0x0280(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x030C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x030D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30E[0x2];                                      // 0x030E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0314(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0318(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0324(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0330(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x033C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0358(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0368(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x036C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0370(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x037C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0389(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38A[0x6];                                      // 0x038A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_1;                   // 0x0390(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_1;               // 0x03B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFalling_ReturnValue;                    // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D1[0x7];                                      // 0x03D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1; // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetControlRotation_ReturnValue;           // 0x03E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_22;           // 0x03EC(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x03FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0400(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0404(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetControlRotation_ReturnValue_1;         // 0x0408(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0414(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x0420(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x0424(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x0428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x042C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData;                     // 0x0438(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag;                 // 0x0460(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_1;        // 0x0469(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46A[0x6];                                      // 0x046A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilityTask_PlayMontageWaitNotify* CallFunc_PlayMontageAndWaitNotify_ReturnValue;     // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_479[0x7];                                      // 0x0479(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0480(0x00B0)(ConstParm)
	class UFortAbilityTask_PlayMontageWaitNotify* CallFunc_PlayMontageAndWaitNotify_ReturnValue_1;   // 0x0530(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0538(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_539[0x7];                                      // 0x0539(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_Select_Default;                             // 0x0540(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_23;           // 0x0548(0x0010)(ZeroConstructor, NoDestructor)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x0558(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0560(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x056C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_56D[0x3];                                      // 0x056D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_1;                           // 0x0570(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_574[0x4];                                      // 0x0574(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_ApplyGameplayEffectContainer_ReturnValue; // 0x0578(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	class UFortAbilityTask_TargetSelectionContinuous* CallFunc_DoTargetSelectionContinuous_ReturnValue;  // 0x0588(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0590(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_591[0x3];                                      // 0x0591(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0594(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0598(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x05A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A5[0x3];                                      // 0x05A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x05A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_2;                           // 0x05AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_ApplyRootMotionConstantForce* CallFunc_ApplyRootMotionConstantForce_ReturnValue; // 0x05B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x05B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash) == 0x000008, "Wrong alignment on GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash");
static_assert(sizeof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash) == 0x0005C0, "Wrong size on GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, EntryPoint) == 0x000000, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, CallFunc_IncrementAnalyticMatchCount_ReturnValue) == 0x000004, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::CallFunc_IncrementAnalyticMatchCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, CallFunc_WaitNetSync_ReturnValue) == 0x000018, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::CallFunc_WaitNetSync_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, K2Node_CreateDelegate_OutputDelegate_1) == 0x000020, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, K2Node_CreateDelegate_OutputDelegate_2) == 0x000034, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, K2Node_CreateDelegate_OutputDelegate_3) == 0x000044, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, CallFunc_StartAbilityState_ReturnValue) == 0x000058, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::CallFunc_StartAbilityState_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, K2Node_CreateDelegate_OutputDelegate_4) == 0x000060, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, CallFunc_IsValid_ReturnValue_1) == 0x000070, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, K2Node_CustomEvent_NotifyTag_11) == 0x000074, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::K2Node_CustomEvent_NotifyTag_11' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, K2Node_CustomEvent_NotifyTag_10) == 0x00007C, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::K2Node_CustomEvent_NotifyTag_10' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, K2Node_CreateDelegate_OutputDelegate_5) == 0x000084, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, K2Node_CustomEvent_NotifyTag_9) == 0x000094, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::K2Node_CustomEvent_NotifyTag_9' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, K2Node_CreateDelegate_OutputDelegate_6) == 0x00009C, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, K2Node_CustomEvent_NotifyTag_8) == 0x0000AC, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::K2Node_CustomEvent_NotifyTag_8' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, K2Node_CreateDelegate_OutputDelegate_7) == 0x0000B4, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, K2Node_CustomEvent_NotifyTag_7) == 0x0000C4, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::K2Node_CustomEvent_NotifyTag_7' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, K2Node_CreateDelegate_OutputDelegate_8) == 0x0000CC, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, K2Node_CustomEvent_NotifyTag_6) == 0x0000DC, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::K2Node_CustomEvent_NotifyTag_6' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, K2Node_CreateDelegate_OutputDelegate_9) == 0x0000E4, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, Temp_struct_Variable) == 0x0000F4, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, K2Node_CreateDelegate_OutputDelegate_10) == 0x0000FC, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess) == 0x00010C, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, CallFunc_WaitNetSync_ReturnValue_1) == 0x000110, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::CallFunc_WaitNetSync_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, K2Node_CreateDelegate_OutputDelegate_11) == 0x000118, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, CallFunc_IsValid_ReturnValue_2) == 0x000128, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, K2Node_CustomEvent_NotifyTag_5) == 0x00012C, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::K2Node_CustomEvent_NotifyTag_5' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, K2Node_CustomEvent_NotifyTag_4) == 0x000134, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::K2Node_CustomEvent_NotifyTag_4' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, K2Node_CreateDelegate_OutputDelegate_12) == 0x00013C, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, K2Node_CustomEvent_NotifyTag_3) == 0x00014C, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::K2Node_CustomEvent_NotifyTag_3' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, K2Node_CreateDelegate_OutputDelegate_13) == 0x000154, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::K2Node_CreateDelegate_OutputDelegate_13' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, K2Node_CustomEvent_NotifyTag_2) == 0x000164, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::K2Node_CustomEvent_NotifyTag_2' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, K2Node_CreateDelegate_OutputDelegate_14) == 0x00016C, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::K2Node_CreateDelegate_OutputDelegate_14' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, K2Node_CustomEvent_NotifyTag_1) == 0x00017C, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::K2Node_CustomEvent_NotifyTag_1' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, K2Node_CreateDelegate_OutputDelegate_15) == 0x000184, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::K2Node_CreateDelegate_OutputDelegate_15' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, K2Node_CustomEvent_NotifyTag) == 0x000194, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::K2Node_CustomEvent_NotifyTag' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, K2Node_CreateDelegate_OutputDelegate_16) == 0x00019C, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::K2Node_CreateDelegate_OutputDelegate_16' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, Temp_struct_Variable_1) == 0x0001AC, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, K2Node_CreateDelegate_OutputDelegate_17) == 0x0001B4, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::K2Node_CreateDelegate_OutputDelegate_17' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, K2Node_CustomEvent_NotifyName_4) == 0x0001C4, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::K2Node_CustomEvent_NotifyName_4' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, K2Node_CustomEvent_NotifyName_3) == 0x0001CC, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::K2Node_CustomEvent_NotifyName_3' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, K2Node_CreateDelegate_OutputDelegate_18) == 0x0001D4, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::K2Node_CreateDelegate_OutputDelegate_18' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, K2Node_CustomEvent_NotifyName_2) == 0x0001E4, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::K2Node_CustomEvent_NotifyName_2' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, K2Node_CreateDelegate_OutputDelegate_19) == 0x0001EC, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::K2Node_CreateDelegate_OutputDelegate_19' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, K2Node_CustomEvent_NotifyName_1) == 0x0001FC, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::K2Node_CustomEvent_NotifyName_1' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, K2Node_CreateDelegate_OutputDelegate_20) == 0x000204, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::K2Node_CreateDelegate_OutputDelegate_20' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, K2Node_CustomEvent_NotifyName) == 0x000214, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, K2Node_CreateDelegate_OutputDelegate_21) == 0x00021C, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::K2Node_CreateDelegate_OutputDelegate_21' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, Temp_name_Variable) == 0x00022C, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, Temp_bool_Variable) == 0x000234, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, Temp_int_Variable) == 0x000238, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, Temp_int_Variable_1) == 0x00023C, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, Temp_int_Variable_2) == 0x000240, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, Temp_int_Variable_3) == 0x000244, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, Temp_int_Variable_4) == 0x000248, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, Temp_bool_Variable_1) == 0x00024C, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, Temp_struct_Variable_2) == 0x000250, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, Temp_struct_Variable_3) == 0x000278, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, CallFunc_GetHitResultFromTargetData_ReturnValue) == 0x000280, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::CallFunc_GetHitResultFromTargetData_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, CallFunc_BreakHitResult_bBlockingHit) == 0x00030C, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, CallFunc_BreakHitResult_bInitialOverlap) == 0x00030D, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, CallFunc_BreakHitResult_Time) == 0x000310, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, CallFunc_BreakHitResult_Distance) == 0x000314, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, CallFunc_BreakHitResult_Location) == 0x000318, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, CallFunc_BreakHitResult_ImpactPoint) == 0x000324, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, CallFunc_BreakHitResult_Normal) == 0x000330, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, CallFunc_BreakHitResult_ImpactNormal) == 0x00033C, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, CallFunc_BreakHitResult_PhysMat) == 0x000348, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, CallFunc_BreakHitResult_HitActor) == 0x000350, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, CallFunc_BreakHitResult_HitComponent) == 0x000358, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, CallFunc_BreakHitResult_HitBoneName) == 0x000360, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, CallFunc_BreakHitResult_HitItem) == 0x000368, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, CallFunc_BreakHitResult_FaceIndex) == 0x00036C, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, CallFunc_BreakHitResult_TraceStart) == 0x000370, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, CallFunc_BreakHitResult_TraceEnd) == 0x00037C, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, K2Node_Event_bWasCancelled) == 0x000388, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, CallFunc_K2_CommitAbility_ReturnValue) == 0x000389, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, K2Node_CustomEvent_TargetData_1) == 0x000390, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::K2Node_CustomEvent_TargetData_1' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, K2Node_CustomEvent_ApplicationTag_1) == 0x0003B8, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::K2Node_CustomEvent_ApplicationTag_1' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x0003C0, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x0003C8, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, CallFunc_IsFalling_ReturnValue) == 0x0003D0, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::CallFunc_IsFalling_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1) == 0x0003D8, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, CallFunc_GetControlRotation_ReturnValue) == 0x0003E0, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::CallFunc_GetControlRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, K2Node_CreateDelegate_OutputDelegate_22) == 0x0003EC, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::K2Node_CreateDelegate_OutputDelegate_22' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, CallFunc_BreakRotator_Roll) == 0x0003FC, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, CallFunc_BreakRotator_Pitch) == 0x000400, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, CallFunc_BreakRotator_Yaw) == 0x000404, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, CallFunc_GetControlRotation_ReturnValue_1) == 0x000408, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::CallFunc_GetControlRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, CallFunc_MakeRotator_ReturnValue) == 0x000414, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, CallFunc_BreakRotator_Roll_1) == 0x000420, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, CallFunc_BreakRotator_Pitch_1) == 0x000424, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, CallFunc_BreakRotator_Yaw_1) == 0x000428, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, CallFunc_GetForwardVector_ReturnValue) == 0x00042C, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, K2Node_CustomEvent_TargetData) == 0x000438, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::K2Node_CustomEvent_TargetData' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, K2Node_CustomEvent_ApplicationTag) == 0x000460, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::K2Node_CustomEvent_ApplicationTag' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, CallFunc_IsLocallyControlled_ReturnValue) == 0x000468, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, CallFunc_IsLocallyControlled_ReturnValue_1) == 0x000469, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::CallFunc_IsLocallyControlled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, CallFunc_PlayMontageAndWaitNotify_ReturnValue) == 0x000470, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::CallFunc_PlayMontageAndWaitNotify_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, CallFunc_IsValid_ReturnValue_3) == 0x000478, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, K2Node_Event_EventData) == 0x000480, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, CallFunc_PlayMontageAndWaitNotify_ReturnValue_1) == 0x000530, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::CallFunc_PlayMontageAndWaitNotify_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, CallFunc_IsValid_ReturnValue_4) == 0x000538, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, K2Node_Select_Default) == 0x000540, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, K2Node_CreateDelegate_OutputDelegate_23) == 0x000548, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::K2Node_CreateDelegate_OutputDelegate_23' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue) == 0x000558, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, CallFunc_MakeRotator_ReturnValue_1) == 0x000560, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, CallFunc_IsValid_ReturnValue_5) == 0x00056C, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, K2Node_Select_Default_1) == 0x000570, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, CallFunc_ApplyGameplayEffectContainer_ReturnValue) == 0x000578, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::CallFunc_ApplyGameplayEffectContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, CallFunc_DoTargetSelectionContinuous_ReturnValue) == 0x000588, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::CallFunc_DoTargetSelectionContinuous_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, CallFunc_IsValid_ReturnValue_6) == 0x000590, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, CallFunc_GetValueAtLevel_ReturnValue) == 0x000594, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000598, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, CallFunc_Not_PreBool_ReturnValue) == 0x0005A4, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0005A8, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, K2Node_Select_Default_2) == 0x0005AC, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, CallFunc_ApplyRootMotionConstantForce_ReturnValue) == 0x0005B0, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::CallFunc_ApplyRootMotionConstantForce_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash, CallFunc_IsValid_ReturnValue_7) == 0x0005B8, "Member 'GA_Uncle_Brolly_Dash_C_ExecuteUbergraph_GA_Uncle_Brolly_Dash::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");

// Function GA_Uncle_Brolly_Dash.GA_Uncle_Brolly_Dash_C.K2_ActivateAbilityFromEvent
// 0x00B0 (0x00B0 - 0x0000)
struct GA_Uncle_Brolly_Dash_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Uncle_Brolly_Dash_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on GA_Uncle_Brolly_Dash_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GA_Uncle_Brolly_Dash_C_K2_ActivateAbilityFromEvent) == 0x0000B0, "Wrong size on GA_Uncle_Brolly_Dash_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GA_Uncle_Brolly_Dash_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

// Function GA_Uncle_Brolly_Dash.GA_Uncle_Brolly_Dash_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Uncle_Brolly_Dash_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Uncle_Brolly_Dash_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Uncle_Brolly_Dash_C_K2_OnEndAbility");
static_assert(sizeof(GA_Uncle_Brolly_Dash_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Uncle_Brolly_Dash_C_K2_OnEndAbility");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Uncle_Brolly_Dash_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_Uncle_Brolly_Dash.GA_Uncle_Brolly_Dash_C.OnCompleted_2A449C794E18083C057A77B57327A251
// 0x0008 (0x0008 - 0x0000)
struct GA_Uncle_Brolly_Dash_C_OnCompleted_2A449C794E18083C057A77B57327A251 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Uncle_Brolly_Dash_C_OnCompleted_2A449C794E18083C057A77B57327A251) == 0x000004, "Wrong alignment on GA_Uncle_Brolly_Dash_C_OnCompleted_2A449C794E18083C057A77B57327A251");
static_assert(sizeof(GA_Uncle_Brolly_Dash_C_OnCompleted_2A449C794E18083C057A77B57327A251) == 0x000008, "Wrong size on GA_Uncle_Brolly_Dash_C_OnCompleted_2A449C794E18083C057A77B57327A251");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_OnCompleted_2A449C794E18083C057A77B57327A251, NotifyName) == 0x000000, "Member 'GA_Uncle_Brolly_Dash_C_OnCompleted_2A449C794E18083C057A77B57327A251::NotifyName' has a wrong offset!");

// Function GA_Uncle_Brolly_Dash.GA_Uncle_Brolly_Dash_C.OnBlendOut_2A449C794E18083C057A77B57327A251
// 0x0008 (0x0008 - 0x0000)
struct GA_Uncle_Brolly_Dash_C_OnBlendOut_2A449C794E18083C057A77B57327A251 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Uncle_Brolly_Dash_C_OnBlendOut_2A449C794E18083C057A77B57327A251) == 0x000004, "Wrong alignment on GA_Uncle_Brolly_Dash_C_OnBlendOut_2A449C794E18083C057A77B57327A251");
static_assert(sizeof(GA_Uncle_Brolly_Dash_C_OnBlendOut_2A449C794E18083C057A77B57327A251) == 0x000008, "Wrong size on GA_Uncle_Brolly_Dash_C_OnBlendOut_2A449C794E18083C057A77B57327A251");
static_assert(offsetof(GA_Uncle_Brolly_Dash_C_OnBlendOut_2A449C794E18083C057A77B57327A251, NotifyName) == 0x000000, "Member 'GA_Uncle_Brolly_Dash_C_OnBlendOut_2A449C794E18083C057A77B57327A251::NotifyName' has a wrong offset!");

// Function GA_Uncle_Brolly_Dash.GA_Uncle_Brolly_Dash_C.OnInterrupted_2A449C794E18083C057A77B57327A251
// 0x0008 (0x0008 - 0x0000)
struct GA_Uncle_Brolly_Dash_C_OnInterrupted_2A449C794E18083C057A77B57327A251 final
{
public:
