#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Uncle_Brolly_Float

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GA_Uncle_Brolly_Float.GA_Uncle_Brolly_Float_C.ExecuteUbergraph_GA_Uncle_Brolly_Float
// 0x0390 (0x0390 - 0x0000)
struct GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_IncrementAnalyticMatchCount_ReturnValue;  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_Payload_1;                      // 0x0008(0x00B0)()
	struct FGameplayEventData                     Temp_struct_Variable;                              // 0x00B8(0x00B0)()
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue;            // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate;              // 0x0174(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_Payload;                        // 0x0188(0x00B0)()
	struct FGameplayEventData                     Temp_struct_Variable_1;                            // 0x0238(0x00B0)()
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue_1;          // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F1[0x3];                                      // 0x02F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x02F4(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0304(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0314(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_324[0x4];                                      // 0x0324(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagRemoved*    CallFunc_WaitGameplayTagRemove_ReturnValue;        // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_331[0x3];                                      // 0x0331(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0334(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0348(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x034C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x034D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34E[0x2];                                      // 0x034E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0354(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x0358(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35C[0x4];                                      // 0x035C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0360(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_369[0x3];                                      // 0x0369(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue_2;            // 0x036C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_3;            // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_4;            // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_5;            // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_6;            // 0x037C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAbilityTask_ApplyRootMotionFallingBoostForce* CallFunc_ApplyRootMotionFallingBoostForce_ReturnValue; // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float) == 0x000008, "Wrong alignment on GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float");
static_assert(sizeof(GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float) == 0x000390, "Wrong size on GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float");
static_assert(offsetof(GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float, EntryPoint) == 0x000000, "Member 'GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float, CallFunc_IncrementAnalyticMatchCount_ReturnValue) == 0x000004, "Member 'GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float::CallFunc_IncrementAnalyticMatchCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float, K2Node_CustomEvent_Payload_1) == 0x000008, "Member 'GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float::K2Node_CustomEvent_Payload_1' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float, Temp_struct_Variable) == 0x0000B8, "Member 'GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float, CallFunc_WaitGameplayEvent_ReturnValue) == 0x000168, "Member 'GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float::CallFunc_WaitGameplayEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float, CallFunc_IsValid_ReturnValue) == 0x000170, "Member 'GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float, K2Node_CreateDelegate_OutputDelegate) == 0x000174, "Member 'GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float, K2Node_CustomEvent_Payload) == 0x000188, "Member 'GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float, Temp_struct_Variable_1) == 0x000238, "Member 'GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float, CallFunc_WaitGameplayEvent_ReturnValue_1) == 0x0002E8, "Member 'GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float::CallFunc_WaitGameplayEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float, CallFunc_IsValid_ReturnValue_1) == 0x0002F0, "Member 'GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float, K2Node_CreateDelegate_OutputDelegate_1) == 0x0002F4, "Member 'GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float, K2Node_CreateDelegate_OutputDelegate_2) == 0x000304, "Member 'GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float, K2Node_CreateDelegate_OutputDelegate_3) == 0x000314, "Member 'GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float, CallFunc_WaitGameplayTagRemove_ReturnValue) == 0x000328, "Member 'GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float::CallFunc_WaitGameplayTagRemove_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float, CallFunc_IsValid_ReturnValue_2) == 0x000330, "Member 'GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float, K2Node_CreateDelegate_OutputDelegate_4) == 0x000334, "Member 'GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000344, "Member 'GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000348, "Member 'GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float, K2Node_Event_bWasCancelled) == 0x00034C, "Member 'GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float, CallFunc_IsLocallyControlled_ReturnValue) == 0x00034D, "Member 'GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float, CallFunc_GetValueAtLevel_ReturnValue) == 0x000350, "Member 'GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000354, "Member 'GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x000358, "Member 'GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000360, "Member 'GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000368, "Member 'GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float, CallFunc_GetValueAtLevel_ReturnValue_2) == 0x00036C, "Member 'GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float::CallFunc_GetValueAtLevel_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float, CallFunc_GetValueAtLevel_ReturnValue_3) == 0x000370, "Member 'GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float::CallFunc_GetValueAtLevel_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float, CallFunc_GetValueAtLevel_ReturnValue_4) == 0x000374, "Member 'GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float::CallFunc_GetValueAtLevel_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float, CallFunc_GetValueAtLevel_ReturnValue_5) == 0x000378, "Member 'GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float::CallFunc_GetValueAtLevel_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float, CallFunc_GetValueAtLevel_ReturnValue_6) == 0x00037C, "Member 'GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float::CallFunc_GetValueAtLevel_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float, CallFunc_ApplyRootMotionFallingBoostForce_ReturnValue) == 0x000380, "Member 'GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float::CallFunc_ApplyRootMotionFallingBoostForce_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float, CallFunc_IsValid_ReturnValue_3) == 0x000388, "Member 'GA_Uncle_Brolly_Float_C_ExecuteUbergraph_GA_Uncle_Brolly_Float::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");

// Function GA_Uncle_Brolly_Float.GA_Uncle_Brolly_Float_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Uncle_Brolly_Float_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Uncle_Brolly_Float_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Uncle_Brolly_Float_C_K2_OnEndAbility");
static_assert(sizeof(GA_Uncle_Brolly_Float_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Uncle_Brolly_Float_C_K2_OnEndAbility");
static_assert(offsetof(GA_Uncle_Brolly_Float_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Uncle_Brolly_Float_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_Uncle_Brolly_Float.GA_Uncle_Brolly_Float_C.EventReceived_849C01504C1370D90F7729BC44FF1CA7
// 0x00B0 (0x00B0 - 0x0000)
struct GA_Uncle_Brolly_Float_C_EventReceived_849C01504C1370D90F7729BC44FF1CA7 final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Uncle_Brolly_Float_C_EventReceived_849C01504C1370D90F7729BC44FF1CA7) == 0x000008, "Wrong alignment on GA_Uncle_Brolly_Float_C_EventReceived_849C01504C1370D90F7729BC44FF1CA7");
static_assert(sizeof(GA_Uncle_Brolly_Float_C_EventReceived_849C01504C1370D90F7729BC44FF1CA7) == 0x0000B0, "Wrong size on GA_Uncle_Brolly_Float_C_EventReceived_849C01504C1370D90F7729BC44FF1CA7");
static_assert(offsetof(GA_Uncle_Brolly_Float_C_EventReceived_849C01504C1370D90F7729BC44FF1CA7, Payload) == 0x000000, "Member 'GA_Uncle_Brolly_Float_C_EventReceived_849C01504C1370D90F7729BC44FF1CA7::Payload' has a wrong offset!");

// Function GA_Uncle_Brolly_Float.GA_Uncle_Brolly_Float_C.EventReceived_A105E94C42D41462EB50A6A3FE424122
// 0x00B0 (0x00B0 - 0x0000)
struct GA_Uncle_Brolly_Float_C_EventReceived_A105E94C42D41462EB50A6A3FE424122 final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Uncle_Brolly_Float_C_EventReceived_A105E94C42D41462EB50A6A3FE424122) == 0x000008, "Wrong alignment on GA_Uncle_Brolly_Float_C_EventReceived_A105E94C42D41462EB50A6A3FE424122");
static_assert(sizeof(GA_Uncle_Brolly_Float_C_EventReceived_A105E94C42D41462EB50A6A3FE424122) == 0x0000B0, "Wrong size on GA_Uncle_Brolly_Float_C_EventReceived_A105E94C42D41462EB50A6A3FE424122");
static_assert(offsetof(GA_Uncle_Brolly_Float_C_EventReceived_A105E94C42D41462EB50A6A3FE424122, Payload) == 0x000000, "Member 'GA_Uncle_Brolly_Float_C_EventReceived_A105E94C42D41462EB50A6A3FE424122::Payload' has a wrong offset!");

// Function GA_Uncle_Brolly_Float.GA_Uncle_Brolly_Float_C.InitAbility
// 0x0060 (0x0060 - 0x0000)
struct GA_Uncle_Brolly_Float_C_InitAbility final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetAttachedActors_OutActors;              // 0x0010(0x0010)(ZeroConstructor, ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AB_Uncle_Brolly_Block_Collision_C*      K2Node_DynamicCast_AsB_Uncle_Brolly_Block_Collision; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Uncle_Brolly_Float_C_InitAbility) == 0x000008, "Wrong alignment on GA_Uncle_Brolly_Float_C_InitAbility");
static_assert(sizeof(GA_Uncle_Brolly_Float_C_InitAbility) == 0x000060, "Wrong size on GA_Uncle_Brolly_Float_C_InitAbility");
static_assert(offsetof(GA_Uncle_Brolly_Float_C_InitAbility, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'GA_Uncle_Brolly_Float_C_InitAbility::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Float_C_InitAbility, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'GA_Uncle_Brolly_Float_C_InitAbility::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Float_C_InitAbility, Temp_int_Array_Index_Variable) == 0x000008, "Member 'GA_Uncle_Brolly_Float_C_InitAbility::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Float_C_InitAbility, CallFunc_IsLocallyControlled_ReturnValue) == 0x00000C, "Member 'GA_Uncle_Brolly_Float_C_InitAbility::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Float_C_InitAbility, CallFunc_GetAttachedActors_OutActors) == 0x000010, "Member 'GA_Uncle_Brolly_Float_C_InitAbility::CallFunc_GetAttachedActors_OutActors' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Float_C_InitAbility, CallFunc_Array_Get_Item) == 0x000020, "Member 'GA_Uncle_Brolly_Float_C_InitAbility::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Float_C_InitAbility, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'GA_Uncle_Brolly_Float_C_InitAbility::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Float_C_InitAbility, CallFunc_IsValid_ReturnValue) == 0x00002C, "Member 'GA_Uncle_Brolly_Float_C_InitAbility::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Float_C_InitAbility, CallFunc_Less_IntInt_ReturnValue) == 0x00002D, "Member 'GA_Uncle_Brolly_Float_C_InitAbility::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Float_C_InitAbility, K2Node_DynamicCast_AsB_Uncle_Brolly_Block_Collision) == 0x000030, "Member 'GA_Uncle_Brolly_Float_C_InitAbility::K2Node_DynamicCast_AsB_Uncle_Brolly_Block_Collision' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Float_C_InitAbility, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'GA_Uncle_Brolly_Float_C_InitAbility::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Float_C_InitAbility, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x00003C, "Member 'GA_Uncle_Brolly_Float_C_InitAbility::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Float_C_InitAbility, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000040, "Member 'GA_Uncle_Brolly_Float_C_InitAbility::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Float_C_InitAbility, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000048, "Member 'GA_Uncle_Brolly_Float_C_InitAbility::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Float_C_InitAbility, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000050, "Member 'GA_Uncle_Brolly_Float_C_InitAbility::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Float_C_InitAbility, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'GA_Uncle_Brolly_Float_C_InitAbility::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

}

