#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Uncle_Brolly_Block

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Uncle_Brolly_Block.GA_Uncle_Brolly_Block_C.ExecuteUbergraph_GA_Uncle_Brolly_Block
// 0x0848 (0x0848 - 0x0000)
struct GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_Payload_3;                      // 0x0028(0x00B0)()
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00D8(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayEventData                     Temp_struct_Variable;                              // 0x00E8(0x00B0)()
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue;            // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A1[0x3];                                      // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x01A4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_Payload_2;                      // 0x01B8(0x00B0)()
	struct FGameplayEventData                     Temp_struct_Variable_1;                            // 0x0268(0x00B0)()
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue_1;          // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_321[0x3];                                      // 0x0321(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0324(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_334[0x4];                                      // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_Payload_1;                      // 0x0338(0x00B0)()
	struct FGameplayEventData                     Temp_struct_Variable_2;                            // 0x03E8(0x00B0)()
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue_2;          // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A1[0x3];                                      // 0x04A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x04A4(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x04B4(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x04C4(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x04D4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_4E4[0x4];                                      // 0x04E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_Payload;                        // 0x04E8(0x00B0)()
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_9;            // 0x0598(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayEventData                     Temp_struct_Variable_3;                            // 0x05A8(0x00B0)()
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue_3;          // 0x0658(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0660(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_661[0x3];                                      // 0x0661(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x0664(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_11;           // 0x0674(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_684[0x4];                                      // 0x0684(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_NetworkSyncPoint*          CallFunc_WaitNetSync_ReturnValue;                  // 0x0688(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_12;           // 0x0690(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x06A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A1[0x7];                                      // 0x06A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue;           // 0x06A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x06B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B1[0x3];                                      // 0x06B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_13;           // 0x06B4(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_CheckMinInputHeldDuration_Success;        // 0x06C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C5[0x3];                                      // 0x06C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_CheckMinInputHeldDuration_MinDurationRemainder; // 0x06C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6CC[0x4];                                      // 0x06CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue_1;         // 0x06D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue_2;         // 0x06D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x06E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x06E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E2[0x6];                                      // 0x06E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue_3;         // 0x06E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue_4;         // 0x06F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x06F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x06F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6FA[0x6];                                      // 0x06FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue_5;         // 0x0700(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue_6;         // 0x0708(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x0710(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x0711(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_712[0x6];                                      // 0x0712(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue_7;         // 0x0718(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_12;                   // 0x0720(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_721[0x3];                                      // 0x0721(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_14;           // 0x0724(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0734(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_735[0x3];                                      // 0x0735(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0738(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayTagRemoved*    CallFunc_WaitGameplayTagRemove_ReturnValue;        // 0x0740(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_15;           // 0x0748(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_13;                   // 0x0758(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_759[0x7];                                      // 0x0759(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue_8;         // 0x0760(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_16;           // 0x0768(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_14;                   // 0x0778(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_779[0x7];                                      // 0x0779(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData;               // 0x0780(0x00B0)()
	bool                                          CallFunc_CheckHasFloatingTags_ReturnValue;         // 0x0830(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckHasFloatingTags_ReturnValue_1;       // 0x0831(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0832(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0833(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0834(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_835[0x3];                                      // 0x0835(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0838(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_83C[0x4];                                      // 0x083C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0840(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block) == 0x000008, "Wrong alignment on GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block");
static_assert(sizeof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block) == 0x000848, "Wrong size on GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, EntryPoint) == 0x000000, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, K2Node_CustomEvent_Payload_3) == 0x000028, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::K2Node_CustomEvent_Payload_3' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000D8, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, Temp_struct_Variable) == 0x0000E8, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, CallFunc_WaitGameplayEvent_ReturnValue) == 0x000198, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::CallFunc_WaitGameplayEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, CallFunc_IsValid_ReturnValue) == 0x0001A0, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, K2Node_CreateDelegate_OutputDelegate_3) == 0x0001A4, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, K2Node_CustomEvent_Payload_2) == 0x0001B8, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::K2Node_CustomEvent_Payload_2' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, Temp_struct_Variable_1) == 0x000268, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, CallFunc_WaitGameplayEvent_ReturnValue_1) == 0x000318, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::CallFunc_WaitGameplayEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, CallFunc_IsValid_ReturnValue_1) == 0x000320, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, K2Node_CreateDelegate_OutputDelegate_4) == 0x000324, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, K2Node_CustomEvent_Payload_1) == 0x000338, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::K2Node_CustomEvent_Payload_1' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, Temp_struct_Variable_2) == 0x0003E8, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, CallFunc_WaitGameplayEvent_ReturnValue_2) == 0x000498, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::CallFunc_WaitGameplayEvent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, CallFunc_IsValid_ReturnValue_2) == 0x0004A0, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, K2Node_CreateDelegate_OutputDelegate_5) == 0x0004A4, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, K2Node_CreateDelegate_OutputDelegate_6) == 0x0004B4, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, K2Node_CreateDelegate_OutputDelegate_7) == 0x0004C4, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, K2Node_CreateDelegate_OutputDelegate_8) == 0x0004D4, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, K2Node_CustomEvent_Payload) == 0x0004E8, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, K2Node_CreateDelegate_OutputDelegate_9) == 0x000598, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, Temp_struct_Variable_3) == 0x0005A8, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, CallFunc_WaitGameplayEvent_ReturnValue_3) == 0x000658, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::CallFunc_WaitGameplayEvent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, CallFunc_IsValid_ReturnValue_3) == 0x000660, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, K2Node_CreateDelegate_OutputDelegate_10) == 0x000664, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, K2Node_CreateDelegate_OutputDelegate_11) == 0x000674, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, CallFunc_WaitNetSync_ReturnValue) == 0x000688, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::CallFunc_WaitNetSync_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, K2Node_CreateDelegate_OutputDelegate_12) == 0x000690, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, CallFunc_IsValid_ReturnValue_4) == 0x0006A0, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, CallFunc_WaitGameplayTagAdd_ReturnValue) == 0x0006A8, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::CallFunc_WaitGameplayTagAdd_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, CallFunc_IsValid_ReturnValue_5) == 0x0006B0, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, K2Node_CreateDelegate_OutputDelegate_13) == 0x0006B4, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::K2Node_CreateDelegate_OutputDelegate_13' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, CallFunc_CheckMinInputHeldDuration_Success) == 0x0006C4, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::CallFunc_CheckMinInputHeldDuration_Success' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, CallFunc_CheckMinInputHeldDuration_MinDurationRemainder) == 0x0006C8, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::CallFunc_CheckMinInputHeldDuration_MinDurationRemainder' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, CallFunc_WaitGameplayTagAdd_ReturnValue_1) == 0x0006D0, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::CallFunc_WaitGameplayTagAdd_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, CallFunc_WaitGameplayTagAdd_ReturnValue_2) == 0x0006D8, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::CallFunc_WaitGameplayTagAdd_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, CallFunc_IsValid_ReturnValue_6) == 0x0006E0, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, CallFunc_IsValid_ReturnValue_7) == 0x0006E1, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, CallFunc_WaitGameplayTagAdd_ReturnValue_3) == 0x0006E8, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::CallFunc_WaitGameplayTagAdd_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, CallFunc_WaitGameplayTagAdd_ReturnValue_4) == 0x0006F0, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::CallFunc_WaitGameplayTagAdd_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, CallFunc_IsValid_ReturnValue_8) == 0x0006F8, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, CallFunc_IsValid_ReturnValue_9) == 0x0006F9, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, CallFunc_WaitGameplayTagAdd_ReturnValue_5) == 0x000700, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::CallFunc_WaitGameplayTagAdd_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, CallFunc_WaitGameplayTagAdd_ReturnValue_6) == 0x000708, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::CallFunc_WaitGameplayTagAdd_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, CallFunc_IsValid_ReturnValue_10) == 0x000710, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::CallFunc_IsValid_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, CallFunc_IsValid_ReturnValue_11) == 0x000711, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::CallFunc_IsValid_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, CallFunc_WaitGameplayTagAdd_ReturnValue_7) == 0x000718, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::CallFunc_WaitGameplayTagAdd_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, CallFunc_IsValid_ReturnValue_12) == 0x000720, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::CallFunc_IsValid_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, K2Node_CreateDelegate_OutputDelegate_14) == 0x000724, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::K2Node_CreateDelegate_OutputDelegate_14' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, K2Node_SwitchEnum_CmpSuccess) == 0x000734, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000738, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, CallFunc_WaitGameplayTagRemove_ReturnValue) == 0x000740, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::CallFunc_WaitGameplayTagRemove_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, K2Node_CreateDelegate_OutputDelegate_15) == 0x000748, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::K2Node_CreateDelegate_OutputDelegate_15' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, CallFunc_IsValid_ReturnValue_13) == 0x000758, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::CallFunc_IsValid_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, CallFunc_WaitGameplayTagAdd_ReturnValue_8) == 0x000760, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::CallFunc_WaitGameplayTagAdd_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, K2Node_CreateDelegate_OutputDelegate_16) == 0x000768, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::K2Node_CreateDelegate_OutputDelegate_16' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, CallFunc_IsValid_ReturnValue_14) == 0x000778, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::CallFunc_IsValid_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, K2Node_MakeStruct_GameplayEventData) == 0x000780, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::K2Node_MakeStruct_GameplayEventData' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, CallFunc_CheckHasFloatingTags_ReturnValue) == 0x000830, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::CallFunc_CheckHasFloatingTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, CallFunc_CheckHasFloatingTags_ReturnValue_1) == 0x000831, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::CallFunc_CheckHasFloatingTags_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, CallFunc_Not_PreBool_ReturnValue) == 0x000832, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, K2Node_Event_bWasCancelled) == 0x000833, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, CallFunc_IsLocallyControlled_ReturnValue) == 0x000834, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, CallFunc_GetValueAtLevel_ReturnValue) == 0x000838, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000840, "Member 'GA_Uncle_Brolly_Block_C_ExecuteUbergraph_GA_Uncle_Brolly_Block::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");

// Function GA_Uncle_Brolly_Block.GA_Uncle_Brolly_Block_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Uncle_Brolly_Block_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Uncle_Brolly_Block_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Uncle_Brolly_Block_C_K2_OnEndAbility");
static_assert(sizeof(GA_Uncle_Brolly_Block_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Uncle_Brolly_Block_C_K2_OnEndAbility");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Uncle_Brolly_Block_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_Uncle_Brolly_Block.GA_Uncle_Brolly_Block_C.EventReceived_649012DE4C5ACF44569293894A96AFD2
// 0x00B0 (0x00B0 - 0x0000)
struct GA_Uncle_Brolly_Block_C_EventReceived_649012DE4C5ACF44569293894A96AFD2 final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Uncle_Brolly_Block_C_EventReceived_649012DE4C5ACF44569293894A96AFD2) == 0x000008, "Wrong alignment on GA_Uncle_Brolly_Block_C_EventReceived_649012DE4C5ACF44569293894A96AFD2");
static_assert(sizeof(GA_Uncle_Brolly_Block_C_EventReceived_649012DE4C5ACF44569293894A96AFD2) == 0x0000B0, "Wrong size on GA_Uncle_Brolly_Block_C_EventReceived_649012DE4C5ACF44569293894A96AFD2");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_EventReceived_649012DE4C5ACF44569293894A96AFD2, Payload) == 0x000000, "Member 'GA_Uncle_Brolly_Block_C_EventReceived_649012DE4C5ACF44569293894A96AFD2::Payload' has a wrong offset!");

// Function GA_Uncle_Brolly_Block.GA_Uncle_Brolly_Block_C.EventReceived_D93809AD482D8DB8DECD5BBB2CD338B9
// 0x00B0 (0x00B0 - 0x0000)
struct GA_Uncle_Brolly_Block_C_EventReceived_D93809AD482D8DB8DECD5BBB2CD338B9 final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Uncle_Brolly_Block_C_EventReceived_D93809AD482D8DB8DECD5BBB2CD338B9) == 0x000008, "Wrong alignment on GA_Uncle_Brolly_Block_C_EventReceived_D93809AD482D8DB8DECD5BBB2CD338B9");
static_assert(sizeof(GA_Uncle_Brolly_Block_C_EventReceived_D93809AD482D8DB8DECD5BBB2CD338B9) == 0x0000B0, "Wrong size on GA_Uncle_Brolly_Block_C_EventReceived_D93809AD482D8DB8DECD5BBB2CD338B9");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_EventReceived_D93809AD482D8DB8DECD5BBB2CD338B9, Payload) == 0x000000, "Member 'GA_Uncle_Brolly_Block_C_EventReceived_D93809AD482D8DB8DECD5BBB2CD338B9::Payload' has a wrong offset!");

// Function GA_Uncle_Brolly_Block.GA_Uncle_Brolly_Block_C.EventReceived_F0D49DEF4CABD7D2970EE482332B97F3
// 0x00B0 (0x00B0 - 0x0000)
struct GA_Uncle_Brolly_Block_C_EventReceived_F0D49DEF4CABD7D2970EE482332B97F3 final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Uncle_Brolly_Block_C_EventReceived_F0D49DEF4CABD7D2970EE482332B97F3) == 0x000008, "Wrong alignment on GA_Uncle_Brolly_Block_C_EventReceived_F0D49DEF4CABD7D2970EE482332B97F3");
static_assert(sizeof(GA_Uncle_Brolly_Block_C_EventReceived_F0D49DEF4CABD7D2970EE482332B97F3) == 0x0000B0, "Wrong size on GA_Uncle_Brolly_Block_C_EventReceived_F0D49DEF4CABD7D2970EE482332B97F3");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_EventReceived_F0D49DEF4CABD7D2970EE482332B97F3, Payload) == 0x000000, "Member 'GA_Uncle_Brolly_Block_C_EventReceived_F0D49DEF4CABD7D2970EE482332B97F3::Payload' has a wrong offset!");

// Function GA_Uncle_Brolly_Block.GA_Uncle_Brolly_Block_C.EventReceived_B232DF744F9B5B3563AFBBAA89EC49C0
// 0x00B0 (0x00B0 - 0x0000)
struct GA_Uncle_Brolly_Block_C_EventReceived_B232DF744F9B5B3563AFBBAA89EC49C0 final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Uncle_Brolly_Block_C_EventReceived_B232DF744F9B5B3563AFBBAA89EC49C0) == 0x000008, "Wrong alignment on GA_Uncle_Brolly_Block_C_EventReceived_B232DF744F9B5B3563AFBBAA89EC49C0");
static_assert(sizeof(GA_Uncle_Brolly_Block_C_EventReceived_B232DF744F9B5B3563AFBBAA89EC49C0) == 0x0000B0, "Wrong size on GA_Uncle_Brolly_Block_C_EventReceived_B232DF744F9B5B3563AFBBAA89EC49C0");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_EventReceived_B232DF744F9B5B3563AFBBAA89EC49C0, Payload) == 0x000000, "Member 'GA_Uncle_Brolly_Block_C_EventReceived_B232DF744F9B5B3563AFBBAA89EC49C0::Payload' has a wrong offset!");

// Function GA_Uncle_Brolly_Block.GA_Uncle_Brolly_Block_C.InitAbility
// 0x0028 (0x0028 - 0x0000)
struct GA_Uncle_Brolly_Block_C_InitAbility final
{
public:
	bool                                          CallFunc_IsFalling_ReturnValue;                    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortWeapon*                            CallFunc_GetCurrentSourceWeapon_ReturnValue;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_UncleBrolly_C*                       K2Node_DynamicCast_AsB_Uncle_Brolly;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Uncle_Brolly_Block_C_InitAbility) == 0x000008, "Wrong alignment on GA_Uncle_Brolly_Block_C_InitAbility");
static_assert(sizeof(GA_Uncle_Brolly_Block_C_InitAbility) == 0x000028, "Wrong size on GA_Uncle_Brolly_Block_C_InitAbility");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_InitAbility, CallFunc_IsFalling_ReturnValue) == 0x000000, "Member 'GA_Uncle_Brolly_Block_C_InitAbility::CallFunc_IsFalling_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_InitAbility, CallFunc_K2_CommitAbility_ReturnValue) == 0x000001, "Member 'GA_Uncle_Brolly_Block_C_InitAbility::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_InitAbility, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000004, "Member 'GA_Uncle_Brolly_Block_C_InitAbility::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_InitAbility, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x00000C, "Member 'GA_Uncle_Brolly_Block_C_InitAbility::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_InitAbility, CallFunc_GetCurrentSourceWeapon_ReturnValue) == 0x000010, "Member 'GA_Uncle_Brolly_Block_C_InitAbility::CallFunc_GetCurrentSourceWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_InitAbility, K2Node_DynamicCast_AsB_Uncle_Brolly) == 0x000018, "Member 'GA_Uncle_Brolly_Block_C_InitAbility::K2Node_DynamicCast_AsB_Uncle_Brolly' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_InitAbility, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'GA_Uncle_Brolly_Block_C_InitAbility::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function GA_Uncle_Brolly_Block.GA_Uncle_Brolly_Block_C.EnableBlockingCollision
// 0x00F0 (0x00F0 - 0x0000)
struct GA_Uncle_Brolly_Block_C_EnableBlockingCollision final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetAttachedActors_OutActors;              // 0x0058(0x0010)(ZeroConstructor, ReferenceParm)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0080(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_Uncle_Brolly_Block_Collision_C*      K2Node_DynamicCast_AsB_Uncle_Brolly_Block_Collision; // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AB_Uncle_Brolly_Block_Collision_C*      K2Node_DynamicCast_AsB_Uncle_Brolly_Block_Collision_1; // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Uncle_Brolly_Block_C_EnableBlockingCollision) == 0x000010, "Wrong alignment on GA_Uncle_Brolly_Block_C_EnableBlockingCollision");
static_assert(sizeof(GA_Uncle_Brolly_Block_C_EnableBlockingCollision) == 0x0000F0, "Wrong size on GA_Uncle_Brolly_Block_C_EnableBlockingCollision");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_EnableBlockingCollision, Temp_int_Array_Index_Variable) == 0x000000, "Member 'GA_Uncle_Brolly_Block_C_EnableBlockingCollision::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_EnableBlockingCollision, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'GA_Uncle_Brolly_Block_C_EnableBlockingCollision::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_EnableBlockingCollision, CallFunc_IsDedicatedServer_ReturnValue) == 0x000008, "Member 'GA_Uncle_Brolly_Block_C_EnableBlockingCollision::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_EnableBlockingCollision, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'GA_Uncle_Brolly_Block_C_EnableBlockingCollision::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_EnableBlockingCollision, CallFunc_MakeVector_ReturnValue) == 0x000010, "Member 'GA_Uncle_Brolly_Block_C_EnableBlockingCollision::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_EnableBlockingCollision, CallFunc_K2_GetActorRotation_ReturnValue) == 0x00001C, "Member 'GA_Uncle_Brolly_Block_C_EnableBlockingCollision::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_EnableBlockingCollision, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000028, "Member 'GA_Uncle_Brolly_Block_C_EnableBlockingCollision::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_EnableBlockingCollision, CallFunc_GetActorForwardVector_ReturnValue) == 0x000034, "Member 'GA_Uncle_Brolly_Block_C_EnableBlockingCollision::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_EnableBlockingCollision, CallFunc_Add_VectorVector_ReturnValue) == 0x000040, "Member 'GA_Uncle_Brolly_Block_C_EnableBlockingCollision::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_EnableBlockingCollision, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x00004C, "Member 'GA_Uncle_Brolly_Block_C_EnableBlockingCollision::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_EnableBlockingCollision, CallFunc_GetAttachedActors_OutActors) == 0x000058, "Member 'GA_Uncle_Brolly_Block_C_EnableBlockingCollision::CallFunc_GetAttachedActors_OutActors' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_EnableBlockingCollision, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000068, "Member 'GA_Uncle_Brolly_Block_C_EnableBlockingCollision::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_EnableBlockingCollision, CallFunc_Array_Get_Item) == 0x000078, "Member 'GA_Uncle_Brolly_Block_C_EnableBlockingCollision::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_EnableBlockingCollision, CallFunc_MakeTransform_ReturnValue) == 0x000080, "Member 'GA_Uncle_Brolly_Block_C_EnableBlockingCollision::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_EnableBlockingCollision, CallFunc_IsValid_ReturnValue) == 0x0000B0, "Member 'GA_Uncle_Brolly_Block_C_EnableBlockingCollision::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_EnableBlockingCollision, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000B8, "Member 'GA_Uncle_Brolly_Block_C_EnableBlockingCollision::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_EnableBlockingCollision, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000C0, "Member 'GA_Uncle_Brolly_Block_C_EnableBlockingCollision::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_EnableBlockingCollision, K2Node_DynamicCast_AsB_Uncle_Brolly_Block_Collision) == 0x0000C8, "Member 'GA_Uncle_Brolly_Block_C_EnableBlockingCollision::K2Node_DynamicCast_AsB_Uncle_Brolly_Block_Collision' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_EnableBlockingCollision, K2Node_DynamicCast_bSuccess) == 0x0000D0, "Member 'GA_Uncle_Brolly_Block_C_EnableBlockingCollision::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_EnableBlockingCollision, K2Node_DynamicCast_AsB_Uncle_Brolly_Block_Collision_1) == 0x0000D8, "Member 'GA_Uncle_Brolly_Block_C_EnableBlockingCollision::K2Node_DynamicCast_AsB_Uncle_Brolly_Block_Collision_1' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_EnableBlockingCollision, K2Node_DynamicCast_bSuccess_1) == 0x0000E0, "Member 'GA_Uncle_Brolly_Block_C_EnableBlockingCollision::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_EnableBlockingCollision, CallFunc_Array_Length_ReturnValue) == 0x0000E4, "Member 'GA_Uncle_Brolly_Block_C_EnableBlockingCollision::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_EnableBlockingCollision, CallFunc_Less_IntInt_ReturnValue) == 0x0000E8, "Member 'GA_Uncle_Brolly_Block_C_EnableBlockingCollision::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function GA_Uncle_Brolly_Block.GA_Uncle_Brolly_Block_C.EndAbilityCleanup
// 0x0004 (0x0004 - 0x0000)
struct GA_Uncle_Brolly_Block_C_EndAbilityCleanup final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Uncle_Brolly_Block_C_EndAbilityCleanup) == 0x000001, "Wrong alignment on GA_Uncle_Brolly_Block_C_EndAbilityCleanup");
static_assert(sizeof(GA_Uncle_Brolly_Block_C_EndAbilityCleanup) == 0x000004, "Wrong size on GA_Uncle_Brolly_Block_C_EndAbilityCleanup");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_EndAbilityCleanup, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'GA_Uncle_Brolly_Block_C_EndAbilityCleanup::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_EndAbilityCleanup, CallFunc_IsValid_ReturnValue_1) == 0x000001, "Member 'GA_Uncle_Brolly_Block_C_EndAbilityCleanup::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_EndAbilityCleanup, CallFunc_IsValid_ReturnValue_2) == 0x000002, "Member 'GA_Uncle_Brolly_Block_C_EndAbilityCleanup::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_EndAbilityCleanup, CallFunc_IsValid_ReturnValue_3) == 0x000003, "Member 'GA_Uncle_Brolly_Block_C_EndAbilityCleanup::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");

// Function GA_Uncle_Brolly_Block.GA_Uncle_Brolly_Block_C.CachePawnAndAbilitySystem
// 0x0028 (0x0028 - 0x0000)
struct GA_Uncle_Brolly_Block_C_CachePawnAndAbilitySystem final
{
public:
	class UFortAbilitySystemComponent*            CallFunc_GetFortAbilitySystemComponent_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Uncle_Brolly_Block_C_CachePawnAndAbilitySystem) == 0x000008, "Wrong alignment on GA_Uncle_Brolly_Block_C_CachePawnAndAbilitySystem");
static_assert(sizeof(GA_Uncle_Brolly_Block_C_CachePawnAndAbilitySystem) == 0x000028, "Wrong size on GA_Uncle_Brolly_Block_C_CachePawnAndAbilitySystem");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_CachePawnAndAbilitySystem, CallFunc_GetFortAbilitySystemComponent_ReturnValue) == 0x000000, "Member 'GA_Uncle_Brolly_Block_C_CachePawnAndAbilitySystem::CallFunc_GetFortAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_CachePawnAndAbilitySystem, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'GA_Uncle_Brolly_Block_C_CachePawnAndAbilitySystem::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_CachePawnAndAbilitySystem, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000010, "Member 'GA_Uncle_Brolly_Block_C_CachePawnAndAbilitySystem::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_CachePawnAndAbilitySystem, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000018, "Member 'GA_Uncle_Brolly_Block_C_CachePawnAndAbilitySystem::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_CachePawnAndAbilitySystem, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'GA_Uncle_Brolly_Block_C_CachePawnAndAbilitySystem::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function GA_Uncle_Brolly_Block.GA_Uncle_Brolly_Block_C.HandleWeaponToggles
// 0x0020 (0x0020 - 0x0000)
struct GA_Uncle_Brolly_Block_C_HandleWeaponToggles final
{
public:
	bool                                          Hide;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortWeapon*                            CallFunc_GetCurrentSourceWeapon_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_UncleBrolly_C*                       K2Node_DynamicCast_AsB_Uncle_Brolly;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Uncle_Brolly_Block_C_HandleWeaponToggles) == 0x000008, "Wrong alignment on GA_Uncle_Brolly_Block_C_HandleWeaponToggles");
static_assert(sizeof(GA_Uncle_Brolly_Block_C_HandleWeaponToggles) == 0x000020, "Wrong size on GA_Uncle_Brolly_Block_C_HandleWeaponToggles");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_HandleWeaponToggles, Hide) == 0x000000, "Member 'GA_Uncle_Brolly_Block_C_HandleWeaponToggles::Hide' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_HandleWeaponToggles, CallFunc_GetCurrentSourceWeapon_ReturnValue) == 0x000008, "Member 'GA_Uncle_Brolly_Block_C_HandleWeaponToggles::CallFunc_GetCurrentSourceWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_HandleWeaponToggles, K2Node_DynamicCast_AsB_Uncle_Brolly) == 0x000010, "Member 'GA_Uncle_Brolly_Block_C_HandleWeaponToggles::K2Node_DynamicCast_AsB_Uncle_Brolly' has a wrong offset!");
static_assert(offsetof(GA_Uncle_Brolly_Block_C_HandleWeaponToggles, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'GA_Uncle_Brolly_Block_C_HandleWeaponToggles::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function GA_Uncle_Brolly_Block.GA_Uncle_Brolly_Block_C.CheckShouldFloat
// 0x0050 (0x0050 - 0x0000)
struct GA_Uncle_Brolly_Block_C_CheckShouldFloat final
{
public:
