#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAB_SurfaceChange

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GAB_SurfaceChange.GAB_SurfaceChange_C
// 0x01C8 (0x0BF8 - 0x0A30)
class UGAB_SurfaceChange_C final : public UFortGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A30(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          Debug;                                             // 0x0A38(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A39[0x7];                                      // 0x0A39(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         RemovalDelay;                                      // 0x0A40(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         IcySurfacesEnabled;                                // 0x0A60(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  HasIce;                                            // 0x0A80(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 GE_SurfaceChange_Ice;                              // 0x0AA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_SurfaceChange_Snow;                             // 0x0AA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_SurfaceChange_Lava;                             // 0x0AB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawnAthena*                  PlayerPawn;                                        // 0x0AB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  IceTags;                                           // 0x0AC0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  LavaTags;                                          // 0x0AE0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  SnowTags;                                          // 0x0B00(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         LavaBounceMultiplier;                              // 0x0B20(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RandomAngleOffset;                                 // 0x0B24(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         RandomConeAngle;                                   // 0x0B28(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         FacingAngleVelocityComponent;                      // 0x0B48(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         BaseVerticalBounceVelocity;                        // 0x0B68(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         BaseLateralBounceVelocity;                         // 0x0B88(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         MaxBounceMultiplier;                               // 0x0BA8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         BounceMultiplierStepAmount;                        // 0x0BC8(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRandomStream                          RandomAngleStream;                                 // 0x0BE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor)
	struct FGameplayTag                           LavaBounceCue;                                     // 0x0BF0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GAB_SurfaceChange(int32 EntryPoint);
	void MovementModeChanged(class ACharacter* Character, EMovementMode PrevMovementMode, uint8 PreviousCustomMode);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void SurfaceCleanupSpecial();
	void HotfixableGEApplication(const struct FScalableFloat& Input, class UClass* GameplayEffectAppliedOnTrue, class UClass* GameplayEffectAppliedOnFalse);
	void LavaBounce();
	void SurfaceCleanup(bool AddLingeringEffects, EPhysicalSurface SurfaceType);
	void OnRep_ReplicatedRandomAngle();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GAB_SurfaceChange_C">();
	}
	static class UGAB_SurfaceChange_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGAB_SurfaceChange_C>();
	}
};
static_assert(alignof(UGAB_SurfaceChange_C) == 0x000008, "Wrong alignment on UGAB_SurfaceChange_C");
static_assert(sizeof(UGAB_SurfaceChange_C) == 0x000BF8, "Wrong size on UGAB_SurfaceChange_C");
static_assert(offsetof(UGAB_SurfaceChange_C, UberGraphFrame) == 0x000A30, "Member 'UGAB_SurfaceChange_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGAB_SurfaceChange_C, Debug) == 0x000A38, "Member 'UGAB_SurfaceChange_C::Debug' has a wrong offset!");
static_assert(offsetof(UGAB_SurfaceChange_C, RemovalDelay) == 0x000A40, "Member 'UGAB_SurfaceChange_C::RemovalDelay' has a wrong offset!");
static_assert(offsetof(UGAB_SurfaceChange_C, IcySurfacesEnabled) == 0x000A60, "Member 'UGAB_SurfaceChange_C::IcySurfacesEnabled' has a wrong offset!");
static_assert(offsetof(UGAB_SurfaceChange_C, HasIce) == 0x000A80, "Member 'UGAB_SurfaceChange_C::HasIce' has a wrong offset!");
static_assert(offsetof(UGAB_SurfaceChange_C, GE_SurfaceChange_Ice) == 0x000AA0, "Member 'UGAB_SurfaceChange_C::GE_SurfaceChange_Ice' has a wrong offset!");
static_assert(offsetof(UGAB_SurfaceChange_C, GE_SurfaceChange_Snow) == 0x000AA8, "Member 'UGAB_SurfaceChange_C::GE_SurfaceChange_Snow' has a wrong offset!");
static_assert(offsetof(UGAB_SurfaceChange_C, GE_SurfaceChange_Lava) == 0x000AB0, "Member 'UGAB_SurfaceChange_C::GE_SurfaceChange_Lava' has a wrong offset!");
static_assert(offsetof(UGAB_SurfaceChange_C, PlayerPawn) == 0x000AB8, "Member 'UGAB_SurfaceChange_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(UGAB_SurfaceChange_C, IceTags) == 0x000AC0, "Member 'UGAB_SurfaceChange_C::IceTags' has a wrong offset!");
static_assert(offsetof(UGAB_SurfaceChange_C, LavaTags) == 0x000AE0, "Member 'UGAB_SurfaceChange_C::LavaTags' has a wrong offset!");
static_assert(offsetof(UGAB_SurfaceChange_C, SnowTags) == 0x000B00, "Member 'UGAB_SurfaceChange_C::SnowTags' has a wrong offset!");
static_assert(offsetof(UGAB_SurfaceChange_C, LavaBounceMultiplier) == 0x000B20, "Member 'UGAB_SurfaceChange_C::LavaBounceMultiplier' has a wrong offset!");
static_assert(offsetof(UGAB_SurfaceChange_C, RandomAngleOffset) == 0x000B24, "Member 'UGAB_SurfaceChange_C::RandomAngleOffset' has a wrong offset!");
static_assert(offsetof(UGAB_SurfaceChange_C, RandomConeAngle) == 0x000B28, "Member 'UGAB_SurfaceChange_C::RandomConeAngle' has a wrong offset!");
static_assert(offsetof(UGAB_SurfaceChange_C, FacingAngleVelocityComponent) == 0x000B48, "Member 'UGAB_SurfaceChange_C::FacingAngleVelocityComponent' has a wrong offset!");
static_assert(offsetof(UGAB_SurfaceChange_C, BaseVerticalBounceVelocity) == 0x000B68, "Member 'UGAB_SurfaceChange_C::BaseVerticalBounceVelocity' has a wrong offset!");
static_assert(offsetof(UGAB_SurfaceChange_C, BaseLateralBounceVelocity) == 0x000B88, "Member 'UGAB_SurfaceChange_C::BaseLateralBounceVelocity' has a wrong offset!");
static_assert(offsetof(UGAB_SurfaceChange_C, MaxBounceMultiplier) == 0x000BA8, "Member 'UGAB_SurfaceChange_C::MaxBounceMultiplier' has a wrong offset!");
static_assert(offsetof(UGAB_SurfaceChange_C, BounceMultiplierStepAmount) == 0x000BC8, "Member 'UGAB_SurfaceChange_C::BounceMultiplierStepAmount' has a wrong offset!");
static_assert(offsetof(UGAB_SurfaceChange_C, RandomAngleStream) == 0x000BE8, "Member 'UGAB_SurfaceChange_C::RandomAngleStream' has a wrong offset!");
static_assert(offsetof(UGAB_SurfaceChange_C, LavaBounceCue) == 0x000BF0, "Member 'UGAB_SurfaceChange_C::LavaBounceCue' has a wrong offset!");

}

