#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_Uncle_Floating

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GCNL_Uncle_Floating.GCNL_Uncle_Floating_C.ExecuteUbergraph_GCNL_Uncle_Floating
// 0x02C0 (0x02C0 - 0x0000)
struct GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_MyTarget_1;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters_1;                         // 0x0020(0x00B8)(ConstParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       K2Node_Event_ParticleComponents_1;                 // 0x00D8(0x0010)(ConstParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents_1;                    // 0x00E8(0x0010)(ConstParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference)
	float                                         CallFunc_BreakGameplayCueParameters_NormalizedMagnitude; // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakGameplayCueParameters_RawMagnitude;  // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           CallFunc_BreakGameplayCueParameters_EffectContext; // 0x0100(0x0018)()
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_MatchedTagName; // 0x0118(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_BreakGameplayCueParameters_OriginalTag;   // 0x0120(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedSourceTags; // 0x0128(0x0020)()
	struct FGameplayTagContainer                  CallFunc_BreakGameplayCueParameters_AggregatedTargetTags; // 0x0148(0x0020)()
	struct FVector                                CallFunc_BreakGameplayCueParameters_Location;      // 0x0168(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakGameplayCueParameters_Normal;        // 0x0174(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_Instigator;    // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakGameplayCueParameters_EffectCauser;  // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_BreakGameplayCueParameters_SourceObject;  // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakGameplayCueParameters_PhysicalMaterial; // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_GameplayEffectLevel; // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakGameplayCueParameters_AbilityLevel;  // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_BreakGameplayCueParameters_TargetAttachComponent; // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_MyTarget;                             // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 K2Node_Event_Parameters;                           // 0x01C8(0x00B8)(ConstParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       K2Node_Event_ParticleComponents;                   // 0x0280(0x0010)(ConstParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                K2Node_Event_AudioComponents;                      // 0x0290(0x0010)(ConstParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference)
	class UCameraShake*                           K2Node_Event_BurstCameraShakeInstance;             // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            K2Node_Event_BurstDecalInstance;                   // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x02B8(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating) == 0x000008, "Wrong alignment on GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating");
static_assert(sizeof(GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating) == 0x0002C0, "Wrong size on GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating");
static_assert(offsetof(GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating, EntryPoint) == 0x000000, "Member 'GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating, K2Node_Event_MyTarget_1) == 0x000018, "Member 'GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating::K2Node_Event_MyTarget_1' has a wrong offset!");
static_assert(offsetof(GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating, K2Node_Event_Parameters_1) == 0x000020, "Member 'GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating::K2Node_Event_Parameters_1' has a wrong offset!");
static_assert(offsetof(GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating, K2Node_Event_ParticleComponents_1) == 0x0000D8, "Member 'GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating::K2Node_Event_ParticleComponents_1' has a wrong offset!");
static_assert(offsetof(GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating, K2Node_Event_AudioComponents_1) == 0x0000E8, "Member 'GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating::K2Node_Event_AudioComponents_1' has a wrong offset!");
static_assert(offsetof(GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating, CallFunc_BreakGameplayCueParameters_NormalizedMagnitude) == 0x0000F8, "Member 'GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating::CallFunc_BreakGameplayCueParameters_NormalizedMagnitude' has a wrong offset!");
static_assert(offsetof(GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating, CallFunc_BreakGameplayCueParameters_RawMagnitude) == 0x0000FC, "Member 'GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating::CallFunc_BreakGameplayCueParameters_RawMagnitude' has a wrong offset!");
static_assert(offsetof(GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating, CallFunc_BreakGameplayCueParameters_EffectContext) == 0x000100, "Member 'GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating::CallFunc_BreakGameplayCueParameters_EffectContext' has a wrong offset!");
static_assert(offsetof(GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating, CallFunc_BreakGameplayCueParameters_MatchedTagName) == 0x000118, "Member 'GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating::CallFunc_BreakGameplayCueParameters_MatchedTagName' has a wrong offset!");
static_assert(offsetof(GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating, CallFunc_BreakGameplayCueParameters_OriginalTag) == 0x000120, "Member 'GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating::CallFunc_BreakGameplayCueParameters_OriginalTag' has a wrong offset!");
static_assert(offsetof(GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating, CallFunc_BreakGameplayCueParameters_AggregatedSourceTags) == 0x000128, "Member 'GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating::CallFunc_BreakGameplayCueParameters_AggregatedSourceTags' has a wrong offset!");
static_assert(offsetof(GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating, CallFunc_BreakGameplayCueParameters_AggregatedTargetTags) == 0x000148, "Member 'GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating::CallFunc_BreakGameplayCueParameters_AggregatedTargetTags' has a wrong offset!");
static_assert(offsetof(GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating, CallFunc_BreakGameplayCueParameters_Location) == 0x000168, "Member 'GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating::CallFunc_BreakGameplayCueParameters_Location' has a wrong offset!");
static_assert(offsetof(GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating, CallFunc_BreakGameplayCueParameters_Normal) == 0x000174, "Member 'GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating::CallFunc_BreakGameplayCueParameters_Normal' has a wrong offset!");
static_assert(offsetof(GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating, CallFunc_BreakGameplayCueParameters_Instigator) == 0x000180, "Member 'GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating::CallFunc_BreakGameplayCueParameters_Instigator' has a wrong offset!");
static_assert(offsetof(GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating, CallFunc_BreakGameplayCueParameters_EffectCauser) == 0x000188, "Member 'GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating::CallFunc_BreakGameplayCueParameters_EffectCauser' has a wrong offset!");
static_assert(offsetof(GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating, CallFunc_BreakGameplayCueParameters_SourceObject) == 0x000190, "Member 'GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating::CallFunc_BreakGameplayCueParameters_SourceObject' has a wrong offset!");
static_assert(offsetof(GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating, CallFunc_BreakGameplayCueParameters_PhysicalMaterial) == 0x000198, "Member 'GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating::CallFunc_BreakGameplayCueParameters_PhysicalMaterial' has a wrong offset!");
static_assert(offsetof(GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating, CallFunc_BreakGameplayCueParameters_GameplayEffectLevel) == 0x0001A0, "Member 'GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating::CallFunc_BreakGameplayCueParameters_GameplayEffectLevel' has a wrong offset!");
static_assert(offsetof(GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating, CallFunc_BreakGameplayCueParameters_AbilityLevel) == 0x0001A4, "Member 'GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating::CallFunc_BreakGameplayCueParameters_AbilityLevel' has a wrong offset!");
static_assert(offsetof(GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating, CallFunc_BreakGameplayCueParameters_TargetAttachComponent) == 0x0001A8, "Member 'GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating::CallFunc_BreakGameplayCueParameters_TargetAttachComponent' has a wrong offset!");
static_assert(offsetof(GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating, CallFunc_K2_GetRootComponent_ReturnValue) == 0x0001B0, "Member 'GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating, CallFunc_SpawnSoundAttached_ReturnValue) == 0x0001B8, "Member 'GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating::CallFunc_SpawnSoundAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating, K2Node_Event_MyTarget) == 0x0001C0, "Member 'GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating::K2Node_Event_MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating, K2Node_Event_Parameters) == 0x0001C8, "Member 'GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating::K2Node_Event_Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating, K2Node_Event_ParticleComponents) == 0x000280, "Member 'GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating::K2Node_Event_ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating, K2Node_Event_AudioComponents) == 0x000290, "Member 'GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating::K2Node_Event_AudioComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating, K2Node_Event_BurstCameraShakeInstance) == 0x0002A0, "Member 'GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating::K2Node_Event_BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating, K2Node_Event_BurstDecalInstance) == 0x0002A8, "Member 'GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating::K2Node_Event_BurstDecalInstance' has a wrong offset!");
static_assert(offsetof(GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0002B0, "Member 'GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating, CallFunc_FClamp_ReturnValue) == 0x0002B4, "Member 'GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0002B8, "Member 'GCNL_Uncle_Floating_C_ExecuteUbergraph_GCNL_Uncle_Floating::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function GCNL_Uncle_Floating.GCNL_Uncle_Floating_C.OnRemoval
// 0x00F0 (0x00F0 - 0x0000)
struct GCNL_Uncle_Floating_C_OnRemoval final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       ParticleComponents;                                // 0x00C0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference)
	class UCameraShake*                           BurstCameraShakeInstance;                          // 0x00E0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADecalActor*                            BurstDecalInstance;                                // 0x00E8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCNL_Uncle_Floating_C_OnRemoval) == 0x000008, "Wrong alignment on GCNL_Uncle_Floating_C_OnRemoval");
static_assert(sizeof(GCNL_Uncle_Floating_C_OnRemoval) == 0x0000F0, "Wrong size on GCNL_Uncle_Floating_C_OnRemoval");
static_assert(offsetof(GCNL_Uncle_Floating_C_OnRemoval, MyTarget) == 0x000000, "Member 'GCNL_Uncle_Floating_C_OnRemoval::MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_Uncle_Floating_C_OnRemoval, Parameters) == 0x000008, "Member 'GCNL_Uncle_Floating_C_OnRemoval::Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_Uncle_Floating_C_OnRemoval, ParticleComponents) == 0x0000C0, "Member 'GCNL_Uncle_Floating_C_OnRemoval::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Uncle_Floating_C_OnRemoval, AudioComponents) == 0x0000D0, "Member 'GCNL_Uncle_Floating_C_OnRemoval::AudioComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Uncle_Floating_C_OnRemoval, BurstCameraShakeInstance) == 0x0000E0, "Member 'GCNL_Uncle_Floating_C_OnRemoval::BurstCameraShakeInstance' has a wrong offset!");
static_assert(offsetof(GCNL_Uncle_Floating_C_OnRemoval, BurstDecalInstance) == 0x0000E8, "Member 'GCNL_Uncle_Floating_C_OnRemoval::BurstDecalInstance' has a wrong offset!");

// Function GCNL_Uncle_Floating.GCNL_Uncle_Floating_C.OnLoopingStart
// 0x00E0 (0x00E0 - 0x0000)
struct GCNL_Uncle_Floating_C_OnLoopingStart final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	TArray<class UParticleSystemComponent*>       ParticleComponents;                                // 0x00C0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference)
	TArray<class UAudioComponent*>                AudioComponents;                                   // 0x00D0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(GCNL_Uncle_Floating_C_OnLoopingStart) == 0x000008, "Wrong alignment on GCNL_Uncle_Floating_C_OnLoopingStart");
static_assert(sizeof(GCNL_Uncle_Floating_C_OnLoopingStart) == 0x0000E0, "Wrong size on GCNL_Uncle_Floating_C_OnLoopingStart");
static_assert(offsetof(GCNL_Uncle_Floating_C_OnLoopingStart, MyTarget) == 0x000000, "Member 'GCNL_Uncle_Floating_C_OnLoopingStart::MyTarget' has a wrong offset!");
static_assert(offsetof(GCNL_Uncle_Floating_C_OnLoopingStart, Parameters) == 0x000008, "Member 'GCNL_Uncle_Floating_C_OnLoopingStart::Parameters' has a wrong offset!");
static_assert(offsetof(GCNL_Uncle_Floating_C_OnLoopingStart, ParticleComponents) == 0x0000C0, "Member 'GCNL_Uncle_Floating_C_OnLoopingStart::ParticleComponents' has a wrong offset!");
static_assert(offsetof(GCNL_Uncle_Floating_C_OnLoopingStart, AudioComponents) == 0x0000D0, "Member 'GCNL_Uncle_Floating_C_OnLoopingStart::AudioComponents' has a wrong offset!");

}

