#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HardcoreModifierSelectionScreen

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass HardcoreModifierSelectionScreen.HardcoreModifierSelectionScreen_C
// 0x0018 (0x0320 - 0x0308)
class UHardcoreModifierSelectionScreen_C final : public UHardcoreModifierSelectionScreen
{
public:
	class UImage*                                 Background_Color;                                  // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Background_PreviewPane;                            // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BackgroundBase;                                    // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HardcoreModifierSelectionScreen_C">();
	}
	static class UHardcoreModifierSelectionScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHardcoreModifierSelectionScreen_C>();
	}
};
static_assert(alignof(UHardcoreModifierSelectionScreen_C) == 0x000008, "Wrong alignment on UHardcoreModifierSelectionScreen_C");
static_assert(sizeof(UHardcoreModifierSelectionScreen_C) == 0x000320, "Wrong size on UHardcoreModifierSelectionScreen_C");
static_assert(offsetof(UHardcoreModifierSelectionScreen_C, Background_Color) == 0x000308, "Member 'UHardcoreModifierSelectionScreen_C::Background_Color' has a wrong offset!");
static_assert(offsetof(UHardcoreModifierSelectionScreen_C, Background_PreviewPane) == 0x000310, "Member 'UHardcoreModifierSelectionScreen_C::Background_PreviewPane' has a wrong offset!");
static_assert(offsetof(UHardcoreModifierSelectionScreen_C, BackgroundBase) == 0x000318, "Member 'UHardcoreModifierSelectionScreen_C::BackgroundBase' has a wrong offset!");

}

