#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HardcoreModifierPreviewPane

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass HardcoreModifierPreviewPane.HardcoreModifierPreviewPane_C
// 0x0100 (0x0390 - 0x0290)
class UHardcoreModifierPreviewPane_C final : public UHardcoreModifierPreviewPane
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 DividerImage;                                      // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Star;                                              // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Star_1;                                            // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Star_2;                                            // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Star_3;                                            // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Star_4;                                            // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Star_5;                                            // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Star_6;                                            // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Star_7;                                            // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Star_8;                                            // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Star_9;                                            // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Star_10;                                           // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Star_11;                                           // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Star_12;                                           // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Star_13;                                           // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Star_14;                                           // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Star_15;                                           // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Star_16;                                           // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Star_17;                                           // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Star_18;                                           // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Star_19;                                           // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Star_20;                                           // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Star_21;                                           // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Star_22;                                           // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Star_23;                                           // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Star_24;                                           // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Star_25;                                           // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Star_26;                                           // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Star_27;                                           // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Star_28;                                           // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Star_29;                                           // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_HardcoreModifierPreviewPane(int32 EntryPoint);
	void HandleMaxLevelCompleted(int32 Level);
	void BP_HandleModifierChanged();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HardcoreModifierPreviewPane_C">();
	}
	static class UHardcoreModifierPreviewPane_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHardcoreModifierPreviewPane_C>();
	}
};
static_assert(alignof(UHardcoreModifierPreviewPane_C) == 0x000008, "Wrong alignment on UHardcoreModifierPreviewPane_C");
static_assert(sizeof(UHardcoreModifierPreviewPane_C) == 0x000390, "Wrong size on UHardcoreModifierPreviewPane_C");
static_assert(offsetof(UHardcoreModifierPreviewPane_C, UberGraphFrame) == 0x000290, "Member 'UHardcoreModifierPreviewPane_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UHardcoreModifierPreviewPane_C, DividerImage) == 0x000298, "Member 'UHardcoreModifierPreviewPane_C::DividerImage' has a wrong offset!");
static_assert(offsetof(UHardcoreModifierPreviewPane_C, Star) == 0x0002A0, "Member 'UHardcoreModifierPreviewPane_C::Star' has a wrong offset!");
static_assert(offsetof(UHardcoreModifierPreviewPane_C, Star_1) == 0x0002A8, "Member 'UHardcoreModifierPreviewPane_C::Star_1' has a wrong offset!");
static_assert(offsetof(UHardcoreModifierPreviewPane_C, Star_2) == 0x0002B0, "Member 'UHardcoreModifierPreviewPane_C::Star_2' has a wrong offset!");
static_assert(offsetof(UHardcoreModifierPreviewPane_C, Star_3) == 0x0002B8, "Member 'UHardcoreModifierPreviewPane_C::Star_3' has a wrong offset!");
static_assert(offsetof(UHardcoreModifierPreviewPane_C, Star_4) == 0x0002C0, "Member 'UHardcoreModifierPreviewPane_C::Star_4' has a wrong offset!");
static_assert(offsetof(UHardcoreModifierPreviewPane_C, Star_5) == 0x0002C8, "Member 'UHardcoreModifierPreviewPane_C::Star_5' has a wrong offset!");
static_assert(offsetof(UHardcoreModifierPreviewPane_C, Star_6) == 0x0002D0, "Member 'UHardcoreModifierPreviewPane_C::Star_6' has a wrong offset!");
static_assert(offsetof(UHardcoreModifierPreviewPane_C, Star_7) == 0x0002D8, "Member 'UHardcoreModifierPreviewPane_C::Star_7' has a wrong offset!");
static_assert(offsetof(UHardcoreModifierPreviewPane_C, Star_8) == 0x0002E0, "Member 'UHardcoreModifierPreviewPane_C::Star_8' has a wrong offset!");
static_assert(offsetof(UHardcoreModifierPreviewPane_C, Star_9) == 0x0002E8, "Member 'UHardcoreModifierPreviewPane_C::Star_9' has a wrong offset!");
static_assert(offsetof(UHardcoreModifierPreviewPane_C, Star_10) == 0x0002F0, "Member 'UHardcoreModifierPreviewPane_C::Star_10' has a wrong offset!");
static_assert(offsetof(UHardcoreModifierPreviewPane_C, Star_11) == 0x0002F8, "Member 'UHardcoreModifierPreviewPane_C::Star_11' has a wrong offset!");
static_assert(offsetof(UHardcoreModifierPreviewPane_C, Star_12) == 0x000300, "Member 'UHardcoreModifierPreviewPane_C::Star_12' has a wrong offset!");
static_assert(offsetof(UHardcoreModifierPreviewPane_C, Star_13) == 0x000308, "Member 'UHardcoreModifierPreviewPane_C::Star_13' has a wrong offset!");
static_assert(offsetof(UHardcoreModifierPreviewPane_C, Star_14) == 0x000310, "Member 'UHardcoreModifierPreviewPane_C::Star_14' has a wrong offset!");
static_assert(offsetof(UHardcoreModifierPreviewPane_C, Star_15) == 0x000318, "Member 'UHardcoreModifierPreviewPane_C::Star_15' has a wrong offset!");
static_assert(offsetof(UHardcoreModifierPreviewPane_C, Star_16) == 0x000320, "Member 'UHardcoreModifierPreviewPane_C::Star_16' has a wrong offset!");
static_assert(offsetof(UHardcoreModifierPreviewPane_C, Star_17) == 0x000328, "Member 'UHardcoreModifierPreviewPane_C::Star_17' has a wrong offset!");
static_assert(offsetof(UHardcoreModifierPreviewPane_C, Star_18) == 0x000330, "Member 'UHardcoreModifierPreviewPane_C::Star_18' has a wrong offset!");
static_assert(offsetof(UHardcoreModifierPreviewPane_C, Star_19) == 0x000338, "Member 'UHardcoreModifierPreviewPane_C::Star_19' has a wrong offset!");
static_assert(offsetof(UHardcoreModifierPreviewPane_C, Star_20) == 0x000340, "Member 'UHardcoreModifierPreviewPane_C::Star_20' has a wrong offset!");
static_assert(offsetof(UHardcoreModifierPreviewPane_C, Star_21) == 0x000348, "Member 'UHardcoreModifierPreviewPane_C::Star_21' has a wrong offset!");
static_assert(offsetof(UHardcoreModifierPreviewPane_C, Star_22) == 0x000350, "Member 'UHardcoreModifierPreviewPane_C::Star_22' has a wrong offset!");
static_assert(offsetof(UHardcoreModifierPreviewPane_C, Star_23) == 0x000358, "Member 'UHardcoreModifierPreviewPane_C::Star_23' has a wrong offset!");
static_assert(offsetof(UHardcoreModifierPreviewPane_C, Star_24) == 0x000360, "Member 'UHardcoreModifierPreviewPane_C::Star_24' has a wrong offset!");
static_assert(offsetof(UHardcoreModifierPreviewPane_C, Star_25) == 0x000368, "Member 'UHardcoreModifierPreviewPane_C::Star_25' has a wrong offset!");
static_assert(offsetof(UHardcoreModifierPreviewPane_C, Star_26) == 0x000370, "Member 'UHardcoreModifierPreviewPane_C::Star_26' has a wrong offset!");
static_assert(offsetof(UHardcoreModifierPreviewPane_C, Star_27) == 0x000378, "Member 'UHardcoreModifierPreviewPane_C::Star_27' has a wrong offset!");
static_assert(offsetof(UHardcoreModifierPreviewPane_C, Star_28) == 0x000380, "Member 'UHardcoreModifierPreviewPane_C::Star_28' has a wrong offset!");
static_assert(offsetof(UHardcoreModifierPreviewPane_C, Star_29) == 0x000388, "Member 'UHardcoreModifierPreviewPane_C::Star_29' has a wrong offset!");

}

