#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HardcoreModifierPreviewPane

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function HardcoreModifierPreviewPane.HardcoreModifierPreviewPane_C.ExecuteUbergraph_HardcoreModifierPreviewPane
// 0x0058 (0x0058 - 0x0000)
struct HardcoreModifierPreviewPane_C_ExecuteUbergraph_HardcoreModifierPreviewPane final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Level;                                // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_IntInt_ReturnValue;               // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UImage*>                         K2Node_MakeArray_Array;                            // 0x0028(0x0010)(ZeroConstructor, ReferenceParm, ContainsInstancedReference)
	class UImage*                                 CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_1;                   // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HardcoreModifierPreviewPane_C_ExecuteUbergraph_HardcoreModifierPreviewPane) == 0x000008, "Wrong alignment on HardcoreModifierPreviewPane_C_ExecuteUbergraph_HardcoreModifierPreviewPane");
static_assert(sizeof(HardcoreModifierPreviewPane_C_ExecuteUbergraph_HardcoreModifierPreviewPane) == 0x000058, "Wrong size on HardcoreModifierPreviewPane_C_ExecuteUbergraph_HardcoreModifierPreviewPane");
static_assert(offsetof(HardcoreModifierPreviewPane_C_ExecuteUbergraph_HardcoreModifierPreviewPane, EntryPoint) == 0x000000, "Member 'HardcoreModifierPreviewPane_C_ExecuteUbergraph_HardcoreModifierPreviewPane::EntryPoint' has a wrong offset!");
static_assert(offsetof(HardcoreModifierPreviewPane_C_ExecuteUbergraph_HardcoreModifierPreviewPane, K2Node_MakeStruct_LinearColor) == 0x000004, "Member 'HardcoreModifierPreviewPane_C_ExecuteUbergraph_HardcoreModifierPreviewPane::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(HardcoreModifierPreviewPane_C_ExecuteUbergraph_HardcoreModifierPreviewPane, K2Node_Event_Level) == 0x000014, "Member 'HardcoreModifierPreviewPane_C_ExecuteUbergraph_HardcoreModifierPreviewPane::K2Node_Event_Level' has a wrong offset!");
static_assert(offsetof(HardcoreModifierPreviewPane_C_ExecuteUbergraph_HardcoreModifierPreviewPane, CallFunc_Subtract_IntInt_ReturnValue) == 0x000018, "Member 'HardcoreModifierPreviewPane_C_ExecuteUbergraph_HardcoreModifierPreviewPane::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HardcoreModifierPreviewPane_C_ExecuteUbergraph_HardcoreModifierPreviewPane, CallFunc_InRange_IntInt_ReturnValue) == 0x00001C, "Member 'HardcoreModifierPreviewPane_C_ExecuteUbergraph_HardcoreModifierPreviewPane::CallFunc_InRange_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HardcoreModifierPreviewPane_C_ExecuteUbergraph_HardcoreModifierPreviewPane, Temp_int_Variable) == 0x000020, "Member 'HardcoreModifierPreviewPane_C_ExecuteUbergraph_HardcoreModifierPreviewPane::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(HardcoreModifierPreviewPane_C_ExecuteUbergraph_HardcoreModifierPreviewPane, K2Node_MakeArray_Array) == 0x000028, "Member 'HardcoreModifierPreviewPane_C_ExecuteUbergraph_HardcoreModifierPreviewPane::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(HardcoreModifierPreviewPane_C_ExecuteUbergraph_HardcoreModifierPreviewPane, CallFunc_Array_Get_Item) == 0x000038, "Member 'HardcoreModifierPreviewPane_C_ExecuteUbergraph_HardcoreModifierPreviewPane::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(HardcoreModifierPreviewPane_C_ExecuteUbergraph_HardcoreModifierPreviewPane, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000040, "Member 'HardcoreModifierPreviewPane_C_ExecuteUbergraph_HardcoreModifierPreviewPane::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HardcoreModifierPreviewPane_C_ExecuteUbergraph_HardcoreModifierPreviewPane, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'HardcoreModifierPreviewPane_C_ExecuteUbergraph_HardcoreModifierPreviewPane::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HardcoreModifierPreviewPane_C_ExecuteUbergraph_HardcoreModifierPreviewPane, K2Node_MakeStruct_LinearColor_1) == 0x000048, "Member 'HardcoreModifierPreviewPane_C_ExecuteUbergraph_HardcoreModifierPreviewPane::K2Node_MakeStruct_LinearColor_1' has a wrong offset!");

// Function HardcoreModifierPreviewPane.HardcoreModifierPreviewPane_C.HandleMaxLevelCompleted
// 0x0004 (0x0004 - 0x0000)
struct HardcoreModifierPreviewPane_C_HandleMaxLevelCompleted final
{
public:
	int32                                         Level;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HardcoreModifierPreviewPane_C_HandleMaxLevelCompleted) == 0x000004, "Wrong alignment on HardcoreModifierPreviewPane_C_HandleMaxLevelCompleted");
static_assert(sizeof(HardcoreModifierPreviewPane_C_HandleMaxLevelCompleted) == 0x000004, "Wrong size on HardcoreModifierPreviewPane_C_HandleMaxLevelCompleted");
static_assert(offsetof(HardcoreModifierPreviewPane_C_HandleMaxLevelCompleted, Level) == 0x000000, "Member 'HardcoreModifierPreviewPane_C_HandleMaxLevelCompleted::Level' has a wrong offset!");

}

