#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HardcoreModifierListEntry

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function HardcoreModifierListEntry.HardcoreModifierListEntry_C.ExecuteUbergraph_HardcoreModifierListEntry
// 0x0190 (0x0190 - 0x0000)
struct HardcoreModifierListEntry_C_ExecuteUbergraph_HardcoreModifierListEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Temp_class_Variable;                               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Temp_class_Variable_1;                             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0018(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0050(0x0070)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00C0(0x0070)(ConstParm)
	int32                                         Temp_int_Variable;                                 // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bModifierEnabled;                     // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_135[0x3];                                      // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_MaxLevel;                             // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_IntInt_ReturnValue;               // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0145(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_146[0x2];                                      // 0x0146(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0148(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UImage*>                         K2Node_MakeArray_Array;                            // 0x0160(0x0010)(ZeroConstructor, ReferenceParm, ContainsInstancedReference)
	class UImage*                                 CallFunc_Array_Get_Item;                           // 0x0170(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_Select_Default;                             // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_1;                   // 0x0180(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HardcoreModifierListEntry_C_ExecuteUbergraph_HardcoreModifierListEntry) == 0x000008, "Wrong alignment on HardcoreModifierListEntry_C_ExecuteUbergraph_HardcoreModifierListEntry");
static_assert(sizeof(HardcoreModifierListEntry_C_ExecuteUbergraph_HardcoreModifierListEntry) == 0x000190, "Wrong size on HardcoreModifierListEntry_C_ExecuteUbergraph_HardcoreModifierListEntry");
static_assert(offsetof(HardcoreModifierListEntry_C_ExecuteUbergraph_HardcoreModifierListEntry, EntryPoint) == 0x000000, "Member 'HardcoreModifierListEntry_C_ExecuteUbergraph_HardcoreModifierListEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(HardcoreModifierListEntry_C_ExecuteUbergraph_HardcoreModifierListEntry, Temp_class_Variable) == 0x000008, "Member 'HardcoreModifierListEntry_C_ExecuteUbergraph_HardcoreModifierListEntry::Temp_class_Variable' has a wrong offset!");
static_assert(offsetof(HardcoreModifierListEntry_C_ExecuteUbergraph_HardcoreModifierListEntry, Temp_class_Variable_1) == 0x000010, "Member 'HardcoreModifierListEntry_C_ExecuteUbergraph_HardcoreModifierListEntry::Temp_class_Variable_1' has a wrong offset!");
static_assert(offsetof(HardcoreModifierListEntry_C_ExecuteUbergraph_HardcoreModifierListEntry, K2Node_Event_MyGeometry) == 0x000018, "Member 'HardcoreModifierListEntry_C_ExecuteUbergraph_HardcoreModifierListEntry::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(HardcoreModifierListEntry_C_ExecuteUbergraph_HardcoreModifierListEntry, K2Node_Event_MouseEvent_1) == 0x000050, "Member 'HardcoreModifierListEntry_C_ExecuteUbergraph_HardcoreModifierListEntry::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(HardcoreModifierListEntry_C_ExecuteUbergraph_HardcoreModifierListEntry, K2Node_Event_MouseEvent) == 0x0000C0, "Member 'HardcoreModifierListEntry_C_ExecuteUbergraph_HardcoreModifierListEntry::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(HardcoreModifierListEntry_C_ExecuteUbergraph_HardcoreModifierListEntry, Temp_int_Variable) == 0x000130, "Member 'HardcoreModifierListEntry_C_ExecuteUbergraph_HardcoreModifierListEntry::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(HardcoreModifierListEntry_C_ExecuteUbergraph_HardcoreModifierListEntry, K2Node_Event_bModifierEnabled) == 0x000134, "Member 'HardcoreModifierListEntry_C_ExecuteUbergraph_HardcoreModifierListEntry::K2Node_Event_bModifierEnabled' has a wrong offset!");
static_assert(offsetof(HardcoreModifierListEntry_C_ExecuteUbergraph_HardcoreModifierListEntry, CallFunc_Add_IntInt_ReturnValue) == 0x000138, "Member 'HardcoreModifierListEntry_C_ExecuteUbergraph_HardcoreModifierListEntry::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HardcoreModifierListEntry_C_ExecuteUbergraph_HardcoreModifierListEntry, K2Node_Event_MaxLevel) == 0x00013C, "Member 'HardcoreModifierListEntry_C_ExecuteUbergraph_HardcoreModifierListEntry::K2Node_Event_MaxLevel' has a wrong offset!");
static_assert(offsetof(HardcoreModifierListEntry_C_ExecuteUbergraph_HardcoreModifierListEntry, CallFunc_Subtract_IntInt_ReturnValue) == 0x000140, "Member 'HardcoreModifierListEntry_C_ExecuteUbergraph_HardcoreModifierListEntry::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HardcoreModifierListEntry_C_ExecuteUbergraph_HardcoreModifierListEntry, CallFunc_InRange_IntInt_ReturnValue) == 0x000144, "Member 'HardcoreModifierListEntry_C_ExecuteUbergraph_HardcoreModifierListEntry::CallFunc_InRange_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HardcoreModifierListEntry_C_ExecuteUbergraph_HardcoreModifierListEntry, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000145, "Member 'HardcoreModifierListEntry_C_ExecuteUbergraph_HardcoreModifierListEntry::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HardcoreModifierListEntry_C_ExecuteUbergraph_HardcoreModifierListEntry, K2Node_MakeStruct_LinearColor) == 0x000148, "Member 'HardcoreModifierListEntry_C_ExecuteUbergraph_HardcoreModifierListEntry::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(HardcoreModifierListEntry_C_ExecuteUbergraph_HardcoreModifierListEntry, Temp_bool_Variable) == 0x000158, "Member 'HardcoreModifierListEntry_C_ExecuteUbergraph_HardcoreModifierListEntry::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(HardcoreModifierListEntry_C_ExecuteUbergraph_HardcoreModifierListEntry, K2Node_MakeArray_Array) == 0x000160, "Member 'HardcoreModifierListEntry_C_ExecuteUbergraph_HardcoreModifierListEntry::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(HardcoreModifierListEntry_C_ExecuteUbergraph_HardcoreModifierListEntry, CallFunc_Array_Get_Item) == 0x000170, "Member 'HardcoreModifierListEntry_C_ExecuteUbergraph_HardcoreModifierListEntry::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(HardcoreModifierListEntry_C_ExecuteUbergraph_HardcoreModifierListEntry, K2Node_Select_Default) == 0x000178, "Member 'HardcoreModifierListEntry_C_ExecuteUbergraph_HardcoreModifierListEntry::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(HardcoreModifierListEntry_C_ExecuteUbergraph_HardcoreModifierListEntry, K2Node_MakeStruct_LinearColor_1) == 0x000180, "Member 'HardcoreModifierListEntry_C_ExecuteUbergraph_HardcoreModifierListEntry::K2Node_MakeStruct_LinearColor_1' has a wrong offset!");

// Function HardcoreModifierListEntry.HardcoreModifierListEntry_C.SetMaxLevelCompleted
// 0x0004 (0x0004 - 0x0000)
struct HardcoreModifierListEntry_C_SetMaxLevelCompleted final
{
public:
	int32                                         MaxLevel;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HardcoreModifierListEntry_C_SetMaxLevelCompleted) == 0x000004, "Wrong alignment on HardcoreModifierListEntry_C_SetMaxLevelCompleted");
static_assert(sizeof(HardcoreModifierListEntry_C_SetMaxLevelCompleted) == 0x000004, "Wrong size on HardcoreModifierListEntry_C_SetMaxLevelCompleted");
static_assert(offsetof(HardcoreModifierListEntry_C_SetMaxLevelCompleted, MaxLevel) == 0x000000, "Member 'HardcoreModifierListEntry_C_SetMaxLevelCompleted::MaxLevel' has a wrong offset!");

// Function HardcoreModifierListEntry.HardcoreModifierListEntry_C.HandleModifierEnabled
// 0x0001 (0x0001 - 0x0000)
struct HardcoreModifierListEntry_C_HandleModifierEnabled final
{
public:
	bool                                          bModifierEnabled;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HardcoreModifierListEntry_C_HandleModifierEnabled) == 0x000001, "Wrong alignment on HardcoreModifierListEntry_C_HandleModifierEnabled");
static_assert(sizeof(HardcoreModifierListEntry_C_HandleModifierEnabled) == 0x000001, "Wrong size on HardcoreModifierListEntry_C_HandleModifierEnabled");
static_assert(offsetof(HardcoreModifierListEntry_C_HandleModifierEnabled, bModifierEnabled) == 0x000000, "Member 'HardcoreModifierListEntry_C_HandleModifierEnabled::bModifierEnabled' has a wrong offset!");

// Function HardcoreModifierListEntry.HardcoreModifierListEntry_C.OnMouseLeave
// 0x0070 (0x0070 - 0x0000)
struct HardcoreModifierListEntry_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(HardcoreModifierListEntry_C_OnMouseLeave) == 0x000008, "Wrong alignment on HardcoreModifierListEntry_C_OnMouseLeave");
static_assert(sizeof(HardcoreModifierListEntry_C_OnMouseLeave) == 0x000070, "Wrong size on HardcoreModifierListEntry_C_OnMouseLeave");
static_assert(offsetof(HardcoreModifierListEntry_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'HardcoreModifierListEntry_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function HardcoreModifierListEntry.HardcoreModifierListEntry_C.OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct HardcoreModifierListEntry_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(HardcoreModifierListEntry_C_OnMouseEnter) == 0x000008, "Wrong alignment on HardcoreModifierListEntry_C_OnMouseEnter");
static_assert(sizeof(HardcoreModifierListEntry_C_OnMouseEnter) == 0x0000A8, "Wrong size on HardcoreModifierListEntry_C_OnMouseEnter");
static_assert(offsetof(HardcoreModifierListEntry_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'HardcoreModifierListEntry_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(HardcoreModifierListEntry_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'HardcoreModifierListEntry_C_OnMouseEnter::MouseEvent' has a wrong offset!");

}

