#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IntelCarryObject

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "BGA_HeldObject_Parent_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass IntelCarryObject.IntelCarryObject_C
// 0x0240 (0x0B90 - 0x0950)
class AIntelCarryObject_C final : public ABGA_HeldObject_Parent_C
{
public:
	uint8                                         Pad_944[0x4];                                      // 0x0944(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_IntelCarryObject_C;                 // 0x0948(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Beam;                                              // 0x0950(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CapturePoint_CaseGlow;                          // 0x0958(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      CapsuleInteract;                                   // 0x0960(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortWidgetComponent*                   Fort_UI_InteractionPoint;                          // 0x0968(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInfiltrationStatusComponent*           InfiltrationStatus;                                // 0x0970(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInfiltrationCarryObjectComponent*      InfiltrationCarryObjectComp;                       // 0x0978(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Mesh;                                              // 0x0980(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         UIShowDistance;                                    // 0x0988(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         UIDetailDistance;                                  // 0x098C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           UICheck_Timer;                                     // 0x0990(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLocalPlayerAttacker;                             // 0x0998(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_999[0x7];                                      // 0x0999(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHUD_InteractionPoint_C*                InteractionWidget;                                 // 0x09A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        CapturingPawn;                                     // 0x09A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerControllerAthena*            LocalPlayer;                                       // 0x09B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        LocalPawn;                                         // 0x09B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            WarningIcon_Enemy;                                 // 0x09C0(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateBrush                            WarningIcon_Friendly;                              // 0x0A48(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateBrush                            DistantIcon;                                       // 0x0AD0(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  HasIntelTag;                                       // 0x0B58(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTimerHandle                           GroundTimerHandle;                                 // 0x0B78(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPickedUp;                                        // 0x0B80(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	bool                                          IsPlaced;                                          // 0x0B81(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)

public:
	void ExecuteUbergraph_IntelCarryObject(int32 EntryPoint);
	void ReceiveDestroyed();
	void InteractionPointClamped(bool bIsClamped);
	void GetTimeRemaining();
	void EventSetupUI();
	void EventStartDropTimer(float NewTimeRemaining);
	void IntelStateChanged(EIntelStateEnum CurrentState);
	void EventGetLocalPlayerTeam();
	void InitializeUI();
	void ReceiveBeginPlay();
	void CheckShouldDisplayUI();
	void BndEvt__FortHeldObject_K2Node_ComponentBoundEvent_4_OnHeldObjectDestroy__DelegateSignature();
	void BndEvt__FortHeldObject_K2Node_ComponentBoundEvent_3_OnHeldObjectThrown__DelegateSignature();
	void BndEvt__FortHeldObject_K2Node_ComponentBoundEvent_2_OnHeldObjectPlaced__DelegateSignature();
	void BndEvt__FortHeldObject_K2Node_ComponentBoundEvent_1_OnHeldObjectDropped__DelegateSignature();
	void BndEvt__FortHeldObject_K2Node_ComponentBoundEvent_0_OnHeldObjectPickedUp__DelegateSignature();
	void Set_UIVisibility(float PlayerDistance, class UWidgetComponent* UITarget);
	void OnRep_IsPickedUp();
	void OnRep_IsPlaced();

	bool BlueprintCanInteract(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted, const ETInteractionType InteractionType) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"IntelCarryObject_C">();
	}
	static class AIntelCarryObject_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AIntelCarryObject_C>();
	}
};
static_assert(alignof(AIntelCarryObject_C) == 0x000010, "Wrong alignment on AIntelCarryObject_C");
static_assert(sizeof(AIntelCarryObject_C) == 0x000B90, "Wrong size on AIntelCarryObject_C");
static_assert(offsetof(AIntelCarryObject_C, UberGraphFrame_IntelCarryObject_C) == 0x000948, "Member 'AIntelCarryObject_C::UberGraphFrame_IntelCarryObject_C' has a wrong offset!");
static_assert(offsetof(AIntelCarryObject_C, Beam) == 0x000950, "Member 'AIntelCarryObject_C::Beam' has a wrong offset!");
static_assert(offsetof(AIntelCarryObject_C, SM_CapturePoint_CaseGlow) == 0x000958, "Member 'AIntelCarryObject_C::SM_CapturePoint_CaseGlow' has a wrong offset!");
static_assert(offsetof(AIntelCarryObject_C, CapsuleInteract) == 0x000960, "Member 'AIntelCarryObject_C::CapsuleInteract' has a wrong offset!");
static_assert(offsetof(AIntelCarryObject_C, Fort_UI_InteractionPoint) == 0x000968, "Member 'AIntelCarryObject_C::Fort_UI_InteractionPoint' has a wrong offset!");
static_assert(offsetof(AIntelCarryObject_C, InfiltrationStatus) == 0x000970, "Member 'AIntelCarryObject_C::InfiltrationStatus' has a wrong offset!");
static_assert(offsetof(AIntelCarryObject_C, InfiltrationCarryObjectComp) == 0x000978, "Member 'AIntelCarryObject_C::InfiltrationCarryObjectComp' has a wrong offset!");
static_assert(offsetof(AIntelCarryObject_C, Mesh) == 0x000980, "Member 'AIntelCarryObject_C::Mesh' has a wrong offset!");
static_assert(offsetof(AIntelCarryObject_C, UIShowDistance) == 0x000988, "Member 'AIntelCarryObject_C::UIShowDistance' has a wrong offset!");
static_assert(offsetof(AIntelCarryObject_C, UIDetailDistance) == 0x00098C, "Member 'AIntelCarryObject_C::UIDetailDistance' has a wrong offset!");
static_assert(offsetof(AIntelCarryObject_C, UICheck_Timer) == 0x000990, "Member 'AIntelCarryObject_C::UICheck_Timer' has a wrong offset!");
static_assert(offsetof(AIntelCarryObject_C, IsLocalPlayerAttacker) == 0x000998, "Member 'AIntelCarryObject_C::IsLocalPlayerAttacker' has a wrong offset!");
static_assert(offsetof(AIntelCarryObject_C, InteractionWidget) == 0x0009A0, "Member 'AIntelCarryObject_C::InteractionWidget' has a wrong offset!");
static_assert(offsetof(AIntelCarryObject_C, CapturingPawn) == 0x0009A8, "Member 'AIntelCarryObject_C::CapturingPawn' has a wrong offset!");
static_assert(offsetof(AIntelCarryObject_C, LocalPlayer) == 0x0009B0, "Member 'AIntelCarryObject_C::LocalPlayer' has a wrong offset!");
static_assert(offsetof(AIntelCarryObject_C, LocalPawn) == 0x0009B8, "Member 'AIntelCarryObject_C::LocalPawn' has a wrong offset!");
static_assert(offsetof(AIntelCarryObject_C, WarningIcon_Enemy) == 0x0009C0, "Member 'AIntelCarryObject_C::WarningIcon_Enemy' has a wrong offset!");
static_assert(offsetof(AIntelCarryObject_C, WarningIcon_Friendly) == 0x000A48, "Member 'AIntelCarryObject_C::WarningIcon_Friendly' has a wrong offset!");
static_assert(offsetof(AIntelCarryObject_C, DistantIcon) == 0x000AD0, "Member 'AIntelCarryObject_C::DistantIcon' has a wrong offset!");
static_assert(offsetof(AIntelCarryObject_C, HasIntelTag) == 0x000B58, "Member 'AIntelCarryObject_C::HasIntelTag' has a wrong offset!");
static_assert(offsetof(AIntelCarryObject_C, GroundTimerHandle) == 0x000B78, "Member 'AIntelCarryObject_C::GroundTimerHandle' has a wrong offset!");
static_assert(offsetof(AIntelCarryObject_C, IsPickedUp) == 0x000B80, "Member 'AIntelCarryObject_C::IsPickedUp' has a wrong offset!");
static_assert(offsetof(AIntelCarryObject_C, IsPlaced) == 0x000B81, "Member 'AIntelCarryObject_C::IsPlaced' has a wrong offset!");

}

