#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LandingPageTile

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function LandingPageTile.LandingPageTile_C.ExecuteUbergraph_LandingPageTile
// 0x0040 (0x0040 - 0x0000)
struct LandingPageTile_C_ExecuteUbergraph_LandingPageTile final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Available;                            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0020(0x0018)()
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LandingPageTile_C_ExecuteUbergraph_LandingPageTile) == 0x000008, "Wrong alignment on LandingPageTile_C_ExecuteUbergraph_LandingPageTile");
static_assert(sizeof(LandingPageTile_C_ExecuteUbergraph_LandingPageTile) == 0x000040, "Wrong size on LandingPageTile_C_ExecuteUbergraph_LandingPageTile");
static_assert(offsetof(LandingPageTile_C_ExecuteUbergraph_LandingPageTile, EntryPoint) == 0x000000, "Member 'LandingPageTile_C_ExecuteUbergraph_LandingPageTile::EntryPoint' has a wrong offset!");
static_assert(offsetof(LandingPageTile_C_ExecuteUbergraph_LandingPageTile, Temp_bool_Variable) == 0x000004, "Member 'LandingPageTile_C_ExecuteUbergraph_LandingPageTile::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(LandingPageTile_C_ExecuteUbergraph_LandingPageTile, Temp_byte_Variable) == 0x000005, "Member 'LandingPageTile_C_ExecuteUbergraph_LandingPageTile::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(LandingPageTile_C_ExecuteUbergraph_LandingPageTile, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'LandingPageTile_C_ExecuteUbergraph_LandingPageTile::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(LandingPageTile_C_ExecuteUbergraph_LandingPageTile, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'LandingPageTile_C_ExecuteUbergraph_LandingPageTile::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LandingPageTile_C_ExecuteUbergraph_LandingPageTile, K2Node_Event_Available) == 0x000018, "Member 'LandingPageTile_C_ExecuteUbergraph_LandingPageTile::K2Node_Event_Available' has a wrong offset!");
static_assert(offsetof(LandingPageTile_C_ExecuteUbergraph_LandingPageTile, CallFunc_TextToUpper_ReturnValue) == 0x000020, "Member 'LandingPageTile_C_ExecuteUbergraph_LandingPageTile::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(LandingPageTile_C_ExecuteUbergraph_LandingPageTile, Temp_byte_Variable_1) == 0x000038, "Member 'LandingPageTile_C_ExecuteUbergraph_LandingPageTile::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(LandingPageTile_C_ExecuteUbergraph_LandingPageTile, K2Node_Select_Default) == 0x000039, "Member 'LandingPageTile_C_ExecuteUbergraph_LandingPageTile::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(LandingPageTile_C_ExecuteUbergraph_LandingPageTile, K2Node_Event_IsDesignTime) == 0x00003A, "Member 'LandingPageTile_C_ExecuteUbergraph_LandingPageTile::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function LandingPageTile.LandingPageTile_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct LandingPageTile_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LandingPageTile_C_PreConstruct) == 0x000001, "Wrong alignment on LandingPageTile_C_PreConstruct");
static_assert(sizeof(LandingPageTile_C_PreConstruct) == 0x000001, "Wrong size on LandingPageTile_C_PreConstruct");
static_assert(offsetof(LandingPageTile_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'LandingPageTile_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function LandingPageTile.LandingPageTile_C.UpdateTileAvailability
// 0x0001 (0x0001 - 0x0000)
struct LandingPageTile_C_UpdateTileAvailability final
{
public:
	bool                                          Available;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LandingPageTile_C_UpdateTileAvailability) == 0x000001, "Wrong alignment on LandingPageTile_C_UpdateTileAvailability");
static_assert(sizeof(LandingPageTile_C_UpdateTileAvailability) == 0x000001, "Wrong size on LandingPageTile_C_UpdateTileAvailability");
static_assert(offsetof(LandingPageTile_C_UpdateTileAvailability, Available) == 0x000000, "Member 'LandingPageTile_C_UpdateTileAvailability::Available' has a wrong offset!");

// Function LandingPageTile.LandingPageTile_C.PlayIntroOrOutro
// 0x0018 (0x0018 - 0x0000)
struct LandingPageTile_C_PlayIntroOrOutro final
{
public:
	bool                                          PlayIntro;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LandingPageTile_C_PlayIntroOrOutro) == 0x000008, "Wrong alignment on LandingPageTile_C_PlayIntroOrOutro");
static_assert(sizeof(LandingPageTile_C_PlayIntroOrOutro) == 0x000018, "Wrong size on LandingPageTile_C_PlayIntroOrOutro");
static_assert(offsetof(LandingPageTile_C_PlayIntroOrOutro, PlayIntro) == 0x000000, "Member 'LandingPageTile_C_PlayIntroOrOutro::PlayIntro' has a wrong offset!");
static_assert(offsetof(LandingPageTile_C_PlayIntroOrOutro, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'LandingPageTile_C_PlayIntroOrOutro::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(LandingPageTile_C_PlayIntroOrOutro, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'LandingPageTile_C_PlayIntroOrOutro::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

}

