#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LandscapeWaterInfo

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function LandscapeWaterInfo.LandscapeWaterInfo_C.ExecuteUbergraph_LandscapeWaterInfo
// 0x0014 (0x0014 - 0x0000)
struct LandscapeWaterInfo_C_ExecuteUbergraph_LandscapeWaterInfo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScalarParameterValue_ReturnValue;      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LandscapeWaterInfo_C_ExecuteUbergraph_LandscapeWaterInfo) == 0x000004, "Wrong alignment on LandscapeWaterInfo_C_ExecuteUbergraph_LandscapeWaterInfo");
static_assert(sizeof(LandscapeWaterInfo_C_ExecuteUbergraph_LandscapeWaterInfo) == 0x000014, "Wrong size on LandscapeWaterInfo_C_ExecuteUbergraph_LandscapeWaterInfo");
static_assert(offsetof(LandscapeWaterInfo_C_ExecuteUbergraph_LandscapeWaterInfo, EntryPoint) == 0x000000, "Member 'LandscapeWaterInfo_C_ExecuteUbergraph_LandscapeWaterInfo::EntryPoint' has a wrong offset!");
static_assert(offsetof(LandscapeWaterInfo_C_ExecuteUbergraph_LandscapeWaterInfo, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'LandscapeWaterInfo_C_ExecuteUbergraph_LandscapeWaterInfo::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(LandscapeWaterInfo_C_ExecuteUbergraph_LandscapeWaterInfo, CallFunc_BooleanAND_ReturnValue) == 0x000005, "Member 'LandscapeWaterInfo_C_ExecuteUbergraph_LandscapeWaterInfo::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(LandscapeWaterInfo_C_ExecuteUbergraph_LandscapeWaterInfo, CallFunc_GetScalarParameterValue_ReturnValue) == 0x000008, "Member 'LandscapeWaterInfo_C_ExecuteUbergraph_LandscapeWaterInfo::CallFunc_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(LandscapeWaterInfo_C_ExecuteUbergraph_LandscapeWaterInfo, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x00000C, "Member 'LandscapeWaterInfo_C_ExecuteUbergraph_LandscapeWaterInfo::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(LandscapeWaterInfo_C_ExecuteUbergraph_LandscapeWaterInfo, K2Node_Event_EndPlayReason) == 0x000010, "Member 'LandscapeWaterInfo_C_ExecuteUbergraph_LandscapeWaterInfo::K2Node_Event_EndPlayReason' has a wrong offset!");

// Function LandscapeWaterInfo.LandscapeWaterInfo_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct LandscapeWaterInfo_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LandscapeWaterInfo_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on LandscapeWaterInfo_C_ReceiveEndPlay");
static_assert(sizeof(LandscapeWaterInfo_C_ReceiveEndPlay) == 0x000001, "Wrong size on LandscapeWaterInfo_C_ReceiveEndPlay");
static_assert(offsetof(LandscapeWaterInfo_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'LandscapeWaterInfo_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function LandscapeWaterInfo.LandscapeWaterInfo_C.UserConstructionScript
// 0x00B0 (0x00B0 - 0x0000)
struct LandscapeWaterInfo_C_UserConstructionScript final
{
public:
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScalarParameterValue_ReturnValue;      // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue;            // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LandscapeWaterInfo_C_UserConstructionScript) == 0x000008, "Wrong alignment on LandscapeWaterInfo_C_UserConstructionScript");
static_assert(sizeof(LandscapeWaterInfo_C_UserConstructionScript) == 0x0000B0, "Wrong size on LandscapeWaterInfo_C_UserConstructionScript");
static_assert(offsetof(LandscapeWaterInfo_C_UserConstructionScript, CallFunc_Concat_StrStr_ReturnValue) == 0x000000, "Member 'LandscapeWaterInfo_C_UserConstructionScript::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(LandscapeWaterInfo_C_UserConstructionScript, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000010, "Member 'LandscapeWaterInfo_C_UserConstructionScript::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LandscapeWaterInfo_C_UserConstructionScript, CallFunc_GetScalarParameterValue_ReturnValue) == 0x000020, "Member 'LandscapeWaterInfo_C_UserConstructionScript::CallFunc_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(LandscapeWaterInfo_C_UserConstructionScript, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000028, "Member 'LandscapeWaterInfo_C_UserConstructionScript::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(LandscapeWaterInfo_C_UserConstructionScript, CallFunc_Conv_FloatToString_ReturnValue) == 0x000038, "Member 'LandscapeWaterInfo_C_UserConstructionScript::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(LandscapeWaterInfo_C_UserConstructionScript, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000048, "Member 'LandscapeWaterInfo_C_UserConstructionScript::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(LandscapeWaterInfo_C_UserConstructionScript, CallFunc_GetDisplayName_ReturnValue) == 0x000058, "Member 'LandscapeWaterInfo_C_UserConstructionScript::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(LandscapeWaterInfo_C_UserConstructionScript, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000068, "Member 'LandscapeWaterInfo_C_UserConstructionScript::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(LandscapeWaterInfo_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'LandscapeWaterInfo_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(LandscapeWaterInfo_C_UserConstructionScript, CallFunc_Conv_BoolToString_ReturnValue) == 0x000080, "Member 'LandscapeWaterInfo_C_UserConstructionScript::CallFunc_Conv_BoolToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(LandscapeWaterInfo_C_UserConstructionScript, CallFunc_BooleanAND_ReturnValue) == 0x000090, "Member 'LandscapeWaterInfo_C_UserConstructionScript::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(LandscapeWaterInfo_C_UserConstructionScript, CallFunc_Concat_StrStr_ReturnValue_5) == 0x000098, "Member 'LandscapeWaterInfo_C_UserConstructionScript::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(LandscapeWaterInfo_C_UserConstructionScript, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x0000A8, "Member 'LandscapeWaterInfo_C_UserConstructionScript::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");

// Function LandscapeWaterInfo.LandscapeWaterInfo_C.Set Water MPC Values
// 0x00B4 (0x00B4 - 0x0000)
struct LandscapeWaterInfo_C_Set_Water_MPC_Values final
{
public:
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x0084(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_2;                          // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue_1;   // 0x00A4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(LandscapeWaterInfo_C_Set_Water_MPC_Values) == 0x000004, "Wrong alignment on LandscapeWaterInfo_C_Set_Water_MPC_Values");
static_assert(sizeof(LandscapeWaterInfo_C_Set_Water_MPC_Values) == 0x0000B4, "Wrong size on LandscapeWaterInfo_C_Set_Water_MPC_Values");
static_assert(offsetof(LandscapeWaterInfo_C_Set_Water_MPC_Values, CallFunc_BreakTransform_Location) == 0x000000, "Member 'LandscapeWaterInfo_C_Set_Water_MPC_Values::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(LandscapeWaterInfo_C_Set_Water_MPC_Values, CallFunc_BreakTransform_Rotation) == 0x00000C, "Member 'LandscapeWaterInfo_C_Set_Water_MPC_Values::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(LandscapeWaterInfo_C_Set_Water_MPC_Values, CallFunc_BreakTransform_Scale) == 0x000018, "Member 'LandscapeWaterInfo_C_Set_Water_MPC_Values::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(LandscapeWaterInfo_C_Set_Water_MPC_Values, CallFunc_Subtract_IntInt_ReturnValue) == 0x000024, "Member 'LandscapeWaterInfo_C_Set_Water_MPC_Values::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(LandscapeWaterInfo_C_Set_Water_MPC_Values, CallFunc_BreakVector_X) == 0x000028, "Member 'LandscapeWaterInfo_C_Set_Water_MPC_Values::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(LandscapeWaterInfo_C_Set_Water_MPC_Values, CallFunc_BreakVector_Y) == 0x00002C, "Member 'LandscapeWaterInfo_C_Set_Water_MPC_Values::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(LandscapeWaterInfo_C_Set_Water_MPC_Values, CallFunc_BreakVector_Z) == 0x000030, "Member 'LandscapeWaterInfo_C_Set_Water_MPC_Values::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(LandscapeWaterInfo_C_Set_Water_MPC_Values, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000034, "Member 'LandscapeWaterInfo_C_Set_Water_MPC_Values::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(LandscapeWaterInfo_C_Set_Water_MPC_Values, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000038, "Member 'LandscapeWaterInfo_C_Set_Water_MPC_Values::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LandscapeWaterInfo_C_Set_Water_MPC_Values, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00003C, "Member 'LandscapeWaterInfo_C_Set_Water_MPC_Values::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(LandscapeWaterInfo_C_Set_Water_MPC_Values, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000040, "Member 'LandscapeWaterInfo_C_Set_Water_MPC_Values::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LandscapeWaterInfo_C_Set_Water_MPC_Values, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000044, "Member 'LandscapeWaterInfo_C_Set_Water_MPC_Values::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(LandscapeWaterInfo_C_Set_Water_MPC_Values, CallFunc_BreakTransform_Location_1) == 0x000048, "Member 'LandscapeWaterInfo_C_Set_Water_MPC_Values::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(LandscapeWaterInfo_C_Set_Water_MPC_Values, CallFunc_BreakTransform_Rotation_1) == 0x000054, "Member 'LandscapeWaterInfo_C_Set_Water_MPC_Values::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(LandscapeWaterInfo_C_Set_Water_MPC_Values, CallFunc_BreakTransform_Scale_1) == 0x000060, "Member 'LandscapeWaterInfo_C_Set_Water_MPC_Values::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(LandscapeWaterInfo_C_Set_Water_MPC_Values, CallFunc_MakeVector_ReturnValue) == 0x00006C, "Member 'LandscapeWaterInfo_C_Set_Water_MPC_Values::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(LandscapeWaterInfo_C_Set_Water_MPC_Values, CallFunc_BreakVector_X_1) == 0x000078, "Member 'LandscapeWaterInfo_C_Set_Water_MPC_Values::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(LandscapeWaterInfo_C_Set_Water_MPC_Values, CallFunc_BreakVector_Y_1) == 0x00007C, "Member 'LandscapeWaterInfo_C_Set_Water_MPC_Values::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(LandscapeWaterInfo_C_Set_Water_MPC_Values, CallFunc_BreakVector_Z_1) == 0x000080, "Member 'LandscapeWaterInfo_C_Set_Water_MPC_Values::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(LandscapeWaterInfo_C_Set_Water_MPC_Values, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x000084, "Member 'LandscapeWaterInfo_C_Set_Water_MPC_Values::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(LandscapeWaterInfo_C_Set_Water_MPC_Values, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000094, "Member 'LandscapeWaterInfo_C_Set_Water_MPC_Values::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(LandscapeWaterInfo_C_Set_Water_MPC_Values, CallFunc_BreakVector_X_2) == 0x000098, "Member 'LandscapeWaterInfo_C_Set_Water_MPC_Values::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(LandscapeWaterInfo_C_Set_Water_MPC_Values, CallFunc_BreakVector_Y_2) == 0x00009C, "Member 'LandscapeWaterInfo_C_Set_Water_MPC_Values::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(LandscapeWaterInfo_C_Set_Water_MPC_Values, CallFunc_BreakVector_Z_2) == 0x0000A0, "Member 'LandscapeWaterInfo_C_Set_Water_MPC_Values::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(LandscapeWaterInfo_C_Set_Water_MPC_Values, CallFunc_Conv_VectorToLinearColor_ReturnValue_1) == 0x0000A4, "Member 'LandscapeWaterInfo_C_Set_Water_MPC_Values::CallFunc_Conv_VectorToLinearColor_ReturnValue_1' has a wrong offset!");

// Function LandscapeWaterInfo.LandscapeWaterInfo_C.Update Water MID
// 0x0010 (0x0010 - 0x0000)
struct LandscapeWaterInfo_C_Update_Water_MID final
{
public:
	class UTexture*                               Texture;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LandscapeWaterInfo_C_Update_Water_MID) == 0x000008, "Wrong alignment on LandscapeWaterInfo_C_Update_Water_MID");
static_assert(sizeof(LandscapeWaterInfo_C_Update_Water_MID) == 0x000010, "Wrong size on LandscapeWaterInfo_C_Update_Water_MID");
static_assert(offsetof(LandscapeWaterInfo_C_Update_Water_MID, Texture) == 0x000000, "Member 'LandscapeWaterInfo_C_Update_Water_MID::Texture' has a wrong offset!");
static_assert(offsetof(LandscapeWaterInfo_C_Update_Water_MID, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'LandscapeWaterInfo_C_Update_Water_MID::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function LandscapeWaterInfo.LandscapeWaterInfo_C.Apply PostProcess MID to WaterBodies
// 0x0078 (0x0078 - 0x0000)
struct LandscapeWaterInfo_C_Apply_PostProcess_MID_to_WaterBodies final
{
public:
	class UMaterialInstanceDynamic*               TempMID;                                           // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWeightedBlendable                     K2Node_MakeStruct_WeightedBlendable;               // 0x0010(0x0010)(NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AWaterBody*>                     CallFunc_GetAllActorsOfClass_OutActors;            // 0x0030(0x0010)(ZeroConstructor, ReferenceParm)
	class AWaterBody*                             CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_56[0x2];                                       // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(LandscapeWaterInfo_C_Apply_PostProcess_MID_to_WaterBodies) == 0x000008, "Wrong alignment on LandscapeWaterInfo_C_Apply_PostProcess_MID_to_WaterBodies");
static_assert(sizeof(LandscapeWaterInfo_C_Apply_PostProcess_MID_to_WaterBodies) == 0x000078, "Wrong size on LandscapeWaterInfo_C_Apply_PostProcess_MID_to_WaterBodies");
static_assert(offsetof(LandscapeWaterInfo_C_Apply_PostProcess_MID_to_WaterBodies, TempMID) == 0x000000, "Member 'LandscapeWaterInfo_C_Apply_PostProcess_MID_to_WaterBodies::TempMID' has a wrong offset!");
static_assert(offsetof(LandscapeWaterInfo_C_Apply_PostProcess_MID_to_WaterBodies, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'LandscapeWaterInfo_C_Apply_PostProcess_MID_to_WaterBodies::CallFunc_IsValid_ReturnValue' has a wrong offset!");
