#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: M_LRG_Henchman_Tough_AnimBP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass M_LRG_Henchman_Tough_AnimBP.M_LRG_Henchman_Tough_AnimBP_C
// 0x1230 (0x1660 - 0x0430)
class UM_LRG_Henchman_Tough_AnimBP_C final : public UCustomCharacterPartAnimInstance_HenchmanTough
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0438(0x0030)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x0468(0x0140)(ContainsInstancedReference)
	uint8                                         Pad_5A8[0x8];                                      // 0x05A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_1;                         // 0x05B0(0x05A0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0B50(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0B70(0x0020)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x0B90(0x05A0)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint;                          // 0x1130(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x1238(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x1340(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x1448(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x1550(0x0108)()

public:
	void ExecuteUbergraph_M_LRG_Henchman_Tough_AnimBP(int32 EntryPoint);
	void OnEndJumping();
	void OnEndCrouching();
	void OnEndSkydiving();
	void OnBeginSkydiving();
	void OnParachuteOpened();
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"M_LRG_Henchman_Tough_AnimBP_C">();
	}
	static class UM_LRG_Henchman_Tough_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UM_LRG_Henchman_Tough_AnimBP_C>();
	}
};
static_assert(alignof(UM_LRG_Henchman_Tough_AnimBP_C) == 0x000010, "Wrong alignment on UM_LRG_Henchman_Tough_AnimBP_C");
static_assert(sizeof(UM_LRG_Henchman_Tough_AnimBP_C) == 0x001660, "Wrong size on UM_LRG_Henchman_Tough_AnimBP_C");
static_assert(offsetof(UM_LRG_Henchman_Tough_AnimBP_C, UberGraphFrame) == 0x000430, "Member 'UM_LRG_Henchman_Tough_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UM_LRG_Henchman_Tough_AnimBP_C, AnimGraphNode_Root) == 0x000438, "Member 'UM_LRG_Henchman_Tough_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UM_LRG_Henchman_Tough_AnimBP_C, AnimGraphNode_CopyPoseFromMesh) == 0x000468, "Member 'UM_LRG_Henchman_Tough_AnimBP_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UM_LRG_Henchman_Tough_AnimBP_C, AnimGraphNode_RigidBody_1) == 0x0005B0, "Member 'UM_LRG_Henchman_Tough_AnimBP_C::AnimGraphNode_RigidBody_1' has a wrong offset!");
static_assert(offsetof(UM_LRG_Henchman_Tough_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x000B50, "Member 'UM_LRG_Henchman_Tough_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UM_LRG_Henchman_Tough_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x000B70, "Member 'UM_LRG_Henchman_Tough_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UM_LRG_Henchman_Tough_AnimBP_C, AnimGraphNode_RigidBody) == 0x000B90, "Member 'UM_LRG_Henchman_Tough_AnimBP_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(UM_LRG_Henchman_Tough_AnimBP_C, AnimGraphNode_Constraint) == 0x001130, "Member 'UM_LRG_Henchman_Tough_AnimBP_C::AnimGraphNode_Constraint' has a wrong offset!");
static_assert(offsetof(UM_LRG_Henchman_Tough_AnimBP_C, AnimGraphNode_ModifyBone_3) == 0x001238, "Member 'UM_LRG_Henchman_Tough_AnimBP_C::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(UM_LRG_Henchman_Tough_AnimBP_C, AnimGraphNode_ModifyBone_2) == 0x001340, "Member 'UM_LRG_Henchman_Tough_AnimBP_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UM_LRG_Henchman_Tough_AnimBP_C, AnimGraphNode_ModifyBone_1) == 0x001448, "Member 'UM_LRG_Henchman_Tough_AnimBP_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UM_LRG_Henchman_Tough_AnimBP_C, AnimGraphNode_ModifyBone) == 0x001550, "Member 'UM_LRG_Henchman_Tough_AnimBP_C::AnimGraphNode_ModifyBone' has a wrong offset!");

}

