#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: M_LRG_Buff_Cat_Tail_PostSim_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass M_LRG_Buff_Cat_Tail_PostSim_AnimBP.M_LRG_Buff_Cat_Tail_PostSim_AnimBP_C
// 0x0360 (0x0780 - 0x0420)
class UM_LRG_Buff_Cat_Tail_PostSim_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	uint8                                         Pad_418[0x8];                                      // 0x0418(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0420(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0428(0x0030)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0458(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0478(0x0020)()
	uint8                                         Pad_498[0x8];                                      // 0x0498(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_Trail                        AnimGraphNode_Trail;                               // 0x04A0(0x0260)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0700(0x0070)()
	bool                                          IsWearingCape;                                     // 0x0770(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsWearingBackbling;                                // 0x0771(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_772[0x2];                                      // 0x0772(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TrailAlpha;                                        // 0x0774(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RelaxSpeed;                                        // 0x0778(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_M_LRG_Buff_Cat_Tail_PostSim_AnimBP(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void OnCharacterCustomizationLoaded();
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"M_LRG_Buff_Cat_Tail_PostSim_AnimBP_C">();
	}
	static class UM_LRG_Buff_Cat_Tail_PostSim_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UM_LRG_Buff_Cat_Tail_PostSim_AnimBP_C>();
	}
};
static_assert(alignof(UM_LRG_Buff_Cat_Tail_PostSim_AnimBP_C) == 0x000010, "Wrong alignment on UM_LRG_Buff_Cat_Tail_PostSim_AnimBP_C");
static_assert(sizeof(UM_LRG_Buff_Cat_Tail_PostSim_AnimBP_C) == 0x000780, "Wrong size on UM_LRG_Buff_Cat_Tail_PostSim_AnimBP_C");
static_assert(offsetof(UM_LRG_Buff_Cat_Tail_PostSim_AnimBP_C, UberGraphFrame) == 0x000420, "Member 'UM_LRG_Buff_Cat_Tail_PostSim_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UM_LRG_Buff_Cat_Tail_PostSim_AnimBP_C, AnimGraphNode_Root) == 0x000428, "Member 'UM_LRG_Buff_Cat_Tail_PostSim_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UM_LRG_Buff_Cat_Tail_PostSim_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x000458, "Member 'UM_LRG_Buff_Cat_Tail_PostSim_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UM_LRG_Buff_Cat_Tail_PostSim_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x000478, "Member 'UM_LRG_Buff_Cat_Tail_PostSim_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UM_LRG_Buff_Cat_Tail_PostSim_AnimBP_C, AnimGraphNode_Trail) == 0x0004A0, "Member 'UM_LRG_Buff_Cat_Tail_PostSim_AnimBP_C::AnimGraphNode_Trail' has a wrong offset!");
static_assert(offsetof(UM_LRG_Buff_Cat_Tail_PostSim_AnimBP_C, AnimGraphNode_LinkedInputPose) == 0x000700, "Member 'UM_LRG_Buff_Cat_Tail_PostSim_AnimBP_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UM_LRG_Buff_Cat_Tail_PostSim_AnimBP_C, IsWearingCape) == 0x000770, "Member 'UM_LRG_Buff_Cat_Tail_PostSim_AnimBP_C::IsWearingCape' has a wrong offset!");
static_assert(offsetof(UM_LRG_Buff_Cat_Tail_PostSim_AnimBP_C, IsWearingBackbling) == 0x000771, "Member 'UM_LRG_Buff_Cat_Tail_PostSim_AnimBP_C::IsWearingBackbling' has a wrong offset!");
static_assert(offsetof(UM_LRG_Buff_Cat_Tail_PostSim_AnimBP_C, TrailAlpha) == 0x000774, "Member 'UM_LRG_Buff_Cat_Tail_PostSim_AnimBP_C::TrailAlpha' has a wrong offset!");
static_assert(offsetof(UM_LRG_Buff_Cat_Tail_PostSim_AnimBP_C, RelaxSpeed) == 0x000778, "Member 'UM_LRG_Buff_Cat_Tail_PostSim_AnimBP_C::RelaxSpeed' has a wrong offset!");

}

