#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: M_LRG_Henchman_Glasses_FaceAcc_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "ControlRig_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass M_LRG_Henchman_Glasses_FaceAcc_AnimBP.M_LRG_Henchman_Glasses_FaceAcc_AnimBP_C
// 0x0820 (0x0C40 - 0x0420)
class UM_LRG_Henchman_Glasses_FaceAcc_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	uint8                                         Pad_418[0x8];                                      // 0x0418(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0420(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0428(0x0030)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x0458(0x0140)(ContainsInstancedReference)
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_2;                        // 0x0598(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_1;                        // 0x06A0(0x0108)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x07A8(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x07C8(0x0020)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0x07E8(0x0348)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint;                          // 0x0B30(0x0108)()
	bool                                          IsLOD0;                                            // 0x0C38(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_M_LRG_Henchman_Glasses_FaceAcc_AnimBP(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"M_LRG_Henchman_Glasses_FaceAcc_AnimBP_C">();
	}
	static class UM_LRG_Henchman_Glasses_FaceAcc_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UM_LRG_Henchman_Glasses_FaceAcc_AnimBP_C>();
	}
};
static_assert(alignof(UM_LRG_Henchman_Glasses_FaceAcc_AnimBP_C) == 0x000010, "Wrong alignment on UM_LRG_Henchman_Glasses_FaceAcc_AnimBP_C");
static_assert(sizeof(UM_LRG_Henchman_Glasses_FaceAcc_AnimBP_C) == 0x000C40, "Wrong size on UM_LRG_Henchman_Glasses_FaceAcc_AnimBP_C");
static_assert(offsetof(UM_LRG_Henchman_Glasses_FaceAcc_AnimBP_C, UberGraphFrame) == 0x000420, "Member 'UM_LRG_Henchman_Glasses_FaceAcc_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UM_LRG_Henchman_Glasses_FaceAcc_AnimBP_C, AnimGraphNode_Root) == 0x000428, "Member 'UM_LRG_Henchman_Glasses_FaceAcc_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UM_LRG_Henchman_Glasses_FaceAcc_AnimBP_C, AnimGraphNode_CopyPoseFromMesh) == 0x000458, "Member 'UM_LRG_Henchman_Glasses_FaceAcc_AnimBP_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UM_LRG_Henchman_Glasses_FaceAcc_AnimBP_C, AnimGraphNode_Constraint_2) == 0x000598, "Member 'UM_LRG_Henchman_Glasses_FaceAcc_AnimBP_C::AnimGraphNode_Constraint_2' has a wrong offset!");
static_assert(offsetof(UM_LRG_Henchman_Glasses_FaceAcc_AnimBP_C, AnimGraphNode_Constraint_1) == 0x0006A0, "Member 'UM_LRG_Henchman_Glasses_FaceAcc_AnimBP_C::AnimGraphNode_Constraint_1' has a wrong offset!");
static_assert(offsetof(UM_LRG_Henchman_Glasses_FaceAcc_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x0007A8, "Member 'UM_LRG_Henchman_Glasses_FaceAcc_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UM_LRG_Henchman_Glasses_FaceAcc_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x0007C8, "Member 'UM_LRG_Henchman_Glasses_FaceAcc_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UM_LRG_Henchman_Glasses_FaceAcc_AnimBP_C, AnimGraphNode_ControlRig) == 0x0007E8, "Member 'UM_LRG_Henchman_Glasses_FaceAcc_AnimBP_C::AnimGraphNode_ControlRig' has a wrong offset!");
static_assert(offsetof(UM_LRG_Henchman_Glasses_FaceAcc_AnimBP_C, AnimGraphNode_Constraint) == 0x000B30, "Member 'UM_LRG_Henchman_Glasses_FaceAcc_AnimBP_C::AnimGraphNode_Constraint' has a wrong offset!");
static_assert(offsetof(UM_LRG_Henchman_Glasses_FaceAcc_AnimBP_C, IsLOD0) == 0x000C38, "Member 'UM_LRG_Henchman_Glasses_FaceAcc_AnimBP_C::IsLOD0' has a wrong offset!");

}

