#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: M_LRG_Buff_Cat_Tail_PostSim_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function M_LRG_Buff_Cat_Tail_PostSim_AnimBP.M_LRG_Buff_Cat_Tail_PostSim_AnimBP_C.ExecuteUbergraph_M_LRG_Buff_Cat_Tail_PostSim_AnimBP
// 0x0038 (0x0038 - 0x0000)
struct M_LRG_Buff_Cat_Tail_PostSim_AnimBP_C_ExecuteUbergraph_M_LRG_Buff_Cat_Tail_PostSim_AnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckForBackbling_bIsWearingBackbling;    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckForBackbling_bIsBackblingLong;       // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetPartSkeletalMeshComponent_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetMIDForSkeletalMeshComponent_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetOwnerDirection_ReturnValue;            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(M_LRG_Buff_Cat_Tail_PostSim_AnimBP_C_ExecuteUbergraph_M_LRG_Buff_Cat_Tail_PostSim_AnimBP) == 0x000008, "Wrong alignment on M_LRG_Buff_Cat_Tail_PostSim_AnimBP_C_ExecuteUbergraph_M_LRG_Buff_Cat_Tail_PostSim_AnimBP");
static_assert(sizeof(M_LRG_Buff_Cat_Tail_PostSim_AnimBP_C_ExecuteUbergraph_M_LRG_Buff_Cat_Tail_PostSim_AnimBP) == 0x000038, "Wrong size on M_LRG_Buff_Cat_Tail_PostSim_AnimBP_C_ExecuteUbergraph_M_LRG_Buff_Cat_Tail_PostSim_AnimBP");
static_assert(offsetof(M_LRG_Buff_Cat_Tail_PostSim_AnimBP_C_ExecuteUbergraph_M_LRG_Buff_Cat_Tail_PostSim_AnimBP, EntryPoint) == 0x000000, "Member 'M_LRG_Buff_Cat_Tail_PostSim_AnimBP_C_ExecuteUbergraph_M_LRG_Buff_Cat_Tail_PostSim_AnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(M_LRG_Buff_Cat_Tail_PostSim_AnimBP_C_ExecuteUbergraph_M_LRG_Buff_Cat_Tail_PostSim_AnimBP, K2Node_Event_DeltaTimeX) == 0x000004, "Member 'M_LRG_Buff_Cat_Tail_PostSim_AnimBP_C_ExecuteUbergraph_M_LRG_Buff_Cat_Tail_PostSim_AnimBP::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(M_LRG_Buff_Cat_Tail_PostSim_AnimBP_C_ExecuteUbergraph_M_LRG_Buff_Cat_Tail_PostSim_AnimBP, CallFunc_CheckForBackbling_bIsWearingBackbling) == 0x000008, "Member 'M_LRG_Buff_Cat_Tail_PostSim_AnimBP_C_ExecuteUbergraph_M_LRG_Buff_Cat_Tail_PostSim_AnimBP::CallFunc_CheckForBackbling_bIsWearingBackbling' has a wrong offset!");
static_assert(offsetof(M_LRG_Buff_Cat_Tail_PostSim_AnimBP_C_ExecuteUbergraph_M_LRG_Buff_Cat_Tail_PostSim_AnimBP, CallFunc_CheckForBackbling_bIsBackblingLong) == 0x000009, "Member 'M_LRG_Buff_Cat_Tail_PostSim_AnimBP_C_ExecuteUbergraph_M_LRG_Buff_Cat_Tail_PostSim_AnimBP::CallFunc_CheckForBackbling_bIsBackblingLong' has a wrong offset!");
static_assert(offsetof(M_LRG_Buff_Cat_Tail_PostSim_AnimBP_C_ExecuteUbergraph_M_LRG_Buff_Cat_Tail_PostSim_AnimBP, CallFunc_GetPartSkeletalMeshComponent_ReturnValue) == 0x000010, "Member 'M_LRG_Buff_Cat_Tail_PostSim_AnimBP_C_ExecuteUbergraph_M_LRG_Buff_Cat_Tail_PostSim_AnimBP::CallFunc_GetPartSkeletalMeshComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_LRG_Buff_Cat_Tail_PostSim_AnimBP_C_ExecuteUbergraph_M_LRG_Buff_Cat_Tail_PostSim_AnimBP, CallFunc_GetMIDForSkeletalMeshComponent_ReturnValue) == 0x000018, "Member 'M_LRG_Buff_Cat_Tail_PostSim_AnimBP_C_ExecuteUbergraph_M_LRG_Buff_Cat_Tail_PostSim_AnimBP::CallFunc_GetMIDForSkeletalMeshComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_LRG_Buff_Cat_Tail_PostSim_AnimBP_C_ExecuteUbergraph_M_LRG_Buff_Cat_Tail_PostSim_AnimBP, CallFunc_BooleanOR_ReturnValue) == 0x000020, "Member 'M_LRG_Buff_Cat_Tail_PostSim_AnimBP_C_ExecuteUbergraph_M_LRG_Buff_Cat_Tail_PostSim_AnimBP::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_LRG_Buff_Cat_Tail_PostSim_AnimBP_C_ExecuteUbergraph_M_LRG_Buff_Cat_Tail_PostSim_AnimBP, CallFunc_GetOwnerDirection_ReturnValue) == 0x000024, "Member 'M_LRG_Buff_Cat_Tail_PostSim_AnimBP_C_ExecuteUbergraph_M_LRG_Buff_Cat_Tail_PostSim_AnimBP::CallFunc_GetOwnerDirection_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_LRG_Buff_Cat_Tail_PostSim_AnimBP_C_ExecuteUbergraph_M_LRG_Buff_Cat_Tail_PostSim_AnimBP, CallFunc_Abs_ReturnValue) == 0x000028, "Member 'M_LRG_Buff_Cat_Tail_PostSim_AnimBP_C_ExecuteUbergraph_M_LRG_Buff_Cat_Tail_PostSim_AnimBP::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_LRG_Buff_Cat_Tail_PostSim_AnimBP_C_ExecuteUbergraph_M_LRG_Buff_Cat_Tail_PostSim_AnimBP, CallFunc_MapRangeClamped_ReturnValue) == 0x00002C, "Member 'M_LRG_Buff_Cat_Tail_PostSim_AnimBP_C_ExecuteUbergraph_M_LRG_Buff_Cat_Tail_PostSim_AnimBP::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_LRG_Buff_Cat_Tail_PostSim_AnimBP_C_ExecuteUbergraph_M_LRG_Buff_Cat_Tail_PostSim_AnimBP, CallFunc_BooleanOR_ReturnValue_1) == 0x000030, "Member 'M_LRG_Buff_Cat_Tail_PostSim_AnimBP_C_ExecuteUbergraph_M_LRG_Buff_Cat_Tail_PostSim_AnimBP::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");

// Function M_LRG_Buff_Cat_Tail_PostSim_AnimBP.M_LRG_Buff_Cat_Tail_PostSim_AnimBP_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct M_LRG_Buff_Cat_Tail_PostSim_AnimBP_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(M_LRG_Buff_Cat_Tail_PostSim_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on M_LRG_Buff_Cat_Tail_PostSim_AnimBP_C_BlueprintUpdateAnimation");
static_assert(sizeof(M_LRG_Buff_Cat_Tail_PostSim_AnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on M_LRG_Buff_Cat_Tail_PostSim_AnimBP_C_BlueprintUpdateAnimation");
static_assert(offsetof(M_LRG_Buff_Cat_Tail_PostSim_AnimBP_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'M_LRG_Buff_Cat_Tail_PostSim_AnimBP_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function M_LRG_Buff_Cat_Tail_PostSim_AnimBP.M_LRG_Buff_Cat_Tail_PostSim_AnimBP_C.AnimGraph
// 0x0020 (0x0020 - 0x0000)
struct M_LRG_Buff_Cat_Tail_PostSim_AnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              AnimGraph_0;                                       // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(M_LRG_Buff_Cat_Tail_PostSim_AnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on M_LRG_Buff_Cat_Tail_PostSim_AnimBP_C_AnimGraph");
static_assert(sizeof(M_LRG_Buff_Cat_Tail_PostSim_AnimBP_C_AnimGraph) == 0x000020, "Wrong size on M_LRG_Buff_Cat_Tail_PostSim_AnimBP_C_AnimGraph");
static_assert(offsetof(M_LRG_Buff_Cat_Tail_PostSim_AnimBP_C_AnimGraph, InPose) == 0x000000, "Member 'M_LRG_Buff_Cat_Tail_PostSim_AnimBP_C_AnimGraph::InPose' has a wrong offset!");
static_assert(offsetof(M_LRG_Buff_Cat_Tail_PostSim_AnimBP_C_AnimGraph, AnimGraph_0) == 0x000010, "Member 'M_LRG_Buff_Cat_Tail_PostSim_AnimBP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

