#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: M_MED_BananaAgent_FaceAcc_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass M_MED_BananaAgent_FaceAcc_AnimBP.M_MED_BananaAgent_FaceAcc_AnimBP_C
// 0x1320 (0x1740 - 0x0420)
class UM_MED_BananaAgent_FaceAcc_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	uint8                                         Pad_418[0x8];                                      // 0x0418(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0420(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0428(0x0030)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint_1;                        // 0x0458(0x0108)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint;                          // 0x0560(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0668(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0688(0x0020)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh_1;                  // 0x06A8(0x0140)(ContainsInstancedReference)
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x07E8(0x0140)(ContainsInstancedReference)
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x0928(0x00C0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x09E8(0x00B8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0AA0(0x0028)()
	uint8                                         Pad_AC8[0x8];                                      // 0x0AC8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_1;                         // 0x0AD0(0x05A0)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x1070(0x05A0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x1610(0x0108)()
	class USkeletalMeshComponent*                 Body_Mesh;                                         // 0x1718(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerPawn_Athena_C*                   Pawn_Owner;                                        // 0x1720(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Head_MESH;                                         // 0x1728(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         IsTargeting;                                       // 0x1730(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         IsNotTargeting;                                    // 0x1734(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_M_MED_BananaAgent_FaceAcc_AnimBP(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void OnEndPlayingEmote();
	void OnBeginPlayingEmote();
	void OnEndTargeting();
	void OnBeginTargeting();
	void BlueprintInitializeAnimation();
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"M_MED_BananaAgent_FaceAcc_AnimBP_C">();
	}
	static class UM_MED_BananaAgent_FaceAcc_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UM_MED_BananaAgent_FaceAcc_AnimBP_C>();
	}
};
static_assert(alignof(UM_MED_BananaAgent_FaceAcc_AnimBP_C) == 0x000010, "Wrong alignment on UM_MED_BananaAgent_FaceAcc_AnimBP_C");
static_assert(sizeof(UM_MED_BananaAgent_FaceAcc_AnimBP_C) == 0x001740, "Wrong size on UM_MED_BananaAgent_FaceAcc_AnimBP_C");
static_assert(offsetof(UM_MED_BananaAgent_FaceAcc_AnimBP_C, UberGraphFrame) == 0x000420, "Member 'UM_MED_BananaAgent_FaceAcc_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UM_MED_BananaAgent_FaceAcc_AnimBP_C, AnimGraphNode_Root) == 0x000428, "Member 'UM_MED_BananaAgent_FaceAcc_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UM_MED_BananaAgent_FaceAcc_AnimBP_C, AnimGraphNode_Constraint_1) == 0x000458, "Member 'UM_MED_BananaAgent_FaceAcc_AnimBP_C::AnimGraphNode_Constraint_1' has a wrong offset!");
static_assert(offsetof(UM_MED_BananaAgent_FaceAcc_AnimBP_C, AnimGraphNode_Constraint) == 0x000560, "Member 'UM_MED_BananaAgent_FaceAcc_AnimBP_C::AnimGraphNode_Constraint' has a wrong offset!");
static_assert(offsetof(UM_MED_BananaAgent_FaceAcc_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x000668, "Member 'UM_MED_BananaAgent_FaceAcc_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UM_MED_BananaAgent_FaceAcc_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x000688, "Member 'UM_MED_BananaAgent_FaceAcc_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UM_MED_BananaAgent_FaceAcc_AnimBP_C, AnimGraphNode_CopyPoseFromMesh_1) == 0x0006A8, "Member 'UM_MED_BananaAgent_FaceAcc_AnimBP_C::AnimGraphNode_CopyPoseFromMesh_1' has a wrong offset!");
static_assert(offsetof(UM_MED_BananaAgent_FaceAcc_AnimBP_C, AnimGraphNode_CopyPoseFromMesh) == 0x0007E8, "Member 'UM_MED_BananaAgent_FaceAcc_AnimBP_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UM_MED_BananaAgent_FaceAcc_AnimBP_C, AnimGraphNode_LayeredBoneBlend) == 0x000928, "Member 'UM_MED_BananaAgent_FaceAcc_AnimBP_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UM_MED_BananaAgent_FaceAcc_AnimBP_C, AnimGraphNode_SaveCachedPose) == 0x0009E8, "Member 'UM_MED_BananaAgent_FaceAcc_AnimBP_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UM_MED_BananaAgent_FaceAcc_AnimBP_C, AnimGraphNode_UseCachedPose) == 0x000AA0, "Member 'UM_MED_BananaAgent_FaceAcc_AnimBP_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UM_MED_BananaAgent_FaceAcc_AnimBP_C, AnimGraphNode_RigidBody_1) == 0x000AD0, "Member 'UM_MED_BananaAgent_FaceAcc_AnimBP_C::AnimGraphNode_RigidBody_1' has a wrong offset!");
static_assert(offsetof(UM_MED_BananaAgent_FaceAcc_AnimBP_C, AnimGraphNode_RigidBody) == 0x001070, "Member 'UM_MED_BananaAgent_FaceAcc_AnimBP_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(UM_MED_BananaAgent_FaceAcc_AnimBP_C, AnimGraphNode_ModifyBone) == 0x001610, "Member 'UM_MED_BananaAgent_FaceAcc_AnimBP_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UM_MED_BananaAgent_FaceAcc_AnimBP_C, Body_Mesh) == 0x001718, "Member 'UM_MED_BananaAgent_FaceAcc_AnimBP_C::Body_Mesh' has a wrong offset!");
static_assert(offsetof(UM_MED_BananaAgent_FaceAcc_AnimBP_C, Pawn_Owner) == 0x001720, "Member 'UM_MED_BananaAgent_FaceAcc_AnimBP_C::Pawn_Owner' has a wrong offset!");
static_assert(offsetof(UM_MED_BananaAgent_FaceAcc_AnimBP_C, Head_MESH) == 0x001728, "Member 'UM_MED_BananaAgent_FaceAcc_AnimBP_C::Head_MESH' has a wrong offset!");
static_assert(offsetof(UM_MED_BananaAgent_FaceAcc_AnimBP_C, IsTargeting) == 0x001730, "Member 'UM_MED_BananaAgent_FaceAcc_AnimBP_C::IsTargeting' has a wrong offset!");
static_assert(offsetof(UM_MED_BananaAgent_FaceAcc_AnimBP_C, IsNotTargeting) == 0x001734, "Member 'UM_MED_BananaAgent_FaceAcc_AnimBP_C::IsNotTargeting' has a wrong offset!");

}

