#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Niagara

#include "Basic.hpp"

#include "MovieScene_classes.hpp"
#include "Niagara_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "NiagaraCore_classes.hpp"


namespace SDK
{

// Class Niagara.MovieSceneNiagaraTrack
// 0x0010 (0x0068 - 0x0058)
class UMovieSceneNiagaraTrack : public UMovieSceneNameableTrack
{
public:
	TArray<class UMovieSceneSection*>             Sections;                                          // 0x0058(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneNiagaraTrack">();
	}
	static class UMovieSceneNiagaraTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraTrack>();
	}
};
static_assert(alignof(UMovieSceneNiagaraTrack) == 0x000008, "Wrong alignment on UMovieSceneNiagaraTrack");
static_assert(sizeof(UMovieSceneNiagaraTrack) == 0x000068, "Wrong size on UMovieSceneNiagaraTrack");
static_assert(offsetof(UMovieSceneNiagaraTrack, Sections) == 0x000058, "Member 'UMovieSceneNiagaraTrack::Sections' has a wrong offset!");

// Class Niagara.MovieSceneNiagaraSystemTrack
// 0x0000 (0x0068 - 0x0068)
class UMovieSceneNiagaraSystemTrack final : public UMovieSceneNiagaraTrack
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneNiagaraSystemTrack">();
	}
	static class UMovieSceneNiagaraSystemTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraSystemTrack>();
	}
};
static_assert(alignof(UMovieSceneNiagaraSystemTrack) == 0x000008, "Wrong alignment on UMovieSceneNiagaraSystemTrack");
static_assert(sizeof(UMovieSceneNiagaraSystemTrack) == 0x000068, "Wrong size on UMovieSceneNiagaraSystemTrack");

// Class Niagara.MovieSceneNiagaraParameterTrack
// 0x0028 (0x0090 - 0x0068)
class UMovieSceneNiagaraParameterTrack : public UMovieSceneNiagaraTrack
{
public:
	struct FNiagaraVariable                       Parameter;                                         // 0x0068(0x0028)(HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneNiagaraParameterTrack">();
	}
	static class UMovieSceneNiagaraParameterTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraParameterTrack>();
	}
};
static_assert(alignof(UMovieSceneNiagaraParameterTrack) == 0x000008, "Wrong alignment on UMovieSceneNiagaraParameterTrack");
static_assert(sizeof(UMovieSceneNiagaraParameterTrack) == 0x000090, "Wrong size on UMovieSceneNiagaraParameterTrack");
static_assert(offsetof(UMovieSceneNiagaraParameterTrack, Parameter) == 0x000068, "Member 'UMovieSceneNiagaraParameterTrack::Parameter' has a wrong offset!");

// Class Niagara.NiagaraRendererProperties
// 0x0008 (0x0030 - 0x0028)
class UNiagaraRendererProperties : public UNiagaraMergeable
{
public:
	int32                                         SortOrderHint;                                     // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsEnabled;                                        // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMotionBlurEnabled;                                // 0x002D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraRendererProperties">();
	}
	static class UNiagaraRendererProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraRendererProperties>();
	}
};
static_assert(alignof(UNiagaraRendererProperties) == 0x000008, "Wrong alignment on UNiagaraRendererProperties");
static_assert(sizeof(UNiagaraRendererProperties) == 0x000030, "Wrong size on UNiagaraRendererProperties");
static_assert(offsetof(UNiagaraRendererProperties, SortOrderHint) == 0x000028, "Member 'UNiagaraRendererProperties::SortOrderHint' has a wrong offset!");
static_assert(offsetof(UNiagaraRendererProperties, bIsEnabled) == 0x00002C, "Member 'UNiagaraRendererProperties::bIsEnabled' has a wrong offset!");
static_assert(offsetof(UNiagaraRendererProperties, bMotionBlurEnabled) == 0x00002D, "Member 'UNiagaraRendererProperties::bMotionBlurEnabled' has a wrong offset!");

// Class Niagara.NiagaraLightRendererProperties
// 0x02E8 (0x0318 - 0x0030)
class UNiagaraLightRendererProperties final : public UNiagaraRendererProperties
{
public:
	uint8                                         bUseInverseSquaredFalloff : 1;                     // 0x0030(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bAffectsTranslucency : 1;                          // 0x0030(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bOverrideRenderingEnabled : 1;                     // 0x0030(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RadiusScale;                                       // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ColorAdd;                                          // 0x0038(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNiagaraVariableAttributeBinding       LightRenderingEnabledBinding;                      // 0x0048(0x0078)(Edit, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       LightExponentBinding;                              // 0x00C0(0x0078)(Edit, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       PositionBinding;                                   // 0x0138(0x0078)(Edit, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       ColorBinding;                                      // 0x01B0(0x0078)(Edit, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       RadiusBinding;                                     // 0x0228(0x0078)(Edit, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       VolumetricScatteringBinding;                       // 0x02A0(0x0078)(Edit, AdvancedDisplay, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraLightRendererProperties">();
	}
	static class UNiagaraLightRendererProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraLightRendererProperties>();
	}
};
static_assert(alignof(UNiagaraLightRendererProperties) == 0x000008, "Wrong alignment on UNiagaraLightRendererProperties");
static_assert(sizeof(UNiagaraLightRendererProperties) == 0x000318, "Wrong size on UNiagaraLightRendererProperties");
static_assert(offsetof(UNiagaraLightRendererProperties, RadiusScale) == 0x000034, "Member 'UNiagaraLightRendererProperties::RadiusScale' has a wrong offset!");
static_assert(offsetof(UNiagaraLightRendererProperties, ColorAdd) == 0x000038, "Member 'UNiagaraLightRendererProperties::ColorAdd' has a wrong offset!");
static_assert(offsetof(UNiagaraLightRendererProperties, LightRenderingEnabledBinding) == 0x000048, "Member 'UNiagaraLightRendererProperties::LightRenderingEnabledBinding' has a wrong offset!");
static_assert(offsetof(UNiagaraLightRendererProperties, LightExponentBinding) == 0x0000C0, "Member 'UNiagaraLightRendererProperties::LightExponentBinding' has a wrong offset!");
static_assert(offsetof(UNiagaraLightRendererProperties, PositionBinding) == 0x000138, "Member 'UNiagaraLightRendererProperties::PositionBinding' has a wrong offset!");
static_assert(offsetof(UNiagaraLightRendererProperties, ColorBinding) == 0x0001B0, "Member 'UNiagaraLightRendererProperties::ColorBinding' has a wrong offset!");
static_assert(offsetof(UNiagaraLightRendererProperties, RadiusBinding) == 0x000228, "Member 'UNiagaraLightRendererProperties::RadiusBinding' has a wrong offset!");
static_assert(offsetof(UNiagaraLightRendererProperties, VolumetricScatteringBinding) == 0x0002A0, "Member 'UNiagaraLightRendererProperties::VolumetricScatteringBinding' has a wrong offset!");

// Class Niagara.MovieSceneNiagaraBoolParameterTrack
// 0x0000 (0x0090 - 0x0090)
class UMovieSceneNiagaraBoolParameterTrack final : public UMovieSceneNiagaraParameterTrack
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneNiagaraBoolParameterTrack">();
	}
	static class UMovieSceneNiagaraBoolParameterTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraBoolParameterTrack>();
	}
};
static_assert(alignof(UMovieSceneNiagaraBoolParameterTrack) == 0x000008, "Wrong alignment on UMovieSceneNiagaraBoolParameterTrack");
static_assert(sizeof(UMovieSceneNiagaraBoolParameterTrack) == 0x000090, "Wrong size on UMovieSceneNiagaraBoolParameterTrack");

// Class Niagara.NiagaraPreviewAxis
// 0x0000 (0x0028 - 0x0028)
class UNiagaraPreviewAxis : public UObject
{
public:
	void ApplyToPreview(class UNiagaraComponent* PreviewComponent, int32 PreviewIndex, bool bIsXAxis, class FString* OutLabelText);
	int32 Num();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraPreviewAxis">();
	}
	static class UNiagaraPreviewAxis* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraPreviewAxis>();
	}
};
static_assert(alignof(UNiagaraPreviewAxis) == 0x000008, "Wrong alignment on UNiagaraPreviewAxis");
static_assert(sizeof(UNiagaraPreviewAxis) == 0x000028, "Wrong size on UNiagaraPreviewAxis");

// Class Niagara.NiagaraPreviewAxis_InterpParamBase
// 0x0010 (0x0038 - 0x0028)
class UNiagaraPreviewAxis_InterpParamBase : public UNiagaraPreviewAxis
{
public:
	class FName                                   Param;                                             // 0x0028(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         Count;                                             // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraPreviewAxis_InterpParamBase">();
	}
	static class UNiagaraPreviewAxis_InterpParamBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraPreviewAxis_InterpParamBase>();
	}
};
static_assert(alignof(UNiagaraPreviewAxis_InterpParamBase) == 0x000008, "Wrong alignment on UNiagaraPreviewAxis_InterpParamBase");
static_assert(sizeof(UNiagaraPreviewAxis_InterpParamBase) == 0x000038, "Wrong size on UNiagaraPreviewAxis_InterpParamBase");
static_assert(offsetof(UNiagaraPreviewAxis_InterpParamBase, Param) == 0x000028, "Member 'UNiagaraPreviewAxis_InterpParamBase::Param' has a wrong offset!");
static_assert(offsetof(UNiagaraPreviewAxis_InterpParamBase, Count) == 0x000030, "Member 'UNiagaraPreviewAxis_InterpParamBase::Count' has a wrong offset!");

// Class Niagara.NiagaraPreviewAxis_InterpParamVector
// 0x0018 (0x0050 - 0x0038)
class UNiagaraPreviewAxis_InterpParamVector final : public UNiagaraPreviewAxis_InterpParamBase
{
public:
	struct FVector                                Min;                                               // 0x0038(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                Max;                                               // 0x0044(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraPreviewAxis_InterpParamVector">();
	}
	static class UNiagaraPreviewAxis_InterpParamVector* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraPreviewAxis_InterpParamVector>();
	}
};
static_assert(alignof(UNiagaraPreviewAxis_InterpParamVector) == 0x000008, "Wrong alignment on UNiagaraPreviewAxis_InterpParamVector");
static_assert(sizeof(UNiagaraPreviewAxis_InterpParamVector) == 0x000050, "Wrong size on UNiagaraPreviewAxis_InterpParamVector");
static_assert(offsetof(UNiagaraPreviewAxis_InterpParamVector, Min) == 0x000038, "Member 'UNiagaraPreviewAxis_InterpParamVector::Min' has a wrong offset!");
static_assert(offsetof(UNiagaraPreviewAxis_InterpParamVector, Max) == 0x000044, "Member 'UNiagaraPreviewAxis_InterpParamVector::Max' has a wrong offset!");

// Class Niagara.MovieSceneNiagaraColorParameterTrack
// 0x0000 (0x0090 - 0x0090)
class UMovieSceneNiagaraColorParameterTrack final : public UMovieSceneNiagaraParameterTrack
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneNiagaraColorParameterTrack">();
	}
	static class UMovieSceneNiagaraColorParameterTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraColorParameterTrack>();
	}
};
static_assert(alignof(UMovieSceneNiagaraColorParameterTrack) == 0x000008, "Wrong alignment on UMovieSceneNiagaraColorParameterTrack");
static_assert(sizeof(UMovieSceneNiagaraColorParameterTrack) == 0x000090, "Wrong size on UMovieSceneNiagaraColorParameterTrack");

// Class Niagara.MovieSceneNiagaraFloatParameterTrack
// 0x0000 (0x0090 - 0x0090)
class UMovieSceneNiagaraFloatParameterTrack final : public UMovieSceneNiagaraParameterTrack
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneNiagaraFloatParameterTrack">();
	}
	static class UMovieSceneNiagaraFloatParameterTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraFloatParameterTrack>();
	}
};
static_assert(alignof(UMovieSceneNiagaraFloatParameterTrack) == 0x000008, "Wrong alignment on UMovieSceneNiagaraFloatParameterTrack");
static_assert(sizeof(UMovieSceneNiagaraFloatParameterTrack) == 0x000090, "Wrong size on UMovieSceneNiagaraFloatParameterTrack");

// Class Niagara.MovieSceneNiagaraIntegerParameterTrack
// 0x0000 (0x0090 - 0x0090)
class UMovieSceneNiagaraIntegerParameterTrack final : public UMovieSceneNiagaraParameterTrack
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneNiagaraIntegerParameterTrack">();
	}
	static class UMovieSceneNiagaraIntegerParameterTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraIntegerParameterTrack>();
	}
};
static_assert(alignof(UMovieSceneNiagaraIntegerParameterTrack) == 0x000008, "Wrong alignment on UMovieSceneNiagaraIntegerParameterTrack");
static_assert(sizeof(UMovieSceneNiagaraIntegerParameterTrack) == 0x000090, "Wrong size on UMovieSceneNiagaraIntegerParameterTrack");

// Class Niagara.NiagaraRibbonRendererProperties
// 0x0710 (0x0740 - 0x0030)
class UNiagaraRibbonRendererProperties final : public UNiagaraRendererProperties
{
public:
	class UMaterialInterface*                     Material;                                          // 0x0030(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FNiagaraUserParameterBinding           MaterialUserParamBinding;                          // 0x0038(0x0028)(Edit, NativeAccessSpecifierPublic)
	ENiagaraRibbonFacingMode                      FacingMode;                                        // 0x0060(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         UV0TilingDistance;                                 // 0x0064(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              UV0Scale;                                          // 0x0068(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              UV0Offset;                                         // 0x0070(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENiagaraRibbonAgeOffsetMode                   UV0AgeOffsetMode;                                  // 0x0078(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         UV1TilingDistance;                                 // 0x007C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              UV1Scale;                                          // 0x0080(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              UV1Offset;                                         // 0x0088(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENiagaraRibbonAgeOffsetMode                   UV1AgeOffsetMode;                                  // 0x0090(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENiagaraRibbonDrawDirection                   DrawDirection;                                     // 0x0091(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_92[0x2];                                       // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CurveTension;                                      // 0x0094(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENiagaraRibbonTessellationMode                TessellationMode;                                  // 0x0098(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TessellationFactor;                                // 0x009C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseConstantFactor;                                // 0x00A0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TessellationAngle;                                 // 0x00A4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bScreenSpaceTessellation;                          // 0x00A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNiagaraVariableAttributeBinding       PositionBinding;                                   // 0x00B0(0x0078)(Edit, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       ColorBinding;                                      // 0x0128(0x0078)(Edit, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       VelocityBinding;                                   // 0x01A0(0x0078)(Edit, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       NormalizedAgeBinding;                              // 0x0218(0x0078)(Edit, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       RibbonTwistBinding;                                // 0x0290(0x0078)(Edit, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       RibbonWidthBinding;                                // 0x0308(0x0078)(Edit, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       RibbonFacingBinding;                               // 0x0380(0x0078)(Edit, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       RibbonIdBinding;                                   // 0x03F8(0x0078)(Edit, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       RibbonLinkOrderBinding;                            // 0x0470(0x0078)(Edit, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       MaterialRandomBinding;                             // 0x04E8(0x0078)(Edit, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       DynamicMaterialBinding;                            // 0x0560(0x0078)(Edit, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       DynamicMaterial1Binding;                           // 0x05D8(0x0078)(Edit, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       DynamicMaterial2Binding;                           // 0x0650(0x0078)(Edit, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FNiagaraVariableAttributeBinding       DynamicMaterial3Binding;                           // 0x06C8(0x0078)(Edit, AdvancedDisplay, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraRibbonRendererProperties">();
	}
	static class UNiagaraRibbonRendererProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraRibbonRendererProperties>();
	}
};
static_assert(alignof(UNiagaraRibbonRendererProperties) == 0x000008, "Wrong alignment on UNiagaraRibbonRendererProperties");
static_assert(sizeof(UNiagaraRibbonRendererProperties) == 0x000740, "Wrong size on UNiagaraRibbonRendererProperties");
static_assert(offsetof(UNiagaraRibbonRendererProperties, Material) == 0x000030, "Member 'UNiagaraRibbonRendererProperties::Material' has a wrong offset!");
static_assert(offsetof(UNiagaraRibbonRendererProperties, MaterialUserParamBinding) == 0x000038, "Member 'UNiagaraRibbonRendererProperties::MaterialUserParamBinding' has a wrong offset!");
static_assert(offsetof(UNiagaraRibbonRendererProperties, FacingMode) == 0x000060, "Member 'UNiagaraRibbonRendererProperties::FacingMode' has a wrong offset!");
static_assert(offsetof(UNiagaraRibbonRendererProperties, UV0TilingDistance) == 0x000064, "Member 'UNiagaraRibbonRendererProperties::UV0TilingDistance' has a wrong offset!");
static_assert(offsetof(UNiagaraRibbonRendererProperties, UV0Scale) == 0x000068, "Member 'UNiagaraRibbonRendererProperties::UV0Scale' has a wrong offset!");
static_assert(offsetof(UNiagaraRibbonRendererProperties, UV0Offset) == 0x000070, "Member 'UNiagaraRibbonRendererProperties::UV0Offset' has a wrong offset!");
static_assert(offsetof(UNiagaraRibbonRendererProperties, UV0AgeOffsetMode) == 0x000078, "Member 'UNiagaraRibbonRendererProperties::UV0AgeOffsetMode' has a wrong offset!");
static_assert(offsetof(UNiagaraRibbonRendererProperties, UV1TilingDistance) == 0x00007C, "Member 'UNiagaraRibbonRendererProperties::UV1TilingDistance' has a wrong offset!");
static_assert(offsetof(UNiagaraRibbonRendererProperties, UV1Scale) == 0x000080, "Member 'UNiagaraRibbonRendererProperties::UV1Scale' has a wrong offset!");
static_assert(offsetof(UNiagaraRibbonRendererProperties, UV1Offset) == 0x000088, "Member 'UNiagaraRibbonRendererProperties::UV1Offset' has a wrong offset!");
static_assert(offsetof(UNiagaraRibbonRendererProperties, UV1AgeOffsetMode) == 0x000090, "Member 'UNiagaraRibbonRendererProperties::UV1AgeOffsetMode' has a wrong offset!");
static_assert(offsetof(UNiagaraRibbonRendererProperties, DrawDirection) == 0x000091, "Member 'UNiagaraRibbonRendererProperties::DrawDirection' has a wrong offset!");
static_assert(offsetof(UNiagaraRibbonRendererProperties, CurveTension) == 0x000094, "Member 'UNiagaraRibbonRendererProperties::CurveTension' has a wrong offset!");
static_assert(offsetof(UNiagaraRibbonRendererProperties, TessellationMode) == 0x000098, "Member 'UNiagaraRibbonRendererProperties::TessellationMode' has a wrong offset!");
static_assert(offsetof(UNiagaraRibbonRendererProperties, TessellationFactor) == 0x00009C, "Member 'UNiagaraRibbonRendererProperties::TessellationFactor' has a wrong offset!");
static_assert(offsetof(UNiagaraRibbonRendererProperties, bUseConstantFactor) == 0x0000A0, "Member 'UNiagaraRibbonRendererProperties::bUseConstantFactor' has a wrong offset!");
static_assert(offsetof(UNiagaraRibbonRendererProperties, TessellationAngle) == 0x0000A4, "Member 'UNiagaraRibbonRendererProperties::TessellationAngle' has a wrong offset!");
static_assert(offsetof(UNiagaraRibbonRendererProperties, bScreenSpaceTessellation) == 0x0000A8, "Member 'UNiagaraRibbonRendererProperties::bScreenSpaceTessellation' has a wrong offset!");
static_assert(offsetof(UNiagaraRibbonRendererProperties, PositionBinding) == 0x0000B0, "Member 'UNiagaraRibbonRendererProperties::PositionBinding' has a wrong offset!");
static_assert(offsetof(UNiagaraRibbonRendererProperties, ColorBinding) == 0x000128, "Member 'UNiagaraRibbonRendererProperties::ColorBinding' has a wrong offset!");
static_assert(offsetof(UNiagaraRibbonRendererProperties, VelocityBinding) == 0x0001A0, "Member 'UNiagaraRibbonRendererProperties::VelocityBinding' has a wrong offset!");
static_assert(offsetof(UNiagaraRibbonRendererProperties, NormalizedAgeBinding) == 0x000218, "Member 'UNiagaraRibbonRendererProperties::NormalizedAgeBinding' has a wrong offset!");
static_assert(offsetof(UNiagaraRibbonRendererProperties, RibbonTwistBinding) == 0x000290, "Member 'UNiagaraRibbonRendererProperties::RibbonTwistBinding' has a wrong offset!");
static_assert(offsetof(UNiagaraRibbonRendererProperties, RibbonWidthBinding) == 0x000308, "Member 'UNiagaraRibbonRendererProperties::RibbonWidthBinding' has a wrong offset!");
static_assert(offsetof(UNiagaraRibbonRendererProperties, RibbonFacingBinding) == 0x000380, "Member 'UNiagaraRibbonRendererProperties::RibbonFacingBinding' has a wrong offset!");
static_assert(offsetof(UNiagaraRibbonRendererProperties, RibbonIdBinding) == 0x0003F8, "Member 'UNiagaraRibbonRendererProperties::RibbonIdBinding' has a wrong offset!");
static_assert(offsetof(UNiagaraRibbonRendererProperties, RibbonLinkOrderBinding) == 0x000470, "Member 'UNiagaraRibbonRendererProperties::RibbonLinkOrderBinding' has a wrong offset!");
static_assert(offsetof(UNiagaraRibbonRendererProperties, MaterialRandomBinding) == 0x0004E8, "Member 'UNiagaraRibbonRendererProperties::MaterialRandomBinding' has a wrong offset!");
static_assert(offsetof(UNiagaraRibbonRendererProperties, DynamicMaterialBinding) == 0x000560, "Member 'UNiagaraRibbonRendererProperties::DynamicMaterialBinding' has a wrong offset!");
static_assert(offsetof(UNiagaraRibbonRendererProperties, DynamicMaterial1Binding) == 0x0005D8, "Member 'UNiagaraRibbonRendererProperties::DynamicMaterial1Binding' has a wrong offset!");
static_assert(offsetof(UNiagaraRibbonRendererProperties, DynamicMaterial2Binding) == 0x000650, "Member 'UNiagaraRibbonRendererProperties::DynamicMaterial2Binding' has a wrong offset!");
static_assert(offsetof(UNiagaraRibbonRendererProperties, DynamicMaterial3Binding) == 0x0006C8, "Member 'UNiagaraRibbonRendererProperties::DynamicMaterial3Binding' has a wrong offset!");

// Class Niagara.MovieSceneNiagaraSystemSpawnSection
// 0x0010 (0x00F0 - 0x00E0)
class UMovieSceneNiagaraSystemSpawnSection final : public UMovieSceneSection
{
public:
	ENiagaraSystemSpawnSectionStartBehavior       SectionStartBehavior;                              // 0x00E0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ENiagaraSystemSpawnSectionEvaluateBehavior    SectionEvaluateBehavior;                           // 0x00E4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ENiagaraSystemSpawnSectionEndBehavior         SectionEndBehavior;                                // 0x00E8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ENiagaraAgeUpdateMode                         AgeUpdateMode;                                     // 0x00EC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneNiagaraSystemSpawnSection">();
	}
	static class UMovieSceneNiagaraSystemSpawnSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraSystemSpawnSection>();
	}
};
static_assert(alignof(UMovieSceneNiagaraSystemSpawnSection) == 0x000008, "Wrong alignment on UMovieSceneNiagaraSystemSpawnSection");
static_assert(sizeof(UMovieSceneNiagaraSystemSpawnSection) == 0x0000F0, "Wrong size on UMovieSceneNiagaraSystemSpawnSection");
static_assert(offsetof(UMovieSceneNiagaraSystemSpawnSection, SectionStartBehavior) == 0x0000E0, "Member 'UMovieSceneNiagaraSystemSpawnSection::SectionStartBehavior' has a wrong offset!");
static_assert(offsetof(UMovieSceneNiagaraSystemSpawnSection, SectionEvaluateBehavior) == 0x0000E4, "Member 'UMovieSceneNiagaraSystemSpawnSection::SectionEvaluateBehavior' has a wrong offset!");
static_assert(offsetof(UMovieSceneNiagaraSystemSpawnSection, SectionEndBehavior) == 0x0000E8, "Member 'UMovieSceneNiagaraSystemSpawnSection::SectionEndBehavior' has a wrong offset!");
static_assert(offsetof(UMovieSceneNiagaraSystemSpawnSection, AgeUpdateMode) == 0x0000EC, "Member 'UMovieSceneNiagaraSystemSpawnSection::AgeUpdateMode' has a wrong offset!");

// Class Niagara.NiagaraPreviewAxis_InterpParamFloat
// 0x0008 (0x0040 - 0x0038)
class UNiagaraPreviewAxis_InterpParamFloat final : public UNiagaraPreviewAxis_InterpParamBase
{
public:
	float                                         Min;                                               // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         Max;                                               // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraPreviewAxis_InterpParamFloat">();
	}
	static class UNiagaraPreviewAxis_InterpParamFloat* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraPreviewAxis_InterpParamFloat>();
	}
};
static_assert(alignof(UNiagaraPreviewAxis_InterpParamFloat) == 0x000008, "Wrong alignment on UNiagaraPreviewAxis_InterpParamFloat");
static_assert(sizeof(UNiagaraPreviewAxis_InterpParamFloat) == 0x000040, "Wrong size on UNiagaraPreviewAxis_InterpParamFloat");
static_assert(offsetof(UNiagaraPreviewAxis_InterpParamFloat, Min) == 0x000038, "Member 'UNiagaraPreviewAxis_InterpParamFloat::Min' has a wrong offset!");
static_assert(offsetof(UNiagaraPreviewAxis_InterpParamFloat, Max) == 0x00003C, "Member 'UNiagaraPreviewAxis_InterpParamFloat::Max' has a wrong offset!");

// Class Niagara.MovieSceneNiagaraVectorParameterTrack
// 0x0008 (0x0098 - 0x0090)
class UMovieSceneNiagaraVectorParameterTrack final : public UMovieSceneNiagaraParameterTrack
{
public:
	int32                                         ChannelsUsed;                                      // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MovieSceneNiagaraVectorParameterTrack">();
	}
	static class UMovieSceneNiagaraVectorParameterTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneNiagaraVectorParameterTrack>();
	}
};
static_assert(alignof(UMovieSceneNiagaraVectorParameterTrack) == 0x000008, "Wrong alignment on UMovieSceneNiagaraVectorParameterTrack");
static_assert(sizeof(UMovieSceneNiagaraVectorParameterTrack) == 0x000098, "Wrong size on UMovieSceneNiagaraVectorParameterTrack");
static_assert(offsetof(UMovieSceneNiagaraVectorParameterTrack, ChannelsUsed) == 0x000090, "Member 'UMovieSceneNiagaraVectorParameterTrack::ChannelsUsed' has a wrong offset!");

// Class Niagara.NiagaraActor
// 0x0008 (0x0220 - 0x0218)
class ANiagaraActor final : public AActor
{
public:
	class UNiagaraComponent*                      NiagaraComponent;                                  // 0x0218(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraActor">();
	}
	static class ANiagaraActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANiagaraActor>();
	}
};
static_assert(alignof(ANiagaraActor) == 0x000008, "Wrong alignment on ANiagaraActor");
static_assert(sizeof(ANiagaraActor) == 0x000220, "Wrong size on ANiagaraActor");
static_assert(offsetof(ANiagaraActor, NiagaraComponent) == 0x000218, "Member 'ANiagaraActor::NiagaraComponent' has a wrong offset!");

// Class Niagara.NiagaraComponent
// 0x0170 (0x0560 - 0x03F0)
class UNiagaraComponent final : public UFXSystemComponent
{
public:
	class UNiagaraSystem*                         Asset;                                             // 0x03E8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	ENiagaraTickBehavior                          TickBehavior;                                      // 0x03F0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3F1[0x7];                                      // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNiagaraUserRedirectionParameterStore  OverrideParameters;                                // 0x03F8(0x00C8)(Edit, NativeAccessSpecifierPrivate)
	uint8                                         bForceSolo : 1;                                    // 0x04C0(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         BitPad_4C0_1 : 7;                                  // 0x04C0(0x0001)(Fixing Bit-Field Size For New Byte [ Dumper-7 ])
	uint8                                         Pad_4C1[0x2B];                                     // 0x04C1(0x002B)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bAutoDestroy : 1;                                  // 0x04EC(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bRenderingEnabled : 1;                             // 0x04EC(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bAutoManageAttachment : 1;                         // 0x04EC(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bAutoAttachWeldSimulatedBodies : 1;                // 0x04EC(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_4ED[0x3];                                      // 0x04ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxTimeBeforeForceUpdateTransform;                 // 0x04F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4F4[0x4];                                      // 0x04F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnSystemFinished;                                  // 0x04F8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class USceneComponent>         AutoAttachParent;                                  // 0x0508(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AutoAttachSocketName;                              // 0x0510(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAttachmentRule                               AutoAttachLocationRule;                            // 0x0518(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAttachmentRule                               AutoAttachRotationRule;                            // 0x0519(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAttachmentRule                               AutoAttachScaleRule;                               // 0x051A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51B[0x45];                                     // 0x051B(0x0045)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AdvanceSimulation(int32 TickCount, float TickDeltaSeconds);
	void AdvanceSimulationByTime(float SimulateTime, float TickDeltaSeconds);
	class UNiagaraDataInterface* GetDataInterface(const class FString& Name_0);
	TArray<struct FVector> GetNiagaraParticlePositions_DebugOnly(const class FString& InEmitterName);
	TArray<float> GetNiagaraParticleValues_DebugOnly(const class FString& InEmitterName, const class FString& InValueName);
	TArray<struct FVector> GetNiagaraParticleValueVec3_DebugOnly(const class FString& InEmitterName, const class FString& InValueName);
	void ReinitializeSystem();
	void ResetSystem();
	void SeekToDesiredAge(float InDesiredAge);
	void SetAgeUpdateMode(ENiagaraAgeUpdateMode InAgeUpdateMode);
	void SetAllowScalability(bool bAllow);
	void SetAsset(class UNiagaraSystem* InAsset);
	void SetAutoDestroy(bool bInAutoDestroy);
	void SetCanRenderWhileSeeking(bool bInCanRenderWhileSeeking);
	void SetDesiredAge(float InDesiredAge);
	void SetForceSolo(bool bInForceSolo);
	void SetMaxSimTime(float InMaxTime);
	void SetNiagaraVariableActor(const class FString& InVariableName, class AActor* Actor);
	void SetNiagaraVariableBool(const class FString& InVariableName, bool InValue);
	void SetNiagaraVariableFloat(const class FString& InVariableName, float InValue);
	void SetNiagaraVariableInt(const class FString& InVariableName, int32 InValue);
	void SetNiagaraVariableLinearColor(const class FString& InVariableName, const struct FLinearColor& InValue);
	void SetNiagaraVariableObject(const class FString& InVariableName, class UObject* Object);
	void SetNiagaraVariableQuat(const class FString& InVariableName, const struct FQuat& InValue);
	void SetNiagaraVariableVec2(const class FString& InVariableName, const struct FVector2D& InValue);
	void SetNiagaraVariableVec3(const class FString& InVariableName, const struct FVector& InValue);
	void SetNiagaraVariableVec4(const class FString& InVariableName, const struct FVector4& InValue);
	void SetPaused(bool bInPaused);
	void SetPreviewLODDistance(bool bEnablePreviewLODDistance, float PreviewLODDistance);
	void SetRenderingEnabled(bool bInRenderingEnabled);
	void SetSeekDelta(float InSeekDelta);
	void SetVariableActor(class FName InVariableName, class AActor* Actor);
	void SetVariableBool(class FName InVariableName, bool InValue);
	void SetVariableFloat(class FName InVariableName, float InValue);
	void SetVariableInt(class FName InVariableName, int32 InValue);
	void SetVariableLinearColor(class FName InVariableName, const struct FLinearColor& InValue);
	void SetVariableMaterial(class FName InVariableName, class UMaterialInterface* Object);
	void SetVariableObject(class FName InVariableName, class UObject* Object);
	void SetVariableQuat(class FName InVariableName, const struct FQuat& InValue);
	void SetVariableVec2(class FName InVariableName, const struct FVector2D& InValue);
	void SetVariableVec3(class FName InVariableName, const struct FVector& InValue);
	void SetVariableVec4(class FName InVariableName, const struct FVector4& InValue);

	ENiagaraAgeUpdateMode GetAgeUpdateMode() const;
	class UNiagaraSystem* GetAsset() const;
	float GetDesiredAge() const;
	bool GetForceSolo() const;
	float GetMaxSimTime() const;
	int32 GetPreviewLODDistance() const;
	bool GetPreviewLODDistanceEnabled() const;
	float GetSeekDelta() const;
	bool IsPaused() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraComponent">();
	}
	static class UNiagaraComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraComponent>();
	}
};
static_assert(alignof(UNiagaraComponent) == 0x000010, "Wrong alignment on UNiagaraComponent");
static_assert(sizeof(UNiagaraComponent) == 0x000560, "Wrong size on UNiagaraComponent");
static_assert(offsetof(UNiagaraComponent, Asset) == 0x0003E8, "Member 'UNiagaraComponent::Asset' has a wrong offset!");
static_assert(offsetof(UNiagaraComponent, TickBehavior) == 0x0003F0, "Member 'UNiagaraComponent::TickBehavior' has a wrong offset!");
static_assert(offsetof(UNiagaraComponent, OverrideParameters) == 0x0003F8, "Member 'UNiagaraComponent::OverrideParameters' has a wrong offset!");
static_assert(offsetof(UNiagaraComponent, MaxTimeBeforeForceUpdateTransform) == 0x0004F0, "Member 'UNiagaraComponent::MaxTimeBeforeForceUpdateTransform' has a wrong offset!");
static_assert(offsetof(UNiagaraComponent, OnSystemFinished) == 0x0004F8, "Member 'UNiagaraComponent::OnSystemFinished' has a wrong offset!");
static_assert(offsetof(UNiagaraComponent, AutoAttachParent) == 0x000508, "Member 'UNiagaraComponent::AutoAttachParent' has a wrong offset!");
static_assert(offsetof(UNiagaraComponent, AutoAttachSocketName) == 0x000510, "Member 'UNiagaraComponent::AutoAttachSocketName' has a wrong offset!");
static_assert(offsetof(UNiagaraComponent, AutoAttachLocationRule) == 0x000518, "Member 'UNiagaraComponent::AutoAttachLocationRule' has a wrong offset!");
static_assert(offsetof(UNiagaraComponent, AutoAttachRotationRule) == 0x000519, "Member 'UNiagaraComponent::AutoAttachRotationRule' has a wrong offset!");
static_assert(offsetof(UNiagaraComponent, AutoAttachScaleRule) == 0x00051A, "Member 'UNiagaraComponent::AutoAttachScaleRule' has a wrong offset!");

// Class Niagara.NiagaraComponentPool
// 0x0058 (0x0080 - 0x0028)
class UNiagaraComponentPool final : public UObject
{
public:
	TMap<class UNiagaraSystem*, struct FNCPool>   WorldParticleSystemPools;                          // 0x0028(0x0050)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraComponentPool">();
	}
	static class UNiagaraComponentPool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraComponentPool>();
	}
};
static_assert(alignof(UNiagaraComponentPool) == 0x000008, "Wrong alignment on UNiagaraComponentPool");
static_assert(sizeof(UNiagaraComponentPool) == 0x000080, "Wrong size on UNiagaraComponentPool");
static_assert(offsetof(UNiagaraComponentPool, WorldParticleSystemPools) == 0x000028, "Member 'UNiagaraComponentPool::WorldParticleSystemPools' has a wrong offset!");

// Class Niagara.NiagaraDataInterface
// 0x0008 (0x0030 - 0x0028)
class UNiagaraDataInterface : public UNiagaraDataInterfaceBase
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterface">();
	}
	static class UNiagaraDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterface>();
	}
};
static_assert(alignof(UNiagaraDataInterface) == 0x000008, "Wrong alignment on UNiagaraDataInterface");
static_assert(sizeof(UNiagaraDataInterface) == 0x000030, "Wrong size on UNiagaraDataInterface");

// Class Niagara.NiagaraDataInterfaceAudioSubmix
// 0x0008 (0x0038 - 0x0030)
class UNiagaraDataInterfaceAudioSubmix : public UNiagaraDataInterface
{
public:
	class USoundSubmix*                           Submix;                                            // 0x0030(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceAudioSubmix">();
	}
	static class UNiagaraDataInterfaceAudioSubmix* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceAudioSubmix>();
	}
};
static_assert(alignof(UNiagaraDataInterfaceAudioSubmix) == 0x000008, "Wrong alignment on UNiagaraDataInterfaceAudioSubmix");
static_assert(sizeof(UNiagaraDataInterfaceAudioSubmix) == 0x000038, "Wrong size on UNiagaraDataInterfaceAudioSubmix");
static_assert(offsetof(UNiagaraDataInterfaceAudioSubmix, Submix) == 0x000030, "Member 'UNiagaraDataInterfaceAudioSubmix::Submix' has a wrong offset!");

// Class Niagara.NiagaraDataInterfaceAudioOscilloscope
// 0x0010 (0x0040 - 0x0030)
class UNiagaraDataInterfaceAudioOscilloscope final : public UNiagaraDataInterface
{
public:
	class USoundSubmix*                           Submix;                                            // 0x0030(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Resolution;                                        // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ScopeInMilliseconds;                               // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceAudioOscilloscope">();
	}
	static class UNiagaraDataInterfaceAudioOscilloscope* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceAudioOscilloscope>();
	}
};
static_assert(alignof(UNiagaraDataInterfaceAudioOscilloscope) == 0x000008, "Wrong alignment on UNiagaraDataInterfaceAudioOscilloscope");
static_assert(sizeof(UNiagaraDataInterfaceAudioOscilloscope) == 0x000040, "Wrong size on UNiagaraDataInterfaceAudioOscilloscope");
static_assert(offsetof(UNiagaraDataInterfaceAudioOscilloscope, Submix) == 0x000030, "Member 'UNiagaraDataInterfaceAudioOscilloscope::Submix' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceAudioOscilloscope, Resolution) == 0x000038, "Member 'UNiagaraDataInterfaceAudioOscilloscope::Resolution' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceAudioOscilloscope, ScopeInMilliseconds) == 0x00003C, "Member 'UNiagaraDataInterfaceAudioOscilloscope::ScopeInMilliseconds' has a wrong offset!");

// Class Niagara.NiagaraDataInterfaceAudioSpectrum
// 0x0010 (0x0048 - 0x0038)
class UNiagaraDataInterfaceAudioSpectrum final : public UNiagaraDataInterfaceAudioSubmix
{
public:
	int32                                         Resolution;                                        // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinimumFrequency;                                  // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaximumFrequency;                                  // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NoiseFloorDb;                                      // 0x0044(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceAudioSpectrum">();
	}
	static class UNiagaraDataInterfaceAudioSpectrum* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceAudioSpectrum>();
	}
};
static_assert(alignof(UNiagaraDataInterfaceAudioSpectrum) == 0x000008, "Wrong alignment on UNiagaraDataInterfaceAudioSpectrum");
static_assert(sizeof(UNiagaraDataInterfaceAudioSpectrum) == 0x000048, "Wrong size on UNiagaraDataInterfaceAudioSpectrum");
static_assert(offsetof(UNiagaraDataInterfaceAudioSpectrum, Resolution) == 0x000038, "Member 'UNiagaraDataInterfaceAudioSpectrum::Resolution' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceAudioSpectrum, MinimumFrequency) == 0x00003C, "Member 'UNiagaraDataInterfaceAudioSpectrum::MinimumFrequency' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceAudioSpectrum, MaximumFrequency) == 0x000040, "Member 'UNiagaraDataInterfaceAudioSpectrum::MaximumFrequency' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceAudioSpectrum, NoiseFloorDb) == 0x000044, "Member 'UNiagaraDataInterfaceAudioSpectrum::NoiseFloorDb' has a wrong offset!");

// Class Niagara.NiagaraDataInterfaceSimpleCounter
// 0x0000 (0x0030 - 0x0030)
class UNiagaraDataInterfaceSimpleCounter final : public UNiagaraDataInterface
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceSimpleCounter">();
	}
	static class UNiagaraDataInterfaceSimpleCounter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceSimpleCounter>();
	}
};
static_assert(alignof(UNiagaraDataInterfaceSimpleCounter) == 0x000008, "Wrong alignment on UNiagaraDataInterfaceSimpleCounter");
static_assert(sizeof(UNiagaraDataInterfaceSimpleCounter) == 0x000030, "Wrong size on UNiagaraDataInterfaceSimpleCounter");

// Class Niagara.NiagaraDataInterfaceCamera
// 0x0008 (0x0038 - 0x0030)
class UNiagaraDataInterfaceCamera final : public UNiagaraDataInterface
{
public:
	int32                                         PlayerControllerIndex;                             // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceCamera">();
	}
	static class UNiagaraDataInterfaceCamera* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceCamera>();
	}
};
static_assert(alignof(UNiagaraDataInterfaceCamera) == 0x000008, "Wrong alignment on UNiagaraDataInterfaceCamera");
static_assert(sizeof(UNiagaraDataInterfaceCamera) == 0x000038, "Wrong size on UNiagaraDataInterfaceCamera");
static_assert(offsetof(UNiagaraDataInterfaceCamera, PlayerControllerIndex) == 0x000030, "Member 'UNiagaraDataInterfaceCamera::PlayerControllerIndex' has a wrong offset!");

// Class Niagara.NiagaraDataInterfaceCollisionQuery
// 0x0010 (0x0040 - 0x0030)
class UNiagaraDataInterfaceCollisionQuery final : public UNiagaraDataInterface
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceCollisionQuery">();
	}
	static class UNiagaraDataInterfaceCollisionQuery* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceCollisionQuery>();
	}
};
static_assert(alignof(UNiagaraDataInterfaceCollisionQuery) == 0x000008, "Wrong alignment on UNiagaraDataInterfaceCollisionQuery");
static_assert(sizeof(UNiagaraDataInterfaceCollisionQuery) == 0x000040, "Wrong size on UNiagaraDataInterfaceCollisionQuery");

// Class Niagara.NiagaraDataInterfaceRWBase
// 0x00A8 (0x00D8 - 0x0030)
class UNiagaraDataInterfaceRWBase : public UNiagaraDataInterface
{
public:
	TSet<int32>                                   OutputShaderStages;                                // 0x0030(0x0050)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TSet<int32>                                   IterationShaderStages;                             // 0x0080(0x0050)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_D0[0x8];                                       // 0x00D0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceRWBase">();
	}
	static class UNiagaraDataInterfaceRWBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceRWBase>();
	}
};
static_assert(alignof(UNiagaraDataInterfaceRWBase) == 0x000008, "Wrong alignment on UNiagaraDataInterfaceRWBase");
static_assert(sizeof(UNiagaraDataInterfaceRWBase) == 0x0000D8, "Wrong size on UNiagaraDataInterfaceRWBase");
static_assert(offsetof(UNiagaraDataInterfaceRWBase, OutputShaderStages) == 0x000030, "Member 'UNiagaraDataInterfaceRWBase::OutputShaderStages' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceRWBase, IterationShaderStages) == 0x000080, "Member 'UNiagaraDataInterfaceRWBase::IterationShaderStages' has a wrong offset!");

// Class Niagara.NiagaraDataInterfaceGrid2D
// 0x0020 (0x00F8 - 0x00D8)
class UNiagaraDataInterfaceGrid2D : public UNiagaraDataInterfaceRWBase
{
public:
	int32                                         NumCellsX;                                         // 0x00D8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumCellsY;                                         // 0x00DC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumCellsMaxAxis;                                   // 0x00E0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumAttributes;                                     // 0x00E4(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          SetGridFromMaxAxis;                                // 0x00E8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              WorldBBoxSize;                                     // 0x00EC(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"NiagaraDataInterfaceGrid2D">();
	}
	static class UNiagaraDataInterfaceGrid2D* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNiagaraDataInterfaceGrid2D>();
	}
};
static_assert(alignof(UNiagaraDataInterfaceGrid2D) == 0x000008, "Wrong alignment on UNiagaraDataInterfaceGrid2D");
static_assert(sizeof(UNiagaraDataInterfaceGrid2D) == 0x0000F8, "Wrong size on UNiagaraDataInterfaceGrid2D");
static_assert(offsetof(UNiagaraDataInterfaceGrid2D, NumCellsX) == 0x0000D8, "Member 'UNiagaraDataInterfaceGrid2D::NumCellsX' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceGrid2D, NumCellsY) == 0x0000DC, "Member 'UNiagaraDataInterfaceGrid2D::NumCellsY' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceGrid2D, NumCellsMaxAxis) == 0x0000E0, "Member 'UNiagaraDataInterfaceGrid2D::NumCellsMaxAxis' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceGrid2D, NumAttributes) == 0x0000E4, "Member 'UNiagaraDataInterfaceGrid2D::NumAttributes' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceGrid2D, SetGridFromMaxAxis) == 0x0000E8, "Member 'UNiagaraDataInterfaceGrid2D::SetGridFromMaxAxis' has a wrong offset!");
static_assert(offsetof(UNiagaraDataInterfaceGrid2D, WorldBBoxSize) == 0x0000EC, "Member 'UNiagaraDataInterfaceGrid2D::WorldBBoxSize' has a wrong offset!");

// Class Niagara.NiagaraDataInterfaceCurveBase
// 0x0028 (0x0058 - 0x0030)
class UNiagaraDataInterfaceCurveBase : public UNiagaraDataInterface
{
public:
	TArray<float>                                 ShaderLUT;                                         // 0x0030(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
