#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PP_Pixelizer

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PP_Pixelizer.PP_Pixelizer_C
// 0x0018 (0x0230 - 0x0218)
class APP_Pixelizer_C final : public AActor
{
public:
	class UPostProcessComponent*                  PostProcess;                                       // 0x0218(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PP_Pixelizer_C">();
	}
	static class APP_Pixelizer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APP_Pixelizer_C>();
	}
};
static_assert(alignof(APP_Pixelizer_C) == 0x000008, "Wrong alignment on APP_Pixelizer_C");
static_assert(sizeof(APP_Pixelizer_C) == 0x000230, "Wrong size on APP_Pixelizer_C");
static_assert(offsetof(APP_Pixelizer_C, PostProcess) == 0x000218, "Member 'APP_Pixelizer_C::PostProcess' has a wrong offset!");
static_assert(offsetof(APP_Pixelizer_C, Box) == 0x000220, "Member 'APP_Pixelizer_C::Box' has a wrong offset!");
static_assert(offsetof(APP_Pixelizer_C, DefaultSceneRoot) == 0x000228, "Member 'APP_Pixelizer_C::DefaultSceneRoot' has a wrong offset!");

}

