#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RadialPickerItem

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass RadialPickerItem.RadialPickerItem_C
// 0x0090 (0x02E8 - 0x0258)
class URadialPickerItem_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Selected;                                          // 0x0260(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonBorder*                          BorderItemBorder;                                  // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       ImageIcon;                                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageItemNotSelected;                              // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  ImageOrItemSwitcher;                               // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeybindWidget_C*                       KeybindWidget;                                     // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMultiSizeItemCard*                 PickerItem;                                        // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextLabel;                                         // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   PickerItemText;                                    // 0x02A0(0x0018)(Edit, BlueprintVisible)
	FMulticastInlineDelegateProperty_             On_Item_Touched;                                   // 0x02B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FLinearColor                           DefaultSelectedColor;                              // 0x02C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DefaultUnselectedColor;                            // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void On_Item_Touched__DelegateSignature(class URadialPickerItem_C* Picked_Option);
	void ExecuteUbergraph_RadialPickerItem(int32 EntryPoint);
	void Construct();
	void SetImageAndLabelContent(const class FText& Text, TSoftObjectPtr<class UTexture2D> Icon, const struct FSlateBrush& Brush, bool Option_Enabled, int32 RadialItemIndex);
	void SetSelected(bool Isselected);
	void SetItemContent(class UFortItem* Item, bool Option_Enabled, int32 Radial_Item_Index);
	void SetShowImageAndLabel(bool ShowImageAndLabel);
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void UpdateSelectionColor(bool Selected_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RadialPickerItem_C">();
	}
	static class URadialPickerItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URadialPickerItem_C>();
	}
};
static_assert(alignof(URadialPickerItem_C) == 0x000008, "Wrong alignment on URadialPickerItem_C");
static_assert(sizeof(URadialPickerItem_C) == 0x0002E8, "Wrong size on URadialPickerItem_C");
static_assert(offsetof(URadialPickerItem_C, UberGraphFrame) == 0x000258, "Member 'URadialPickerItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(URadialPickerItem_C, Selected) == 0x000260, "Member 'URadialPickerItem_C::Selected' has a wrong offset!");
static_assert(offsetof(URadialPickerItem_C, BorderItemBorder) == 0x000268, "Member 'URadialPickerItem_C::BorderItemBorder' has a wrong offset!");
static_assert(offsetof(URadialPickerItem_C, ImageIcon) == 0x000270, "Member 'URadialPickerItem_C::ImageIcon' has a wrong offset!");
static_assert(offsetof(URadialPickerItem_C, ImageItemNotSelected) == 0x000278, "Member 'URadialPickerItem_C::ImageItemNotSelected' has a wrong offset!");
static_assert(offsetof(URadialPickerItem_C, ImageOrItemSwitcher) == 0x000280, "Member 'URadialPickerItem_C::ImageOrItemSwitcher' has a wrong offset!");
static_assert(offsetof(URadialPickerItem_C, KeybindWidget) == 0x000288, "Member 'URadialPickerItem_C::KeybindWidget' has a wrong offset!");
static_assert(offsetof(URadialPickerItem_C, PickerItem) == 0x000290, "Member 'URadialPickerItem_C::PickerItem' has a wrong offset!");
static_assert(offsetof(URadialPickerItem_C, TextLabel) == 0x000298, "Member 'URadialPickerItem_C::TextLabel' has a wrong offset!");
static_assert(offsetof(URadialPickerItem_C, PickerItemText) == 0x0002A0, "Member 'URadialPickerItem_C::PickerItemText' has a wrong offset!");
static_assert(offsetof(URadialPickerItem_C, On_Item_Touched) == 0x0002B8, "Member 'URadialPickerItem_C::On_Item_Touched' has a wrong offset!");
static_assert(offsetof(URadialPickerItem_C, DefaultSelectedColor) == 0x0002C8, "Member 'URadialPickerItem_C::DefaultSelectedColor' has a wrong offset!");
static_assert(offsetof(URadialPickerItem_C, DefaultUnselectedColor) == 0x0002D8, "Member 'URadialPickerItem_C::DefaultUnselectedColor' has a wrong offset!");

}

