#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RadialPickerItem

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function RadialPickerItem.RadialPickerItem_C.On Item Touched__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct RadialPickerItem_C_On_Item_Touched__DelegateSignature final
{
public:
	class URadialPickerItem_C*                    Picked_Option;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RadialPickerItem_C_On_Item_Touched__DelegateSignature) == 0x000008, "Wrong alignment on RadialPickerItem_C_On_Item_Touched__DelegateSignature");
static_assert(sizeof(RadialPickerItem_C_On_Item_Touched__DelegateSignature) == 0x000008, "Wrong size on RadialPickerItem_C_On_Item_Touched__DelegateSignature");
static_assert(offsetof(RadialPickerItem_C_On_Item_Touched__DelegateSignature, Picked_Option) == 0x000000, "Member 'RadialPickerItem_C_On_Item_Touched__DelegateSignature::Picked_Option' has a wrong offset!");

// Function RadialPickerItem.RadialPickerItem_C.ExecuteUbergraph_RadialPickerItem
// 0x0004 (0x0004 - 0x0000)
struct RadialPickerItem_C_ExecuteUbergraph_RadialPickerItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RadialPickerItem_C_ExecuteUbergraph_RadialPickerItem) == 0x000004, "Wrong alignment on RadialPickerItem_C_ExecuteUbergraph_RadialPickerItem");
static_assert(sizeof(RadialPickerItem_C_ExecuteUbergraph_RadialPickerItem) == 0x000004, "Wrong size on RadialPickerItem_C_ExecuteUbergraph_RadialPickerItem");
static_assert(offsetof(RadialPickerItem_C_ExecuteUbergraph_RadialPickerItem, EntryPoint) == 0x000000, "Member 'RadialPickerItem_C_ExecuteUbergraph_RadialPickerItem::EntryPoint' has a wrong offset!");

// Function RadialPickerItem.RadialPickerItem_C.SetImageAndLabelContent
// 0x0100 (0x0100 - 0x0000)
struct RadialPickerItem_C_SetImageAndLabelContent final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	TSoftObjectPtr<class UTexture2D>              Icon;                                              // 0x0018(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	struct FSlateBrush                            Brush;                                             // 0x0040(0x0088)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          Option_Enabled;                                    // 0x00C8(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RadialItemIndex;                                   // 0x00CC(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_BuildString_Int_ReturnValue;              // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x00F4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RadialPickerItem_C_SetImageAndLabelContent) == 0x000008, "Wrong alignment on RadialPickerItem_C_SetImageAndLabelContent");
static_assert(sizeof(RadialPickerItem_C_SetImageAndLabelContent) == 0x000100, "Wrong size on RadialPickerItem_C_SetImageAndLabelContent");
static_assert(offsetof(RadialPickerItem_C_SetImageAndLabelContent, Text) == 0x000000, "Member 'RadialPickerItem_C_SetImageAndLabelContent::Text' has a wrong offset!");
static_assert(offsetof(RadialPickerItem_C_SetImageAndLabelContent, Icon) == 0x000018, "Member 'RadialPickerItem_C_SetImageAndLabelContent::Icon' has a wrong offset!");
static_assert(offsetof(RadialPickerItem_C_SetImageAndLabelContent, Brush) == 0x000040, "Member 'RadialPickerItem_C_SetImageAndLabelContent::Brush' has a wrong offset!");
static_assert(offsetof(RadialPickerItem_C_SetImageAndLabelContent, Option_Enabled) == 0x0000C8, "Member 'RadialPickerItem_C_SetImageAndLabelContent::Option_Enabled' has a wrong offset!");
static_assert(offsetof(RadialPickerItem_C_SetImageAndLabelContent, RadialItemIndex) == 0x0000CC, "Member 'RadialPickerItem_C_SetImageAndLabelContent::RadialItemIndex' has a wrong offset!");
static_assert(offsetof(RadialPickerItem_C_SetImageAndLabelContent, CallFunc_Add_IntInt_ReturnValue) == 0x0000D0, "Member 'RadialPickerItem_C_SetImageAndLabelContent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RadialPickerItem_C_SetImageAndLabelContent, CallFunc_BuildString_Int_ReturnValue) == 0x0000D8, "Member 'RadialPickerItem_C_SetImageAndLabelContent::CallFunc_BuildString_Int_ReturnValue' has a wrong offset!");
static_assert(offsetof(RadialPickerItem_C_SetImageAndLabelContent, CallFunc_Conv_StringToName_ReturnValue) == 0x0000E8, "Member 'RadialPickerItem_C_SetImageAndLabelContent::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(RadialPickerItem_C_SetImageAndLabelContent, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x0000F0, "Member 'RadialPickerItem_C_SetImageAndLabelContent::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(RadialPickerItem_C_SetImageAndLabelContent, CallFunc_MakeLiteralName_ReturnValue) == 0x0000F4, "Member 'RadialPickerItem_C_SetImageAndLabelContent::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");

// Function RadialPickerItem.RadialPickerItem_C.SetSelected
// 0x0050 (0x0050 - 0x0000)
struct RadialPickerItem_C_SetSelected final
{
public:
	bool                                          Isselected;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAnimationCurrentTime_ReturnValue;      // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_1;                           // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RadialPickerItem_C_SetSelected) == 0x000008, "Wrong alignment on RadialPickerItem_C_SetSelected");
static_assert(sizeof(RadialPickerItem_C_SetSelected) == 0x000050, "Wrong size on RadialPickerItem_C_SetSelected");
static_assert(offsetof(RadialPickerItem_C_SetSelected, Isselected) == 0x000000, "Member 'RadialPickerItem_C_SetSelected::Isselected' has a wrong offset!");
static_assert(offsetof(RadialPickerItem_C_SetSelected, Temp_bool_Variable) == 0x000001, "Member 'RadialPickerItem_C_SetSelected::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(RadialPickerItem_C_SetSelected, Temp_float_Variable) == 0x000004, "Member 'RadialPickerItem_C_SetSelected::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(RadialPickerItem_C_SetSelected, Temp_bool_Variable_1) == 0x000008, "Member 'RadialPickerItem_C_SetSelected::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(RadialPickerItem_C_SetSelected, Temp_byte_Variable) == 0x000009, "Member 'RadialPickerItem_C_SetSelected::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(RadialPickerItem_C_SetSelected, Temp_byte_Variable_1) == 0x00000A, "Member 'RadialPickerItem_C_SetSelected::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(RadialPickerItem_C_SetSelected, K2Node_Select_Default) == 0x00000B, "Member 'RadialPickerItem_C_SetSelected::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(RadialPickerItem_C_SetSelected, CallFunc_GetEndTime_ReturnValue) == 0x00000C, "Member 'RadialPickerItem_C_SetSelected::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(RadialPickerItem_C_SetSelected, CallFunc_GetAnimationCurrentTime_ReturnValue) == 0x000010, "Member 'RadialPickerItem_C_SetSelected::CallFunc_GetAnimationCurrentTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(RadialPickerItem_C_SetSelected, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000014, "Member 'RadialPickerItem_C_SetSelected::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(RadialPickerItem_C_SetSelected, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000018, "Member 'RadialPickerItem_C_SetSelected::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(RadialPickerItem_C_SetSelected, CallFunc_PlayAnimation_ReturnValue) == 0x000020, "Member 'RadialPickerItem_C_SetSelected::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(RadialPickerItem_C_SetSelected, K2Node_Select_Default_1) == 0x000028, "Member 'RadialPickerItem_C_SetSelected::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(RadialPickerItem_C_SetSelected, CallFunc_PlayAnimation_ReturnValue_1) == 0x000030, "Member 'RadialPickerItem_C_SetSelected::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RadialPickerItem_C_SetSelected, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000038, "Member 'RadialPickerItem_C_SetSelected::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(RadialPickerItem_C_SetSelected, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000040, "Member 'RadialPickerItem_C_SetSelected::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(RadialPickerItem_C_SetSelected, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000048, "Member 'RadialPickerItem_C_SetSelected::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function RadialPickerItem.RadialPickerItem_C.SetItemContent
// 0x0050 (0x0050 - 0x0000)
struct RadialPickerItem_C_SetItemContent final
{
public:
	class UFortItem*                              Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Option_Enabled;                                    // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Radial_Item_Index;                                 // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_BuildString_Int_ReturnValue;              // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetDisplayName_ReturnValue;               // 0x0030(0x0018)()
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RadialPickerItem_C_SetItemContent) == 0x000008, "Wrong alignment on RadialPickerItem_C_SetItemContent");
static_assert(sizeof(RadialPickerItem_C_SetItemContent) == 0x000050, "Wrong size on RadialPickerItem_C_SetItemContent");
static_assert(offsetof(RadialPickerItem_C_SetItemContent, Item) == 0x000000, "Member 'RadialPickerItem_C_SetItemContent::Item' has a wrong offset!");
static_assert(offsetof(RadialPickerItem_C_SetItemContent, Option_Enabled) == 0x000008, "Member 'RadialPickerItem_C_SetItemContent::Option_Enabled' has a wrong offset!");
static_assert(offsetof(RadialPickerItem_C_SetItemContent, Radial_Item_Index) == 0x00000C, "Member 'RadialPickerItem_C_SetItemContent::Radial_Item_Index' has a wrong offset!");
static_assert(offsetof(RadialPickerItem_C_SetItemContent, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'RadialPickerItem_C_SetItemContent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RadialPickerItem_C_SetItemContent, CallFunc_BuildString_Int_ReturnValue) == 0x000018, "Member 'RadialPickerItem_C_SetItemContent::CallFunc_BuildString_Int_ReturnValue' has a wrong offset!");
static_assert(offsetof(RadialPickerItem_C_SetItemContent, CallFunc_Conv_StringToName_ReturnValue) == 0x000028, "Member 'RadialPickerItem_C_SetItemContent::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(RadialPickerItem_C_SetItemContent, CallFunc_GetDisplayName_ReturnValue) == 0x000030, "Member 'RadialPickerItem_C_SetItemContent::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(RadialPickerItem_C_SetItemContent, CallFunc_MakeLiteralName_ReturnValue) == 0x000048, "Member 'RadialPickerItem_C_SetItemContent::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");

// Function RadialPickerItem.RadialPickerItem_C.SetShowImageAndLabel
// 0x0001 (0x0001 - 0x0000)
struct RadialPickerItem_C_SetShowImageAndLabel final
{
public:
	bool                                          ShowImageAndLabel;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(RadialPickerItem_C_SetShowImageAndLabel) == 0x000001, "Wrong alignment on RadialPickerItem_C_SetShowImageAndLabel");
static_assert(sizeof(RadialPickerItem_C_SetShowImageAndLabel) == 0x000001, "Wrong size on RadialPickerItem_C_SetShowImageAndLabel");
static_assert(offsetof(RadialPickerItem_C_SetShowImageAndLabel, ShowImageAndLabel) == 0x000000, "Member 'RadialPickerItem_C_SetShowImageAndLabel::ShowImageAndLabel' has a wrong offset!");

// Function RadialPickerItem.RadialPickerItem_C.OnMouseButtonDown
// 0x0218 (0x0218 - 0x0000)
struct RadialPickerItem_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0160(0x00B8)()
};
static_assert(alignof(RadialPickerItem_C_OnMouseButtonDown) == 0x000008, "Wrong alignment on RadialPickerItem_C_OnMouseButtonDown");
static_assert(sizeof(RadialPickerItem_C_OnMouseButtonDown) == 0x000218, "Wrong size on RadialPickerItem_C_OnMouseButtonDown");
static_assert(offsetof(RadialPickerItem_C_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'RadialPickerItem_C_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(RadialPickerItem_C_OnMouseButtonDown, MouseEvent) == 0x000038, "Member 'RadialPickerItem_C_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(RadialPickerItem_C_OnMouseButtonDown, ReturnValue) == 0x0000A8, "Member 'RadialPickerItem_C_OnMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(RadialPickerItem_C_OnMouseButtonDown, CallFunc_Handled_ReturnValue) == 0x000160, "Member 'RadialPickerItem_C_OnMouseButtonDown::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function RadialPickerItem.RadialPickerItem_C.UpdateSelectionColor
// 0x0040 (0x0040 - 0x0000)
struct RadialPickerItem_C_UpdateSelectionColor final
{
public:
	bool                                          Selected_0;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsEnabled_ReturnValue;                 // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0018(0x0028)()
};
static_assert(alignof(RadialPickerItem_C_UpdateSelectionColor) == 0x000008, "Wrong alignment on RadialPickerItem_C_UpdateSelectionColor");
static_assert(sizeof(RadialPickerItem_C_UpdateSelectionColor) == 0x000040, "Wrong size on RadialPickerItem_C_UpdateSelectionColor");
static_assert(offsetof(RadialPickerItem_C_UpdateSelectionColor, Selected_0) == 0x000000, "Member 'RadialPickerItem_C_UpdateSelectionColor::Selected_0' has a wrong offset!");
static_assert(offsetof(RadialPickerItem_C_UpdateSelectionColor, Temp_bool_Variable) == 0x000001, "Member 'RadialPickerItem_C_UpdateSelectionColor::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(RadialPickerItem_C_UpdateSelectionColor, CallFunc_GetIsEnabled_ReturnValue) == 0x000002, "Member 'RadialPickerItem_C_UpdateSelectionColor::CallFunc_GetIsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(RadialPickerItem_C_UpdateSelectionColor, CallFunc_BooleanAND_ReturnValue) == 0x000003, "Member 'RadialPickerItem_C_UpdateSelectionColor::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(RadialPickerItem_C_UpdateSelectionColor, K2Node_Select_Default) == 0x000004, "Member 'RadialPickerItem_C_UpdateSelectionColor::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(RadialPickerItem_C_UpdateSelectionColor, K2Node_MakeStruct_SlateColor) == 0x000018, "Member 'RadialPickerItem_C_UpdateSelectionColor::K2Node_MakeStruct_SlateColor' has a wrong offset!");

}

