#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S12BP_MusicController

#include "Basic.hpp"


namespace SDK::Params
{

// Function S12BP_MusicController.S12BP_MusicController_C.ExecuteUbergraph_S12BP_MusicController
// 0x0004 (0x0004 - 0x0000)
struct S12BP_MusicController_C_ExecuteUbergraph_S12BP_MusicController final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(S12BP_MusicController_C_ExecuteUbergraph_S12BP_MusicController) == 0x000004, "Wrong alignment on S12BP_MusicController_C_ExecuteUbergraph_S12BP_MusicController");
static_assert(sizeof(S12BP_MusicController_C_ExecuteUbergraph_S12BP_MusicController) == 0x000004, "Wrong size on S12BP_MusicController_C_ExecuteUbergraph_S12BP_MusicController");
static_assert(offsetof(S12BP_MusicController_C_ExecuteUbergraph_S12BP_MusicController, EntryPoint) == 0x000000, "Member 'S12BP_MusicController_C_ExecuteUbergraph_S12BP_MusicController::EntryPoint' has a wrong offset!");

// Function S12BP_MusicController.S12BP_MusicController_C.GetTracksForRegistration
// 0x0020 (0x0020 - 0x0000)
struct S12BP_MusicController_C_GetTracksForRegistration final
{
public:
	TArray<class UBP_TimeSynthTrackComponent_C*>  Tracks;                                            // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ContainsInstancedReference)
	TArray<class UBP_TimeSynthTrackComponent_C*>  K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ZeroConstructor, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(S12BP_MusicController_C_GetTracksForRegistration) == 0x000008, "Wrong alignment on S12BP_MusicController_C_GetTracksForRegistration");
static_assert(sizeof(S12BP_MusicController_C_GetTracksForRegistration) == 0x000020, "Wrong size on S12BP_MusicController_C_GetTracksForRegistration");
static_assert(offsetof(S12BP_MusicController_C_GetTracksForRegistration, Tracks) == 0x000000, "Member 'S12BP_MusicController_C_GetTracksForRegistration::Tracks' has a wrong offset!");
static_assert(offsetof(S12BP_MusicController_C_GetTracksForRegistration, K2Node_MakeArray_Array) == 0x000010, "Member 'S12BP_MusicController_C_GetTracksForRegistration::K2Node_MakeArray_Array' has a wrong offset!");

}

