#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ServerBrowserInfoTile_OwnServer

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ServerBrowserInfoTile_OwnServer.ServerBrowserInfoTile_OwnServer_C
// 0x00F8 (0x0CB0 - 0x0BB8)
class UServerBrowserInfoTile_OwnServer_C final : public UFortServerActionTile
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BB8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x0BC0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Selected_1;                                        // 0x0BC8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PrivacyToggle;                                     // 0x0BD0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoverToggle;                                       // 0x0BD8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ViewPlayers;                                       // 0x0BE0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Selected;                                          // 0x0BE8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USimpleCommonButtonWithInput_C*         Button_CloseFriends;                               // 0x0BF0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USimpleCommonButtonWithInput_C*         Button_ShowFriends;                                // 0x0BF8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorder_ServerDetails;                        // 0x0C00(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         CreatedByText;                                     // 0x0C08(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDynamicEntryBox*                       EntryBox_ServerFriendList;                         // 0x0C10(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_28;                                          // 0x0C18(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_112;                                         // 0x0C20(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_113;                                         // 0x0C28(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_114;                                         // 0x0C30(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_115;                                         // 0x0C38(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_116;                                         // 0x0C40(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ColorFill;                                   // 0x0C48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Gradient;                                    // 0x0C50(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ServerImage;                                 // 0x0C58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               JoinServerContent;                                 // 0x0C60(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              Launch_ScaleBox;                                   // 0x0C68(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_OwnerName;                                    // 0x0C70(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_PlayerCount;                                  // 0x0C78(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               WarningOverlay;                                    // 0x0C80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class FString>                         FriendListOutput;                                  // 0x0C88(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	bool                                          PlayersShown;                                      // 0x0C98(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          NewServerIsPrivate;                                // 0x0C99(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9A[0x2];                                      // 0x0C9A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           DisabledColor;                                     // 0x0C9C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ServerBrowserInfoTile_OwnServer(int32 EntryPoint);
	void SetBackgroundImage(int32 ArrayIndex);
	void Construct();
	void OnLaunchButtonEnableChanged(bool bEnableValue);
	void BP_OnUnhovered();
	void BP_OnHovered();
	void InputMethodChanged(ECommonInputType bNewInputType);
	void InitializeSelectedButton();
	void BndEvt__Button_ShowFriends_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BP_OnDeselected();
	void BP_OnSelected();
	void BndEvt__Button_CloseFriends_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void OnLoaded_48F9B2C944196B333B43868DC1DE5716(class UObject* Loaded);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ServerBrowserInfoTile_OwnServer_C">();
	}
	static class UServerBrowserInfoTile_OwnServer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UServerBrowserInfoTile_OwnServer_C>();
	}
};
static_assert(alignof(UServerBrowserInfoTile_OwnServer_C) == 0x000008, "Wrong alignment on UServerBrowserInfoTile_OwnServer_C");
static_assert(sizeof(UServerBrowserInfoTile_OwnServer_C) == 0x000CB0, "Wrong size on UServerBrowserInfoTile_OwnServer_C");
static_assert(offsetof(UServerBrowserInfoTile_OwnServer_C, UberGraphFrame) == 0x000BB8, "Member 'UServerBrowserInfoTile_OwnServer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UServerBrowserInfoTile_OwnServer_C, Hover) == 0x000BC0, "Member 'UServerBrowserInfoTile_OwnServer_C::Hover' has a wrong offset!");
static_assert(offsetof(UServerBrowserInfoTile_OwnServer_C, Selected_1) == 0x000BC8, "Member 'UServerBrowserInfoTile_OwnServer_C::Selected_1' has a wrong offset!");
static_assert(offsetof(UServerBrowserInfoTile_OwnServer_C, PrivacyToggle) == 0x000BD0, "Member 'UServerBrowserInfoTile_OwnServer_C::PrivacyToggle' has a wrong offset!");
static_assert(offsetof(UServerBrowserInfoTile_OwnServer_C, HoverToggle) == 0x000BD8, "Member 'UServerBrowserInfoTile_OwnServer_C::HoverToggle' has a wrong offset!");
static_assert(offsetof(UServerBrowserInfoTile_OwnServer_C, ViewPlayers) == 0x000BE0, "Member 'UServerBrowserInfoTile_OwnServer_C::ViewPlayers' has a wrong offset!");
static_assert(offsetof(UServerBrowserInfoTile_OwnServer_C, Selected) == 0x000BE8, "Member 'UServerBrowserInfoTile_OwnServer_C::Selected' has a wrong offset!");
static_assert(offsetof(UServerBrowserInfoTile_OwnServer_C, Button_CloseFriends) == 0x000BF0, "Member 'UServerBrowserInfoTile_OwnServer_C::Button_CloseFriends' has a wrong offset!");
static_assert(offsetof(UServerBrowserInfoTile_OwnServer_C, Button_ShowFriends) == 0x000BF8, "Member 'UServerBrowserInfoTile_OwnServer_C::Button_ShowFriends' has a wrong offset!");
static_assert(offsetof(UServerBrowserInfoTile_OwnServer_C, CommonBorder_ServerDetails) == 0x000C00, "Member 'UServerBrowserInfoTile_OwnServer_C::CommonBorder_ServerDetails' has a wrong offset!");
static_assert(offsetof(UServerBrowserInfoTile_OwnServer_C, CreatedByText) == 0x000C08, "Member 'UServerBrowserInfoTile_OwnServer_C::CreatedByText' has a wrong offset!");
static_assert(offsetof(UServerBrowserInfoTile_OwnServer_C, EntryBox_ServerFriendList) == 0x000C10, "Member 'UServerBrowserInfoTile_OwnServer_C::EntryBox_ServerFriendList' has a wrong offset!");
static_assert(offsetof(UServerBrowserInfoTile_OwnServer_C, Image_28) == 0x000C18, "Member 'UServerBrowserInfoTile_OwnServer_C::Image_28' has a wrong offset!");
static_assert(offsetof(UServerBrowserInfoTile_OwnServer_C, Image_112) == 0x000C20, "Member 'UServerBrowserInfoTile_OwnServer_C::Image_112' has a wrong offset!");
static_assert(offsetof(UServerBrowserInfoTile_OwnServer_C, Image_113) == 0x000C28, "Member 'UServerBrowserInfoTile_OwnServer_C::Image_113' has a wrong offset!");
static_assert(offsetof(UServerBrowserInfoTile_OwnServer_C, Image_114) == 0x000C30, "Member 'UServerBrowserInfoTile_OwnServer_C::Image_114' has a wrong offset!");
static_assert(offsetof(UServerBrowserInfoTile_OwnServer_C, Image_115) == 0x000C38, "Member 'UServerBrowserInfoTile_OwnServer_C::Image_115' has a wrong offset!");
static_assert(offsetof(UServerBrowserInfoTile_OwnServer_C, Image_116) == 0x000C40, "Member 'UServerBrowserInfoTile_OwnServer_C::Image_116' has a wrong offset!");
static_assert(offsetof(UServerBrowserInfoTile_OwnServer_C, Image_ColorFill) == 0x000C48, "Member 'UServerBrowserInfoTile_OwnServer_C::Image_ColorFill' has a wrong offset!");
static_assert(offsetof(UServerBrowserInfoTile_OwnServer_C, Image_Gradient) == 0x000C50, "Member 'UServerBrowserInfoTile_OwnServer_C::Image_Gradient' has a wrong offset!");
static_assert(offsetof(UServerBrowserInfoTile_OwnServer_C, Image_ServerImage) == 0x000C58, "Member 'UServerBrowserInfoTile_OwnServer_C::Image_ServerImage' has a wrong offset!");
static_assert(offsetof(UServerBrowserInfoTile_OwnServer_C, JoinServerContent) == 0x000C60, "Member 'UServerBrowserInfoTile_OwnServer_C::JoinServerContent' has a wrong offset!");
static_assert(offsetof(UServerBrowserInfoTile_OwnServer_C, Launch_ScaleBox) == 0x000C68, "Member 'UServerBrowserInfoTile_OwnServer_C::Launch_ScaleBox' has a wrong offset!");
static_assert(offsetof(UServerBrowserInfoTile_OwnServer_C, Text_OwnerName) == 0x000C70, "Member 'UServerBrowserInfoTile_OwnServer_C::Text_OwnerName' has a wrong offset!");
static_assert(offsetof(UServerBrowserInfoTile_OwnServer_C, Text_PlayerCount) == 0x000C78, "Member 'UServerBrowserInfoTile_OwnServer_C::Text_PlayerCount' has a wrong offset!");
static_assert(offsetof(UServerBrowserInfoTile_OwnServer_C, WarningOverlay) == 0x000C80, "Member 'UServerBrowserInfoTile_OwnServer_C::WarningOverlay' has a wrong offset!");
static_assert(offsetof(UServerBrowserInfoTile_OwnServer_C, FriendListOutput) == 0x000C88, "Member 'UServerBrowserInfoTile_OwnServer_C::FriendListOutput' has a wrong offset!");
static_assert(offsetof(UServerBrowserInfoTile_OwnServer_C, PlayersShown) == 0x000C98, "Member 'UServerBrowserInfoTile_OwnServer_C::PlayersShown' has a wrong offset!");
static_assert(offsetof(UServerBrowserInfoTile_OwnServer_C, NewServerIsPrivate) == 0x000C99, "Member 'UServerBrowserInfoTile_OwnServer_C::NewServerIsPrivate' has a wrong offset!");
static_assert(offsetof(UServerBrowserInfoTile_OwnServer_C, DisabledColor) == 0x000C9C, "Member 'UServerBrowserInfoTile_OwnServer_C::DisabledColor' has a wrong offset!");

}

