#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ServerBrowserPlaylistActionTile

#include "Basic.hpp"


namespace SDK::Params
{

// Function ServerBrowserPlaylistActionTile.ServerBrowserPlaylistActionTile_C.ExecuteUbergraph_ServerBrowserPlaylistActionTile
// 0x0158 (0x0158 - 0x0000)
struct ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingTouch_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0020(0x0018)()
	bool                                          Temp_bool_Variable_1;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_3;                              // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_4;                              // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_2;                              // 0x0040(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0058(0x0018)()
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button_4;               // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button_3;               // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default;                             // 0x0098(0x0018)()
	bool                                          K2Node_Select_Default_1;                           // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button_2;               // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button_1;               // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_2;       // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_2;       // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_3;       // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSelected_ReturnValue;                  // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_4;       // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_3;       // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bEnableValue;                         // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_122[0x6];                                      // 0x0122(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_2;                           // 0x0128(0x0018)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimarySkewButton_C*                   K2Node_DynamicCast_AsPrimary_Skew_Button;          // 0x0148(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile) == 0x000008, "Wrong alignment on ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile");
static_assert(sizeof(ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile) == 0x000158, "Wrong size on ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile");
static_assert(offsetof(ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile, EntryPoint) == 0x000000, "Member 'ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile::EntryPoint' has a wrong offset!");
static_assert(offsetof(ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile, CallFunc_IsUsingTouch_ReturnValue) == 0x000004, "Member 'ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile::CallFunc_IsUsingTouch_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile, Temp_bool_Variable) == 0x000005, "Member 'ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile, Temp_text_Variable) == 0x000008, "Member 'ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile, Temp_text_Variable_1) == 0x000020, "Member 'ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile, Temp_bool_Variable_1) == 0x000038, "Member 'ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile, Temp_bool_Variable_2) == 0x000039, "Member 'ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile, Temp_bool_Variable_3) == 0x00003A, "Member 'ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile, Temp_bool_Variable_4) == 0x00003B, "Member 'ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile, Temp_text_Variable_2) == 0x000040, "Member 'ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile, Temp_text_Variable_3) == 0x000058, "Member 'ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile, K2Node_ComponentBoundEvent_Button_4) == 0x000070, "Member 'ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile::K2Node_ComponentBoundEvent_Button_4' has a wrong offset!");
static_assert(offsetof(ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile, CallFunc_PlayAnimationForward_ReturnValue) == 0x000078, "Member 'ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000080, "Member 'ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile, CallFunc_PlayAnimationReverse_ReturnValue_1) == 0x000088, "Member 'ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile::CallFunc_PlayAnimationReverse_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile, K2Node_ComponentBoundEvent_Button_3) == 0x000090, "Member 'ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile::K2Node_ComponentBoundEvent_Button_3' has a wrong offset!");
static_assert(offsetof(ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile, K2Node_Select_Default) == 0x000098, "Member 'ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile, K2Node_Select_Default_1) == 0x0000B0, "Member 'ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile, K2Node_ComponentBoundEvent_Button_2) == 0x0000B8, "Member 'ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile, K2Node_ComponentBoundEvent_Button_1) == 0x0000C0, "Member 'ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile, CallFunc_PlayAnimationReverse_ReturnValue_2) == 0x0000C8, "Member 'ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile::CallFunc_PlayAnimationReverse_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x0000D0, "Member 'ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile, K2Node_ComponentBoundEvent_Button) == 0x0000D8, "Member 'ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile, CallFunc_PlayAnimation_ReturnValue) == 0x0000E0, "Member 'ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile, CallFunc_PlayAnimationForward_ReturnValue_2) == 0x0000E8, "Member 'ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile::CallFunc_PlayAnimationForward_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile, CallFunc_GetEndTime_ReturnValue) == 0x0000F0, "Member 'ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile, CallFunc_PlayAnimationReverse_ReturnValue_3) == 0x0000F8, "Member 'ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile::CallFunc_PlayAnimationReverse_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile, CallFunc_PlayAnimation_ReturnValue_1) == 0x000100, "Member 'ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile, CallFunc_GetSelected_ReturnValue) == 0x000108, "Member 'ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile::CallFunc_GetSelected_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile, CallFunc_PlayAnimationReverse_ReturnValue_4) == 0x000110, "Member 'ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile::CallFunc_PlayAnimationReverse_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile, CallFunc_PlayAnimationForward_ReturnValue_3) == 0x000118, "Member 'ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile::CallFunc_PlayAnimationForward_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000120, "Member 'ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile, K2Node_Event_bEnableValue) == 0x000121, "Member 'ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile::K2Node_Event_bEnableValue' has a wrong offset!");
static_assert(offsetof(ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile, K2Node_Select_Default_2) == 0x000128, "Member 'ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile, K2Node_Event_IsDesignTime) == 0x000140, "Member 'ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile, K2Node_DynamicCast_AsPrimary_Skew_Button) == 0x000148, "Member 'ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile::K2Node_DynamicCast_AsPrimary_Skew_Button' has a wrong offset!");
static_assert(offsetof(ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile, K2Node_DynamicCast_bSuccess) == 0x000150, "Member 'ServerBrowserPlaylistActionTile_C_ExecuteUbergraph_ServerBrowserPlaylistActionTile::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function ServerBrowserPlaylistActionTile.ServerBrowserPlaylistActionTile_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct ServerBrowserPlaylistActionTile_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ServerBrowserPlaylistActionTile_C_PreConstruct) == 0x000001, "Wrong alignment on ServerBrowserPlaylistActionTile_C_PreConstruct");
static_assert(sizeof(ServerBrowserPlaylistActionTile_C_PreConstruct) == 0x000001, "Wrong size on ServerBrowserPlaylistActionTile_C_PreConstruct");
static_assert(offsetof(ServerBrowserPlaylistActionTile_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'ServerBrowserPlaylistActionTile_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function ServerBrowserPlaylistActionTile.ServerBrowserPlaylistActionTile_C.OnLaunchButtonEnableChanged
// 0x0001 (0x0001 - 0x0000)
struct ServerBrowserPlaylistActionTile_C_OnLaunchButtonEnableChanged final
{
public:
	bool                                          bEnableValue;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ServerBrowserPlaylistActionTile_C_OnLaunchButtonEnableChanged) == 0x000001, "Wrong alignment on ServerBrowserPlaylistActionTile_C_OnLaunchButtonEnableChanged");
static_assert(sizeof(ServerBrowserPlaylistActionTile_C_OnLaunchButtonEnableChanged) == 0x000001, "Wrong size on ServerBrowserPlaylistActionTile_C_OnLaunchButtonEnableChanged");
static_assert(offsetof(ServerBrowserPlaylistActionTile_C_OnLaunchButtonEnableChanged, bEnableValue) == 0x000000, "Member 'ServerBrowserPlaylistActionTile_C_OnLaunchButtonEnableChanged::bEnableValue' has a wrong offset!");

// Function ServerBrowserPlaylistActionTile.ServerBrowserPlaylistActionTile_C.BndEvt__Button_ShowFriends_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ServerBrowserPlaylistActionTile_C_BndEvt__Button_ShowFriends_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ServerBrowserPlaylistActionTile_C_BndEvt__Button_ShowFriends_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on ServerBrowserPlaylistActionTile_C_BndEvt__Button_ShowFriends_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(ServerBrowserPlaylistActionTile_C_BndEvt__Button_ShowFriends_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on ServerBrowserPlaylistActionTile_C_BndEvt__Button_ShowFriends_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(ServerBrowserPlaylistActionTile_C_BndEvt__Button_ShowFriends_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'ServerBrowserPlaylistActionTile_C_BndEvt__Button_ShowFriends_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function ServerBrowserPlaylistActionTile.ServerBrowserPlaylistActionTile_C.BndEvt__CreateServerPrivacy_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ServerBrowserPlaylistActionTile_C_BndEvt__CreateServerPrivacy_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ServerBrowserPlaylistActionTile_C_BndEvt__CreateServerPrivacy_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on ServerBrowserPlaylistActionTile_C_BndEvt__CreateServerPrivacy_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(ServerBrowserPlaylistActionTile_C_BndEvt__CreateServerPrivacy_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on ServerBrowserPlaylistActionTile_C_BndEvt__CreateServerPrivacy_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(ServerBrowserPlaylistActionTile_C_BndEvt__CreateServerPrivacy_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'ServerBrowserPlaylistActionTile_C_BndEvt__CreateServerPrivacy_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function ServerBrowserPlaylistActionTile.ServerBrowserPlaylistActionTile_C.BndEvt__CreateServerPrivacy_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ServerBrowserPlaylistActionTile_C_BndEvt__CreateServerPrivacy_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ServerBrowserPlaylistActionTile_C_BndEvt__CreateServerPrivacy_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on ServerBrowserPlaylistActionTile_C_BndEvt__CreateServerPrivacy_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(ServerBrowserPlaylistActionTile_C_BndEvt__CreateServerPrivacy_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on ServerBrowserPlaylistActionTile_C_BndEvt__CreateServerPrivacy_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(ServerBrowserPlaylistActionTile_C_BndEvt__CreateServerPrivacy_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'ServerBrowserPlaylistActionTile_C_BndEvt__CreateServerPrivacy_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function ServerBrowserPlaylistActionTile.ServerBrowserPlaylistActionTile_C.BndEvt__IconTextButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ServerBrowserPlaylistActionTile_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ServerBrowserPlaylistActionTile_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on ServerBrowserPlaylistActionTile_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(ServerBrowserPlaylistActionTile_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on ServerBrowserPlaylistActionTile_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(ServerBrowserPlaylistActionTile_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'ServerBrowserPlaylistActionTile_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function ServerBrowserPlaylistActionTile.ServerBrowserPlaylistActionTile_C.BndEvt__Button_CloseFriends_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ServerBrowserPlaylistActionTile_C_BndEvt__Button_CloseFriends_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ServerBrowserPlaylistActionTile_C_BndEvt__Button_CloseFriends_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on ServerBrowserPlaylistActionTile_C_BndEvt__Button_CloseFriends_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(ServerBrowserPlaylistActionTile_C_BndEvt__Button_CloseFriends_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on ServerBrowserPlaylistActionTile_C_BndEvt__Button_CloseFriends_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(ServerBrowserPlaylistActionTile_C_BndEvt__Button_CloseFriends_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'ServerBrowserPlaylistActionTile_C_BndEvt__Button_CloseFriends_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

}

