#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpatialFaction_GhostButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SpatialFaction_GhostButton.SpatialFaction_GhostButton_C
// 0x0040 (0x0BB0 - 0x0B70)
class USpatialFaction_GhostButton_C final : public UCommonButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Select;                                            // 0x0B78(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x0B80(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_73;                                          // 0x0B88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_FactionChoice;                               // 0x0B90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_FactionChoiceName;                            // 0x0B98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_FactionChoiceTechs;                           // 0x0BA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Is_selected;                                       // 0x0BA8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_SpatialFaction_GhostButton(int32 EntryPoint);
	void On_Unselected();
	void On_Selected();
	void BP_OnUnhovered();
	void BP_OnHovered();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SpatialFaction_GhostButton_C">();
	}
	static class USpatialFaction_GhostButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpatialFaction_GhostButton_C>();
	}
};
static_assert(alignof(USpatialFaction_GhostButton_C) == 0x000008, "Wrong alignment on USpatialFaction_GhostButton_C");
static_assert(sizeof(USpatialFaction_GhostButton_C) == 0x000BB0, "Wrong size on USpatialFaction_GhostButton_C");
static_assert(offsetof(USpatialFaction_GhostButton_C, UberGraphFrame) == 0x000B70, "Member 'USpatialFaction_GhostButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USpatialFaction_GhostButton_C, Select) == 0x000B78, "Member 'USpatialFaction_GhostButton_C::Select' has a wrong offset!");
static_assert(offsetof(USpatialFaction_GhostButton_C, Hover) == 0x000B80, "Member 'USpatialFaction_GhostButton_C::Hover' has a wrong offset!");
static_assert(offsetof(USpatialFaction_GhostButton_C, Image_73) == 0x000B88, "Member 'USpatialFaction_GhostButton_C::Image_73' has a wrong offset!");
static_assert(offsetof(USpatialFaction_GhostButton_C, Image_FactionChoice) == 0x000B90, "Member 'USpatialFaction_GhostButton_C::Image_FactionChoice' has a wrong offset!");
static_assert(offsetof(USpatialFaction_GhostButton_C, Text_FactionChoiceName) == 0x000B98, "Member 'USpatialFaction_GhostButton_C::Text_FactionChoiceName' has a wrong offset!");
static_assert(offsetof(USpatialFaction_GhostButton_C, Text_FactionChoiceTechs) == 0x000BA0, "Member 'USpatialFaction_GhostButton_C::Text_FactionChoiceTechs' has a wrong offset!");
static_assert(offsetof(USpatialFaction_GhostButton_C, Is_selected) == 0x000BA8, "Member 'USpatialFaction_GhostButton_C::Is_selected' has a wrong offset!");

}

