#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpatialFactionOption

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SpatialFactionOption.SpatialFactionOption_C
// 0x0050 (0x0BC0 - 0x0B70)
class USpatialFactionOption_C final : public UCommonButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover_Right;                                       // 0x0B78(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover_Left;                                        // 0x0B80(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         Hbox_button;                                       // 0x0B88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Background;                                  // 0x0B90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_backgroundreflection;                        // 0x0B98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_FactionIcon;                                 // 0x0BA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_FactionName;                                  // 0x0BA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_FactionName_1;                                // 0x0BB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         FactionId;                                         // 0x0BB8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_right_button;                                   // 0x0BBC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void PreConstruct(bool IsDesignTime);
	void BP_OnUnhovered();
	void BP_OnHovered();
	void ExecuteUbergraph_SpatialFactionOption(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SpatialFactionOption_C">();
	}
	static class USpatialFactionOption_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpatialFactionOption_C>();
	}
};
static_assert(alignof(USpatialFactionOption_C) == 0x000008, "Wrong alignment on USpatialFactionOption_C");
static_assert(sizeof(USpatialFactionOption_C) == 0x000BC0, "Wrong size on USpatialFactionOption_C");
static_assert(offsetof(USpatialFactionOption_C, UberGraphFrame) == 0x000B70, "Member 'USpatialFactionOption_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USpatialFactionOption_C, Hover_Right) == 0x000B78, "Member 'USpatialFactionOption_C::Hover_Right' has a wrong offset!");
static_assert(offsetof(USpatialFactionOption_C, Hover_Left) == 0x000B80, "Member 'USpatialFactionOption_C::Hover_Left' has a wrong offset!");
static_assert(offsetof(USpatialFactionOption_C, Hbox_button) == 0x000B88, "Member 'USpatialFactionOption_C::Hbox_button' has a wrong offset!");
static_assert(offsetof(USpatialFactionOption_C, Image_Background) == 0x000B90, "Member 'USpatialFactionOption_C::Image_Background' has a wrong offset!");
static_assert(offsetof(USpatialFactionOption_C, Image_backgroundreflection) == 0x000B98, "Member 'USpatialFactionOption_C::Image_backgroundreflection' has a wrong offset!");
static_assert(offsetof(USpatialFactionOption_C, Image_FactionIcon) == 0x000BA0, "Member 'USpatialFactionOption_C::Image_FactionIcon' has a wrong offset!");
static_assert(offsetof(USpatialFactionOption_C, Text_FactionName) == 0x000BA8, "Member 'USpatialFactionOption_C::Text_FactionName' has a wrong offset!");
static_assert(offsetof(USpatialFactionOption_C, Text_FactionName_1) == 0x000BB0, "Member 'USpatialFactionOption_C::Text_FactionName_1' has a wrong offset!");
static_assert(offsetof(USpatialFactionOption_C, FactionId) == 0x000BB8, "Member 'USpatialFactionOption_C::FactionId' has a wrong offset!");
static_assert(offsetof(USpatialFactionOption_C, Is_right_button) == 0x000BBC, "Member 'USpatialFactionOption_C::Is_right_button' has a wrong offset!");

}

