#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpatialHenchmanFactionComplete

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function SpatialHenchmanFactionComplete.SpatialHenchmanFactionComplete_C.InitCompletedInfo
// 0x0010 (0x0010 - 0x0000)
struct SpatialHenchmanFactionComplete_C_InitCompletedInfo final
{
public:
	bool                                          bIsAlter;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemDefinition*                    RewardItem;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpatialHenchmanFactionComplete_C_InitCompletedInfo) == 0x000008, "Wrong alignment on SpatialHenchmanFactionComplete_C_InitCompletedInfo");
static_assert(sizeof(SpatialHenchmanFactionComplete_C_InitCompletedInfo) == 0x000010, "Wrong size on SpatialHenchmanFactionComplete_C_InitCompletedInfo");
static_assert(offsetof(SpatialHenchmanFactionComplete_C_InitCompletedInfo, bIsAlter) == 0x000000, "Member 'SpatialHenchmanFactionComplete_C_InitCompletedInfo::bIsAlter' has a wrong offset!");
static_assert(offsetof(SpatialHenchmanFactionComplete_C_InitCompletedInfo, RewardItem) == 0x000008, "Member 'SpatialHenchmanFactionComplete_C_InitCompletedInfo::RewardItem' has a wrong offset!");

// Function SpatialHenchmanFactionComplete.SpatialHenchmanFactionComplete_C.ExecuteUbergraph_SpatialHenchmanFactionComplete
// 0x00D0 (0x00D0 - 0x0000)
struct SpatialHenchmanFactionComplete_C_ExecuteUbergraph_SpatialHenchmanFactionComplete final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bIsAlter;                       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortItemDefinition*                    K2Node_CustomEvent_RewardItem;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0010(0x0040)(HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default;                             // 0x0050(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0068(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00A8(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00B8(0x0018)()
};
static_assert(alignof(SpatialHenchmanFactionComplete_C_ExecuteUbergraph_SpatialHenchmanFactionComplete) == 0x000008, "Wrong alignment on SpatialHenchmanFactionComplete_C_ExecuteUbergraph_SpatialHenchmanFactionComplete");
static_assert(sizeof(SpatialHenchmanFactionComplete_C_ExecuteUbergraph_SpatialHenchmanFactionComplete) == 0x0000D0, "Wrong size on SpatialHenchmanFactionComplete_C_ExecuteUbergraph_SpatialHenchmanFactionComplete");
static_assert(offsetof(SpatialHenchmanFactionComplete_C_ExecuteUbergraph_SpatialHenchmanFactionComplete, EntryPoint) == 0x000000, "Member 'SpatialHenchmanFactionComplete_C_ExecuteUbergraph_SpatialHenchmanFactionComplete::EntryPoint' has a wrong offset!");
static_assert(offsetof(SpatialHenchmanFactionComplete_C_ExecuteUbergraph_SpatialHenchmanFactionComplete, Temp_bool_Variable) == 0x000004, "Member 'SpatialHenchmanFactionComplete_C_ExecuteUbergraph_SpatialHenchmanFactionComplete::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SpatialHenchmanFactionComplete_C_ExecuteUbergraph_SpatialHenchmanFactionComplete, K2Node_CustomEvent_bIsAlter) == 0x000005, "Member 'SpatialHenchmanFactionComplete_C_ExecuteUbergraph_SpatialHenchmanFactionComplete::K2Node_CustomEvent_bIsAlter' has a wrong offset!");
static_assert(offsetof(SpatialHenchmanFactionComplete_C_ExecuteUbergraph_SpatialHenchmanFactionComplete, K2Node_CustomEvent_RewardItem) == 0x000008, "Member 'SpatialHenchmanFactionComplete_C_ExecuteUbergraph_SpatialHenchmanFactionComplete::K2Node_CustomEvent_RewardItem' has a wrong offset!");
static_assert(offsetof(SpatialHenchmanFactionComplete_C_ExecuteUbergraph_SpatialHenchmanFactionComplete, K2Node_MakeStruct_FormatArgumentData) == 0x000010, "Member 'SpatialHenchmanFactionComplete_C_ExecuteUbergraph_SpatialHenchmanFactionComplete::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(SpatialHenchmanFactionComplete_C_ExecuteUbergraph_SpatialHenchmanFactionComplete, K2Node_Select_Default) == 0x000050, "Member 'SpatialHenchmanFactionComplete_C_ExecuteUbergraph_SpatialHenchmanFactionComplete::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SpatialHenchmanFactionComplete_C_ExecuteUbergraph_SpatialHenchmanFactionComplete, K2Node_MakeStruct_FormatArgumentData_1) == 0x000068, "Member 'SpatialHenchmanFactionComplete_C_ExecuteUbergraph_SpatialHenchmanFactionComplete::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(SpatialHenchmanFactionComplete_C_ExecuteUbergraph_SpatialHenchmanFactionComplete, K2Node_MakeArray_Array) == 0x0000A8, "Member 'SpatialHenchmanFactionComplete_C_ExecuteUbergraph_SpatialHenchmanFactionComplete::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(SpatialHenchmanFactionComplete_C_ExecuteUbergraph_SpatialHenchmanFactionComplete, CallFunc_Format_ReturnValue) == 0x0000B8, "Member 'SpatialHenchmanFactionComplete_C_ExecuteUbergraph_SpatialHenchmanFactionComplete::CallFunc_Format_ReturnValue' has a wrong offset!");

}

