#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpatialFactionOption

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function SpatialFactionOption.SpatialFactionOption_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct SpatialFactionOption_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SpatialFactionOption_C_PreConstruct) == 0x000001, "Wrong alignment on SpatialFactionOption_C_PreConstruct");
static_assert(sizeof(SpatialFactionOption_C_PreConstruct) == 0x000001, "Wrong size on SpatialFactionOption_C_PreConstruct");
static_assert(offsetof(SpatialFactionOption_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'SpatialFactionOption_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function SpatialFactionOption.SpatialFactionOption_C.ExecuteUbergraph_SpatialFactionOption
// 0x01E8 (0x01E8 - 0x0000)
struct SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0020(0x0018)()
	bool                                          Temp_bool_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable;                              // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_1;                            // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable_2;                            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_3;                            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable_4;                            // 0x007C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_5;                            // 0x0084(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable_6;                            // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_7;                            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_5;                              // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_6;                              // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A3[0x1];                                       // 0x00A3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_8;                            // 0x00A4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_9;                            // 0x00B4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_7;                              // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_10;                           // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_11;                           // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_8;                              // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_12;                           // 0x00EC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_13;                           // 0x00FC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_9;                              // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_14;                           // 0x0110(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0120(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_15;                           // 0x0130(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_1;                           // 0x0148(0x0018)()
	class UMaterialInterface*                     K2Node_Select_Default_2;                           // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Select_Default_3;                           // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Select_Default_4;                           // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Select_Default_5;                           // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Select_Default_6;                           // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       K2Node_Select_Default_7;                           // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       K2Node_Select_Default_8;                           // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_9;                           // 0x01B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_10;                          // 0x01C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_11;                          // 0x01D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption) == 0x000008, "Wrong alignment on SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption");
static_assert(sizeof(SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption) == 0x0001E8, "Wrong size on SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption");
static_assert(offsetof(SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption, EntryPoint) == 0x000000, "Member 'SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption::EntryPoint' has a wrong offset!");
static_assert(offsetof(SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption, Temp_int_Variable) == 0x000004, "Member 'SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption, Temp_text_Variable) == 0x000008, "Member 'SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption, Temp_text_Variable_1) == 0x000020, "Member 'SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption, Temp_bool_Variable) == 0x000038, "Member 'SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption, Temp_struct_Variable) == 0x00003C, "Member 'SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption, Temp_struct_Variable_1) == 0x000044, "Member 'SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption, Temp_bool_Variable_1) == 0x00004C, "Member 'SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption, Temp_struct_Variable_2) == 0x000050, "Member 'SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption, Temp_struct_Variable_3) == 0x000058, "Member 'SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption, Temp_int_Variable_1) == 0x000060, "Member 'SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption, Temp_object_Variable) == 0x000068, "Member 'SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption, Temp_object_Variable_1) == 0x000070, "Member 'SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption, Temp_bool_Variable_2) == 0x000078, "Member 'SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption, Temp_struct_Variable_4) == 0x00007C, "Member 'SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption, Temp_struct_Variable_5) == 0x000084, "Member 'SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption, Temp_bool_Variable_3) == 0x00008C, "Member 'SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption, Temp_struct_Variable_6) == 0x000090, "Member 'SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption::Temp_struct_Variable_6' has a wrong offset!");
static_assert(offsetof(SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption, Temp_struct_Variable_7) == 0x000098, "Member 'SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption::Temp_struct_Variable_7' has a wrong offset!");
static_assert(offsetof(SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption, Temp_bool_Variable_4) == 0x0000A0, "Member 'SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption, Temp_bool_Variable_5) == 0x0000A1, "Member 'SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption, Temp_bool_Variable_6) == 0x0000A2, "Member 'SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption, Temp_struct_Variable_8) == 0x0000A4, "Member 'SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption::Temp_struct_Variable_8' has a wrong offset!");
static_assert(offsetof(SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption, Temp_struct_Variable_9) == 0x0000B4, "Member 'SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption::Temp_struct_Variable_9' has a wrong offset!");
static_assert(offsetof(SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption, Temp_bool_Variable_7) == 0x0000C4, "Member 'SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption::Temp_bool_Variable_7' has a wrong offset!");
static_assert(offsetof(SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption, Temp_struct_Variable_10) == 0x0000C8, "Member 'SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption::Temp_struct_Variable_10' has a wrong offset!");
static_assert(offsetof(SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption, Temp_struct_Variable_11) == 0x0000D8, "Member 'SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption::Temp_struct_Variable_11' has a wrong offset!");
static_assert(offsetof(SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption, Temp_bool_Variable_8) == 0x0000E8, "Member 'SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption::Temp_bool_Variable_8' has a wrong offset!");
static_assert(offsetof(SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption, Temp_struct_Variable_12) == 0x0000EC, "Member 'SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption::Temp_struct_Variable_12' has a wrong offset!");
static_assert(offsetof(SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption, Temp_struct_Variable_13) == 0x0000FC, "Member 'SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption::Temp_struct_Variable_13' has a wrong offset!");
static_assert(offsetof(SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption, Temp_bool_Variable_9) == 0x00010C, "Member 'SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption::Temp_bool_Variable_9' has a wrong offset!");
static_assert(offsetof(SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption, Temp_struct_Variable_14) == 0x000110, "Member 'SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption::Temp_struct_Variable_14' has a wrong offset!");
static_assert(offsetof(SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption, K2Node_Select_Default) == 0x000120, "Member 'SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption, Temp_struct_Variable_15) == 0x000130, "Member 'SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption::Temp_struct_Variable_15' has a wrong offset!");
static_assert(offsetof(SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption, K2Node_Event_IsDesignTime) == 0x000140, "Member 'SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption, K2Node_Select_Default_1) == 0x000148, "Member 'SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption, K2Node_Select_Default_2) == 0x000160, "Member 'SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption, K2Node_Select_Default_3) == 0x000168, "Member 'SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption, K2Node_Select_Default_4) == 0x000170, "Member 'SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption, K2Node_Select_Default_5) == 0x000178, "Member 'SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption, K2Node_Select_Default_6) == 0x000180, "Member 'SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption::K2Node_Select_Default_6' has a wrong offset!");
static_assert(offsetof(SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption, K2Node_Select_Default_7) == 0x000188, "Member 'SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption::K2Node_Select_Default_7' has a wrong offset!");
static_assert(offsetof(SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption, K2Node_Select_Default_8) == 0x000190, "Member 'SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption::K2Node_Select_Default_8' has a wrong offset!");
static_assert(offsetof(SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption, CallFunc_PlayAnimationForward_ReturnValue) == 0x000198, "Member 'SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption, CallFunc_PlayAnimationReverse_ReturnValue) == 0x0001A0, "Member 'SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0001A8, "Member 'SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption, K2Node_Select_Default_9) == 0x0001B0, "Member 'SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption::K2Node_Select_Default_9' has a wrong offset!");
static_assert(offsetof(SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption, K2Node_Select_Default_10) == 0x0001C0, "Member 'SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption::K2Node_Select_Default_10' has a wrong offset!");
static_assert(offsetof(SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x0001D0, "Member 'SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption, K2Node_Select_Default_11) == 0x0001D8, "Member 'SpatialFactionOption_C_ExecuteUbergraph_SpatialFactionOption::K2Node_Select_Default_11' has a wrong offset!");

}

