#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpatialFaction_SwapButton

#include "Basic.hpp"


namespace SDK::Params
{

// Function SpatialFaction_SwapButton.SpatialFaction_SwapButton_C.ExecuteUbergraph_SpatialFaction_SwapButton
// 0x0028 (0x0028 - 0x0000)
struct SpatialFaction_SwapButton_C_ExecuteUbergraph_SpatialFaction_SwapButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpatialFaction_SwapButton_C_ExecuteUbergraph_SpatialFaction_SwapButton) == 0x000008, "Wrong alignment on SpatialFaction_SwapButton_C_ExecuteUbergraph_SpatialFaction_SwapButton");
static_assert(sizeof(SpatialFaction_SwapButton_C_ExecuteUbergraph_SpatialFaction_SwapButton) == 0x000028, "Wrong size on SpatialFaction_SwapButton_C_ExecuteUbergraph_SpatialFaction_SwapButton");
static_assert(offsetof(SpatialFaction_SwapButton_C_ExecuteUbergraph_SpatialFaction_SwapButton, EntryPoint) == 0x000000, "Member 'SpatialFaction_SwapButton_C_ExecuteUbergraph_SpatialFaction_SwapButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(SpatialFaction_SwapButton_C_ExecuteUbergraph_SpatialFaction_SwapButton, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000008, "Member 'SpatialFaction_SwapButton_C_ExecuteUbergraph_SpatialFaction_SwapButton::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpatialFaction_SwapButton_C_ExecuteUbergraph_SpatialFaction_SwapButton, CallFunc_PlayAnimationForward_ReturnValue) == 0x000010, "Member 'SpatialFaction_SwapButton_C_ExecuteUbergraph_SpatialFaction_SwapButton::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpatialFaction_SwapButton_C_ExecuteUbergraph_SpatialFaction_SwapButton, CallFunc_PlayAnimationReverse_ReturnValue_1) == 0x000018, "Member 'SpatialFaction_SwapButton_C_ExecuteUbergraph_SpatialFaction_SwapButton::CallFunc_PlayAnimationReverse_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SpatialFaction_SwapButton_C_ExecuteUbergraph_SpatialFaction_SwapButton, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000020, "Member 'SpatialFaction_SwapButton_C_ExecuteUbergraph_SpatialFaction_SwapButton::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");

}

