#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpatialFaction_GhostButton

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function SpatialFaction_GhostButton.SpatialFaction_GhostButton_C.ExecuteUbergraph_SpatialFaction_GhostButton
// 0x00A0 (0x00A0 - 0x0000)
struct SpatialFaction_GhostButton_C_ExecuteUbergraph_SpatialFaction_GhostButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingTouch_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0028(0x0028)()
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicFontMaterial_ReturnValue;       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicFontMaterial_ReturnValue_1;     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0060(0x0028)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsUsingTouch_ReturnValue_1;               // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SpatialFaction_GhostButton_C_ExecuteUbergraph_SpatialFaction_GhostButton) == 0x000008, "Wrong alignment on SpatialFaction_GhostButton_C_ExecuteUbergraph_SpatialFaction_GhostButton");
static_assert(sizeof(SpatialFaction_GhostButton_C_ExecuteUbergraph_SpatialFaction_GhostButton) == 0x0000A0, "Wrong size on SpatialFaction_GhostButton_C_ExecuteUbergraph_SpatialFaction_GhostButton");
static_assert(offsetof(SpatialFaction_GhostButton_C_ExecuteUbergraph_SpatialFaction_GhostButton, EntryPoint) == 0x000000, "Member 'SpatialFaction_GhostButton_C_ExecuteUbergraph_SpatialFaction_GhostButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(SpatialFaction_GhostButton_C_ExecuteUbergraph_SpatialFaction_GhostButton, CallFunc_IsUsingTouch_ReturnValue) == 0x000004, "Member 'SpatialFaction_GhostButton_C_ExecuteUbergraph_SpatialFaction_GhostButton::CallFunc_IsUsingTouch_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpatialFaction_GhostButton_C_ExecuteUbergraph_SpatialFaction_GhostButton, K2Node_Event_IsDesignTime) == 0x000005, "Member 'SpatialFaction_GhostButton_C_ExecuteUbergraph_SpatialFaction_GhostButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(SpatialFaction_GhostButton_C_ExecuteUbergraph_SpatialFaction_GhostButton, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'SpatialFaction_GhostButton_C_ExecuteUbergraph_SpatialFaction_GhostButton::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpatialFaction_GhostButton_C_ExecuteUbergraph_SpatialFaction_GhostButton, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000010, "Member 'SpatialFaction_GhostButton_C_ExecuteUbergraph_SpatialFaction_GhostButton::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpatialFaction_GhostButton_C_ExecuteUbergraph_SpatialFaction_GhostButton, CallFunc_PlayAnimationForward_ReturnValue) == 0x000018, "Member 'SpatialFaction_GhostButton_C_ExecuteUbergraph_SpatialFaction_GhostButton::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpatialFaction_GhostButton_C_ExecuteUbergraph_SpatialFaction_GhostButton, CallFunc_BooleanOR_ReturnValue) == 0x000020, "Member 'SpatialFaction_GhostButton_C_ExecuteUbergraph_SpatialFaction_GhostButton::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpatialFaction_GhostButton_C_ExecuteUbergraph_SpatialFaction_GhostButton, K2Node_MakeStruct_SlateColor) == 0x000028, "Member 'SpatialFaction_GhostButton_C_ExecuteUbergraph_SpatialFaction_GhostButton::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(SpatialFaction_GhostButton_C_ExecuteUbergraph_SpatialFaction_GhostButton, CallFunc_GetDynamicFontMaterial_ReturnValue) == 0x000050, "Member 'SpatialFaction_GhostButton_C_ExecuteUbergraph_SpatialFaction_GhostButton::CallFunc_GetDynamicFontMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpatialFaction_GhostButton_C_ExecuteUbergraph_SpatialFaction_GhostButton, CallFunc_GetDynamicFontMaterial_ReturnValue_1) == 0x000058, "Member 'SpatialFaction_GhostButton_C_ExecuteUbergraph_SpatialFaction_GhostButton::CallFunc_GetDynamicFontMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SpatialFaction_GhostButton_C_ExecuteUbergraph_SpatialFaction_GhostButton, K2Node_MakeStruct_SlateColor_1) == 0x000060, "Member 'SpatialFaction_GhostButton_C_ExecuteUbergraph_SpatialFaction_GhostButton::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(SpatialFaction_GhostButton_C_ExecuteUbergraph_SpatialFaction_GhostButton, CallFunc_PlayAnimationReverse_ReturnValue_1) == 0x000088, "Member 'SpatialFaction_GhostButton_C_ExecuteUbergraph_SpatialFaction_GhostButton::CallFunc_PlayAnimationReverse_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SpatialFaction_GhostButton_C_ExecuteUbergraph_SpatialFaction_GhostButton, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000090, "Member 'SpatialFaction_GhostButton_C_ExecuteUbergraph_SpatialFaction_GhostButton::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SpatialFaction_GhostButton_C_ExecuteUbergraph_SpatialFaction_GhostButton, CallFunc_IsUsingTouch_ReturnValue_1) == 0x000098, "Member 'SpatialFaction_GhostButton_C_ExecuteUbergraph_SpatialFaction_GhostButton::CallFunc_IsUsingTouch_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SpatialFaction_GhostButton_C_ExecuteUbergraph_SpatialFaction_GhostButton, CallFunc_BooleanOR_ReturnValue_1) == 0x000099, "Member 'SpatialFaction_GhostButton_C_ExecuteUbergraph_SpatialFaction_GhostButton::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");

// Function SpatialFaction_GhostButton.SpatialFaction_GhostButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct SpatialFaction_GhostButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SpatialFaction_GhostButton_C_PreConstruct) == 0x000001, "Wrong alignment on SpatialFaction_GhostButton_C_PreConstruct");
static_assert(sizeof(SpatialFaction_GhostButton_C_PreConstruct) == 0x000001, "Wrong size on SpatialFaction_GhostButton_C_PreConstruct");
static_assert(offsetof(SpatialFaction_GhostButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'SpatialFaction_GhostButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

