#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpatialFaction_FakeProgressBar

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SpatialFaction_FakeProgressBar.SpatialFaction_FakeProgressBar_C
// 0x0058 (0x0288 - 0x0230)
class USpatialFaction_FakeProgressBar_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Progress_Level_Main;                               // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Progress_Level_Reverse;                            // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_width;                                     // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_Middle;                                     // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_Top;                                        // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         Wanted_Percent;                                    // 0x0260(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Current_Percent;                                   // 0x0264(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timer;                                             // 0x0268(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26C[0x4];                                      // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           TimerHandle;                                       // 0x0270(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         Width;                                             // 0x0278(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         Height;                                            // 0x027C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         Spacing;                                           // 0x0280(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          UseLightSweep;                                     // 0x0284(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          UseBars;                                           // 0x0285(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_SpatialFaction_FakeProgressBar(int32 EntryPoint);
	void Play_bar_anim();
	void Stop_bar_anim();
	void PreConstruct(bool IsDesignTime);
	void Set_random_percentage();
	void Increment();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SpatialFaction_FakeProgressBar_C">();
	}
	static class USpatialFaction_FakeProgressBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpatialFaction_FakeProgressBar_C>();
	}
};
static_assert(alignof(USpatialFaction_FakeProgressBar_C) == 0x000008, "Wrong alignment on USpatialFaction_FakeProgressBar_C");
static_assert(sizeof(USpatialFaction_FakeProgressBar_C) == 0x000288, "Wrong size on USpatialFaction_FakeProgressBar_C");
static_assert(offsetof(USpatialFaction_FakeProgressBar_C, UberGraphFrame) == 0x000230, "Member 'USpatialFaction_FakeProgressBar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USpatialFaction_FakeProgressBar_C, Progress_Level_Main) == 0x000238, "Member 'USpatialFaction_FakeProgressBar_C::Progress_Level_Main' has a wrong offset!");
static_assert(offsetof(USpatialFaction_FakeProgressBar_C, Progress_Level_Reverse) == 0x000240, "Member 'USpatialFaction_FakeProgressBar_C::Progress_Level_Reverse' has a wrong offset!");
static_assert(offsetof(USpatialFaction_FakeProgressBar_C, SizeBox_width) == 0x000248, "Member 'USpatialFaction_FakeProgressBar_C::SizeBox_width' has a wrong offset!");
static_assert(offsetof(USpatialFaction_FakeProgressBar_C, Spacer_Middle) == 0x000250, "Member 'USpatialFaction_FakeProgressBar_C::Spacer_Middle' has a wrong offset!");
static_assert(offsetof(USpatialFaction_FakeProgressBar_C, Spacer_Top) == 0x000258, "Member 'USpatialFaction_FakeProgressBar_C::Spacer_Top' has a wrong offset!");
static_assert(offsetof(USpatialFaction_FakeProgressBar_C, Wanted_Percent) == 0x000260, "Member 'USpatialFaction_FakeProgressBar_C::Wanted_Percent' has a wrong offset!");
static_assert(offsetof(USpatialFaction_FakeProgressBar_C, Current_Percent) == 0x000264, "Member 'USpatialFaction_FakeProgressBar_C::Current_Percent' has a wrong offset!");
static_assert(offsetof(USpatialFaction_FakeProgressBar_C, Timer) == 0x000268, "Member 'USpatialFaction_FakeProgressBar_C::Timer' has a wrong offset!");
static_assert(offsetof(USpatialFaction_FakeProgressBar_C, TimerHandle) == 0x000270, "Member 'USpatialFaction_FakeProgressBar_C::TimerHandle' has a wrong offset!");
static_assert(offsetof(USpatialFaction_FakeProgressBar_C, Width) == 0x000278, "Member 'USpatialFaction_FakeProgressBar_C::Width' has a wrong offset!");
static_assert(offsetof(USpatialFaction_FakeProgressBar_C, Height) == 0x00027C, "Member 'USpatialFaction_FakeProgressBar_C::Height' has a wrong offset!");
static_assert(offsetof(USpatialFaction_FakeProgressBar_C, Spacing) == 0x000280, "Member 'USpatialFaction_FakeProgressBar_C::Spacing' has a wrong offset!");
static_assert(offsetof(USpatialFaction_FakeProgressBar_C, UseLightSweep) == 0x000284, "Member 'USpatialFaction_FakeProgressBar_C::UseLightSweep' has a wrong offset!");
static_assert(offsetof(USpatialFaction_FakeProgressBar_C, UseBars) == 0x000285, "Member 'USpatialFaction_FakeProgressBar_C::UseBars' has a wrong offset!");

}

