#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpatialCustomizationCategoryEntry

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function SpatialCustomizationCategoryEntry.SpatialCustomizationCategoryEntry_C.ExecuteUbergraph_SpatialCustomizationCategoryEntry
// 0x0088 (0x0088 - 0x0000)
struct SpatialCustomizationCategoryEntry_C_ExecuteUbergraph_SpatialCustomizationCategoryEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USpatialCustomizationChoice_C*          K2Node_DynamicCast_AsSpatial_Customization_Choice; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESpatialCustomizationCategoryState            K2Node_Event_State;                                // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x1];                                       // 0x0013(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Event_StateColor;                           // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue_1;      // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_2;       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_2;       // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USpatialCustomizationChoice_C*          K2Node_DynamicCast_AsSpatial_Customization_Choice_1; // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SpatialCustomizationCategoryEntry_C_ExecuteUbergraph_SpatialCustomizationCategoryEntry) == 0x000008, "Wrong alignment on SpatialCustomizationCategoryEntry_C_ExecuteUbergraph_SpatialCustomizationCategoryEntry");
static_assert(sizeof(SpatialCustomizationCategoryEntry_C_ExecuteUbergraph_SpatialCustomizationCategoryEntry) == 0x000088, "Wrong size on SpatialCustomizationCategoryEntry_C_ExecuteUbergraph_SpatialCustomizationCategoryEntry");
static_assert(offsetof(SpatialCustomizationCategoryEntry_C_ExecuteUbergraph_SpatialCustomizationCategoryEntry, EntryPoint) == 0x000000, "Member 'SpatialCustomizationCategoryEntry_C_ExecuteUbergraph_SpatialCustomizationCategoryEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationCategoryEntry_C_ExecuteUbergraph_SpatialCustomizationCategoryEntry, K2Node_DynamicCast_AsSpatial_Customization_Choice) == 0x000008, "Member 'SpatialCustomizationCategoryEntry_C_ExecuteUbergraph_SpatialCustomizationCategoryEntry::K2Node_DynamicCast_AsSpatial_Customization_Choice' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationCategoryEntry_C_ExecuteUbergraph_SpatialCustomizationCategoryEntry, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'SpatialCustomizationCategoryEntry_C_ExecuteUbergraph_SpatialCustomizationCategoryEntry::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationCategoryEntry_C_ExecuteUbergraph_SpatialCustomizationCategoryEntry, K2Node_Event_IsDesignTime) == 0x000011, "Member 'SpatialCustomizationCategoryEntry_C_ExecuteUbergraph_SpatialCustomizationCategoryEntry::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationCategoryEntry_C_ExecuteUbergraph_SpatialCustomizationCategoryEntry, K2Node_Event_State) == 0x000012, "Member 'SpatialCustomizationCategoryEntry_C_ExecuteUbergraph_SpatialCustomizationCategoryEntry::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationCategoryEntry_C_ExecuteUbergraph_SpatialCustomizationCategoryEntry, K2Node_Event_StateColor) == 0x000014, "Member 'SpatialCustomizationCategoryEntry_C_ExecuteUbergraph_SpatialCustomizationCategoryEntry::K2Node_Event_StateColor' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationCategoryEntry_C_ExecuteUbergraph_SpatialCustomizationCategoryEntry, CallFunc_SlotAsVerticalBoxSlot_ReturnValue) == 0x000028, "Member 'SpatialCustomizationCategoryEntry_C_ExecuteUbergraph_SpatialCustomizationCategoryEntry::CallFunc_SlotAsVerticalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationCategoryEntry_C_ExecuteUbergraph_SpatialCustomizationCategoryEntry, CallFunc_SlotAsVerticalBoxSlot_ReturnValue_1) == 0x000030, "Member 'SpatialCustomizationCategoryEntry_C_ExecuteUbergraph_SpatialCustomizationCategoryEntry::CallFunc_SlotAsVerticalBoxSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationCategoryEntry_C_ExecuteUbergraph_SpatialCustomizationCategoryEntry, CallFunc_PlayAnimationForward_ReturnValue) == 0x000038, "Member 'SpatialCustomizationCategoryEntry_C_ExecuteUbergraph_SpatialCustomizationCategoryEntry::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationCategoryEntry_C_ExecuteUbergraph_SpatialCustomizationCategoryEntry, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000040, "Member 'SpatialCustomizationCategoryEntry_C_ExecuteUbergraph_SpatialCustomizationCategoryEntry::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationCategoryEntry_C_ExecuteUbergraph_SpatialCustomizationCategoryEntry, CallFunc_PlayAnimationForward_ReturnValue_2) == 0x000048, "Member 'SpatialCustomizationCategoryEntry_C_ExecuteUbergraph_SpatialCustomizationCategoryEntry::CallFunc_PlayAnimationForward_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationCategoryEntry_C_ExecuteUbergraph_SpatialCustomizationCategoryEntry, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000050, "Member 'SpatialCustomizationCategoryEntry_C_ExecuteUbergraph_SpatialCustomizationCategoryEntry::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationCategoryEntry_C_ExecuteUbergraph_SpatialCustomizationCategoryEntry, CallFunc_PlayAnimationReverse_ReturnValue_1) == 0x000058, "Member 'SpatialCustomizationCategoryEntry_C_ExecuteUbergraph_SpatialCustomizationCategoryEntry::CallFunc_PlayAnimationReverse_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationCategoryEntry_C_ExecuteUbergraph_SpatialCustomizationCategoryEntry, CallFunc_PlayAnimationReverse_ReturnValue_2) == 0x000060, "Member 'SpatialCustomizationCategoryEntry_C_ExecuteUbergraph_SpatialCustomizationCategoryEntry::CallFunc_PlayAnimationReverse_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationCategoryEntry_C_ExecuteUbergraph_SpatialCustomizationCategoryEntry, CallFunc_AddChild_ReturnValue) == 0x000068, "Member 'SpatialCustomizationCategoryEntry_C_ExecuteUbergraph_SpatialCustomizationCategoryEntry::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationCategoryEntry_C_ExecuteUbergraph_SpatialCustomizationCategoryEntry, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x000070, "Member 'SpatialCustomizationCategoryEntry_C_ExecuteUbergraph_SpatialCustomizationCategoryEntry::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationCategoryEntry_C_ExecuteUbergraph_SpatialCustomizationCategoryEntry, K2Node_DynamicCast_AsSpatial_Customization_Choice_1) == 0x000078, "Member 'SpatialCustomizationCategoryEntry_C_ExecuteUbergraph_SpatialCustomizationCategoryEntry::K2Node_DynamicCast_AsSpatial_Customization_Choice_1' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationCategoryEntry_C_ExecuteUbergraph_SpatialCustomizationCategoryEntry, K2Node_DynamicCast_bSuccess_1) == 0x000080, "Member 'SpatialCustomizationCategoryEntry_C_ExecuteUbergraph_SpatialCustomizationCategoryEntry::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function SpatialCustomizationCategoryEntry.SpatialCustomizationCategoryEntry_C.OnCategoryStateSet
// 0x0014 (0x0014 - 0x0000)
struct SpatialCustomizationCategoryEntry_C_OnCategoryStateSet final
{
public:
	ESpatialCustomizationCategoryState            State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           StateColor;                                        // 0x0004(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpatialCustomizationCategoryEntry_C_OnCategoryStateSet) == 0x000004, "Wrong alignment on SpatialCustomizationCategoryEntry_C_OnCategoryStateSet");
static_assert(sizeof(SpatialCustomizationCategoryEntry_C_OnCategoryStateSet) == 0x000014, "Wrong size on SpatialCustomizationCategoryEntry_C_OnCategoryStateSet");
static_assert(offsetof(SpatialCustomizationCategoryEntry_C_OnCategoryStateSet, State) == 0x000000, "Member 'SpatialCustomizationCategoryEntry_C_OnCategoryStateSet::State' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationCategoryEntry_C_OnCategoryStateSet, StateColor) == 0x000004, "Member 'SpatialCustomizationCategoryEntry_C_OnCategoryStateSet::StateColor' has a wrong offset!");

// Function SpatialCustomizationCategoryEntry.SpatialCustomizationCategoryEntry_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct SpatialCustomizationCategoryEntry_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SpatialCustomizationCategoryEntry_C_PreConstruct) == 0x000001, "Wrong alignment on SpatialCustomizationCategoryEntry_C_PreConstruct");
static_assert(sizeof(SpatialCustomizationCategoryEntry_C_PreConstruct) == 0x000001, "Wrong size on SpatialCustomizationCategoryEntry_C_PreConstruct");
static_assert(offsetof(SpatialCustomizationCategoryEntry_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'SpatialCustomizationCategoryEntry_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function SpatialCustomizationCategoryEntry.SpatialCustomizationCategoryEntry_C.HandleCategoryStateSet
// 0x00E8 (0x00E8 - 0x0000)
struct SpatialCustomizationCategoryEntry_C_HandleCategoryStateSet final
{
public:
	ESpatialCustomizationCategoryState            State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           StateColor;                                        // 0x0004(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_R;                             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G;                             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B;                             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A;                             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_R_1;                           // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G_1;                           // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B_1;                           // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A_1;                           // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_1;                   // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0060(0x0028)()
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_1;                             // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x00B8(0x0018)()
	bool                                          Temp_bool_Variable_1;                              // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_Select_Default_1;                           // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpatialCustomizationCategoryEntry_C_HandleCategoryStateSet) == 0x000008, "Wrong alignment on SpatialCustomizationCategoryEntry_C_HandleCategoryStateSet");
static_assert(sizeof(SpatialCustomizationCategoryEntry_C_HandleCategoryStateSet) == 0x0000E8, "Wrong size on SpatialCustomizationCategoryEntry_C_HandleCategoryStateSet");
static_assert(offsetof(SpatialCustomizationCategoryEntry_C_HandleCategoryStateSet, State) == 0x000000, "Member 'SpatialCustomizationCategoryEntry_C_HandleCategoryStateSet::State' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationCategoryEntry_C_HandleCategoryStateSet, StateColor) == 0x000004, "Member 'SpatialCustomizationCategoryEntry_C_HandleCategoryStateSet::StateColor' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationCategoryEntry_C_HandleCategoryStateSet, Temp_float_Variable) == 0x000014, "Member 'SpatialCustomizationCategoryEntry_C_HandleCategoryStateSet::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationCategoryEntry_C_HandleCategoryStateSet, CallFunc_BreakColor_R) == 0x000018, "Member 'SpatialCustomizationCategoryEntry_C_HandleCategoryStateSet::CallFunc_BreakColor_R' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationCategoryEntry_C_HandleCategoryStateSet, CallFunc_BreakColor_G) == 0x00001C, "Member 'SpatialCustomizationCategoryEntry_C_HandleCategoryStateSet::CallFunc_BreakColor_G' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationCategoryEntry_C_HandleCategoryStateSet, CallFunc_BreakColor_B) == 0x000020, "Member 'SpatialCustomizationCategoryEntry_C_HandleCategoryStateSet::CallFunc_BreakColor_B' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationCategoryEntry_C_HandleCategoryStateSet, CallFunc_BreakColor_A) == 0x000024, "Member 'SpatialCustomizationCategoryEntry_C_HandleCategoryStateSet::CallFunc_BreakColor_A' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationCategoryEntry_C_HandleCategoryStateSet, CallFunc_BreakColor_R_1) == 0x000028, "Member 'SpatialCustomizationCategoryEntry_C_HandleCategoryStateSet::CallFunc_BreakColor_R_1' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationCategoryEntry_C_HandleCategoryStateSet, CallFunc_BreakColor_G_1) == 0x00002C, "Member 'SpatialCustomizationCategoryEntry_C_HandleCategoryStateSet::CallFunc_BreakColor_G_1' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationCategoryEntry_C_HandleCategoryStateSet, CallFunc_BreakColor_B_1) == 0x000030, "Member 'SpatialCustomizationCategoryEntry_C_HandleCategoryStateSet::CallFunc_BreakColor_B_1' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationCategoryEntry_C_HandleCategoryStateSet, CallFunc_BreakColor_A_1) == 0x000034, "Member 'SpatialCustomizationCategoryEntry_C_HandleCategoryStateSet::CallFunc_BreakColor_A_1' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationCategoryEntry_C_HandleCategoryStateSet, K2Node_MakeStruct_LinearColor) == 0x000038, "Member 'SpatialCustomizationCategoryEntry_C_HandleCategoryStateSet::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationCategoryEntry_C_HandleCategoryStateSet, K2Node_MakeStruct_LinearColor_1) == 0x000048, "Member 'SpatialCustomizationCategoryEntry_C_HandleCategoryStateSet::K2Node_MakeStruct_LinearColor_1' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationCategoryEntry_C_HandleCategoryStateSet, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000058, "Member 'SpatialCustomizationCategoryEntry_C_HandleCategoryStateSet::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationCategoryEntry_C_HandleCategoryStateSet, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000059, "Member 'SpatialCustomizationCategoryEntry_C_HandleCategoryStateSet::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationCategoryEntry_C_HandleCategoryStateSet, K2Node_MakeStruct_SlateColor) == 0x000060, "Member 'SpatialCustomizationCategoryEntry_C_HandleCategoryStateSet::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationCategoryEntry_C_HandleCategoryStateSet, CallFunc_BooleanOR_ReturnValue) == 0x000088, "Member 'SpatialCustomizationCategoryEntry_C_HandleCategoryStateSet::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationCategoryEntry_C_HandleCategoryStateSet, Temp_float_Variable_1) == 0x00008C, "Member 'SpatialCustomizationCategoryEntry_C_HandleCategoryStateSet::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationCategoryEntry_C_HandleCategoryStateSet, K2Node_SwitchEnum_CmpSuccess) == 0x000090, "Member 'SpatialCustomizationCategoryEntry_C_HandleCategoryStateSet::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationCategoryEntry_C_HandleCategoryStateSet, Temp_bool_Variable) == 0x000091, "Member 'SpatialCustomizationCategoryEntry_C_HandleCategoryStateSet::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationCategoryEntry_C_HandleCategoryStateSet, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000098, "Member 'SpatialCustomizationCategoryEntry_C_HandleCategoryStateSet::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationCategoryEntry_C_HandleCategoryStateSet, Temp_object_Variable) == 0x0000A0, "Member 'SpatialCustomizationCategoryEntry_C_HandleCategoryStateSet::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationCategoryEntry_C_HandleCategoryStateSet, K2Node_Select_Default) == 0x0000A8, "Member 'SpatialCustomizationCategoryEntry_C_HandleCategoryStateSet::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationCategoryEntry_C_HandleCategoryStateSet, Temp_object_Variable_1) == 0x0000B0, "Member 'SpatialCustomizationCategoryEntry_C_HandleCategoryStateSet::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationCategoryEntry_C_HandleCategoryStateSet, CallFunc_GetText_ReturnValue) == 0x0000B8, "Member 'SpatialCustomizationCategoryEntry_C_HandleCategoryStateSet::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationCategoryEntry_C_HandleCategoryStateSet, Temp_bool_Variable_1) == 0x0000D0, "Member 'SpatialCustomizationCategoryEntry_C_HandleCategoryStateSet::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationCategoryEntry_C_HandleCategoryStateSet, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x0000D8, "Member 'SpatialCustomizationCategoryEntry_C_HandleCategoryStateSet::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationCategoryEntry_C_HandleCategoryStateSet, K2Node_Select_Default_1) == 0x0000E0, "Member 'SpatialCustomizationCategoryEntry_C_HandleCategoryStateSet::K2Node_Select_Default_1' has a wrong offset!");

// Function SpatialCustomizationCategoryEntry.SpatialCustomizationCategoryEntry_C.Set rim brush color
// 0x00C8 (0x00C8 - 0x0000)
struct SpatialCustomizationCategoryEntry_C_Set_rim_brush_color final
{
public:
	class UCommonActionWidget*                    Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color;                                             // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0018(0x0028)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0040(0x0088)()
};
static_assert(alignof(SpatialCustomizationCategoryEntry_C_Set_rim_brush_color) == 0x000008, "Wrong alignment on SpatialCustomizationCategoryEntry_C_Set_rim_brush_color");
static_assert(sizeof(SpatialCustomizationCategoryEntry_C_Set_rim_brush_color) == 0x0000C8, "Wrong size on SpatialCustomizationCategoryEntry_C_Set_rim_brush_color");
static_assert(offsetof(SpatialCustomizationCategoryEntry_C_Set_rim_brush_color, Target) == 0x000000, "Member 'SpatialCustomizationCategoryEntry_C_Set_rim_brush_color::Target' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationCategoryEntry_C_Set_rim_brush_color, Color) == 0x000008, "Member 'SpatialCustomizationCategoryEntry_C_Set_rim_brush_color::Color' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationCategoryEntry_C_Set_rim_brush_color, K2Node_MakeStruct_SlateColor) == 0x000018, "Member 'SpatialCustomizationCategoryEntry_C_Set_rim_brush_color::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationCategoryEntry_C_Set_rim_brush_color, K2Node_MakeStruct_SlateBrush) == 0x000040, "Member 'SpatialCustomizationCategoryEntry_C_Set_rim_brush_color::K2Node_MakeStruct_SlateBrush' has a wrong offset!");

}

