#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpatialFactionPerkReward

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function SpatialFactionPerkReward.SpatialFactionPerkReward_C.ExecuteUbergraph_SpatialFactionPerkReward
// 0x0238 (0x0238 - 0x0000)
struct SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_2;                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_3;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x001C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x002C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_3;                              // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECommonInputType                              Temp_byte_Variable;                                // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_5;                              // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_6;                              // 0x005E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_7;                              // 0x005F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate;              // 0x006C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable_8;                              // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x007E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7F[0x1];                                       // 0x007F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_FactionNumber;                        // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PerkLevel;                            // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              K2Node_Event_RewardTexture;                        // 0x0088(0x0028)(ConstParm, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsRevealed;                          // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsEarned;                            // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsCurrentFaction;                    // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bShowBang;                            // 0x00B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_9;                              // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B7[0x1];                                       // 0x00B7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_4;                             // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_5;                             // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_10;                             // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x00D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D6[0x2];                                       // 0x00D6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_11;                             // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_2;         // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10A[0x6];                                      // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_3;         // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_4;         // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_5;         // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_6;         // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_12;                             // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_7;         // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_8;         // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_2;       // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_2;       // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x015A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x015B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         K2Node_CustomEvent_FactionNumber;                  // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PerkLevel;                      // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              K2Node_CustomEvent_RewardTexture;                  // 0x0168(0x0028)(HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsRevealed;                     // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_IsEarned;                       // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_IsCurrentFaction;               // 0x0192(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0193(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_3;                           // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_4;                           // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_5;                           // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_6;                           // 0x01A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x3];                                      // 0x01B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x01B4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_1;                   // 0x01C4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_2;                   // 0x01D4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_3;                   // 0x01E4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_7;                           // 0x01F4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_8;                           // 0x0204(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_13;                             // 0x0214(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_215[0x3];                                      // 0x0215(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x0218(0x0010)(ZeroConstructor, NoDestructor)
	class UWidget*                                K2Node_Select_Default_9;                           // 0x0228(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              K2Node_CustomEvent_bNewInputType;                  // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default_10;                          // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward) == 0x000008, "Wrong alignment on SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward");
static_assert(sizeof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward) == 0x000238, "Wrong size on SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, EntryPoint) == 0x000000, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::EntryPoint' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, Temp_float_Variable) == 0x000004, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, Temp_float_Variable_1) == 0x000008, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, Temp_bool_Variable) == 0x00000C, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, Temp_float_Variable_2) == 0x000010, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::Temp_float_Variable_2' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, Temp_float_Variable_3) == 0x000014, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::Temp_float_Variable_3' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, Temp_bool_Variable_1) == 0x000018, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, Temp_struct_Variable) == 0x00001C, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, Temp_struct_Variable_1) == 0x00002C, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, K2Node_CustomEvent_Loaded) == 0x000040, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, Temp_object_Variable) == 0x000048, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, K2Node_DynamicCast_AsTexture_2D) == 0x000050, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, Temp_bool_Variable_2) == 0x000059, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, Temp_bool_Variable_3) == 0x00005A, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, Temp_byte_Variable) == 0x00005B, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, Temp_bool_Variable_4) == 0x00005C, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, Temp_bool_Variable_5) == 0x00005D, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, Temp_bool_Variable_6) == 0x00005E, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, Temp_bool_Variable_7) == 0x00005F, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::Temp_bool_Variable_7' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000060, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, CallFunc_GetCurrentInputType_ReturnValue) == 0x000068, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, K2Node_CreateDelegate_OutputDelegate) == 0x00006C, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, Temp_bool_Variable_8) == 0x00007C, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::Temp_bool_Variable_8' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, Temp_byte_Variable_1) == 0x00007D, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, Temp_byte_Variable_2) == 0x00007E, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, K2Node_Event_FactionNumber) == 0x000080, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::K2Node_Event_FactionNumber' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, K2Node_Event_PerkLevel) == 0x000084, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::K2Node_Event_PerkLevel' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, K2Node_Event_RewardTexture) == 0x000088, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::K2Node_Event_RewardTexture' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, K2Node_Event_bIsRevealed) == 0x0000B0, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::K2Node_Event_bIsRevealed' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, K2Node_Event_bIsEarned) == 0x0000B1, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::K2Node_Event_bIsEarned' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, K2Node_Event_bIsCurrentFaction) == 0x0000B2, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::K2Node_Event_bIsCurrentFaction' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, K2Node_Event_bShowBang) == 0x0000B3, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::K2Node_Event_bShowBang' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, Temp_bool_Variable_9) == 0x0000B4, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::Temp_bool_Variable_9' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, K2Node_Select_Default) == 0x0000B5, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, K2Node_Event_IsDesignTime) == 0x0000B6, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, Temp_float_Variable_4) == 0x0000B8, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::Temp_float_Variable_4' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, CallFunc_PlayAnimationReverse_ReturnValue) == 0x0000C0, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, CallFunc_PlayAnimationForward_ReturnValue) == 0x0000C8, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, Temp_float_Variable_5) == 0x0000D0, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::Temp_float_Variable_5' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, Temp_bool_Variable_10) == 0x0000D4, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::Temp_bool_Variable_10' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, Temp_byte_Variable_3) == 0x0000D5, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0000D8, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, Temp_byte_Variable_4) == 0x0000E0, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, Temp_bool_Variable_11) == 0x0000E1, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::Temp_bool_Variable_11' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, CallFunc_PlayAnimationReverse_ReturnValue_1) == 0x0000E8, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::CallFunc_PlayAnimationReverse_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x0000F0, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, CallFunc_GetDynamicMaterial_ReturnValue_2) == 0x0000F8, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::CallFunc_GetDynamicMaterial_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000100, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, Temp_byte_Variable_5) == 0x000108, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, Temp_byte_Variable_6) == 0x000109, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, CallFunc_GetDynamicMaterial_ReturnValue_3) == 0x000110, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::CallFunc_GetDynamicMaterial_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, CallFunc_GetDynamicMaterial_ReturnValue_4) == 0x000118, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::CallFunc_GetDynamicMaterial_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, CallFunc_GetDynamicMaterial_ReturnValue_5) == 0x000120, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::CallFunc_GetDynamicMaterial_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, CallFunc_GetDynamicMaterial_ReturnValue_6) == 0x000128, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::CallFunc_GetDynamicMaterial_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, Temp_bool_Variable_12) == 0x000130, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::Temp_bool_Variable_12' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, CallFunc_GetDynamicMaterial_ReturnValue_7) == 0x000138, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::CallFunc_GetDynamicMaterial_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, CallFunc_GetDynamicMaterial_ReturnValue_8) == 0x000140, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::CallFunc_GetDynamicMaterial_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, CallFunc_PlayAnimationForward_ReturnValue_2) == 0x000148, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::CallFunc_PlayAnimationForward_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, CallFunc_PlayAnimationReverse_ReturnValue_2) == 0x000150, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::CallFunc_PlayAnimationReverse_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, CallFunc_BooleanOR_ReturnValue) == 0x000158, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, CallFunc_Not_PreBool_ReturnValue) == 0x000159, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, K2Node_Select_Default_1) == 0x00015A, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, CallFunc_BooleanAND_ReturnValue) == 0x00015B, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, K2Node_CustomEvent_FactionNumber) == 0x00015C, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::K2Node_CustomEvent_FactionNumber' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, K2Node_CustomEvent_PerkLevel) == 0x000160, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::K2Node_CustomEvent_PerkLevel' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, K2Node_CustomEvent_RewardTexture) == 0x000168, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::K2Node_CustomEvent_RewardTexture' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, K2Node_CustomEvent_IsRevealed) == 0x000190, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::K2Node_CustomEvent_IsRevealed' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, K2Node_CustomEvent_IsEarned) == 0x000191, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::K2Node_CustomEvent_IsEarned' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, K2Node_CustomEvent_IsCurrentFaction) == 0x000192, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::K2Node_CustomEvent_IsCurrentFaction' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, K2Node_Select_Default_2) == 0x000193, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, K2Node_Select_Default_3) == 0x000194, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, K2Node_Select_Default_4) == 0x000198, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, K2Node_Select_Default_5) == 0x00019C, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, K2Node_Select_Default_6) == 0x0001A0, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::K2Node_Select_Default_6' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, CallFunc_Not_PreBool_ReturnValue_1) == 0x0001B0, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, K2Node_MakeStruct_LinearColor) == 0x0001B4, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, K2Node_MakeStruct_LinearColor_1) == 0x0001C4, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::K2Node_MakeStruct_LinearColor_1' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, K2Node_MakeStruct_LinearColor_2) == 0x0001D4, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::K2Node_MakeStruct_LinearColor_2' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, K2Node_MakeStruct_LinearColor_3) == 0x0001E4, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::K2Node_MakeStruct_LinearColor_3' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, K2Node_Select_Default_7) == 0x0001F4, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::K2Node_Select_Default_7' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, K2Node_Select_Default_8) == 0x000204, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::K2Node_Select_Default_8' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, Temp_bool_Variable_13) == 0x000214, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::Temp_bool_Variable_13' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, K2Node_CreateDelegate_OutputDelegate_1) == 0x000218, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, K2Node_Select_Default_9) == 0x000228, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::K2Node_Select_Default_9' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, K2Node_CustomEvent_bNewInputType) == 0x000230, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::K2Node_CustomEvent_bNewInputType' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward, K2Node_Select_Default_10) == 0x000231, "Member 'SpatialFactionPerkReward_C_ExecuteUbergraph_SpatialFactionPerkReward::K2Node_Select_Default_10' has a wrong offset!");

// Function SpatialFactionPerkReward.SpatialFactionPerkReward_C.HandleInputChanged
// 0x0001 (0x0001 - 0x0000)
struct SpatialFactionPerkReward_C_HandleInputChanged final
{
public:
	ECommonInputType                              bNewInputType;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpatialFactionPerkReward_C_HandleInputChanged) == 0x000001, "Wrong alignment on SpatialFactionPerkReward_C_HandleInputChanged");
static_assert(sizeof(SpatialFactionPerkReward_C_HandleInputChanged) == 0x000001, "Wrong size on SpatialFactionPerkReward_C_HandleInputChanged");
static_assert(offsetof(SpatialFactionPerkReward_C_HandleInputChanged, bNewInputType) == 0x000000, "Member 'SpatialFactionPerkReward_C_HandleInputChanged::bNewInputType' has a wrong offset!");

// Function SpatialFactionPerkReward.SpatialFactionPerkReward_C.SetPerkReward
// 0x0038 (0x0038 - 0x0000)
struct SpatialFactionPerkReward_C_SetPerkReward final
{
public:
	int32                                         FactionNumber;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PerkLevel;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              RewardTexture;                                     // 0x0008(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          IsRevealed;                                        // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsEarned;                                          // 0x0031(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsCurrentFaction;                                  // 0x0032(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SpatialFactionPerkReward_C_SetPerkReward) == 0x000008, "Wrong alignment on SpatialFactionPerkReward_C_SetPerkReward");
static_assert(sizeof(SpatialFactionPerkReward_C_SetPerkReward) == 0x000038, "Wrong size on SpatialFactionPerkReward_C_SetPerkReward");
static_assert(offsetof(SpatialFactionPerkReward_C_SetPerkReward, FactionNumber) == 0x000000, "Member 'SpatialFactionPerkReward_C_SetPerkReward::FactionNumber' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_SetPerkReward, PerkLevel) == 0x000004, "Member 'SpatialFactionPerkReward_C_SetPerkReward::PerkLevel' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_SetPerkReward, RewardTexture) == 0x000008, "Member 'SpatialFactionPerkReward_C_SetPerkReward::RewardTexture' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_SetPerkReward, IsRevealed) == 0x000030, "Member 'SpatialFactionPerkReward_C_SetPerkReward::IsRevealed' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_SetPerkReward, IsEarned) == 0x000031, "Member 'SpatialFactionPerkReward_C_SetPerkReward::IsEarned' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_SetPerkReward, IsCurrentFaction) == 0x000032, "Member 'SpatialFactionPerkReward_C_SetPerkReward::IsCurrentFaction' has a wrong offset!");

// Function SpatialFactionPerkReward.SpatialFactionPerkReward_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct SpatialFactionPerkReward_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SpatialFactionPerkReward_C_PreConstruct) == 0x000001, "Wrong alignment on SpatialFactionPerkReward_C_PreConstruct");
static_assert(sizeof(SpatialFactionPerkReward_C_PreConstruct) == 0x000001, "Wrong size on SpatialFactionPerkReward_C_PreConstruct");
static_assert(offsetof(SpatialFactionPerkReward_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'SpatialFactionPerkReward_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function SpatialFactionPerkReward.SpatialFactionPerkReward_C.OnInitializePerkReward
// 0x0038 (0x0038 - 0x0000)
struct SpatialFactionPerkReward_C_OnInitializePerkReward final
{
public:
	int32                                         FactionNumber;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PerkLevel;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              RewardTexture;                                     // 0x0008(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash)
	bool                                          bIsRevealed;                                       // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIsEarned;                                         // 0x0031(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIsCurrentFaction;                                 // 0x0032(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bShowBang;                                         // 0x0033(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SpatialFactionPerkReward_C_OnInitializePerkReward) == 0x000008, "Wrong alignment on SpatialFactionPerkReward_C_OnInitializePerkReward");
static_assert(sizeof(SpatialFactionPerkReward_C_OnInitializePerkReward) == 0x000038, "Wrong size on SpatialFactionPerkReward_C_OnInitializePerkReward");
static_assert(offsetof(SpatialFactionPerkReward_C_OnInitializePerkReward, FactionNumber) == 0x000000, "Member 'SpatialFactionPerkReward_C_OnInitializePerkReward::FactionNumber' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_OnInitializePerkReward, PerkLevel) == 0x000004, "Member 'SpatialFactionPerkReward_C_OnInitializePerkReward::PerkLevel' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_OnInitializePerkReward, RewardTexture) == 0x000008, "Member 'SpatialFactionPerkReward_C_OnInitializePerkReward::RewardTexture' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_OnInitializePerkReward, bIsRevealed) == 0x000030, "Member 'SpatialFactionPerkReward_C_OnInitializePerkReward::bIsRevealed' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_OnInitializePerkReward, bIsEarned) == 0x000031, "Member 'SpatialFactionPerkReward_C_OnInitializePerkReward::bIsEarned' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_OnInitializePerkReward, bIsCurrentFaction) == 0x000032, "Member 'SpatialFactionPerkReward_C_OnInitializePerkReward::bIsCurrentFaction' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkReward_C_OnInitializePerkReward, bShowBang) == 0x000033, "Member 'SpatialFactionPerkReward_C_OnInitializePerkReward::bShowBang' has a wrong offset!");

// Function SpatialFactionPerkReward.SpatialFactionPerkReward_C.OnLoaded_3DAD11EA474CE52F9A680ABB88B17B8D
// 0x0008 (0x0008 - 0x0000)
struct SpatialFactionPerkReward_C_OnLoaded_3DAD11EA474CE52F9A680ABB88B17B8D final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpatialFactionPerkReward_C_OnLoaded_3DAD11EA474CE52F9A680ABB88B17B8D) == 0x000008, "Wrong alignment on SpatialFactionPerkReward_C_OnLoaded_3DAD11EA474CE52F9A680ABB88B17B8D");
static_assert(sizeof(SpatialFactionPerkReward_C_OnLoaded_3DAD11EA474CE52F9A680ABB88B17B8D) == 0x000008, "Wrong size on SpatialFactionPerkReward_C_OnLoaded_3DAD11EA474CE52F9A680ABB88B17B8D");
static_assert(offsetof(SpatialFactionPerkReward_C_OnLoaded_3DAD11EA474CE52F9A680ABB88B17B8D, Loaded) == 0x000000, "Member 'SpatialFactionPerkReward_C_OnLoaded_3DAD11EA474CE52F9A680ABB88B17B8D::Loaded' has a wrong offset!");

}

