#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Spatial_Specialbutton

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function Spatial_Specialbutton.Spatial_Specialbutton_C.ExecuteUbergraph_Spatial_Specialbutton
// 0x0020 (0x0020 - 0x0000)
struct Spatial_Specialbutton_C_ExecuteUbergraph_Spatial_Specialbutton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Spatial_Specialbutton_C_ExecuteUbergraph_Spatial_Specialbutton) == 0x000008, "Wrong alignment on Spatial_Specialbutton_C_ExecuteUbergraph_Spatial_Specialbutton");
static_assert(sizeof(Spatial_Specialbutton_C_ExecuteUbergraph_Spatial_Specialbutton) == 0x000020, "Wrong size on Spatial_Specialbutton_C_ExecuteUbergraph_Spatial_Specialbutton");
static_assert(offsetof(Spatial_Specialbutton_C_ExecuteUbergraph_Spatial_Specialbutton, EntryPoint) == 0x000000, "Member 'Spatial_Specialbutton_C_ExecuteUbergraph_Spatial_Specialbutton::EntryPoint' has a wrong offset!");
static_assert(offsetof(Spatial_Specialbutton_C_ExecuteUbergraph_Spatial_Specialbutton, Temp_byte_Variable) == 0x000004, "Member 'Spatial_Specialbutton_C_ExecuteUbergraph_Spatial_Specialbutton::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(Spatial_Specialbutton_C_ExecuteUbergraph_Spatial_Specialbutton, K2Node_Event_IsDesignTime) == 0x000005, "Member 'Spatial_Specialbutton_C_ExecuteUbergraph_Spatial_Specialbutton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(Spatial_Specialbutton_C_ExecuteUbergraph_Spatial_Specialbutton, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000008, "Member 'Spatial_Specialbutton_C_ExecuteUbergraph_Spatial_Specialbutton::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spatial_Specialbutton_C_ExecuteUbergraph_Spatial_Specialbutton, CallFunc_PlayAnimationForward_ReturnValue) == 0x000010, "Member 'Spatial_Specialbutton_C_ExecuteUbergraph_Spatial_Specialbutton::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spatial_Specialbutton_C_ExecuteUbergraph_Spatial_Specialbutton, Temp_byte_Variable_1) == 0x000018, "Member 'Spatial_Specialbutton_C_ExecuteUbergraph_Spatial_Specialbutton::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(Spatial_Specialbutton_C_ExecuteUbergraph_Spatial_Specialbutton, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'Spatial_Specialbutton_C_ExecuteUbergraph_Spatial_Specialbutton::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Spatial_Specialbutton_C_ExecuteUbergraph_Spatial_Specialbutton, Temp_bool_Variable) == 0x00001A, "Member 'Spatial_Specialbutton_C_ExecuteUbergraph_Spatial_Specialbutton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(Spatial_Specialbutton_C_ExecuteUbergraph_Spatial_Specialbutton, K2Node_Select_Default) == 0x00001B, "Member 'Spatial_Specialbutton_C_ExecuteUbergraph_Spatial_Specialbutton::K2Node_Select_Default' has a wrong offset!");

// Function Spatial_Specialbutton.Spatial_Specialbutton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct Spatial_Specialbutton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Spatial_Specialbutton_C_PreConstruct) == 0x000001, "Wrong alignment on Spatial_Specialbutton_C_PreConstruct");
static_assert(sizeof(Spatial_Specialbutton_C_PreConstruct) == 0x000001, "Wrong size on Spatial_Specialbutton_C_PreConstruct");
static_assert(offsetof(Spatial_Specialbutton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'Spatial_Specialbutton_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

