#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpatialHenchmanFactionEgo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "FortniteUI_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SpatialHenchmanFactionEgo.SpatialHenchmanFactionEgo_C
// 0x00F0 (0x0C60 - 0x0B70)
class USpatialHenchmanFactionEgo_C final : public UCommonButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnActivate;                                        // 0x0B78(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnHover;                                           // 0x0B80(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x0B88(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                ActiveTag;                                         // 0x0B90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                AvailableTag;                                      // 0x0B98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BGFill;                                            // 0x0BA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                ClassifiedTag;                                     // 0x0BA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                CompleteTag;                                       // 0x0BB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FactionLogo_C;                                     // 0x0BB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FactionLogo_R;                                     // 0x0BC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Fake_Graphs;                                       // 0x0BC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFakeStatsGraphs_C*                     FakeStatsGraphs;                                   // 0x0BD0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Glow;                                              // 0x0BD8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Lock;                                         // 0x0BE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Lock_1;                                       // 0x0BE8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Lock_2;                                       // 0x0BF0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Lock_3;                                       // 0x0BF8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Lock_4;                                       // 0x0C00(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                InActiveTag;                                       // 0x0C08(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ItemVariantName;                                   // 0x0C10(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortLazyImage*                         LazyImage_Portrait;                                // 0x0C18(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LeftLine;                                          // 0x0C20(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RightLine;                                         // 0x0C28(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpatialHenchmenViewMoreButton_C*       SpatialHenchmenViewMoreButton;                     // 0x0C30(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               StatusandBarsOvr;                                  // 0x0C38(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        StatusSwitcher;                                    // 0x0C40(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Alter;                                        // 0x0C48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Alter_C;                                      // 0x0C50(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Alter_R;                                      // 0x0C58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SpatialHenchmanFactionEgo(int32 EntryPoint);
	void Construct();
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void BndEvt__SpatialHenchmenViewMoreButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void InitForVariant(class UFortVariantTokenType* Variant, EMissionState MissionState, EMissionState OtherMissionState);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SpatialHenchmanFactionEgo_C">();
	}
	static class USpatialHenchmanFactionEgo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpatialHenchmanFactionEgo_C>();
	}
};
static_assert(alignof(USpatialHenchmanFactionEgo_C) == 0x000008, "Wrong alignment on USpatialHenchmanFactionEgo_C");
static_assert(sizeof(USpatialHenchmanFactionEgo_C) == 0x000C60, "Wrong size on USpatialHenchmanFactionEgo_C");
static_assert(offsetof(USpatialHenchmanFactionEgo_C, UberGraphFrame) == 0x000B70, "Member 'USpatialHenchmanFactionEgo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USpatialHenchmanFactionEgo_C, OnActivate) == 0x000B78, "Member 'USpatialHenchmanFactionEgo_C::OnActivate' has a wrong offset!");
static_assert(offsetof(USpatialHenchmanFactionEgo_C, OnHover) == 0x000B80, "Member 'USpatialHenchmanFactionEgo_C::OnHover' has a wrong offset!");
static_assert(offsetof(USpatialHenchmanFactionEgo_C, Intro) == 0x000B88, "Member 'USpatialHenchmanFactionEgo_C::Intro' has a wrong offset!");
static_assert(offsetof(USpatialHenchmanFactionEgo_C, ActiveTag) == 0x000B90, "Member 'USpatialHenchmanFactionEgo_C::ActiveTag' has a wrong offset!");
static_assert(offsetof(USpatialHenchmanFactionEgo_C, AvailableTag) == 0x000B98, "Member 'USpatialHenchmanFactionEgo_C::AvailableTag' has a wrong offset!");
static_assert(offsetof(USpatialHenchmanFactionEgo_C, BGFill) == 0x000BA0, "Member 'USpatialHenchmanFactionEgo_C::BGFill' has a wrong offset!");
static_assert(offsetof(USpatialHenchmanFactionEgo_C, ClassifiedTag) == 0x000BA8, "Member 'USpatialHenchmanFactionEgo_C::ClassifiedTag' has a wrong offset!");
static_assert(offsetof(USpatialHenchmanFactionEgo_C, CompleteTag) == 0x000BB0, "Member 'USpatialHenchmanFactionEgo_C::CompleteTag' has a wrong offset!");
static_assert(offsetof(USpatialHenchmanFactionEgo_C, FactionLogo_C) == 0x000BB8, "Member 'USpatialHenchmanFactionEgo_C::FactionLogo_C' has a wrong offset!");
static_assert(offsetof(USpatialHenchmanFactionEgo_C, FactionLogo_R) == 0x000BC0, "Member 'USpatialHenchmanFactionEgo_C::FactionLogo_R' has a wrong offset!");
static_assert(offsetof(USpatialHenchmanFactionEgo_C, Fake_Graphs) == 0x000BC8, "Member 'USpatialHenchmanFactionEgo_C::Fake_Graphs' has a wrong offset!");
static_assert(offsetof(USpatialHenchmanFactionEgo_C, FakeStatsGraphs) == 0x000BD0, "Member 'USpatialHenchmanFactionEgo_C::FakeStatsGraphs' has a wrong offset!");
static_assert(offsetof(USpatialHenchmanFactionEgo_C, Glow) == 0x000BD8, "Member 'USpatialHenchmanFactionEgo_C::Glow' has a wrong offset!");
static_assert(offsetof(USpatialHenchmanFactionEgo_C, Icon_Lock) == 0x000BE0, "Member 'USpatialHenchmanFactionEgo_C::Icon_Lock' has a wrong offset!");
static_assert(offsetof(USpatialHenchmanFactionEgo_C, Icon_Lock_1) == 0x000BE8, "Member 'USpatialHenchmanFactionEgo_C::Icon_Lock_1' has a wrong offset!");
static_assert(offsetof(USpatialHenchmanFactionEgo_C, Icon_Lock_2) == 0x000BF0, "Member 'USpatialHenchmanFactionEgo_C::Icon_Lock_2' has a wrong offset!");
static_assert(offsetof(USpatialHenchmanFactionEgo_C, Icon_Lock_3) == 0x000BF8, "Member 'USpatialHenchmanFactionEgo_C::Icon_Lock_3' has a wrong offset!");
static_assert(offsetof(USpatialHenchmanFactionEgo_C, Icon_Lock_4) == 0x000C00, "Member 'USpatialHenchmanFactionEgo_C::Icon_Lock_4' has a wrong offset!");
static_assert(offsetof(USpatialHenchmanFactionEgo_C, InActiveTag) == 0x000C08, "Member 'USpatialHenchmanFactionEgo_C::InActiveTag' has a wrong offset!");
static_assert(offsetof(USpatialHenchmanFactionEgo_C, ItemVariantName) == 0x000C10, "Member 'USpatialHenchmanFactionEgo_C::ItemVariantName' has a wrong offset!");
static_assert(offsetof(USpatialHenchmanFactionEgo_C, LazyImage_Portrait) == 0x000C18, "Member 'USpatialHenchmanFactionEgo_C::LazyImage_Portrait' has a wrong offset!");
static_assert(offsetof(USpatialHenchmanFactionEgo_C, LeftLine) == 0x000C20, "Member 'USpatialHenchmanFactionEgo_C::LeftLine' has a wrong offset!");
static_assert(offsetof(USpatialHenchmanFactionEgo_C, RightLine) == 0x000C28, "Member 'USpatialHenchmanFactionEgo_C::RightLine' has a wrong offset!");
static_assert(offsetof(USpatialHenchmanFactionEgo_C, SpatialHenchmenViewMoreButton) == 0x000C30, "Member 'USpatialHenchmanFactionEgo_C::SpatialHenchmenViewMoreButton' has a wrong offset!");
static_assert(offsetof(USpatialHenchmanFactionEgo_C, StatusandBarsOvr) == 0x000C38, "Member 'USpatialHenchmanFactionEgo_C::StatusandBarsOvr' has a wrong offset!");
static_assert(offsetof(USpatialHenchmanFactionEgo_C, StatusSwitcher) == 0x000C40, "Member 'USpatialHenchmanFactionEgo_C::StatusSwitcher' has a wrong offset!");
static_assert(offsetof(USpatialHenchmanFactionEgo_C, Text_Alter) == 0x000C48, "Member 'USpatialHenchmanFactionEgo_C::Text_Alter' has a wrong offset!");
static_assert(offsetof(USpatialHenchmanFactionEgo_C, Text_Alter_C) == 0x000C50, "Member 'USpatialHenchmanFactionEgo_C::Text_Alter_C' has a wrong offset!");
static_assert(offsetof(USpatialHenchmanFactionEgo_C, Text_Alter_R) == 0x000C58, "Member 'USpatialHenchmanFactionEgo_C::Text_Alter_R' has a wrong offset!");

}

