#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpatialFaction_FakeProgressBar

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function SpatialFaction_FakeProgressBar.SpatialFaction_FakeProgressBar_C.ExecuteUbergraph_SpatialFaction_FakeProgressBar
// 0x0088 (0x0088 - 0x0000)
struct SpatialFaction_FakeProgressBar_C_ExecuteUbergraph_SpatialFaction_FakeProgressBar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_2;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_3;                             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_4;                             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_5;                             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue;       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_6;                             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_7;                             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_2;         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_3;         // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0074(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_1;                           // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_2;                           // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_3;                           // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpatialFaction_FakeProgressBar_C_ExecuteUbergraph_SpatialFaction_FakeProgressBar) == 0x000008, "Wrong alignment on SpatialFaction_FakeProgressBar_C_ExecuteUbergraph_SpatialFaction_FakeProgressBar");
static_assert(sizeof(SpatialFaction_FakeProgressBar_C_ExecuteUbergraph_SpatialFaction_FakeProgressBar) == 0x000088, "Wrong size on SpatialFaction_FakeProgressBar_C_ExecuteUbergraph_SpatialFaction_FakeProgressBar");
static_assert(offsetof(SpatialFaction_FakeProgressBar_C_ExecuteUbergraph_SpatialFaction_FakeProgressBar, EntryPoint) == 0x000000, "Member 'SpatialFaction_FakeProgressBar_C_ExecuteUbergraph_SpatialFaction_FakeProgressBar::EntryPoint' has a wrong offset!");
static_assert(offsetof(SpatialFaction_FakeProgressBar_C_ExecuteUbergraph_SpatialFaction_FakeProgressBar, Temp_bool_Variable) == 0x000004, "Member 'SpatialFaction_FakeProgressBar_C_ExecuteUbergraph_SpatialFaction_FakeProgressBar::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SpatialFaction_FakeProgressBar_C_ExecuteUbergraph_SpatialFaction_FakeProgressBar, Temp_float_Variable) == 0x000008, "Member 'SpatialFaction_FakeProgressBar_C_ExecuteUbergraph_SpatialFaction_FakeProgressBar::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(SpatialFaction_FakeProgressBar_C_ExecuteUbergraph_SpatialFaction_FakeProgressBar, Temp_float_Variable_1) == 0x00000C, "Member 'SpatialFaction_FakeProgressBar_C_ExecuteUbergraph_SpatialFaction_FakeProgressBar::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(SpatialFaction_FakeProgressBar_C_ExecuteUbergraph_SpatialFaction_FakeProgressBar, Temp_bool_Variable_1) == 0x000010, "Member 'SpatialFaction_FakeProgressBar_C_ExecuteUbergraph_SpatialFaction_FakeProgressBar::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(SpatialFaction_FakeProgressBar_C_ExecuteUbergraph_SpatialFaction_FakeProgressBar, Temp_float_Variable_2) == 0x000014, "Member 'SpatialFaction_FakeProgressBar_C_ExecuteUbergraph_SpatialFaction_FakeProgressBar::Temp_float_Variable_2' has a wrong offset!");
static_assert(offsetof(SpatialFaction_FakeProgressBar_C_ExecuteUbergraph_SpatialFaction_FakeProgressBar, Temp_float_Variable_3) == 0x000018, "Member 'SpatialFaction_FakeProgressBar_C_ExecuteUbergraph_SpatialFaction_FakeProgressBar::Temp_float_Variable_3' has a wrong offset!");
static_assert(offsetof(SpatialFaction_FakeProgressBar_C_ExecuteUbergraph_SpatialFaction_FakeProgressBar, Temp_bool_Variable_2) == 0x00001C, "Member 'SpatialFaction_FakeProgressBar_C_ExecuteUbergraph_SpatialFaction_FakeProgressBar::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(SpatialFaction_FakeProgressBar_C_ExecuteUbergraph_SpatialFaction_FakeProgressBar, Temp_float_Variable_4) == 0x000020, "Member 'SpatialFaction_FakeProgressBar_C_ExecuteUbergraph_SpatialFaction_FakeProgressBar::Temp_float_Variable_4' has a wrong offset!");
static_assert(offsetof(SpatialFaction_FakeProgressBar_C_ExecuteUbergraph_SpatialFaction_FakeProgressBar, Temp_float_Variable_5) == 0x000024, "Member 'SpatialFaction_FakeProgressBar_C_ExecuteUbergraph_SpatialFaction_FakeProgressBar::Temp_float_Variable_5' has a wrong offset!");
static_assert(offsetof(SpatialFaction_FakeProgressBar_C_ExecuteUbergraph_SpatialFaction_FakeProgressBar, K2Node_Event_IsDesignTime) == 0x000028, "Member 'SpatialFaction_FakeProgressBar_C_ExecuteUbergraph_SpatialFaction_FakeProgressBar::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(SpatialFaction_FakeProgressBar_C_ExecuteUbergraph_SpatialFaction_FakeProgressBar, K2Node_Select_Default) == 0x00002C, "Member 'SpatialFaction_FakeProgressBar_C_ExecuteUbergraph_SpatialFaction_FakeProgressBar::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SpatialFaction_FakeProgressBar_C_ExecuteUbergraph_SpatialFaction_FakeProgressBar, CallFunc_K2_SetTimer_ReturnValue) == 0x000030, "Member 'SpatialFaction_FakeProgressBar_C_ExecuteUbergraph_SpatialFaction_FakeProgressBar::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpatialFaction_FakeProgressBar_C_ExecuteUbergraph_SpatialFaction_FakeProgressBar, CallFunc_K2_IsTimerActiveHandle_ReturnValue) == 0x000038, "Member 'SpatialFaction_FakeProgressBar_C_ExecuteUbergraph_SpatialFaction_FakeProgressBar::CallFunc_K2_IsTimerActiveHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpatialFaction_FakeProgressBar_C_ExecuteUbergraph_SpatialFaction_FakeProgressBar, Temp_float_Variable_6) == 0x00003C, "Member 'SpatialFaction_FakeProgressBar_C_ExecuteUbergraph_SpatialFaction_FakeProgressBar::Temp_float_Variable_6' has a wrong offset!");
static_assert(offsetof(SpatialFaction_FakeProgressBar_C_ExecuteUbergraph_SpatialFaction_FakeProgressBar, CallFunc_RandomFloatInRange_ReturnValue) == 0x000040, "Member 'SpatialFaction_FakeProgressBar_C_ExecuteUbergraph_SpatialFaction_FakeProgressBar::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpatialFaction_FakeProgressBar_C_ExecuteUbergraph_SpatialFaction_FakeProgressBar, Temp_float_Variable_7) == 0x000044, "Member 'SpatialFaction_FakeProgressBar_C_ExecuteUbergraph_SpatialFaction_FakeProgressBar::Temp_float_Variable_7' has a wrong offset!");
static_assert(offsetof(SpatialFaction_FakeProgressBar_C_ExecuteUbergraph_SpatialFaction_FakeProgressBar, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000048, "Member 'SpatialFaction_FakeProgressBar_C_ExecuteUbergraph_SpatialFaction_FakeProgressBar::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpatialFaction_FakeProgressBar_C_ExecuteUbergraph_SpatialFaction_FakeProgressBar, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000050, "Member 'SpatialFaction_FakeProgressBar_C_ExecuteUbergraph_SpatialFaction_FakeProgressBar::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SpatialFaction_FakeProgressBar_C_ExecuteUbergraph_SpatialFaction_FakeProgressBar, Temp_bool_Variable_3) == 0x000058, "Member 'SpatialFaction_FakeProgressBar_C_ExecuteUbergraph_SpatialFaction_FakeProgressBar::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(SpatialFaction_FakeProgressBar_C_ExecuteUbergraph_SpatialFaction_FakeProgressBar, CallFunc_GetDynamicMaterial_ReturnValue_2) == 0x000060, "Member 'SpatialFaction_FakeProgressBar_C_ExecuteUbergraph_SpatialFaction_FakeProgressBar::CallFunc_GetDynamicMaterial_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SpatialFaction_FakeProgressBar_C_ExecuteUbergraph_SpatialFaction_FakeProgressBar, CallFunc_GetDynamicMaterial_ReturnValue_3) == 0x000068, "Member 'SpatialFaction_FakeProgressBar_C_ExecuteUbergraph_SpatialFaction_FakeProgressBar::CallFunc_GetDynamicMaterial_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SpatialFaction_FakeProgressBar_C_ExecuteUbergraph_SpatialFaction_FakeProgressBar, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000070, "Member 'SpatialFaction_FakeProgressBar_C_ExecuteUbergraph_SpatialFaction_FakeProgressBar::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpatialFaction_FakeProgressBar_C_ExecuteUbergraph_SpatialFaction_FakeProgressBar, CallFunc_MakeVector2D_ReturnValue) == 0x000074, "Member 'SpatialFaction_FakeProgressBar_C_ExecuteUbergraph_SpatialFaction_FakeProgressBar::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpatialFaction_FakeProgressBar_C_ExecuteUbergraph_SpatialFaction_FakeProgressBar, K2Node_Select_Default_1) == 0x00007C, "Member 'SpatialFaction_FakeProgressBar_C_ExecuteUbergraph_SpatialFaction_FakeProgressBar::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(SpatialFaction_FakeProgressBar_C_ExecuteUbergraph_SpatialFaction_FakeProgressBar, K2Node_Select_Default_2) == 0x000080, "Member 'SpatialFaction_FakeProgressBar_C_ExecuteUbergraph_SpatialFaction_FakeProgressBar::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(SpatialFaction_FakeProgressBar_C_ExecuteUbergraph_SpatialFaction_FakeProgressBar, K2Node_Select_Default_3) == 0x000084, "Member 'SpatialFaction_FakeProgressBar_C_ExecuteUbergraph_SpatialFaction_FakeProgressBar::K2Node_Select_Default_3' has a wrong offset!");

// Function SpatialFaction_FakeProgressBar.SpatialFaction_FakeProgressBar_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct SpatialFaction_FakeProgressBar_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SpatialFaction_FakeProgressBar_C_PreConstruct) == 0x000001, "Wrong alignment on SpatialFaction_FakeProgressBar_C_PreConstruct");
static_assert(sizeof(SpatialFaction_FakeProgressBar_C_PreConstruct) == 0x000001, "Wrong size on SpatialFaction_FakeProgressBar_C_PreConstruct");
static_assert(offsetof(SpatialFaction_FakeProgressBar_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'SpatialFaction_FakeProgressBar_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function SpatialFaction_FakeProgressBar.SpatialFaction_FakeProgressBar_C.set random percentage
// 0x0010 (0x0010 - 0x0000)
struct SpatialFaction_FakeProgressBar_C_Set_random_percentage final
{
public:
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpatialFaction_FakeProgressBar_C_Set_random_percentage) == 0x000008, "Wrong alignment on SpatialFaction_FakeProgressBar_C_Set_random_percentage");
static_assert(sizeof(SpatialFaction_FakeProgressBar_C_Set_random_percentage) == 0x000010, "Wrong size on SpatialFaction_FakeProgressBar_C_Set_random_percentage");
static_assert(offsetof(SpatialFaction_FakeProgressBar_C_Set_random_percentage, CallFunc_RandomFloatInRange_ReturnValue) == 0x000000, "Member 'SpatialFaction_FakeProgressBar_C_Set_random_percentage::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpatialFaction_FakeProgressBar_C_Set_random_percentage, CallFunc_K2_SetTimer_ReturnValue) == 0x000008, "Member 'SpatialFaction_FakeProgressBar_C_Set_random_percentage::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");

// Function SpatialFaction_FakeProgressBar.SpatialFaction_FakeProgressBar_C.Increment
// 0x0020 (0x0020 - 0x0000)
struct SpatialFaction_FakeProgressBar_C_Increment final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpatialFaction_FakeProgressBar_C_Increment) == 0x000008, "Wrong alignment on SpatialFaction_FakeProgressBar_C_Increment");
static_assert(sizeof(SpatialFaction_FakeProgressBar_C_Increment) == 0x000020, "Wrong size on SpatialFaction_FakeProgressBar_C_Increment");
static_assert(offsetof(SpatialFaction_FakeProgressBar_C_Increment, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000000, "Member 'SpatialFaction_FakeProgressBar_C_Increment::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpatialFaction_FakeProgressBar_C_Increment, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000008, "Member 'SpatialFaction_FakeProgressBar_C_Increment::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SpatialFaction_FakeProgressBar_C_Increment, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000010, "Member 'SpatialFaction_FakeProgressBar_C_Increment::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpatialFaction_FakeProgressBar_C_Increment, CallFunc_Lerp_ReturnValue) == 0x000014, "Member 'SpatialFaction_FakeProgressBar_C_Increment::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpatialFaction_FakeProgressBar_C_Increment, CallFunc_Add_FloatFloat_ReturnValue) == 0x000018, "Member 'SpatialFaction_FakeProgressBar_C_Increment::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

}

