#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpatialFactionComingSoonScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SpatialFactionComingSoonScreen.SpatialFactionComingSoonScreen_C
// 0x0080 (0x02D8 - 0x0258)
class USpatialFactionComingSoonScreen_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Activation;                                        // 0x0260(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                ClassifiedTag;                                     // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Glow;                                              // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Glow_1;                                            // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Lock;                                         // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_9;                                           // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_10;                                          // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_11;                                          // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_86;                                          // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_172;                                         // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_FactionIconHeader_1;                         // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_FactionIconHeader_2;                         // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_1;                                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ScanlineOverlay;                                   // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void OnActivated();
	void ExecuteUbergraph_SpatialFactionComingSoonScreen(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SpatialFactionComingSoonScreen_C">();
	}
	static class USpatialFactionComingSoonScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpatialFactionComingSoonScreen_C>();
	}
};
static_assert(alignof(USpatialFactionComingSoonScreen_C) == 0x000008, "Wrong alignment on USpatialFactionComingSoonScreen_C");
static_assert(sizeof(USpatialFactionComingSoonScreen_C) == 0x0002D8, "Wrong size on USpatialFactionComingSoonScreen_C");
static_assert(offsetof(USpatialFactionComingSoonScreen_C, UberGraphFrame) == 0x000258, "Member 'USpatialFactionComingSoonScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USpatialFactionComingSoonScreen_C, Activation) == 0x000260, "Member 'USpatialFactionComingSoonScreen_C::Activation' has a wrong offset!");
static_assert(offsetof(USpatialFactionComingSoonScreen_C, ClassifiedTag) == 0x000268, "Member 'USpatialFactionComingSoonScreen_C::ClassifiedTag' has a wrong offset!");
static_assert(offsetof(USpatialFactionComingSoonScreen_C, Glow) == 0x000270, "Member 'USpatialFactionComingSoonScreen_C::Glow' has a wrong offset!");
static_assert(offsetof(USpatialFactionComingSoonScreen_C, Glow_1) == 0x000278, "Member 'USpatialFactionComingSoonScreen_C::Glow_1' has a wrong offset!");
static_assert(offsetof(USpatialFactionComingSoonScreen_C, Icon_Lock) == 0x000280, "Member 'USpatialFactionComingSoonScreen_C::Icon_Lock' has a wrong offset!");
static_assert(offsetof(USpatialFactionComingSoonScreen_C, Image_1) == 0x000288, "Member 'USpatialFactionComingSoonScreen_C::Image_1' has a wrong offset!");
static_assert(offsetof(USpatialFactionComingSoonScreen_C, Image_9) == 0x000290, "Member 'USpatialFactionComingSoonScreen_C::Image_9' has a wrong offset!");
static_assert(offsetof(USpatialFactionComingSoonScreen_C, Image_10) == 0x000298, "Member 'USpatialFactionComingSoonScreen_C::Image_10' has a wrong offset!");
static_assert(offsetof(USpatialFactionComingSoonScreen_C, Image_11) == 0x0002A0, "Member 'USpatialFactionComingSoonScreen_C::Image_11' has a wrong offset!");
static_assert(offsetof(USpatialFactionComingSoonScreen_C, Image_86) == 0x0002A8, "Member 'USpatialFactionComingSoonScreen_C::Image_86' has a wrong offset!");
static_assert(offsetof(USpatialFactionComingSoonScreen_C, Image_172) == 0x0002B0, "Member 'USpatialFactionComingSoonScreen_C::Image_172' has a wrong offset!");
static_assert(offsetof(USpatialFactionComingSoonScreen_C, Image_FactionIconHeader_1) == 0x0002B8, "Member 'USpatialFactionComingSoonScreen_C::Image_FactionIconHeader_1' has a wrong offset!");
static_assert(offsetof(USpatialFactionComingSoonScreen_C, Image_FactionIconHeader_2) == 0x0002C0, "Member 'USpatialFactionComingSoonScreen_C::Image_FactionIconHeader_2' has a wrong offset!");
static_assert(offsetof(USpatialFactionComingSoonScreen_C, SafeZone_1) == 0x0002C8, "Member 'USpatialFactionComingSoonScreen_C::SafeZone_1' has a wrong offset!");
static_assert(offsetof(USpatialFactionComingSoonScreen_C, ScanlineOverlay) == 0x0002D0, "Member 'USpatialFactionComingSoonScreen_C::ScanlineOverlay' has a wrong offset!");

}

