#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpatialFactionPerkTier

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function SpatialFactionPerkTier.SpatialFactionPerkTier_C.ExecuteUbergraph_SpatialFactionPerkTier
// 0x0158 (0x0158 - 0x0000)
struct SpatialFactionPerkTier_C_ExecuteUbergraph_SpatialFactionPerkTier final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PerkLevel;                            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsRevealed_1;                        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_PerkIndex;                            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0010(0x0018)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0030(0x0028)()
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0060(0x0028)()
	bool                                          K2Node_Event_bIsCurrentFactionEarned;              // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsRevealed;                          // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A[0x2];                                       // 0x008A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_FactionNumber;                        // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0098(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x00C0(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_4;                    // 0x00E8(0x0028)()
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0112(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_113[0x5];                                      // 0x0113(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_Select_Default_1;                           // 0x0130(0x0028)()
};
static_assert(alignof(SpatialFactionPerkTier_C_ExecuteUbergraph_SpatialFactionPerkTier) == 0x000008, "Wrong alignment on SpatialFactionPerkTier_C_ExecuteUbergraph_SpatialFactionPerkTier");
static_assert(sizeof(SpatialFactionPerkTier_C_ExecuteUbergraph_SpatialFactionPerkTier) == 0x000158, "Wrong size on SpatialFactionPerkTier_C_ExecuteUbergraph_SpatialFactionPerkTier");
static_assert(offsetof(SpatialFactionPerkTier_C_ExecuteUbergraph_SpatialFactionPerkTier, EntryPoint) == 0x000000, "Member 'SpatialFactionPerkTier_C_ExecuteUbergraph_SpatialFactionPerkTier::EntryPoint' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkTier_C_ExecuteUbergraph_SpatialFactionPerkTier, K2Node_Event_PerkLevel) == 0x000004, "Member 'SpatialFactionPerkTier_C_ExecuteUbergraph_SpatialFactionPerkTier::K2Node_Event_PerkLevel' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkTier_C_ExecuteUbergraph_SpatialFactionPerkTier, K2Node_Event_bIsRevealed_1) == 0x000008, "Member 'SpatialFactionPerkTier_C_ExecuteUbergraph_SpatialFactionPerkTier::K2Node_Event_bIsRevealed_1' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkTier_C_ExecuteUbergraph_SpatialFactionPerkTier, K2Node_Event_PerkIndex) == 0x00000C, "Member 'SpatialFactionPerkTier_C_ExecuteUbergraph_SpatialFactionPerkTier::K2Node_Event_PerkIndex' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkTier_C_ExecuteUbergraph_SpatialFactionPerkTier, CallFunc_Conv_IntToText_ReturnValue) == 0x000010, "Member 'SpatialFactionPerkTier_C_ExecuteUbergraph_SpatialFactionPerkTier::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkTier_C_ExecuteUbergraph_SpatialFactionPerkTier, CallFunc_Greater_IntInt_ReturnValue) == 0x000028, "Member 'SpatialFactionPerkTier_C_ExecuteUbergraph_SpatialFactionPerkTier::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkTier_C_ExecuteUbergraph_SpatialFactionPerkTier, K2Node_MakeStruct_SlateColor) == 0x000030, "Member 'SpatialFactionPerkTier_C_ExecuteUbergraph_SpatialFactionPerkTier::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkTier_C_ExecuteUbergraph_SpatialFactionPerkTier, Temp_byte_Variable) == 0x000058, "Member 'SpatialFactionPerkTier_C_ExecuteUbergraph_SpatialFactionPerkTier::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkTier_C_ExecuteUbergraph_SpatialFactionPerkTier, K2Node_MakeStruct_SlateColor_1) == 0x000060, "Member 'SpatialFactionPerkTier_C_ExecuteUbergraph_SpatialFactionPerkTier::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkTier_C_ExecuteUbergraph_SpatialFactionPerkTier, K2Node_Event_bIsCurrentFactionEarned) == 0x000088, "Member 'SpatialFactionPerkTier_C_ExecuteUbergraph_SpatialFactionPerkTier::K2Node_Event_bIsCurrentFactionEarned' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkTier_C_ExecuteUbergraph_SpatialFactionPerkTier, K2Node_Event_bIsRevealed) == 0x000089, "Member 'SpatialFactionPerkTier_C_ExecuteUbergraph_SpatialFactionPerkTier::K2Node_Event_bIsRevealed' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkTier_C_ExecuteUbergraph_SpatialFactionPerkTier, K2Node_Event_FactionNumber) == 0x00008C, "Member 'SpatialFactionPerkTier_C_ExecuteUbergraph_SpatialFactionPerkTier::K2Node_Event_FactionNumber' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkTier_C_ExecuteUbergraph_SpatialFactionPerkTier, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000090, "Member 'SpatialFactionPerkTier_C_ExecuteUbergraph_SpatialFactionPerkTier::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkTier_C_ExecuteUbergraph_SpatialFactionPerkTier, K2Node_MakeStruct_SlateColor_2) == 0x000098, "Member 'SpatialFactionPerkTier_C_ExecuteUbergraph_SpatialFactionPerkTier::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkTier_C_ExecuteUbergraph_SpatialFactionPerkTier, K2Node_MakeStruct_SlateColor_3) == 0x0000C0, "Member 'SpatialFactionPerkTier_C_ExecuteUbergraph_SpatialFactionPerkTier::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkTier_C_ExecuteUbergraph_SpatialFactionPerkTier, K2Node_MakeStruct_SlateColor_4) == 0x0000E8, "Member 'SpatialFactionPerkTier_C_ExecuteUbergraph_SpatialFactionPerkTier::K2Node_MakeStruct_SlateColor_4' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkTier_C_ExecuteUbergraph_SpatialFactionPerkTier, Temp_byte_Variable_1) == 0x000110, "Member 'SpatialFactionPerkTier_C_ExecuteUbergraph_SpatialFactionPerkTier::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkTier_C_ExecuteUbergraph_SpatialFactionPerkTier, Temp_bool_Variable) == 0x000111, "Member 'SpatialFactionPerkTier_C_ExecuteUbergraph_SpatialFactionPerkTier::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkTier_C_ExecuteUbergraph_SpatialFactionPerkTier, K2Node_Select_Default) == 0x000112, "Member 'SpatialFactionPerkTier_C_ExecuteUbergraph_SpatialFactionPerkTier::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkTier_C_ExecuteUbergraph_SpatialFactionPerkTier, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000118, "Member 'SpatialFactionPerkTier_C_ExecuteUbergraph_SpatialFactionPerkTier::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkTier_C_ExecuteUbergraph_SpatialFactionPerkTier, CallFunc_PlayAnimationForward_ReturnValue) == 0x000120, "Member 'SpatialFactionPerkTier_C_ExecuteUbergraph_SpatialFactionPerkTier::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkTier_C_ExecuteUbergraph_SpatialFactionPerkTier, Temp_bool_Variable_1) == 0x000128, "Member 'SpatialFactionPerkTier_C_ExecuteUbergraph_SpatialFactionPerkTier::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkTier_C_ExecuteUbergraph_SpatialFactionPerkTier, K2Node_Select_Default_1) == 0x000130, "Member 'SpatialFactionPerkTier_C_ExecuteUbergraph_SpatialFactionPerkTier::K2Node_Select_Default_1' has a wrong offset!");

// Function SpatialFactionPerkTier.SpatialFactionPerkTier_C.OnFactionSet
// 0x0008 (0x0008 - 0x0000)
struct SpatialFactionPerkTier_C_OnFactionSet final
{
public:
	bool                                          bIsCurrentFactionEarned;                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIsRevealed;                                       // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         FactionNumber;                                     // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpatialFactionPerkTier_C_OnFactionSet) == 0x000004, "Wrong alignment on SpatialFactionPerkTier_C_OnFactionSet");
static_assert(sizeof(SpatialFactionPerkTier_C_OnFactionSet) == 0x000008, "Wrong size on SpatialFactionPerkTier_C_OnFactionSet");
static_assert(offsetof(SpatialFactionPerkTier_C_OnFactionSet, bIsCurrentFactionEarned) == 0x000000, "Member 'SpatialFactionPerkTier_C_OnFactionSet::bIsCurrentFactionEarned' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkTier_C_OnFactionSet, bIsRevealed) == 0x000001, "Member 'SpatialFactionPerkTier_C_OnFactionSet::bIsRevealed' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkTier_C_OnFactionSet, FactionNumber) == 0x000004, "Member 'SpatialFactionPerkTier_C_OnFactionSet::FactionNumber' has a wrong offset!");

// Function SpatialFactionPerkTier.SpatialFactionPerkTier_C.OnInitializePerkTier
// 0x000C (0x000C - 0x0000)
struct SpatialFactionPerkTier_C_OnInitializePerkTier final
{
public:
	int32                                         PerkLevel;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsRevealed;                                       // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PerkIndex;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpatialFactionPerkTier_C_OnInitializePerkTier) == 0x000004, "Wrong alignment on SpatialFactionPerkTier_C_OnInitializePerkTier");
static_assert(sizeof(SpatialFactionPerkTier_C_OnInitializePerkTier) == 0x00000C, "Wrong size on SpatialFactionPerkTier_C_OnInitializePerkTier");
static_assert(offsetof(SpatialFactionPerkTier_C_OnInitializePerkTier, PerkLevel) == 0x000000, "Member 'SpatialFactionPerkTier_C_OnInitializePerkTier::PerkLevel' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkTier_C_OnInitializePerkTier, bIsRevealed) == 0x000004, "Member 'SpatialFactionPerkTier_C_OnInitializePerkTier::bIsRevealed' has a wrong offset!");
static_assert(offsetof(SpatialFactionPerkTier_C_OnInitializePerkTier, PerkIndex) == 0x000008, "Member 'SpatialFactionPerkTier_C_OnInitializePerkTier::PerkIndex' has a wrong offset!");

}

