#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpatialCustomizationSelection

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SpatialCustomizationSelection.SpatialCustomizationSelection_C
// 0x0108 (0x0508 - 0x0400)
class USpatialCustomizationSelection_C final : public UAthenaSpatialCustomizationSelection
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0400(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Switch_right;                                      // 0x0408(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Fanfare;                                           // 0x0410(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ChangeCategory;                                    // 0x0418(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_Body;                                       // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_Choice_Header;                              // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_Locked;                                     // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_UnlockUsed;                                 // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFakeStatsGraphs_C*                     FakeStatsGraphs;                                   // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_318;                                         // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_checkbox;                                    // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Fill_Left;                                   // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_FIll_Right;                                  // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_GreenCheck;                                  // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Left;                                        // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_PulseRing;                                   // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Right;                                       // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_triangles;                                   // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Choice;                                    // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Choices;                                   // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Unlocked;                                  // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   RichText_UnlockUsed;                               // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   RichText_Upgraded;                                 // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SceenSpaceTexture;                                 // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SceenSpaceTexture_2;                               // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SceenSpaceTexture_bottom;                          // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Choice;                                    // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher_CustomizationState;                       // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher_Finalize;                                 // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActivatableWidgetSwitcher*       Switcher_Selection;                                // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Preview;                                      // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SpatialCustomizationSelection(int32 EntryPoint);
	void BndEvt__Button_PreviousChoice_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__Button_NextChoice_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void OnFinalizeChoiceFinished(bool bSucceeded);
	void Play_Intro_Animation_();
	void Construct();
	void BP_OnActivated();
	void OnUpdateFinalizedText(const class FText& InFinalizedChoiceText);
	void OnCategoryUpdated(ESpatialCustomizationCategoryState CategoryState, const struct FLinearColor& Color, bool bUseColorPicker);
	void HandleCategoryUpdated(ESpatialCustomizationCategoryState State, const struct FLinearColor& Color, bool UseColorPicker);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SpatialCustomizationSelection_C">();
	}
	static class USpatialCustomizationSelection_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpatialCustomizationSelection_C>();
	}
};
static_assert(alignof(USpatialCustomizationSelection_C) == 0x000008, "Wrong alignment on USpatialCustomizationSelection_C");
static_assert(sizeof(USpatialCustomizationSelection_C) == 0x000508, "Wrong size on USpatialCustomizationSelection_C");
static_assert(offsetof(USpatialCustomizationSelection_C, UberGraphFrame) == 0x000400, "Member 'USpatialCustomizationSelection_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USpatialCustomizationSelection_C, Switch_right) == 0x000408, "Member 'USpatialCustomizationSelection_C::Switch_right' has a wrong offset!");
static_assert(offsetof(USpatialCustomizationSelection_C, Fanfare) == 0x000410, "Member 'USpatialCustomizationSelection_C::Fanfare' has a wrong offset!");
static_assert(offsetof(USpatialCustomizationSelection_C, ChangeCategory) == 0x000418, "Member 'USpatialCustomizationSelection_C::ChangeCategory' has a wrong offset!");
static_assert(offsetof(USpatialCustomizationSelection_C, Border_Body) == 0x000420, "Member 'USpatialCustomizationSelection_C::Border_Body' has a wrong offset!");
static_assert(offsetof(USpatialCustomizationSelection_C, Border_Choice_Header) == 0x000428, "Member 'USpatialCustomizationSelection_C::Border_Choice_Header' has a wrong offset!");
static_assert(offsetof(USpatialCustomizationSelection_C, Border_Locked) == 0x000430, "Member 'USpatialCustomizationSelection_C::Border_Locked' has a wrong offset!");
static_assert(offsetof(USpatialCustomizationSelection_C, Border_UnlockUsed) == 0x000438, "Member 'USpatialCustomizationSelection_C::Border_UnlockUsed' has a wrong offset!");
static_assert(offsetof(USpatialCustomizationSelection_C, FakeStatsGraphs) == 0x000440, "Member 'USpatialCustomizationSelection_C::FakeStatsGraphs' has a wrong offset!");
static_assert(offsetof(USpatialCustomizationSelection_C, Image_1) == 0x000448, "Member 'USpatialCustomizationSelection_C::Image_1' has a wrong offset!");
static_assert(offsetof(USpatialCustomizationSelection_C, Image_318) == 0x000450, "Member 'USpatialCustomizationSelection_C::Image_318' has a wrong offset!");
static_assert(offsetof(USpatialCustomizationSelection_C, Image_checkbox) == 0x000458, "Member 'USpatialCustomizationSelection_C::Image_checkbox' has a wrong offset!");
static_assert(offsetof(USpatialCustomizationSelection_C, Image_Fill_Left) == 0x000460, "Member 'USpatialCustomizationSelection_C::Image_Fill_Left' has a wrong offset!");
static_assert(offsetof(USpatialCustomizationSelection_C, Image_FIll_Right) == 0x000468, "Member 'USpatialCustomizationSelection_C::Image_FIll_Right' has a wrong offset!");
static_assert(offsetof(USpatialCustomizationSelection_C, Image_GreenCheck) == 0x000470, "Member 'USpatialCustomizationSelection_C::Image_GreenCheck' has a wrong offset!");
static_assert(offsetof(USpatialCustomizationSelection_C, Image_Left) == 0x000478, "Member 'USpatialCustomizationSelection_C::Image_Left' has a wrong offset!");
static_assert(offsetof(USpatialCustomizationSelection_C, Image_PulseRing) == 0x000480, "Member 'USpatialCustomizationSelection_C::Image_PulseRing' has a wrong offset!");
static_assert(offsetof(USpatialCustomizationSelection_C, Image_Right) == 0x000488, "Member 'USpatialCustomizationSelection_C::Image_Right' has a wrong offset!");
static_assert(offsetof(USpatialCustomizationSelection_C, Image_triangles) == 0x000490, "Member 'USpatialCustomizationSelection_C::Image_triangles' has a wrong offset!");
static_assert(offsetof(USpatialCustomizationSelection_C, Overlay_Choice) == 0x000498, "Member 'USpatialCustomizationSelection_C::Overlay_Choice' has a wrong offset!");
static_assert(offsetof(USpatialCustomizationSelection_C, Overlay_Choices) == 0x0004A0, "Member 'USpatialCustomizationSelection_C::Overlay_Choices' has a wrong offset!");
static_assert(offsetof(USpatialCustomizationSelection_C, Overlay_Unlocked) == 0x0004A8, "Member 'USpatialCustomizationSelection_C::Overlay_Unlocked' has a wrong offset!");
static_assert(offsetof(USpatialCustomizationSelection_C, RichText_UnlockUsed) == 0x0004B0, "Member 'USpatialCustomizationSelection_C::RichText_UnlockUsed' has a wrong offset!");
static_assert(offsetof(USpatialCustomizationSelection_C, RichText_Upgraded) == 0x0004B8, "Member 'USpatialCustomizationSelection_C::RichText_Upgraded' has a wrong offset!");
static_assert(offsetof(USpatialCustomizationSelection_C, SafeZone_0) == 0x0004C0, "Member 'USpatialCustomizationSelection_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(USpatialCustomizationSelection_C, SceenSpaceTexture) == 0x0004C8, "Member 'USpatialCustomizationSelection_C::SceenSpaceTexture' has a wrong offset!");
static_assert(offsetof(USpatialCustomizationSelection_C, SceenSpaceTexture_2) == 0x0004D0, "Member 'USpatialCustomizationSelection_C::SceenSpaceTexture_2' has a wrong offset!");
static_assert(offsetof(USpatialCustomizationSelection_C, SceenSpaceTexture_bottom) == 0x0004D8, "Member 'USpatialCustomizationSelection_C::SceenSpaceTexture_bottom' has a wrong offset!");
static_assert(offsetof(USpatialCustomizationSelection_C, SizeBox_Choice) == 0x0004E0, "Member 'USpatialCustomizationSelection_C::SizeBox_Choice' has a wrong offset!");
static_assert(offsetof(USpatialCustomizationSelection_C, Switcher_CustomizationState) == 0x0004E8, "Member 'USpatialCustomizationSelection_C::Switcher_CustomizationState' has a wrong offset!");
static_assert(offsetof(USpatialCustomizationSelection_C, Switcher_Finalize) == 0x0004F0, "Member 'USpatialCustomizationSelection_C::Switcher_Finalize' has a wrong offset!");
static_assert(offsetof(USpatialCustomizationSelection_C, Switcher_Selection) == 0x0004F8, "Member 'USpatialCustomizationSelection_C::Switcher_Selection' has a wrong offset!");
static_assert(offsetof(USpatialCustomizationSelection_C, Text_Preview) == 0x000500, "Member 'USpatialCustomizationSelection_C::Text_Preview' has a wrong offset!");

}

