#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpatialHenchmanFactionDetails

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SpatialHenchmanFactionDetails.SpatialHenchmanFactionDetails_C
// 0x0118 (0x03B0 - 0x0298)
class USpatialHenchmanFactionDetails_C final : public USpatialMissionActivation
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetSwitcher*                        AcceptedHeaderContentSwitcher;                     // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BGFill;                                            // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BGFill_1;                                          // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BGFill_2;                                          // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BGFill_3;                                          // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   ChangeInfo;                                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ContentHeader_Available;                           // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ContentHeader_Available_1;                         // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ContentHeader_Available_2;                         // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ContentHeader_Classified;                          // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UDynamicEntryBox*                       DynamicEntryBox_77;                                // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Lock;                                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Lock_1;                                       // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Lock_2;                                       // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Lock_3;                                       // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LeftLine;                                          // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LeftLine_1;                                        // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LeftLine_2;                                        // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LeftLine_3;                                        // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RightLine;                                         // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RightLine_1;                                       // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RightLine_2;                                       // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RightLine_3;                                       // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpatialHenchmanFactionComplete_C*      SpatialHenchmanFactionComplete;                    // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Text_FinishInfo;                                   // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Text_LockedInfo;                                   // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Alter;                                             // 0x0370(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Ego;                                               // 0x0388(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	FMulticastInlineDelegateProperty_             OnPlayAcceptedMissionAnim;                         // 0x03A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void SetVisualStateComplete();
	void SetVisualStateActive();
	void SetVisualStateClassified();
	void UpdateVisualState(EMissionState MissionState, class UFortItemDefinition* DefaultItem, class UFortItemDefinition* RewardItem, bool bIsAlter);
	void AddLockedReason(const class FText& Reason, bool bCompleted, int32 NeededCount, int32 CurrentCount);
	void ClearLockedReasons();
	void BndEvt__Button_ActivateMission_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void ExecuteUbergraph_SpatialHenchmanFactionDetails(int32 EntryPoint);
	void OnPlayAcceptedMissionAnim__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SpatialHenchmanFactionDetails_C">();
	}
	static class USpatialHenchmanFactionDetails_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpatialHenchmanFactionDetails_C>();
	}
};
static_assert(alignof(USpatialHenchmanFactionDetails_C) == 0x000008, "Wrong alignment on USpatialHenchmanFactionDetails_C");
static_assert(sizeof(USpatialHenchmanFactionDetails_C) == 0x0003B0, "Wrong size on USpatialHenchmanFactionDetails_C");
static_assert(offsetof(USpatialHenchmanFactionDetails_C, UberGraphFrame) == 0x000298, "Member 'USpatialHenchmanFactionDetails_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USpatialHenchmanFactionDetails_C, AcceptedHeaderContentSwitcher) == 0x0002A0, "Member 'USpatialHenchmanFactionDetails_C::AcceptedHeaderContentSwitcher' has a wrong offset!");
static_assert(offsetof(USpatialHenchmanFactionDetails_C, BGFill) == 0x0002A8, "Member 'USpatialHenchmanFactionDetails_C::BGFill' has a wrong offset!");
static_assert(offsetof(USpatialHenchmanFactionDetails_C, BGFill_1) == 0x0002B0, "Member 'USpatialHenchmanFactionDetails_C::BGFill_1' has a wrong offset!");
static_assert(offsetof(USpatialHenchmanFactionDetails_C, BGFill_2) == 0x0002B8, "Member 'USpatialHenchmanFactionDetails_C::BGFill_2' has a wrong offset!");
static_assert(offsetof(USpatialHenchmanFactionDetails_C, BGFill_3) == 0x0002C0, "Member 'USpatialHenchmanFactionDetails_C::BGFill_3' has a wrong offset!");
static_assert(offsetof(USpatialHenchmanFactionDetails_C, ChangeInfo) == 0x0002C8, "Member 'USpatialHenchmanFactionDetails_C::ChangeInfo' has a wrong offset!");
static_assert(offsetof(USpatialHenchmanFactionDetails_C, ContentHeader_Available) == 0x0002D0, "Member 'USpatialHenchmanFactionDetails_C::ContentHeader_Available' has a wrong offset!");
static_assert(offsetof(USpatialHenchmanFactionDetails_C, ContentHeader_Available_1) == 0x0002D8, "Member 'USpatialHenchmanFactionDetails_C::ContentHeader_Available_1' has a wrong offset!");
static_assert(offsetof(USpatialHenchmanFactionDetails_C, ContentHeader_Available_2) == 0x0002E0, "Member 'USpatialHenchmanFactionDetails_C::ContentHeader_Available_2' has a wrong offset!");
static_assert(offsetof(USpatialHenchmanFactionDetails_C, ContentHeader_Classified) == 0x0002E8, "Member 'USpatialHenchmanFactionDetails_C::ContentHeader_Classified' has a wrong offset!");
static_assert(offsetof(USpatialHenchmanFactionDetails_C, DynamicEntryBox_77) == 0x0002F0, "Member 'USpatialHenchmanFactionDetails_C::DynamicEntryBox_77' has a wrong offset!");
static_assert(offsetof(USpatialHenchmanFactionDetails_C, Icon_Lock) == 0x0002F8, "Member 'USpatialHenchmanFactionDetails_C::Icon_Lock' has a wrong offset!");
static_assert(offsetof(USpatialHenchmanFactionDetails_C, Icon_Lock_1) == 0x000300, "Member 'USpatialHenchmanFactionDetails_C::Icon_Lock_1' has a wrong offset!");
static_assert(offsetof(USpatialHenchmanFactionDetails_C, Icon_Lock_2) == 0x000308, "Member 'USpatialHenchmanFactionDetails_C::Icon_Lock_2' has a wrong offset!");
static_assert(offsetof(USpatialHenchmanFactionDetails_C, Icon_Lock_3) == 0x000310, "Member 'USpatialHenchmanFactionDetails_C::Icon_Lock_3' has a wrong offset!");
static_assert(offsetof(USpatialHenchmanFactionDetails_C, LeftLine) == 0x000318, "Member 'USpatialHenchmanFactionDetails_C::LeftLine' has a wrong offset!");
static_assert(offsetof(USpatialHenchmanFactionDetails_C, LeftLine_1) == 0x000320, "Member 'USpatialHenchmanFactionDetails_C::LeftLine_1' has a wrong offset!");
static_assert(offsetof(USpatialHenchmanFactionDetails_C, LeftLine_2) == 0x000328, "Member 'USpatialHenchmanFactionDetails_C::LeftLine_2' has a wrong offset!");
static_assert(offsetof(USpatialHenchmanFactionDetails_C, LeftLine_3) == 0x000330, "Member 'USpatialHenchmanFactionDetails_C::LeftLine_3' has a wrong offset!");
static_assert(offsetof(USpatialHenchmanFactionDetails_C, RightLine) == 0x000338, "Member 'USpatialHenchmanFactionDetails_C::RightLine' has a wrong offset!");
static_assert(offsetof(USpatialHenchmanFactionDetails_C, RightLine_1) == 0x000340, "Member 'USpatialHenchmanFactionDetails_C::RightLine_1' has a wrong offset!");
static_assert(offsetof(USpatialHenchmanFactionDetails_C, RightLine_2) == 0x000348, "Member 'USpatialHenchmanFactionDetails_C::RightLine_2' has a wrong offset!");
static_assert(offsetof(USpatialHenchmanFactionDetails_C, RightLine_3) == 0x000350, "Member 'USpatialHenchmanFactionDetails_C::RightLine_3' has a wrong offset!");
static_assert(offsetof(USpatialHenchmanFactionDetails_C, SpatialHenchmanFactionComplete) == 0x000358, "Member 'USpatialHenchmanFactionDetails_C::SpatialHenchmanFactionComplete' has a wrong offset!");
static_assert(offsetof(USpatialHenchmanFactionDetails_C, Text_FinishInfo) == 0x000360, "Member 'USpatialHenchmanFactionDetails_C::Text_FinishInfo' has a wrong offset!");
static_assert(offsetof(USpatialHenchmanFactionDetails_C, Text_LockedInfo) == 0x000368, "Member 'USpatialHenchmanFactionDetails_C::Text_LockedInfo' has a wrong offset!");
static_assert(offsetof(USpatialHenchmanFactionDetails_C, Alter) == 0x000370, "Member 'USpatialHenchmanFactionDetails_C::Alter' has a wrong offset!");
static_assert(offsetof(USpatialHenchmanFactionDetails_C, Ego) == 0x000388, "Member 'USpatialHenchmanFactionDetails_C::Ego' has a wrong offset!");
static_assert(offsetof(USpatialHenchmanFactionDetails_C, OnPlayAcceptedMissionAnim) == 0x0003A0, "Member 'USpatialHenchmanFactionDetails_C::OnPlayAcceptedMissionAnim' has a wrong offset!");

}

