#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StoreCamera_Blueprint

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass StoreCamera_Blueprint.StoreCamera_Blueprint_C
// 0x0080 (0x0840 - 0x07C0)
class AStoreCamera_Blueprint_C final : public AFortCameraBase
{
public:
	uint8                                         Pad_7B8[0x8];                                      // 0x07B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   MeshMinusDarkenBG;                                 // 0x07C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       CameraPlaceholderGround;                           // 0x07D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         ChoicePack_NewTrack_0_ACA3841D4D5084BE3482FA8EBB7CE9C0; // 0x07D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ChoicePack__Direction_ACA3841D4D5084BE3482FA8EBB7CE9C0; // 0x07DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7DD[0x3];                                      // 0x07DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     ChoicePack;                                        // 0x07E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_NewTrack_0_6555812E4B246E6144D3C99FC49F7FE9; // 0x07E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_6555812E4B246E6144D3C99FC49F7FE9; // 0x07EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7ED[0x3];                                      // 0x07ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x07F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CameraGroundLoc;                                   // 0x07F8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CameraGroundRot;                                   // 0x0804(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                CameraOriginalLoc;                                 // 0x0810(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CameraOriginalRot;                                 // 0x081C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          CameraInStartPos;                                  // 0x0828(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          MouseDown;                                         // 0x0829(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82A[0x6];                                      // 0x082A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AStorePinataMaster_Parent_C*            PinataInLevel;                                     // 0x0830(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AStoreCardReveal_Parent_C*              CardRevealInLevel;                                 // 0x0838(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void ChoicePack__FinishedFunc();
	void ChoicePack__UpdateFunc();
	void OnActivated(class AFortPlayerController* PlayerController);
	void OnDeactivated(class AFortPlayerController* PlayerController);
	void OpeningCameraTransition();
	void ResetCamera();
	void DarkenBGVisibility(bool Enable);
	void ChoicePackFOVMinusOut();
	void ChoicePackFOVMinusIn();
	void ExecuteUbergraph_StoreCamera_Blueprint(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"StoreCamera_Blueprint_C">();
	}
	static class AStoreCamera_Blueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AStoreCamera_Blueprint_C>();
	}
};
static_assert(alignof(AStoreCamera_Blueprint_C) == 0x000010, "Wrong alignment on AStoreCamera_Blueprint_C");
static_assert(sizeof(AStoreCamera_Blueprint_C) == 0x000840, "Wrong size on AStoreCamera_Blueprint_C");
static_assert(offsetof(AStoreCamera_Blueprint_C, UberGraphFrame) == 0x0007C0, "Member 'AStoreCamera_Blueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AStoreCamera_Blueprint_C, MeshMinusDarkenBG) == 0x0007C8, "Member 'AStoreCamera_Blueprint_C::MeshMinusDarkenBG' has a wrong offset!");
static_assert(offsetof(AStoreCamera_Blueprint_C, CameraPlaceholderGround) == 0x0007D0, "Member 'AStoreCamera_Blueprint_C::CameraPlaceholderGround' has a wrong offset!");
static_assert(offsetof(AStoreCamera_Blueprint_C, ChoicePack_NewTrack_0_ACA3841D4D5084BE3482FA8EBB7CE9C0) == 0x0007D8, "Member 'AStoreCamera_Blueprint_C::ChoicePack_NewTrack_0_ACA3841D4D5084BE3482FA8EBB7CE9C0' has a wrong offset!");
static_assert(offsetof(AStoreCamera_Blueprint_C, ChoicePack__Direction_ACA3841D4D5084BE3482FA8EBB7CE9C0) == 0x0007DC, "Member 'AStoreCamera_Blueprint_C::ChoicePack__Direction_ACA3841D4D5084BE3482FA8EBB7CE9C0' has a wrong offset!");
static_assert(offsetof(AStoreCamera_Blueprint_C, ChoicePack) == 0x0007E0, "Member 'AStoreCamera_Blueprint_C::ChoicePack' has a wrong offset!");
static_assert(offsetof(AStoreCamera_Blueprint_C, Timeline_0_NewTrack_0_6555812E4B246E6144D3C99FC49F7FE9) == 0x0007E8, "Member 'AStoreCamera_Blueprint_C::Timeline_0_NewTrack_0_6555812E4B246E6144D3C99FC49F7FE9' has a wrong offset!");
static_assert(offsetof(AStoreCamera_Blueprint_C, Timeline_0__Direction_6555812E4B246E6144D3C99FC49F7FE9) == 0x0007EC, "Member 'AStoreCamera_Blueprint_C::Timeline_0__Direction_6555812E4B246E6144D3C99FC49F7FE9' has a wrong offset!");
static_assert(offsetof(AStoreCamera_Blueprint_C, Timeline_0) == 0x0007F0, "Member 'AStoreCamera_Blueprint_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(AStoreCamera_Blueprint_C, CameraGroundLoc) == 0x0007F8, "Member 'AStoreCamera_Blueprint_C::CameraGroundLoc' has a wrong offset!");
static_assert(offsetof(AStoreCamera_Blueprint_C, CameraGroundRot) == 0x000804, "Member 'AStoreCamera_Blueprint_C::CameraGroundRot' has a wrong offset!");
static_assert(offsetof(AStoreCamera_Blueprint_C, CameraOriginalLoc) == 0x000810, "Member 'AStoreCamera_Blueprint_C::CameraOriginalLoc' has a wrong offset!");
static_assert(offsetof(AStoreCamera_Blueprint_C, CameraOriginalRot) == 0x00081C, "Member 'AStoreCamera_Blueprint_C::CameraOriginalRot' has a wrong offset!");
static_assert(offsetof(AStoreCamera_Blueprint_C, CameraInStartPos) == 0x000828, "Member 'AStoreCamera_Blueprint_C::CameraInStartPos' has a wrong offset!");
static_assert(offsetof(AStoreCamera_Blueprint_C, MouseDown) == 0x000829, "Member 'AStoreCamera_Blueprint_C::MouseDown' has a wrong offset!");
static_assert(offsetof(AStoreCamera_Blueprint_C, PinataInLevel) == 0x000830, "Member 'AStoreCamera_Blueprint_C::PinataInLevel' has a wrong offset!");
static_assert(offsetof(AStoreCamera_Blueprint_C, CardRevealInLevel) == 0x000838, "Member 'AStoreCamera_Blueprint_C::CardRevealInLevel' has a wrong offset!");

}

