#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StoreMain_RMT_OfferDetails

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CommonInput_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function StoreMain_RMT_OfferDetails.StoreMain_RMT_OfferDetails_C.ExecuteUbergraph_StoreMain_RMT_OfferDetails
// 0x0088 (0x0088 - 0x0000)
struct StoreMain_RMT_OfferDetails_C_ExecuteUbergraph_StoreMain_RMT_OfferDetails final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HandleUndoAction_bPassthrough;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortStoreFrontOfferInfo*               CallFunc_GetOfferInfo_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaDirectAcquisitionConfirmation_C* CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         K2Node_Event_QuantityPurchased;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPurchasedItemInfo>             K2Node_Event_PurchasedItems;                       // 0x0048(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	class FString                                 K2Node_Event_OfferId;                              // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortStoreFrontOfferInfo*               CallFunc_GetOfferInfoById_ReturnValue;             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaDirectAcquisitionOfferPurchasedOverlay_C* CallFunc_Create_ReturnValue_1;                     // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StoreMain_RMT_OfferDetails_C_ExecuteUbergraph_StoreMain_RMT_OfferDetails) == 0x000008, "Wrong alignment on StoreMain_RMT_OfferDetails_C_ExecuteUbergraph_StoreMain_RMT_OfferDetails");
static_assert(sizeof(StoreMain_RMT_OfferDetails_C_ExecuteUbergraph_StoreMain_RMT_OfferDetails) == 0x000088, "Wrong size on StoreMain_RMT_OfferDetails_C_ExecuteUbergraph_StoreMain_RMT_OfferDetails");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_ExecuteUbergraph_StoreMain_RMT_OfferDetails, EntryPoint) == 0x000000, "Member 'StoreMain_RMT_OfferDetails_C_ExecuteUbergraph_StoreMain_RMT_OfferDetails::EntryPoint' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_ExecuteUbergraph_StoreMain_RMT_OfferDetails, CallFunc_HandleUndoAction_bPassthrough) == 0x000004, "Member 'StoreMain_RMT_OfferDetails_C_ExecuteUbergraph_StoreMain_RMT_OfferDetails::CallFunc_HandleUndoAction_bPassthrough' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_ExecuteUbergraph_StoreMain_RMT_OfferDetails, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'StoreMain_RMT_OfferDetails_C_ExecuteUbergraph_StoreMain_RMT_OfferDetails::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_ExecuteUbergraph_StoreMain_RMT_OfferDetails, CallFunc_GetOfferInfo_ReturnValue) == 0x000010, "Member 'StoreMain_RMT_OfferDetails_C_ExecuteUbergraph_StoreMain_RMT_OfferDetails::CallFunc_GetOfferInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_ExecuteUbergraph_StoreMain_RMT_OfferDetails, CallFunc_Create_ReturnValue) == 0x000018, "Member 'StoreMain_RMT_OfferDetails_C_ExecuteUbergraph_StoreMain_RMT_OfferDetails::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_ExecuteUbergraph_StoreMain_RMT_OfferDetails, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'StoreMain_RMT_OfferDetails_C_ExecuteUbergraph_StoreMain_RMT_OfferDetails::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_ExecuteUbergraph_StoreMain_RMT_OfferDetails, K2Node_CreateDelegate_OutputDelegate_1) == 0x000030, "Member 'StoreMain_RMT_OfferDetails_C_ExecuteUbergraph_StoreMain_RMT_OfferDetails::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_ExecuteUbergraph_StoreMain_RMT_OfferDetails, K2Node_Event_QuantityPurchased) == 0x000040, "Member 'StoreMain_RMT_OfferDetails_C_ExecuteUbergraph_StoreMain_RMT_OfferDetails::K2Node_Event_QuantityPurchased' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_ExecuteUbergraph_StoreMain_RMT_OfferDetails, K2Node_Event_PurchasedItems) == 0x000048, "Member 'StoreMain_RMT_OfferDetails_C_ExecuteUbergraph_StoreMain_RMT_OfferDetails::K2Node_Event_PurchasedItems' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_ExecuteUbergraph_StoreMain_RMT_OfferDetails, K2Node_Event_OfferId) == 0x000058, "Member 'StoreMain_RMT_OfferDetails_C_ExecuteUbergraph_StoreMain_RMT_OfferDetails::K2Node_Event_OfferId' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_ExecuteUbergraph_StoreMain_RMT_OfferDetails, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000068, "Member 'StoreMain_RMT_OfferDetails_C_ExecuteUbergraph_StoreMain_RMT_OfferDetails::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_ExecuteUbergraph_StoreMain_RMT_OfferDetails, CallFunc_GetOfferInfoById_ReturnValue) == 0x000070, "Member 'StoreMain_RMT_OfferDetails_C_ExecuteUbergraph_StoreMain_RMT_OfferDetails::CallFunc_GetOfferInfoById_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_ExecuteUbergraph_StoreMain_RMT_OfferDetails, CallFunc_Create_ReturnValue_1) == 0x000078, "Member 'StoreMain_RMT_OfferDetails_C_ExecuteUbergraph_StoreMain_RMT_OfferDetails::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_ExecuteUbergraph_StoreMain_RMT_OfferDetails, K2Node_ComponentBoundEvent_Button) == 0x000080, "Member 'StoreMain_RMT_OfferDetails_C_ExecuteUbergraph_StoreMain_RMT_OfferDetails::K2Node_ComponentBoundEvent_Button' has a wrong offset!");

// Function StoreMain_RMT_OfferDetails.StoreMain_RMT_OfferDetails_C.BndEvt__Button_Undo_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct StoreMain_RMT_OfferDetails_C_BndEvt__Button_Undo_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StoreMain_RMT_OfferDetails_C_BndEvt__Button_Undo_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on StoreMain_RMT_OfferDetails_C_BndEvt__Button_Undo_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(StoreMain_RMT_OfferDetails_C_BndEvt__Button_Undo_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on StoreMain_RMT_OfferDetails_C_BndEvt__Button_Undo_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_BndEvt__Button_Undo_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'StoreMain_RMT_OfferDetails_C_BndEvt__Button_Undo_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function StoreMain_RMT_OfferDetails.StoreMain_RMT_OfferDetails_C.ShowPurchasedOverlay
// 0x0028 (0x0028 - 0x0000)
struct StoreMain_RMT_OfferDetails_C_ShowPurchasedOverlay final
{
public:
	int32                                         QuantityPurchased;                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPurchasedItemInfo>             PurchasedItems;                                    // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	class FString                                 OfferId;                                           // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(StoreMain_RMT_OfferDetails_C_ShowPurchasedOverlay) == 0x000008, "Wrong alignment on StoreMain_RMT_OfferDetails_C_ShowPurchasedOverlay");
static_assert(sizeof(StoreMain_RMT_OfferDetails_C_ShowPurchasedOverlay) == 0x000028, "Wrong size on StoreMain_RMT_OfferDetails_C_ShowPurchasedOverlay");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_ShowPurchasedOverlay, QuantityPurchased) == 0x000000, "Member 'StoreMain_RMT_OfferDetails_C_ShowPurchasedOverlay::QuantityPurchased' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_ShowPurchasedOverlay, PurchasedItems) == 0x000008, "Member 'StoreMain_RMT_OfferDetails_C_ShowPurchasedOverlay::PurchasedItems' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_ShowPurchasedOverlay, OfferId) == 0x000018, "Member 'StoreMain_RMT_OfferDetails_C_ShowPurchasedOverlay::OfferId' has a wrong offset!");

// Function StoreMain_RMT_OfferDetails.StoreMain_RMT_OfferDetails_C.HandleBack
// 0x0001 (0x0001 - 0x0000)
struct StoreMain_RMT_OfferDetails_C_HandleBack final
{
public:
	bool                                          PassThrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(StoreMain_RMT_OfferDetails_C_HandleBack) == 0x000001, "Wrong alignment on StoreMain_RMT_OfferDetails_C_HandleBack");
static_assert(sizeof(StoreMain_RMT_OfferDetails_C_HandleBack) == 0x000001, "Wrong size on StoreMain_RMT_OfferDetails_C_HandleBack");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_HandleBack, PassThrough) == 0x000000, "Member 'StoreMain_RMT_OfferDetails_C_HandleBack::PassThrough' has a wrong offset!");

// Function StoreMain_RMT_OfferDetails.StoreMain_RMT_OfferDetails_C.Init
// 0x00C0 (0x00C0 - 0x0000)
struct StoreMain_RMT_OfferDetails_C_Init final
{
public:
	class UFortMtxOfferData*                      DisplayAsset;                                      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F[0x1];                                        // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0010(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0028(0x0018)()
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue_1;        // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortStoreFrontOfferInfo*               CallFunc_GetOfferInfo_ReturnValue;                 // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetSalePrice_SalePrice;                   // 0x0050(0x0018)()
	bool                                          CallFunc_GetSalePrice_ReturnValue;                 // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetNormalPrice_ReturnValue;               // 0x0070(0x0018)()
	class FText                                   CallFunc_GetName_ReturnValue;                      // 0x0088(0x0018)()
	class UFortStoreFrontOfferInfo*               CallFunc_GetOfferInfo_ReturnValue_1;               // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMtxOfferData*                      CallFunc_GetOfferDisplayAsset_ReturnValue;         // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StoreMain_RMT_OfferDetails_C_Init) == 0x000008, "Wrong alignment on StoreMain_RMT_OfferDetails_C_Init");
static_assert(sizeof(StoreMain_RMT_OfferDetails_C_Init) == 0x0000C0, "Wrong size on StoreMain_RMT_OfferDetails_C_Init");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_Init, DisplayAsset) == 0x000000, "Member 'StoreMain_RMT_OfferDetails_C_Init::DisplayAsset' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_Init, Temp_bool_Variable) == 0x000008, "Member 'StoreMain_RMT_OfferDetails_C_Init::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_Init, Temp_byte_Variable) == 0x000009, "Member 'StoreMain_RMT_OfferDetails_C_Init::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_Init, Temp_byte_Variable_1) == 0x00000A, "Member 'StoreMain_RMT_OfferDetails_C_Init::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_Init, Temp_bool_Variable_1) == 0x00000B, "Member 'StoreMain_RMT_OfferDetails_C_Init::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_Init, Temp_byte_Variable_2) == 0x00000C, "Member 'StoreMain_RMT_OfferDetails_C_Init::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_Init, Temp_byte_Variable_3) == 0x00000D, "Member 'StoreMain_RMT_OfferDetails_C_Init::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_Init, CallFunc_IsValid_ReturnValue) == 0x00000E, "Member 'StoreMain_RMT_OfferDetails_C_Init::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_Init, CallFunc_MakeLiteralText_ReturnValue) == 0x000010, "Member 'StoreMain_RMT_OfferDetails_C_Init::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_Init, CallFunc_MakeLiteralText_ReturnValue_1) == 0x000028, "Member 'StoreMain_RMT_OfferDetails_C_Init::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_Init, CallFunc_EqualEqual_TextText_ReturnValue) == 0x000040, "Member 'StoreMain_RMT_OfferDetails_C_Init::CallFunc_EqualEqual_TextText_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_Init, Temp_byte_Variable_4) == 0x000041, "Member 'StoreMain_RMT_OfferDetails_C_Init::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_Init, CallFunc_EqualEqual_TextText_ReturnValue_1) == 0x000042, "Member 'StoreMain_RMT_OfferDetails_C_Init::CallFunc_EqualEqual_TextText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_Init, K2Node_Select_Default) == 0x000043, "Member 'StoreMain_RMT_OfferDetails_C_Init::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_Init, CallFunc_GetOfferInfo_ReturnValue) == 0x000048, "Member 'StoreMain_RMT_OfferDetails_C_Init::CallFunc_GetOfferInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_Init, CallFunc_GetSalePrice_SalePrice) == 0x000050, "Member 'StoreMain_RMT_OfferDetails_C_Init::CallFunc_GetSalePrice_SalePrice' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_Init, CallFunc_GetSalePrice_ReturnValue) == 0x000068, "Member 'StoreMain_RMT_OfferDetails_C_Init::CallFunc_GetSalePrice_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_Init, K2Node_Select_Default_1) == 0x000069, "Member 'StoreMain_RMT_OfferDetails_C_Init::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_Init, CallFunc_GetNormalPrice_ReturnValue) == 0x000070, "Member 'StoreMain_RMT_OfferDetails_C_Init::CallFunc_GetNormalPrice_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_Init, CallFunc_GetName_ReturnValue) == 0x000088, "Member 'StoreMain_RMT_OfferDetails_C_Init::CallFunc_GetName_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_Init, CallFunc_GetOfferInfo_ReturnValue_1) == 0x0000A0, "Member 'StoreMain_RMT_OfferDetails_C_Init::CallFunc_GetOfferInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_Init, CallFunc_GetOfferDisplayAsset_ReturnValue) == 0x0000A8, "Member 'StoreMain_RMT_OfferDetails_C_Init::CallFunc_GetOfferDisplayAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_Init, CallFunc_PlayAnimationForward_ReturnValue) == 0x0000B0, "Member 'StoreMain_RMT_OfferDetails_C_Init::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_Init, Temp_byte_Variable_5) == 0x0000B8, "Member 'StoreMain_RMT_OfferDetails_C_Init::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_Init, Temp_bool_Variable_2) == 0x0000B9, "Member 'StoreMain_RMT_OfferDetails_C_Init::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_Init, K2Node_Select_Default_2) == 0x0000BA, "Member 'StoreMain_RMT_OfferDetails_C_Init::K2Node_Select_Default_2' has a wrong offset!");

// Function StoreMain_RMT_OfferDetails.StoreMain_RMT_OfferDetails_C.RegisterInput
// 0x0020 (0x0020 - 0x0000)
struct StoreMain_RMT_OfferDetails_C_RegisterInput final
{
public:
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x0010(0x0010)(NoDestructor)
};
static_assert(alignof(StoreMain_RMT_OfferDetails_C_RegisterInput) == 0x000008, "Wrong alignment on StoreMain_RMT_OfferDetails_C_RegisterInput");
static_assert(sizeof(StoreMain_RMT_OfferDetails_C_RegisterInput) == 0x000020, "Wrong size on StoreMain_RMT_OfferDetails_C_RegisterInput");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_RegisterInput, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'StoreMain_RMT_OfferDetails_C_RegisterInput::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_RegisterInput, K2Node_MakeStruct_DataTableRowHandle) == 0x000010, "Member 'StoreMain_RMT_OfferDetails_C_RegisterInput::K2Node_MakeStruct_DataTableRowHandle' has a wrong offset!");

// Function StoreMain_RMT_OfferDetails.StoreMain_RMT_OfferDetails_C.InitCurrency
// 0x0088 (0x0088 - 0x0000)
struct StoreMain_RMT_OfferDetails_C_InitCurrency final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortStoreFrontOfferInfo*               CallFunc_GetOfferInfo_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortStoreFrontOfferInfo*               CallFunc_GetOfferInfo_ReturnValue_1;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetBonusQuantity_ReturnValue;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTotalQuantity_ReturnValue;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortStoreFrontOfferInfo*               CallFunc_GetOfferInfo_ReturnValue_2;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortStoreFrontOfferInfo*               CallFunc_GetOfferInfo_ReturnValue_3;               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetBonusQuantity_ReturnValue_1;           // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTotalQuantity_ReturnValue_1;           // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0048(0x0018)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetBaseQuantity_ReturnValue;              // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0068(0x0018)()
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StoreMain_RMT_OfferDetails_C_InitCurrency) == 0x000008, "Wrong alignment on StoreMain_RMT_OfferDetails_C_InitCurrency");
static_assert(sizeof(StoreMain_RMT_OfferDetails_C_InitCurrency) == 0x000088, "Wrong size on StoreMain_RMT_OfferDetails_C_InitCurrency");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_InitCurrency, Temp_byte_Variable) == 0x000000, "Member 'StoreMain_RMT_OfferDetails_C_InitCurrency::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_InitCurrency, Temp_byte_Variable_1) == 0x000001, "Member 'StoreMain_RMT_OfferDetails_C_InitCurrency::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_InitCurrency, Temp_bool_Variable) == 0x000002, "Member 'StoreMain_RMT_OfferDetails_C_InitCurrency::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_InitCurrency, Temp_byte_Variable_2) == 0x000003, "Member 'StoreMain_RMT_OfferDetails_C_InitCurrency::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_InitCurrency, Temp_byte_Variable_3) == 0x000004, "Member 'StoreMain_RMT_OfferDetails_C_InitCurrency::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_InitCurrency, Temp_bool_Variable_1) == 0x000005, "Member 'StoreMain_RMT_OfferDetails_C_InitCurrency::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_InitCurrency, Temp_byte_Variable_4) == 0x000006, "Member 'StoreMain_RMT_OfferDetails_C_InitCurrency::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_InitCurrency, Temp_byte_Variable_5) == 0x000007, "Member 'StoreMain_RMT_OfferDetails_C_InitCurrency::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_InitCurrency, Temp_bool_Variable_2) == 0x000008, "Member 'StoreMain_RMT_OfferDetails_C_InitCurrency::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_InitCurrency, CallFunc_GetOfferInfo_ReturnValue) == 0x000010, "Member 'StoreMain_RMT_OfferDetails_C_InitCurrency::CallFunc_GetOfferInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_InitCurrency, CallFunc_GetOfferInfo_ReturnValue_1) == 0x000018, "Member 'StoreMain_RMT_OfferDetails_C_InitCurrency::CallFunc_GetOfferInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_InitCurrency, CallFunc_GetBonusQuantity_ReturnValue) == 0x000020, "Member 'StoreMain_RMT_OfferDetails_C_InitCurrency::CallFunc_GetBonusQuantity_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_InitCurrency, CallFunc_GetTotalQuantity_ReturnValue) == 0x000024, "Member 'StoreMain_RMT_OfferDetails_C_InitCurrency::CallFunc_GetTotalQuantity_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_InitCurrency, CallFunc_Greater_IntInt_ReturnValue) == 0x000028, "Member 'StoreMain_RMT_OfferDetails_C_InitCurrency::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_InitCurrency, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000029, "Member 'StoreMain_RMT_OfferDetails_C_InitCurrency::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_InitCurrency, K2Node_Select_Default) == 0x00002A, "Member 'StoreMain_RMT_OfferDetails_C_InitCurrency::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_InitCurrency, K2Node_Select_Default_1) == 0x00002B, "Member 'StoreMain_RMT_OfferDetails_C_InitCurrency::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_InitCurrency, CallFunc_GetOfferInfo_ReturnValue_2) == 0x000030, "Member 'StoreMain_RMT_OfferDetails_C_InitCurrency::CallFunc_GetOfferInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_InitCurrency, CallFunc_GetOfferInfo_ReturnValue_3) == 0x000038, "Member 'StoreMain_RMT_OfferDetails_C_InitCurrency::CallFunc_GetOfferInfo_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_InitCurrency, CallFunc_GetBonusQuantity_ReturnValue_1) == 0x000040, "Member 'StoreMain_RMT_OfferDetails_C_InitCurrency::CallFunc_GetBonusQuantity_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_InitCurrency, CallFunc_GetTotalQuantity_ReturnValue_1) == 0x000044, "Member 'StoreMain_RMT_OfferDetails_C_InitCurrency::CallFunc_GetTotalQuantity_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_InitCurrency, CallFunc_Conv_IntToText_ReturnValue) == 0x000048, "Member 'StoreMain_RMT_OfferDetails_C_InitCurrency::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_InitCurrency, CallFunc_Greater_IntInt_ReturnValue_2) == 0x000060, "Member 'StoreMain_RMT_OfferDetails_C_InitCurrency::CallFunc_Greater_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_InitCurrency, CallFunc_GetBaseQuantity_ReturnValue) == 0x000064, "Member 'StoreMain_RMT_OfferDetails_C_InitCurrency::CallFunc_GetBaseQuantity_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_InitCurrency, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000068, "Member 'StoreMain_RMT_OfferDetails_C_InitCurrency::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_InitCurrency, K2Node_Select_Default_2) == 0x000080, "Member 'StoreMain_RMT_OfferDetails_C_InitCurrency::K2Node_Select_Default_2' has a wrong offset!");

// Function StoreMain_RMT_OfferDetails.StoreMain_RMT_OfferDetails_C.IsGiftingStorefrontOffer
// 0x0018 (0x0018 - 0x0000)
struct StoreMain_RMT_OfferDetails_C_IsGiftingStorefrontOffer final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortStoreFrontOfferInfo*               CallFunc_GetOfferInfo_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGiftingStorefrontOffer_ReturnValue;     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(StoreMain_RMT_OfferDetails_C_IsGiftingStorefrontOffer) == 0x000008, "Wrong alignment on StoreMain_RMT_OfferDetails_C_IsGiftingStorefrontOffer");
static_assert(sizeof(StoreMain_RMT_OfferDetails_C_IsGiftingStorefrontOffer) == 0x000018, "Wrong size on StoreMain_RMT_OfferDetails_C_IsGiftingStorefrontOffer");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_IsGiftingStorefrontOffer, ReturnValue) == 0x000000, "Member 'StoreMain_RMT_OfferDetails_C_IsGiftingStorefrontOffer::ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_IsGiftingStorefrontOffer, CallFunc_GetOfferInfo_ReturnValue) == 0x000008, "Member 'StoreMain_RMT_OfferDetails_C_IsGiftingStorefrontOffer::CallFunc_GetOfferInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_IsGiftingStorefrontOffer, CallFunc_IsGiftingStorefrontOffer_ReturnValue) == 0x000010, "Member 'StoreMain_RMT_OfferDetails_C_IsGiftingStorefrontOffer::CallFunc_IsGiftingStorefrontOffer_ReturnValue' has a wrong offset!");

// Function StoreMain_RMT_OfferDetails.StoreMain_RMT_OfferDetails_C.SetPurchaseButtonText
// 0x0028 (0x0028 - 0x0000)
struct StoreMain_RMT_OfferDetails_C_SetPurchaseButtonText final
{
public:
	class FText                                   ButtonText;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UIconTextButton_C*                      K2Node_DynamicCast_AsIcon_Text_Button;             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(StoreMain_RMT_OfferDetails_C_SetPurchaseButtonText) == 0x000008, "Wrong alignment on StoreMain_RMT_OfferDetails_C_SetPurchaseButtonText");
static_assert(sizeof(StoreMain_RMT_OfferDetails_C_SetPurchaseButtonText) == 0x000028, "Wrong size on StoreMain_RMT_OfferDetails_C_SetPurchaseButtonText");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_SetPurchaseButtonText, ButtonText) == 0x000000, "Member 'StoreMain_RMT_OfferDetails_C_SetPurchaseButtonText::ButtonText' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_SetPurchaseButtonText, K2Node_DynamicCast_AsIcon_Text_Button) == 0x000018, "Member 'StoreMain_RMT_OfferDetails_C_SetPurchaseButtonText::K2Node_DynamicCast_AsIcon_Text_Button' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_SetPurchaseButtonText, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'StoreMain_RMT_OfferDetails_C_SetPurchaseButtonText::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function StoreMain_RMT_OfferDetails.StoreMain_RMT_OfferDetails_C.InitDetailAttributes
// 0x0080 (0x0080 - 0x0000)
struct StoreMain_RMT_OfferDetails_C_InitDetailAttributes final
{
public:
	struct FLinearColor                           TertiaryColor;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortStoreFrontOfferInfo*               CallFunc_GetOfferInfo_ReturnValue;                 // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMtxOfferData*                      CallFunc_GetOfferDisplayAsset_ReturnValue;         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URMT_Offer_EntryRow_C*                  CallFunc_Create_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortMtxDetailsAttribute               CallFunc_Array_Get_Item;                           // 0x0040(0x0030)()
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(StoreMain_RMT_OfferDetails_C_InitDetailAttributes) == 0x000008, "Wrong alignment on StoreMain_RMT_OfferDetails_C_InitDetailAttributes");
static_assert(sizeof(StoreMain_RMT_OfferDetails_C_InitDetailAttributes) == 0x000080, "Wrong size on StoreMain_RMT_OfferDetails_C_InitDetailAttributes");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_InitDetailAttributes, TertiaryColor) == 0x000000, "Member 'StoreMain_RMT_OfferDetails_C_InitDetailAttributes::TertiaryColor' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_InitDetailAttributes, Temp_int_Array_Index_Variable) == 0x000010, "Member 'StoreMain_RMT_OfferDetails_C_InitDetailAttributes::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_InitDetailAttributes, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'StoreMain_RMT_OfferDetails_C_InitDetailAttributes::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_InitDetailAttributes, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'StoreMain_RMT_OfferDetails_C_InitDetailAttributes::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_InitDetailAttributes, CallFunc_GetOfferInfo_ReturnValue) == 0x000020, "Member 'StoreMain_RMT_OfferDetails_C_InitDetailAttributes::CallFunc_GetOfferInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_InitDetailAttributes, CallFunc_GetOfferDisplayAsset_ReturnValue) == 0x000028, "Member 'StoreMain_RMT_OfferDetails_C_InitDetailAttributes::CallFunc_GetOfferDisplayAsset_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_InitDetailAttributes, CallFunc_GetOwningPlayer_ReturnValue) == 0x000030, "Member 'StoreMain_RMT_OfferDetails_C_InitDetailAttributes::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_InitDetailAttributes, CallFunc_Create_ReturnValue) == 0x000038, "Member 'StoreMain_RMT_OfferDetails_C_InitDetailAttributes::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_InitDetailAttributes, CallFunc_Array_Get_Item) == 0x000040, "Member 'StoreMain_RMT_OfferDetails_C_InitDetailAttributes::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_InitDetailAttributes, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000070, "Member 'StoreMain_RMT_OfferDetails_C_InitDetailAttributes::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_InitDetailAttributes, CallFunc_Array_Length_ReturnValue) == 0x000078, "Member 'StoreMain_RMT_OfferDetails_C_InitDetailAttributes::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_InitDetailAttributes, CallFunc_Less_IntInt_ReturnValue) == 0x00007C, "Member 'StoreMain_RMT_OfferDetails_C_InitDetailAttributes::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function StoreMain_RMT_OfferDetails.StoreMain_RMT_OfferDetails_C.UpdatePurchaseButton
// 0x0088 (0x0088 - 0x0000)
struct StoreMain_RMT_OfferDetails_C_UpdatePurchaseButton final
{
public:
	bool                                          IsOwned;                                           // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          MtxPrice;                                          // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PriceIndex;                                        // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0020(0x0018)()
	bool                                          Temp_bool_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UIconTextButton_C*                      K2Node_DynamicCast_AsIcon_Text_Button;             // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanPurchaseMtxPriceOffer_ReturnValue;     // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0050(0x0018)()
	class UCommonInputSubsystem*                  CallFunc_GetContext_ReturnValue;                   // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortStoreFrontOfferInfo*               CallFunc_GetOfferInfo_ReturnValue;                 // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPriceInMTX_ReturnValue;                 // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AreGrantedItemsOwned_ReturnValue;         // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(StoreMain_RMT_OfferDetails_C_UpdatePurchaseButton) == 0x000008, "Wrong alignment on StoreMain_RMT_OfferDetails_C_UpdatePurchaseButton");
static_assert(sizeof(StoreMain_RMT_OfferDetails_C_UpdatePurchaseButton) == 0x000088, "Wrong size on StoreMain_RMT_OfferDetails_C_UpdatePurchaseButton");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_UpdatePurchaseButton, IsOwned) == 0x000000, "Member 'StoreMain_RMT_OfferDetails_C_UpdatePurchaseButton::IsOwned' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_UpdatePurchaseButton, MtxPrice) == 0x000001, "Member 'StoreMain_RMT_OfferDetails_C_UpdatePurchaseButton::MtxPrice' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_UpdatePurchaseButton, PriceIndex) == 0x000004, "Member 'StoreMain_RMT_OfferDetails_C_UpdatePurchaseButton::PriceIndex' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_UpdatePurchaseButton, Temp_text_Variable) == 0x000008, "Member 'StoreMain_RMT_OfferDetails_C_UpdatePurchaseButton::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_UpdatePurchaseButton, Temp_text_Variable_1) == 0x000020, "Member 'StoreMain_RMT_OfferDetails_C_UpdatePurchaseButton::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_UpdatePurchaseButton, Temp_bool_Variable) == 0x000038, "Member 'StoreMain_RMT_OfferDetails_C_UpdatePurchaseButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_UpdatePurchaseButton, K2Node_DynamicCast_AsIcon_Text_Button) == 0x000040, "Member 'StoreMain_RMT_OfferDetails_C_UpdatePurchaseButton::K2Node_DynamicCast_AsIcon_Text_Button' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_UpdatePurchaseButton, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'StoreMain_RMT_OfferDetails_C_UpdatePurchaseButton::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_UpdatePurchaseButton, CallFunc_CanPurchaseMtxPriceOffer_ReturnValue) == 0x000049, "Member 'StoreMain_RMT_OfferDetails_C_UpdatePurchaseButton::CallFunc_CanPurchaseMtxPriceOffer_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_UpdatePurchaseButton, K2Node_Select_Default) == 0x000050, "Member 'StoreMain_RMT_OfferDetails_C_UpdatePurchaseButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_UpdatePurchaseButton, CallFunc_GetContext_ReturnValue) == 0x000068, "Member 'StoreMain_RMT_OfferDetails_C_UpdatePurchaseButton::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_UpdatePurchaseButton, CallFunc_GetCurrentInputType_ReturnValue) == 0x000070, "Member 'StoreMain_RMT_OfferDetails_C_UpdatePurchaseButton::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_UpdatePurchaseButton, CallFunc_GetOfferInfo_ReturnValue) == 0x000078, "Member 'StoreMain_RMT_OfferDetails_C_UpdatePurchaseButton::CallFunc_GetOfferInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_UpdatePurchaseButton, CallFunc_IsPriceInMTX_ReturnValue) == 0x000080, "Member 'StoreMain_RMT_OfferDetails_C_UpdatePurchaseButton::CallFunc_IsPriceInMTX_ReturnValue' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_UpdatePurchaseButton, CallFunc_AreGrantedItemsOwned_ReturnValue) == 0x000081, "Member 'StoreMain_RMT_OfferDetails_C_UpdatePurchaseButton::CallFunc_AreGrantedItemsOwned_ReturnValue' has a wrong offset!");

// Function StoreMain_RMT_OfferDetails.StoreMain_RMT_OfferDetails_C.Set colors from data Asset
// 0x0888 (0x0888 - 0x0000)
struct StoreMain_RMT_OfferDetails_C_Set_colors_from_data_Asset final
{
public:
	struct FLinearColor                           Upsell_Primary;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Upsell_Secondary;                                  // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Text_Color;                                        // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Use_Base_Color;                                    // 0x0030(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Background;                                        // 0x0034(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Gradient;                                          // 0x0044(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0058(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0080(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x00A8(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x00D0(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_4;                    // 0x00F8(0x0028)()
	float                                         CallFunc_BreakColor_R;                             // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G;                             // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B;                             // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A;                             // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0130(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_5;                    // 0x0140(0x0028)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0168(0x0088)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_1;                    // 0x01F0(0x0088)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_2;                    // 0x0278(0x0088)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_3;                    // 0x0300(0x0088)()
	struct FScrollBarStyle                        K2Node_MakeStruct_ScrollBarStyle;                  // 0x0388(0x04D0)()
	bool                                          Temp_bool_Variable;                                // 0x0858(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0859(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85A[0x2];                                      // 0x085A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x085C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x086C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_87C[0x4];                                      // 0x087C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0880(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StoreMain_RMT_OfferDetails_C_Set_colors_from_data_Asset) == 0x000008, "Wrong alignment on StoreMain_RMT_OfferDetails_C_Set_colors_from_data_Asset");
static_assert(sizeof(StoreMain_RMT_OfferDetails_C_Set_colors_from_data_Asset) == 0x000888, "Wrong size on StoreMain_RMT_OfferDetails_C_Set_colors_from_data_Asset");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_Set_colors_from_data_Asset, Upsell_Primary) == 0x000000, "Member 'StoreMain_RMT_OfferDetails_C_Set_colors_from_data_Asset::Upsell_Primary' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_Set_colors_from_data_Asset, Upsell_Secondary) == 0x000010, "Member 'StoreMain_RMT_OfferDetails_C_Set_colors_from_data_Asset::Upsell_Secondary' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_Set_colors_from_data_Asset, Text_Color) == 0x000020, "Member 'StoreMain_RMT_OfferDetails_C_Set_colors_from_data_Asset::Text_Color' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_Set_colors_from_data_Asset, Use_Base_Color) == 0x000030, "Member 'StoreMain_RMT_OfferDetails_C_Set_colors_from_data_Asset::Use_Base_Color' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_Set_colors_from_data_Asset, Background) == 0x000034, "Member 'StoreMain_RMT_OfferDetails_C_Set_colors_from_data_Asset::Background' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_Set_colors_from_data_Asset, Gradient) == 0x000044, "Member 'StoreMain_RMT_OfferDetails_C_Set_colors_from_data_Asset::Gradient' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_Set_colors_from_data_Asset, K2Node_MakeStruct_SlateColor) == 0x000058, "Member 'StoreMain_RMT_OfferDetails_C_Set_colors_from_data_Asset::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_Set_colors_from_data_Asset, K2Node_MakeStruct_SlateColor_1) == 0x000080, "Member 'StoreMain_RMT_OfferDetails_C_Set_colors_from_data_Asset::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_Set_colors_from_data_Asset, K2Node_MakeStruct_SlateColor_2) == 0x0000A8, "Member 'StoreMain_RMT_OfferDetails_C_Set_colors_from_data_Asset::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_Set_colors_from_data_Asset, K2Node_MakeStruct_SlateColor_3) == 0x0000D0, "Member 'StoreMain_RMT_OfferDetails_C_Set_colors_from_data_Asset::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_Set_colors_from_data_Asset, K2Node_MakeStruct_SlateColor_4) == 0x0000F8, "Member 'StoreMain_RMT_OfferDetails_C_Set_colors_from_data_Asset::K2Node_MakeStruct_SlateColor_4' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_Set_colors_from_data_Asset, CallFunc_BreakColor_R) == 0x000120, "Member 'StoreMain_RMT_OfferDetails_C_Set_colors_from_data_Asset::CallFunc_BreakColor_R' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_Set_colors_from_data_Asset, CallFunc_BreakColor_G) == 0x000124, "Member 'StoreMain_RMT_OfferDetails_C_Set_colors_from_data_Asset::CallFunc_BreakColor_G' has a wrong offset!");
static_assert(offsetof(StoreMain_RMT_OfferDetails_C_Set_colors_from_data_Asset, CallFunc_BreakColor_B) == 0x000128, "Member 'StoreMain_RMT_OfferDetails_C_Set_colors_from_data_Asset::CallFunc_BreakColor_B' has a wrong offset!");
