#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ToastDisplayArea

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function ToastDisplayArea.ToastDisplayArea_C.OnDisplayToast
// 0x0008 (0x0008 - 0x0000)
struct ToastDisplayArea_C_OnDisplayToast final
{
public:
	class UFortUINotification*                    NewToast;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ToastDisplayArea_C_OnDisplayToast) == 0x000008, "Wrong alignment on ToastDisplayArea_C_OnDisplayToast");
static_assert(sizeof(ToastDisplayArea_C_OnDisplayToast) == 0x000008, "Wrong size on ToastDisplayArea_C_OnDisplayToast");
static_assert(offsetof(ToastDisplayArea_C_OnDisplayToast, NewToast) == 0x000000, "Member 'ToastDisplayArea_C_OnDisplayToast::NewToast' has a wrong offset!");

// Function ToastDisplayArea.ToastDisplayArea_C.ExecuteUbergraph_ToastDisplayArea
// 0x0068 (0x0068 - 0x0000)
struct ToastDisplayArea_C_ExecuteUbergraph_ToastDisplayArea final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUINotification*                    K2Node_Event_NewToast;                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UToastWidget_New_C*                     K2Node_DynamicCast_AsToast_Widget_New;             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UToastWidget_MinorError_C*              K2Node_DynamicCast_AsToast_Widget_Minor_Error;     // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_ByteByte_ReturnValue;           // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPlayerPowerRatingToast*            K2Node_DynamicCast_AsFort_Player_Power_Rating_Toast; // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESubGame                                      CallFunc_GetSubGame_ReturnValue;                   // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_ByteByte_ReturnValue_1;         // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_56[0x2];                                       // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UToastWidgetDonut_C*                    K2Node_DynamicCast_AsToast_Widget_Donut;           // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ToastDisplayArea_C_ExecuteUbergraph_ToastDisplayArea) == 0x000008, "Wrong alignment on ToastDisplayArea_C_ExecuteUbergraph_ToastDisplayArea");
static_assert(sizeof(ToastDisplayArea_C_ExecuteUbergraph_ToastDisplayArea) == 0x000068, "Wrong size on ToastDisplayArea_C_ExecuteUbergraph_ToastDisplayArea");
static_assert(offsetof(ToastDisplayArea_C_ExecuteUbergraph_ToastDisplayArea, EntryPoint) == 0x000000, "Member 'ToastDisplayArea_C_ExecuteUbergraph_ToastDisplayArea::EntryPoint' has a wrong offset!");
static_assert(offsetof(ToastDisplayArea_C_ExecuteUbergraph_ToastDisplayArea, K2Node_Event_NewToast) == 0x000008, "Member 'ToastDisplayArea_C_ExecuteUbergraph_ToastDisplayArea::K2Node_Event_NewToast' has a wrong offset!");
static_assert(offsetof(ToastDisplayArea_C_ExecuteUbergraph_ToastDisplayArea, CallFunc_MakeLiteralByte_ReturnValue) == 0x000010, "Member 'ToastDisplayArea_C_ExecuteUbergraph_ToastDisplayArea::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastDisplayArea_C_ExecuteUbergraph_ToastDisplayArea, K2Node_SwitchEnum_CmpSuccess) == 0x000011, "Member 'ToastDisplayArea_C_ExecuteUbergraph_ToastDisplayArea::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ToastDisplayArea_C_ExecuteUbergraph_ToastDisplayArea, K2Node_DynamicCast_AsToast_Widget_New) == 0x000018, "Member 'ToastDisplayArea_C_ExecuteUbergraph_ToastDisplayArea::K2Node_DynamicCast_AsToast_Widget_New' has a wrong offset!");
static_assert(offsetof(ToastDisplayArea_C_ExecuteUbergraph_ToastDisplayArea, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'ToastDisplayArea_C_ExecuteUbergraph_ToastDisplayArea::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ToastDisplayArea_C_ExecuteUbergraph_ToastDisplayArea, K2Node_DynamicCast_AsToast_Widget_Minor_Error) == 0x000028, "Member 'ToastDisplayArea_C_ExecuteUbergraph_ToastDisplayArea::K2Node_DynamicCast_AsToast_Widget_Minor_Error' has a wrong offset!");
static_assert(offsetof(ToastDisplayArea_C_ExecuteUbergraph_ToastDisplayArea, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'ToastDisplayArea_C_ExecuteUbergraph_ToastDisplayArea::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ToastDisplayArea_C_ExecuteUbergraph_ToastDisplayArea, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000031, "Member 'ToastDisplayArea_C_ExecuteUbergraph_ToastDisplayArea::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ToastDisplayArea_C_ExecuteUbergraph_ToastDisplayArea, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000032, "Member 'ToastDisplayArea_C_ExecuteUbergraph_ToastDisplayArea::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastDisplayArea_C_ExecuteUbergraph_ToastDisplayArea, CallFunc_LessEqual_ByteByte_ReturnValue) == 0x000033, "Member 'ToastDisplayArea_C_ExecuteUbergraph_ToastDisplayArea::CallFunc_LessEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastDisplayArea_C_ExecuteUbergraph_ToastDisplayArea, CallFunc_BooleanAND_ReturnValue) == 0x000034, "Member 'ToastDisplayArea_C_ExecuteUbergraph_ToastDisplayArea::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastDisplayArea_C_ExecuteUbergraph_ToastDisplayArea, K2Node_DynamicCast_AsFort_Player_Power_Rating_Toast) == 0x000038, "Member 'ToastDisplayArea_C_ExecuteUbergraph_ToastDisplayArea::K2Node_DynamicCast_AsFort_Player_Power_Rating_Toast' has a wrong offset!");
static_assert(offsetof(ToastDisplayArea_C_ExecuteUbergraph_ToastDisplayArea, K2Node_DynamicCast_bSuccess_2) == 0x000040, "Member 'ToastDisplayArea_C_ExecuteUbergraph_ToastDisplayArea::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(ToastDisplayArea_C_ExecuteUbergraph_ToastDisplayArea, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000041, "Member 'ToastDisplayArea_C_ExecuteUbergraph_ToastDisplayArea::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ToastDisplayArea_C_ExecuteUbergraph_ToastDisplayArea, CallFunc_GetContext_ReturnValue) == 0x000048, "Member 'ToastDisplayArea_C_ExecuteUbergraph_ToastDisplayArea::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastDisplayArea_C_ExecuteUbergraph_ToastDisplayArea, CallFunc_GetSubGame_ReturnValue) == 0x000050, "Member 'ToastDisplayArea_C_ExecuteUbergraph_ToastDisplayArea::CallFunc_GetSubGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastDisplayArea_C_ExecuteUbergraph_ToastDisplayArea, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000051, "Member 'ToastDisplayArea_C_ExecuteUbergraph_ToastDisplayArea::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ToastDisplayArea_C_ExecuteUbergraph_ToastDisplayArea, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000052, "Member 'ToastDisplayArea_C_ExecuteUbergraph_ToastDisplayArea::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ToastDisplayArea_C_ExecuteUbergraph_ToastDisplayArea, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x000053, "Member 'ToastDisplayArea_C_ExecuteUbergraph_ToastDisplayArea::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ToastDisplayArea_C_ExecuteUbergraph_ToastDisplayArea, CallFunc_LessEqual_ByteByte_ReturnValue_1) == 0x000054, "Member 'ToastDisplayArea_C_ExecuteUbergraph_ToastDisplayArea::CallFunc_LessEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ToastDisplayArea_C_ExecuteUbergraph_ToastDisplayArea, CallFunc_BooleanAND_ReturnValue_1) == 0x000055, "Member 'ToastDisplayArea_C_ExecuteUbergraph_ToastDisplayArea::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ToastDisplayArea_C_ExecuteUbergraph_ToastDisplayArea, K2Node_DynamicCast_AsToast_Widget_Donut) == 0x000058, "Member 'ToastDisplayArea_C_ExecuteUbergraph_ToastDisplayArea::K2Node_DynamicCast_AsToast_Widget_Donut' has a wrong offset!");
static_assert(offsetof(ToastDisplayArea_C_ExecuteUbergraph_ToastDisplayArea, K2Node_DynamicCast_bSuccess_3) == 0x000060, "Member 'ToastDisplayArea_C_ExecuteUbergraph_ToastDisplayArea::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");

}

