#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VoiceChannelSettings

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass VoiceChannelSettings.VoiceChannelSettings_C
// 0x0058 (0x02F8 - 0x02A0)
class UVoiceChannelSettings_C final : public UFortVoiceSettingsDisplay
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       GearHover;                                         // 0x02A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonActionWidget*                    ActionWidget_InputDisplay;                         // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 GearIcon;                                          // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   InputDevice;                                       // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   OutputDevice;                                      // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UKeybindWidget_C*                       PTTKeybindWidget;                                  // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   PushToTalk;                                        // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   SettingsTitle;                                     // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 VoiceDisabledIcon;                                 // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   VoiceDisabledText;                                 // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_VoiceChannelSettings(int32 EntryPoint);
	void BndEvt__Button_GearIcon_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__Button_OpenSettings_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__Button_GearIcon_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"VoiceChannelSettings_C">();
	}
	static class UVoiceChannelSettings_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoiceChannelSettings_C>();
	}
};
static_assert(alignof(UVoiceChannelSettings_C) == 0x000008, "Wrong alignment on UVoiceChannelSettings_C");
static_assert(sizeof(UVoiceChannelSettings_C) == 0x0002F8, "Wrong size on UVoiceChannelSettings_C");
static_assert(offsetof(UVoiceChannelSettings_C, UberGraphFrame) == 0x0002A0, "Member 'UVoiceChannelSettings_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UVoiceChannelSettings_C, GearHover) == 0x0002A8, "Member 'UVoiceChannelSettings_C::GearHover' has a wrong offset!");
static_assert(offsetof(UVoiceChannelSettings_C, ActionWidget_InputDisplay) == 0x0002B0, "Member 'UVoiceChannelSettings_C::ActionWidget_InputDisplay' has a wrong offset!");
static_assert(offsetof(UVoiceChannelSettings_C, GearIcon) == 0x0002B8, "Member 'UVoiceChannelSettings_C::GearIcon' has a wrong offset!");
static_assert(offsetof(UVoiceChannelSettings_C, InputDevice) == 0x0002C0, "Member 'UVoiceChannelSettings_C::InputDevice' has a wrong offset!");
static_assert(offsetof(UVoiceChannelSettings_C, OutputDevice) == 0x0002C8, "Member 'UVoiceChannelSettings_C::OutputDevice' has a wrong offset!");
static_assert(offsetof(UVoiceChannelSettings_C, PTTKeybindWidget) == 0x0002D0, "Member 'UVoiceChannelSettings_C::PTTKeybindWidget' has a wrong offset!");
static_assert(offsetof(UVoiceChannelSettings_C, PushToTalk) == 0x0002D8, "Member 'UVoiceChannelSettings_C::PushToTalk' has a wrong offset!");
static_assert(offsetof(UVoiceChannelSettings_C, SettingsTitle) == 0x0002E0, "Member 'UVoiceChannelSettings_C::SettingsTitle' has a wrong offset!");
static_assert(offsetof(UVoiceChannelSettings_C, VoiceDisabledIcon) == 0x0002E8, "Member 'UVoiceChannelSettings_C::VoiceDisabledIcon' has a wrong offset!");
static_assert(offsetof(UVoiceChannelSettings_C, VoiceDisabledText) == 0x0002F0, "Member 'UVoiceChannelSettings_C::VoiceDisabledText' has a wrong offset!");

}

