#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Athena_Fake_CoolCarpet

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Athena_Fake_SNeakySnowmanV2_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Athena_Fake_CoolCarpet.Athena_Fake_CoolCarpet_C
// 0x0040 (0x07F0 - 0x07B0)
class AAthena_Fake_CoolCarpet_C final : public AAthena_Fake_SneakySnowmanV2_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Athena_Fake_CoolCarpet_C;           // 0x07B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_ShadowInsert;                                   // 0x07B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CoolCarpet_Flap2;                               // 0x07C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CoolCarpet_Flap1;                               // 0x07C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Flaps_Rotation_F5AB76D74BCF44B635766F92F043E4C1;   // 0x07D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Flaps__Direction_F5AB76D74BCF44B635766F92F043E4C1; // 0x07D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D5[0x3];                                      // 0x07D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Flaps;                                             // 0x07D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Center_MID;                                        // 0x07E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Flap_MID_1;                                        // 0x07E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Athena_Fake_CoolCarpet(int32 EntryPoint);
	void OnDamaged_(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, class AActor* DamageCauser, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& Momentum);
	void ReceiveBeginPlay();
	void CloseFlaps();
	void OpenFlaps();
	void Flaps__UpdateFunc();
	void Flaps__FinishedFunc();
	bool ShouldDie(float Damage, class AController* EventInstigator, class AActor* DamageCauser);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Athena_Fake_CoolCarpet_C">();
	}
	static class AAthena_Fake_CoolCarpet_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAthena_Fake_CoolCarpet_C>();
	}
};
static_assert(alignof(AAthena_Fake_CoolCarpet_C) == 0x000008, "Wrong alignment on AAthena_Fake_CoolCarpet_C");
static_assert(sizeof(AAthena_Fake_CoolCarpet_C) == 0x0007F0, "Wrong size on AAthena_Fake_CoolCarpet_C");
static_assert(offsetof(AAthena_Fake_CoolCarpet_C, UberGraphFrame_Athena_Fake_CoolCarpet_C) == 0x0007B0, "Member 'AAthena_Fake_CoolCarpet_C::UberGraphFrame_Athena_Fake_CoolCarpet_C' has a wrong offset!");
static_assert(offsetof(AAthena_Fake_CoolCarpet_C, SM_ShadowInsert) == 0x0007B8, "Member 'AAthena_Fake_CoolCarpet_C::SM_ShadowInsert' has a wrong offset!");
static_assert(offsetof(AAthena_Fake_CoolCarpet_C, SM_CoolCarpet_Flap2) == 0x0007C0, "Member 'AAthena_Fake_CoolCarpet_C::SM_CoolCarpet_Flap2' has a wrong offset!");
static_assert(offsetof(AAthena_Fake_CoolCarpet_C, SM_CoolCarpet_Flap1) == 0x0007C8, "Member 'AAthena_Fake_CoolCarpet_C::SM_CoolCarpet_Flap1' has a wrong offset!");
static_assert(offsetof(AAthena_Fake_CoolCarpet_C, Flaps_Rotation_F5AB76D74BCF44B635766F92F043E4C1) == 0x0007D0, "Member 'AAthena_Fake_CoolCarpet_C::Flaps_Rotation_F5AB76D74BCF44B635766F92F043E4C1' has a wrong offset!");
static_assert(offsetof(AAthena_Fake_CoolCarpet_C, Flaps__Direction_F5AB76D74BCF44B635766F92F043E4C1) == 0x0007D4, "Member 'AAthena_Fake_CoolCarpet_C::Flaps__Direction_F5AB76D74BCF44B635766F92F043E4C1' has a wrong offset!");
static_assert(offsetof(AAthena_Fake_CoolCarpet_C, Flaps) == 0x0007D8, "Member 'AAthena_Fake_CoolCarpet_C::Flaps' has a wrong offset!");
static_assert(offsetof(AAthena_Fake_CoolCarpet_C, Center_MID) == 0x0007E0, "Member 'AAthena_Fake_CoolCarpet_C::Center_MID' has a wrong offset!");
static_assert(offsetof(AAthena_Fake_CoolCarpet_C, Flap_MID_1) == 0x0007E8, "Member 'AAthena_Fake_CoolCarpet_C::Flap_MID_1' has a wrong offset!");

}

