#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaNewsTile

#include "Basic.hpp"


namespace SDK::Params
{

// Function AthenaNewsTile.AthenaNewsTile_C.ExecuteUbergraph_AthenaNewsTile
// 0x0010 (0x0010 - 0x0000)
struct AthenaNewsTile_C_ExecuteUbergraph_AthenaNewsTile final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaNewsTile_C_ExecuteUbergraph_AthenaNewsTile) == 0x000008, "Wrong alignment on AthenaNewsTile_C_ExecuteUbergraph_AthenaNewsTile");
static_assert(sizeof(AthenaNewsTile_C_ExecuteUbergraph_AthenaNewsTile) == 0x000010, "Wrong size on AthenaNewsTile_C_ExecuteUbergraph_AthenaNewsTile");
static_assert(offsetof(AthenaNewsTile_C_ExecuteUbergraph_AthenaNewsTile, EntryPoint) == 0x000000, "Member 'AthenaNewsTile_C_ExecuteUbergraph_AthenaNewsTile::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaNewsTile_C_ExecuteUbergraph_AthenaNewsTile, CallFunc_RandomFloatInRange_ReturnValue) == 0x000004, "Member 'AthenaNewsTile_C_ExecuteUbergraph_AthenaNewsTile::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaNewsTile_C_ExecuteUbergraph_AthenaNewsTile, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'AthenaNewsTile_C_ExecuteUbergraph_AthenaNewsTile::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

}

