#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Athena_Prop_CoolCarpet

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Athena_Prop_CoolCarpet.Athena_Prop_CoolCarpet_C.ExecuteUbergraph_Athena_Prop_CoolCarpet
// 0x04C8 (0x04C8 - 0x0000)
struct Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterial*                              Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterial*                              Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterial*                              Temp_object_Variable_2;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_2;                // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_3;                // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_4;                // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class AActor*>                         Temp_object_Variable_3;                            // 0x0068(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_GetMaterialInt_MatInt;                    // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class AFortPawn*                        K2Node_Event_InteractingPawn;                      // 0x0080(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    K2Node_Event_InteractionBeingAttempted;            // 0x0088(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterial*                              K2Node_Select_Default;                             // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x00A0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x00A8(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_1;  // 0x0134(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_2;  // 0x01C4(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_3;  // 0x0250(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_4;  // 0x02DC(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0368(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0374(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0380(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x038C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0398(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0424(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0425(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0426(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_427[0x1];                                      // 0x0427(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x042C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0430(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x043C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0448(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0454(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0470(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0480(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0484(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0488(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0494(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_ProjectVectorOnToPlane_ReturnValue;       // 0x04A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x04AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromXZ_ReturnValue;                // 0x04B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x04C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet) == 0x000008, "Wrong alignment on Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet");
static_assert(sizeof(Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet) == 0x0004C8, "Wrong size on Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet, EntryPoint) == 0x000000, "Member 'Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet::EntryPoint' has a wrong offset!");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet, Temp_int_Variable) == 0x000004, "Member 'Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet, Temp_object_Variable) == 0x000008, "Member 'Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet, Temp_object_Variable_1) == 0x000010, "Member 'Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet, Temp_object_Variable_2) == 0x000018, "Member 'Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000020, "Member 'Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000024, "Member 'Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet, CallFunc_MakeRotator_ReturnValue) == 0x000028, "Member 'Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet, CallFunc_MakeRotator_ReturnValue_1) == 0x000034, "Member 'Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet, CallFunc_MakeRotator_ReturnValue_2) == 0x000040, "Member 'Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet::CallFunc_MakeRotator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet, K2Node_SwitchEnum_CmpSuccess) == 0x00004C, "Member 'Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet, CallFunc_MakeRotator_ReturnValue_3) == 0x000050, "Member 'Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet::CallFunc_MakeRotator_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet, CallFunc_MakeRotator_ReturnValue_4) == 0x00005C, "Member 'Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet::CallFunc_MakeRotator_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet, Temp_object_Variable_3) == 0x000068, "Member 'Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet, CallFunc_GetMaterialInt_MatInt) == 0x000078, "Member 'Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet::CallFunc_GetMaterialInt_MatInt' has a wrong offset!");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet, K2Node_Event_InteractingPawn) == 0x000080, "Member 'Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet::K2Node_Event_InteractingPawn' has a wrong offset!");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet, K2Node_Event_InteractionBeingAttempted) == 0x000088, "Member 'Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet::K2Node_Event_InteractionBeingAttempted' has a wrong offset!");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet, K2Node_Select_Default) == 0x000090, "Member 'Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000098, "Member 'Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x0000A0, "Member 'Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x0000A8, "Member 'Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet, CallFunc_K2_SetRelativeRotation_SweepHitResult_1) == 0x000134, "Member 'Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet::CallFunc_K2_SetRelativeRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x0001C0, "Member 'Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet, CallFunc_K2_SetRelativeRotation_SweepHitResult_2) == 0x0001C4, "Member 'Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet::CallFunc_K2_SetRelativeRotation_SweepHitResult_2' has a wrong offset!");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet, CallFunc_K2_SetRelativeRotation_SweepHitResult_3) == 0x000250, "Member 'Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet::CallFunc_K2_SetRelativeRotation_SweepHitResult_3' has a wrong offset!");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet, CallFunc_K2_SetRelativeRotation_SweepHitResult_4) == 0x0002DC, "Member 'Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet::CallFunc_K2_SetRelativeRotation_SweepHitResult_4' has a wrong offset!");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000368, "Member 'Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet, CallFunc_GetActorForwardVector_ReturnValue) == 0x000374, "Member 'Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet, CallFunc_Add_VectorVector_ReturnValue) == 0x000380, "Member 'Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet, CallFunc_Subtract_VectorVector_ReturnValue) == 0x00038C, "Member 'Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet, CallFunc_LineTraceSingle_OutHit) == 0x000398, "Member 'Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet, CallFunc_LineTraceSingle_ReturnValue) == 0x000424, "Member 'Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet, CallFunc_BreakHitResult_bBlockingHit) == 0x000425, "Member 'Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet, CallFunc_BreakHitResult_bInitialOverlap) == 0x000426, "Member 'Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet, CallFunc_BreakHitResult_Time) == 0x000428, "Member 'Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet, CallFunc_BreakHitResult_Distance) == 0x00042C, "Member 'Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet, CallFunc_BreakHitResult_Location) == 0x000430, "Member 'Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet, CallFunc_BreakHitResult_ImpactPoint) == 0x00043C, "Member 'Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet, CallFunc_BreakHitResult_Normal) == 0x000448, "Member 'Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet, CallFunc_BreakHitResult_ImpactNormal) == 0x000454, "Member 'Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet, CallFunc_BreakHitResult_PhysMat) == 0x000460, "Member 'Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet, CallFunc_BreakHitResult_HitActor) == 0x000468, "Member 'Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet, CallFunc_BreakHitResult_HitComponent) == 0x000470, "Member 'Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet, CallFunc_BreakHitResult_HitBoneName) == 0x000478, "Member 'Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet, CallFunc_BreakHitResult_HitItem) == 0x000480, "Member 'Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet, CallFunc_BreakHitResult_FaceIndex) == 0x000484, "Member 'Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet, CallFunc_BreakHitResult_TraceStart) == 0x000488, "Member 'Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet, CallFunc_BreakHitResult_TraceEnd) == 0x000494, "Member 'Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet, CallFunc_ProjectVectorOnToPlane_ReturnValue) == 0x0004A0, "Member 'Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet::CallFunc_ProjectVectorOnToPlane_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet, CallFunc_Normal_ReturnValue) == 0x0004AC, "Member 'Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet, CallFunc_MakeRotFromXZ_ReturnValue) == 0x0004B8, "Member 'Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet::CallFunc_MakeRotFromXZ_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet, CallFunc_K2_SetActorRotation_ReturnValue) == 0x0004C4, "Member 'Athena_Prop_CoolCarpet_C_ExecuteUbergraph_Athena_Prop_CoolCarpet::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");

// Function Athena_Prop_CoolCarpet.Athena_Prop_CoolCarpet_C.BlueprintOnInteract
// 0x0010 (0x0010 - 0x0000)
struct Athena_Prop_CoolCarpet_C_BlueprintOnInteract final
{
public:
	const class AFortPawn*                        InteractingPawn;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    InteractionBeingAttempted;                         // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Athena_Prop_CoolCarpet_C_BlueprintOnInteract) == 0x000008, "Wrong alignment on Athena_Prop_CoolCarpet_C_BlueprintOnInteract");
static_assert(sizeof(Athena_Prop_CoolCarpet_C_BlueprintOnInteract) == 0x000010, "Wrong size on Athena_Prop_CoolCarpet_C_BlueprintOnInteract");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_BlueprintOnInteract, InteractingPawn) == 0x000000, "Member 'Athena_Prop_CoolCarpet_C_BlueprintOnInteract::InteractingPawn' has a wrong offset!");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_BlueprintOnInteract, InteractionBeingAttempted) == 0x000008, "Member 'Athena_Prop_CoolCarpet_C_BlueprintOnInteract::InteractionBeingAttempted' has a wrong offset!");

// Function Athena_Prop_CoolCarpet.Athena_Prop_CoolCarpet_C.UserConstructionScript
// 0x0020 (0x0020 - 0x0000)
struct Athena_Prop_CoolCarpet_C_UserConstructionScript final
{
public:
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Athena_Prop_CoolCarpet_C_UserConstructionScript) == 0x000004, "Wrong alignment on Athena_Prop_CoolCarpet_C_UserConstructionScript");
static_assert(sizeof(Athena_Prop_CoolCarpet_C_UserConstructionScript) == 0x000020, "Wrong size on Athena_Prop_CoolCarpet_C_UserConstructionScript");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_UserConstructionScript, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000000, "Member 'Athena_Prop_CoolCarpet_C_UserConstructionScript::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_UserConstructionScript, CallFunc_VSize_ReturnValue) == 0x00000C, "Member 'Athena_Prop_CoolCarpet_C_UserConstructionScript::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_UserConstructionScript, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000010, "Member 'Athena_Prop_CoolCarpet_C_UserConstructionScript::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_UserConstructionScript, CallFunc_FTrunc_ReturnValue) == 0x000014, "Member 'Athena_Prop_CoolCarpet_C_UserConstructionScript::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_UserConstructionScript, CallFunc_Percent_IntInt_ReturnValue) == 0x000018, "Member 'Athena_Prop_CoolCarpet_C_UserConstructionScript::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_UserConstructionScript, CallFunc_HasAuthority_ReturnValue) == 0x00001C, "Member 'Athena_Prop_CoolCarpet_C_UserConstructionScript::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");

// Function Athena_Prop_CoolCarpet.Athena_Prop_CoolCarpet_C.GetMaterialInt
// 0x000C (0x000C - 0x0000)
struct Athena_Prop_CoolCarpet_C_GetMaterialInt final
{
public:
	int32                                         MatInt;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Athena_Prop_CoolCarpet_C_GetMaterialInt) == 0x000004, "Wrong alignment on Athena_Prop_CoolCarpet_C_GetMaterialInt");
static_assert(sizeof(Athena_Prop_CoolCarpet_C_GetMaterialInt) == 0x00000C, "Wrong size on Athena_Prop_CoolCarpet_C_GetMaterialInt");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_GetMaterialInt, MatInt) == 0x000000, "Member 'Athena_Prop_CoolCarpet_C_GetMaterialInt::MatInt' has a wrong offset!");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_GetMaterialInt, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000004, "Member 'Athena_Prop_CoolCarpet_C_GetMaterialInt::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_GetMaterialInt, CallFunc_SelectInt_ReturnValue) == 0x000008, "Member 'Athena_Prop_CoolCarpet_C_GetMaterialInt::CallFunc_SelectInt_ReturnValue' has a wrong offset!");

// Function Athena_Prop_CoolCarpet.Athena_Prop_CoolCarpet_C.OnRep_MatIntOverride
// 0x0030 (0x0030 - 0x0000)
struct Athena_Prop_CoolCarpet_C_OnRep_MatIntOverride final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterial*                              Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterial*                              Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterial*                              Temp_object_Variable_2;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMaterialInt_MatInt;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterial*                              K2Node_Select_Default;                             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Athena_Prop_CoolCarpet_C_OnRep_MatIntOverride) == 0x000008, "Wrong alignment on Athena_Prop_CoolCarpet_C_OnRep_MatIntOverride");
static_assert(sizeof(Athena_Prop_CoolCarpet_C_OnRep_MatIntOverride) == 0x000030, "Wrong size on Athena_Prop_CoolCarpet_C_OnRep_MatIntOverride");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_OnRep_MatIntOverride, Temp_int_Variable) == 0x000000, "Member 'Athena_Prop_CoolCarpet_C_OnRep_MatIntOverride::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_OnRep_MatIntOverride, Temp_object_Variable) == 0x000008, "Member 'Athena_Prop_CoolCarpet_C_OnRep_MatIntOverride::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_OnRep_MatIntOverride, Temp_object_Variable_1) == 0x000010, "Member 'Athena_Prop_CoolCarpet_C_OnRep_MatIntOverride::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_OnRep_MatIntOverride, Temp_object_Variable_2) == 0x000018, "Member 'Athena_Prop_CoolCarpet_C_OnRep_MatIntOverride::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_OnRep_MatIntOverride, CallFunc_GetMaterialInt_MatInt) == 0x000020, "Member 'Athena_Prop_CoolCarpet_C_OnRep_MatIntOverride::CallFunc_GetMaterialInt_MatInt' has a wrong offset!");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_OnRep_MatIntOverride, K2Node_Select_Default) == 0x000028, "Member 'Athena_Prop_CoolCarpet_C_OnRep_MatIntOverride::K2Node_Select_Default' has a wrong offset!");

// Function Athena_Prop_CoolCarpet.Athena_Prop_CoolCarpet_C.BlueprintCanInteract
// 0x0050 (0x0050 - 0x0000)
struct Athena_Prop_CoolCarpet_C_BlueprintCanInteract final
{
public:
	const class AFortPawn*                        InteractingPawn;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    InteractionBeingAttempted;                         // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETInteractionType                             InteractionType;                                   // 0x0009(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x000A(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x0010(0x0020)()
	bool                                          CallFunc_BlueprintCanInteract_ReturnValue;         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput; // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RowToBool_ReturnValue;                    // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Athena_Prop_CoolCarpet_C_BlueprintCanInteract) == 0x000008, "Wrong alignment on Athena_Prop_CoolCarpet_C_BlueprintCanInteract");
static_assert(sizeof(Athena_Prop_CoolCarpet_C_BlueprintCanInteract) == 0x000050, "Wrong size on Athena_Prop_CoolCarpet_C_BlueprintCanInteract");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_BlueprintCanInteract, InteractingPawn) == 0x000000, "Member 'Athena_Prop_CoolCarpet_C_BlueprintCanInteract::InteractingPawn' has a wrong offset!");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_BlueprintCanInteract, InteractionBeingAttempted) == 0x000008, "Member 'Athena_Prop_CoolCarpet_C_BlueprintCanInteract::InteractionBeingAttempted' has a wrong offset!");
static_assert(offsetof(Athena_Prop_CoolCarpet_C_BlueprintCanInteract, InteractionType) == 0x000009, "Member 'Athena_Prop_CoolCarpet_C_BlueprintCanInteract::InteractionType' has a wrong offset!");
