#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaLobby

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaLobby.AthenaLobby_C
// 0x0058 (0x05C0 - 0x0568)
class UAthenaLobby_C final : public UAthenaLobbyBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0568(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFeaturedCreativeContent_C*             FeaturedCreativeContent;                           // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMatchmakingRegionAndPool_C*            MatchmakingRegion;                                 // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMinimalTeamDisplay_C*                  MinimalTeamDisplay;                                // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Main;                                      // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPunchCard_C*                           PunchCard;                                         // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFancyToastWidget_C*                    StoreToastWidget;                                  // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStoreToastRequest*                     StoreToastRequest;                                 // 0x05A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           TryShowToast;                                      // 0x05A8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    InputAction_InspectChallenges;                     // 0x05B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_AthenaLobby(int32 EntryPoint);
	void DisplayGlyphQuestUpdated(int32 NewGlyphs);
	void OnPlaylistChanged(EFortLobbyType LobbyType, const class UFortPlaylistAthena* PlaylistData);
	void BndEvt__StoreToastWidget_K2Node_ComponentBoundEvent_2_OnFinishedToast__DelegateSignature();
	void TryToastAgainNextFrame();
	void AttemptToShowToast();
	void BP_OnActivated();
	void DisplayStoreUpdated(class UStoreToastRequest* StoreUpdatedRequest);
	void BP_OnDeactivated();
	void Construct();
	void Destruct();
	void BndEvt__ShadowPlayHighlights_K2Node_ComponentBoundEvent_116_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void OnSuccess_DA5E62624D068772EA890193344BA4AE();
	void OnFailure_DA5E62624D068772EA890193344BA4AE();
	void StartAthenaLobbyMusic();
	void ShowPicker(EFortPickerMode Mode, int32 InitialOption, bool IgnoreFirstAccept);
	void ConfigureGenericLinkButton();
	void HandleLobbyColorSchemeChange(const struct FLinearColor& NewColorScheme, bool UseDefaultScheme);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaLobby_C">();
	}
	static class UAthenaLobby_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaLobby_C>();
	}
};
static_assert(alignof(UAthenaLobby_C) == 0x000008, "Wrong alignment on UAthenaLobby_C");
static_assert(sizeof(UAthenaLobby_C) == 0x0005C0, "Wrong size on UAthenaLobby_C");
static_assert(offsetof(UAthenaLobby_C, UberGraphFrame) == 0x000568, "Member 'UAthenaLobby_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaLobby_C, FeaturedCreativeContent) == 0x000570, "Member 'UAthenaLobby_C::FeaturedCreativeContent' has a wrong offset!");
static_assert(offsetof(UAthenaLobby_C, MatchmakingRegion) == 0x000578, "Member 'UAthenaLobby_C::MatchmakingRegion' has a wrong offset!");
static_assert(offsetof(UAthenaLobby_C, MinimalTeamDisplay) == 0x000580, "Member 'UAthenaLobby_C::MinimalTeamDisplay' has a wrong offset!");
static_assert(offsetof(UAthenaLobby_C, Overlay_Main) == 0x000588, "Member 'UAthenaLobby_C::Overlay_Main' has a wrong offset!");
static_assert(offsetof(UAthenaLobby_C, PunchCard) == 0x000590, "Member 'UAthenaLobby_C::PunchCard' has a wrong offset!");
static_assert(offsetof(UAthenaLobby_C, StoreToastWidget) == 0x000598, "Member 'UAthenaLobby_C::StoreToastWidget' has a wrong offset!");
static_assert(offsetof(UAthenaLobby_C, StoreToastRequest) == 0x0005A0, "Member 'UAthenaLobby_C::StoreToastRequest' has a wrong offset!");
static_assert(offsetof(UAthenaLobby_C, TryShowToast) == 0x0005A8, "Member 'UAthenaLobby_C::TryShowToast' has a wrong offset!");
static_assert(offsetof(UAthenaLobby_C, InputAction_InspectChallenges) == 0x0005B0, "Member 'UAthenaLobby_C::InputAction_InspectChallenges' has a wrong offset!");

}

