#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Athena_Fake_SNeakySnowmanV2

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function Athena_Fake_SNeakySnowmanV2.Athena_Fake_SneakySnowmanV2_C.ExecuteUbergraph_Athena_Fake_SneakySnowmanV2
// 0x0018 (0x0018 - 0x0000)
struct Athena_Fake_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Fake_SneakySnowmanV2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class AFortPawn*                        K2Node_Event_InteractingPawn;                      // 0x0008(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    K2Node_Event_InteractionBeingAttempted;            // 0x0010(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Athena_Fake_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Fake_SneakySnowmanV2) == 0x000008, "Wrong alignment on Athena_Fake_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Fake_SneakySnowmanV2");
static_assert(sizeof(Athena_Fake_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Fake_SneakySnowmanV2) == 0x000018, "Wrong size on Athena_Fake_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Fake_SneakySnowmanV2");
static_assert(offsetof(Athena_Fake_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Fake_SneakySnowmanV2, EntryPoint) == 0x000000, "Member 'Athena_Fake_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Fake_SneakySnowmanV2::EntryPoint' has a wrong offset!");
static_assert(offsetof(Athena_Fake_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Fake_SneakySnowmanV2, K2Node_Event_InteractingPawn) == 0x000008, "Member 'Athena_Fake_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Fake_SneakySnowmanV2::K2Node_Event_InteractingPawn' has a wrong offset!");
static_assert(offsetof(Athena_Fake_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Fake_SneakySnowmanV2, K2Node_Event_InteractionBeingAttempted) == 0x000010, "Member 'Athena_Fake_SneakySnowmanV2_C_ExecuteUbergraph_Athena_Fake_SneakySnowmanV2::K2Node_Event_InteractionBeingAttempted' has a wrong offset!");

// Function Athena_Fake_SNeakySnowmanV2.Athena_Fake_SneakySnowmanV2_C.BlueprintOnInteract
// 0x0010 (0x0010 - 0x0000)
struct Athena_Fake_SneakySnowmanV2_C_BlueprintOnInteract final
{
public:
	const class AFortPawn*                        InteractingPawn;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    InteractionBeingAttempted;                         // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Athena_Fake_SneakySnowmanV2_C_BlueprintOnInteract) == 0x000008, "Wrong alignment on Athena_Fake_SneakySnowmanV2_C_BlueprintOnInteract");
static_assert(sizeof(Athena_Fake_SneakySnowmanV2_C_BlueprintOnInteract) == 0x000010, "Wrong size on Athena_Fake_SneakySnowmanV2_C_BlueprintOnInteract");
static_assert(offsetof(Athena_Fake_SneakySnowmanV2_C_BlueprintOnInteract, InteractingPawn) == 0x000000, "Member 'Athena_Fake_SneakySnowmanV2_C_BlueprintOnInteract::InteractingPawn' has a wrong offset!");
static_assert(offsetof(Athena_Fake_SneakySnowmanV2_C_BlueprintOnInteract, InteractionBeingAttempted) == 0x000008, "Member 'Athena_Fake_SneakySnowmanV2_C_BlueprintOnInteract::InteractionBeingAttempted' has a wrong offset!");

// Function Athena_Fake_SNeakySnowmanV2.Athena_Fake_SneakySnowmanV2_C.BlueprintCanInteract
// 0x0260 (0x0260 - 0x0000)
struct Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract final
{
public:
	const class AFortPawn*                        InteractingPawn;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    InteractionBeingAttempted;                         // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETInteractionType                             InteractionType;                                   // 0x0009(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x000A(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FGameplayTag>                   K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromArray_ReturnValue; // 0x0038(0x0020)()
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetHeldObjectAttachedToPlayer_ReturnValue; // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A2[0x6];                                       // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTag>                   K2Node_MakeArray_Array_1;                          // 0x00A8(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromArray_ReturnValue_1; // 0x00B8(0x0020)()
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1; // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCrouching_ReturnValue;                  // 0x00DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00DE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DF[0x1];                                       // 0x00DF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array_2;                          // 0x00E0(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	TArray<class AActor*>                         K2Node_MakeArray_Array_3;                          // 0x00F0(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0104(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OnSameTeam_ReturnValue;                   // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x0114(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0120(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1AD[0x3];                                      // 0x01AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x01B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1BD[0x3];                                      // 0x01BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_3;           // 0x01C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit_1;                 // 0x01CC(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue_1;            // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x0259(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x025A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x025B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x025D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x025E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x025F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract) == 0x000008, "Wrong alignment on Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract");
static_assert(sizeof(Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract) == 0x000260, "Wrong size on Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract");
static_assert(offsetof(Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract, InteractingPawn) == 0x000000, "Member 'Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract::InteractingPawn' has a wrong offset!");
static_assert(offsetof(Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract, InteractionBeingAttempted) == 0x000008, "Member 'Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract::InteractionBeingAttempted' has a wrong offset!");
static_assert(offsetof(Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract, InteractionType) == 0x000009, "Member 'Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract::InteractionType' has a wrong offset!");
static_assert(offsetof(Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract, ReturnValue) == 0x00000A, "Member 'Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract::ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract, PlayerPawn) == 0x000010, "Member 'Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract::PlayerPawn' has a wrong offset!");
static_assert(offsetof(Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract, K2Node_MakeArray_Array) == 0x000018, "Member 'Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000028, "Member 'Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract, CallFunc_MakeGameplayTagContainerFromArray_ReturnValue) == 0x000038, "Member 'Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract::CallFunc_MakeGameplayTagContainerFromArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract, CallFunc_Add_VectorVector_ReturnValue) == 0x000058, "Member 'Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x000064, "Member 'Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000068, "Member 'Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract, CallFunc_Not_PreBool_ReturnValue) == 0x000074, "Member 'Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000078, "Member 'Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract, CallFunc_IsValid_ReturnValue) == 0x000084, "Member 'Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000088, "Member 'Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract, K2Node_DynamicCast_bSuccess) == 0x000090, "Member 'Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract, CallFunc_GetHeldObjectAttachedToPlayer_ReturnValue) == 0x000098, "Member 'Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract::CallFunc_GetHeldObjectAttachedToPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x0000A0, "Member 'Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract, CallFunc_IsValid_ReturnValue_1) == 0x0000A1, "Member 'Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract, K2Node_MakeArray_Array_1) == 0x0000A8, "Member 'Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract, CallFunc_MakeGameplayTagContainerFromArray_ReturnValue_1) == 0x0000B8, "Member 'Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract::CallFunc_MakeGameplayTagContainerFromArray_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract, CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1) == 0x0000D8, "Member 'Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract::CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000D9, "Member 'Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract, CallFunc_BooleanOR_ReturnValue) == 0x0000DA, "Member 'Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract, CallFunc_IsValid_ReturnValue_2) == 0x0000DB, "Member 'Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract, CallFunc_BooleanAND_ReturnValue) == 0x0000DC, "Member 'Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract, CallFunc_IsCrouching_ReturnValue) == 0x0000DD, "Member 'Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract::CallFunc_IsCrouching_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract, CallFunc_IsValid_ReturnValue_3) == 0x0000DE, "Member 'Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract, K2Node_MakeArray_Array_2) == 0x0000E0, "Member 'Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract, K2Node_MakeArray_Array_3) == 0x0000F0, "Member 'Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract, CallFunc_Not_PreBool_ReturnValue_2) == 0x000100, "Member 'Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000104, "Member 'Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract, CallFunc_OnSameTeam_ReturnValue) == 0x000110, "Member 'Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract::CallFunc_OnSameTeam_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract, CallFunc_Add_VectorVector_ReturnValue_2) == 0x000114, "Member 'Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract, CallFunc_LineTraceSingle_OutHit) == 0x000120, "Member 'Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract, CallFunc_LineTraceSingle_ReturnValue) == 0x0001AC, "Member 'Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x0001B0, "Member 'Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract, CallFunc_Not_PreBool_ReturnValue_3) == 0x0001BC, "Member 'Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract, CallFunc_Add_VectorVector_ReturnValue_3) == 0x0001C0, "Member 'Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract::CallFunc_Add_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract, CallFunc_LineTraceSingle_OutHit_1) == 0x0001CC, "Member 'Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract::CallFunc_LineTraceSingle_OutHit_1' has a wrong offset!");
static_assert(offsetof(Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract, CallFunc_LineTraceSingle_ReturnValue_1) == 0x000258, "Member 'Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract::CallFunc_LineTraceSingle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract, CallFunc_Not_PreBool_ReturnValue_4) == 0x000259, "Member 'Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x00025A, "Member 'Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract, CallFunc_BooleanAND_ReturnValue_1) == 0x00025B, "Member 'Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract, CallFunc_BooleanAND_ReturnValue_2) == 0x00025C, "Member 'Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract, CallFunc_BooleanAND_ReturnValue_3) == 0x00025D, "Member 'Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract, CallFunc_BooleanAND_ReturnValue_4) == 0x00025E, "Member 'Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract, CallFunc_BooleanAND_ReturnValue_5) == 0x00025F, "Member 'Athena_Fake_SneakySnowmanV2_C_BlueprintCanInteract::CallFunc_BooleanAND_ReturnValue_5' has a wrong offset!");

// Function Athena_Fake_SNeakySnowmanV2.Athena_Fake_SneakySnowmanV2_C.BlueprintGetInteractionTime
// 0x0010 (0x0010 - 0x0000)
struct Athena_Fake_SneakySnowmanV2_C_BlueprintGetInteractionTime final
{
public:
	const class AFortPawn*                        InteractingPawn;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OutInteractionTime;                                // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    InteractionBeingAttempted;                         // 0x000C(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x000D(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Athena_Fake_SneakySnowmanV2_C_BlueprintGetInteractionTime) == 0x000008, "Wrong alignment on Athena_Fake_SneakySnowmanV2_C_BlueprintGetInteractionTime");
static_assert(sizeof(Athena_Fake_SneakySnowmanV2_C_BlueprintGetInteractionTime) == 0x000010, "Wrong size on Athena_Fake_SneakySnowmanV2_C_BlueprintGetInteractionTime");
static_assert(offsetof(Athena_Fake_SneakySnowmanV2_C_BlueprintGetInteractionTime, InteractingPawn) == 0x000000, "Member 'Athena_Fake_SneakySnowmanV2_C_BlueprintGetInteractionTime::InteractingPawn' has a wrong offset!");
static_assert(offsetof(Athena_Fake_SneakySnowmanV2_C_BlueprintGetInteractionTime, OutInteractionTime) == 0x000008, "Member 'Athena_Fake_SneakySnowmanV2_C_BlueprintGetInteractionTime::OutInteractionTime' has a wrong offset!");
static_assert(offsetof(Athena_Fake_SneakySnowmanV2_C_BlueprintGetInteractionTime, InteractionBeingAttempted) == 0x00000C, "Member 'Athena_Fake_SneakySnowmanV2_C_BlueprintGetInteractionTime::InteractionBeingAttempted' has a wrong offset!");
static_assert(offsetof(Athena_Fake_SneakySnowmanV2_C_BlueprintGetInteractionTime, ReturnValue) == 0x00000D, "Member 'Athena_Fake_SneakySnowmanV2_C_BlueprintGetInteractionTime::ReturnValue' has a wrong offset!");

// Function Athena_Fake_SNeakySnowmanV2.Athena_Fake_SneakySnowmanV2_C.BlueprintGetInteractionString
// 0x0028 (0x0028 - 0x0000)
struct Athena_Fake_SneakySnowmanV2_C_BlueprintGetInteractionString final
{
public:
	const class AFortPawn*                        InteractingPawn;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionBeingAttempted                    InteractionBeingAttempted;                         // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ReturnValue;                                       // 0x0010(0x0018)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(Athena_Fake_SneakySnowmanV2_C_BlueprintGetInteractionString) == 0x000008, "Wrong alignment on Athena_Fake_SneakySnowmanV2_C_BlueprintGetInteractionString");
static_assert(sizeof(Athena_Fake_SneakySnowmanV2_C_BlueprintGetInteractionString) == 0x000028, "Wrong size on Athena_Fake_SneakySnowmanV2_C_BlueprintGetInteractionString");
static_assert(offsetof(Athena_Fake_SneakySnowmanV2_C_BlueprintGetInteractionString, InteractingPawn) == 0x000000, "Member 'Athena_Fake_SneakySnowmanV2_C_BlueprintGetInteractionString::InteractingPawn' has a wrong offset!");
static_assert(offsetof(Athena_Fake_SneakySnowmanV2_C_BlueprintGetInteractionString, InteractionBeingAttempted) == 0x000008, "Member 'Athena_Fake_SneakySnowmanV2_C_BlueprintGetInteractionString::InteractionBeingAttempted' has a wrong offset!");
