#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Athena_SneakySnowmanV2_InteractSphere

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Athena_SneakySnowmanV2_InteractSphere.Athena_SneakySnowmanV2_InteractSphere_C
// 0x0018 (0x07A0 - 0x0788)
class AAthena_SneakySnowmanV2_InteractSphere_C final : public ABuildingGameplayActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0788(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       Sphere;                                            // 0x0790(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AAthena_Player_SneakySnowmanV2_C*       AssociatedSnowman;                                 // 0x0798(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Athena_SneakySnowmanV2_InteractSphere(int32 EntryPoint);
	void BlueprintOnInterruptInteract();
	void BlueprintOnBeginInteract();
	void BlueprintOnInteract(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted);
	void Destroy(class AActor* DestroyedActor);
	void OnRep_AssociatedSnowman();
	void Init(class AAthena_Player_SneakySnowmanV2_C* AssociatedSnowman_0);

	bool BlueprintCanInteract(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted, const ETInteractionType InteractionType) const;
	class FText BlueprintGetInteractionString(const class AFortPawn* InteractingPawn, const EInteractionBeingAttempted InteractionBeingAttempted) const;
	bool BlueprintGetInteractionTime(const class AFortPawn* InteractingPawn, float* OutInteractionTime, const EInteractionBeingAttempted InteractionBeingAttempted) const;
	struct FVector GetFocusedSocketLocation() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Athena_SneakySnowmanV2_InteractSphere_C">();
	}
	static class AAthena_SneakySnowmanV2_InteractSphere_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAthena_SneakySnowmanV2_InteractSphere_C>();
	}
};
static_assert(alignof(AAthena_SneakySnowmanV2_InteractSphere_C) == 0x000008, "Wrong alignment on AAthena_SneakySnowmanV2_InteractSphere_C");
static_assert(sizeof(AAthena_SneakySnowmanV2_InteractSphere_C) == 0x0007A0, "Wrong size on AAthena_SneakySnowmanV2_InteractSphere_C");
static_assert(offsetof(AAthena_SneakySnowmanV2_InteractSphere_C, UberGraphFrame) == 0x000788, "Member 'AAthena_SneakySnowmanV2_InteractSphere_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AAthena_SneakySnowmanV2_InteractSphere_C, Sphere) == 0x000790, "Member 'AAthena_SneakySnowmanV2_InteractSphere_C::Sphere' has a wrong offset!");
static_assert(offsetof(AAthena_SneakySnowmanV2_InteractSphere_C, AssociatedSnowman) == 0x000798, "Member 'AAthena_SneakySnowmanV2_InteractSphere_C::AssociatedSnowman' has a wrong offset!");

}

