#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaMatchmakingOptionsDisplay_v2

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "CommonUI_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaMatchmakingOptionsDisplay_v2.AthenaMatchmakingOptionsDisplay_v2_C
// 0x01A0 (0x0738 - 0x0598)
class UAthenaMatchmakingOptionsDisplay_v2_C final : public UFortAthenaMatchmakingOptions
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0598(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       IntroRightPanel;                                   // 0x05A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OutroRightPanel;                                   // 0x05A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UIconTextButton_C*                      AcceptButton;                                      // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaMatchmakingTile_C*               AthenaMatchmakingTile;                             // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaMatchmakingTile_C*               AthenaMatchmakingTile_0;                           // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaMatchmakingTile_C*               AthenaMatchmakingTile_1;                           // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        BangSwitcher;                                      // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BGImage;                                           // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          BorderLTMBang;                                     // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          BorderLTMBang_Heist;                               // 0x05E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               ChoosePromptSB;                                    // 0x05F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCloseButton_C*                         CloseButton;                                       // 0x05F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ConfirmSelectionShine;                             // 0x0600(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CurrentGameModeDescription;                        // 0x0608(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CurrentGameModeDisabledDescription;                // 0x0610(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CurrentGameModeName;                               // 0x0618(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 GameModeGlow;                                      // 0x0620(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 GameModeIcon;                                      // 0x0628(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           GameModes;                                         // 0x0630(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCMSImageSlideShow_C*                   GameModeSlideShow;                                 // 0x0638(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                IconSpacer;                                        // 0x0640(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULightbox_C*                            Lightbox;                                          // 0x0648(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LineRule;                                          // 0x0650(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LTMModeSubIcon;                                    // 0x0658(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ModeDescriptionScrollBox;                          // 0x0660(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                RootBorder;                                        // 0x0668(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               RootOverlay;                                       // 0x0670(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SubGameModeName;                                   // 0x0678(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         SubGameModeNameHB;                                 // 0x0680(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputReflectorButton_C*                SupportAffliateButton;                             // 0x0688(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       T_LTMBangText;                                     // 0x0690(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       T_LTMBangText_Heist;                               // 0x0698(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          TouchTOCloseZone;                                  // 0x06A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         WarningHB;                                         // 0x06A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FDataTableRowHandle                    Input_Cancel;                                      // 0x06B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class UAthena_Matchmaking_SpecialEventButton_C* MyLTM;                                             // 0x06C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LastHoveredStandardModeIndex;                      // 0x06C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SM_Button_IndexMax;                                // 0x06CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SM_Button_IndexCurrent;                            // 0x06D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D4[0x4];                                      // 0x06D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                DefaultPlaylists;                                  // 0x06D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthena_Matchmaking_GameModeButton_C*   InitialButtonSelection;                            // 0x06E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CurrentPlaylist;                                   // 0x06E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MatchmakingPageTileIndex;                          // 0x06F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         IntroOutroTileDelayTime;                           // 0x06F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    InputCustomMatchmaking;                            // 0x06F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	bool                                          IsPerformingOutro;                                 // 0x0708(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          PlayIntroAnim;                                     // 0x0709(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_70A[0x6];                                      // 0x070A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    InputSpectateMatch;                                // 0x0710(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	bool                                          IsShowingSupportCreator;                           // 0x0720(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsPerformingIntro;                                 // 0x0721(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_722[0x6];                                      // 0x0722(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    Confirm;                                           // 0x0728(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_AthenaMatchmakingOptionsDisplay_v2(int32 EntryPoint);
	void SetHardcoreModiferButtonText(const class FText& InText);
	void BndEvt__CloseButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void On_Intro_Complete();
	void UpdateShowSupportAffiliateButton(bool bIsCreativeLTM);
	void Construct();
	void OnAffiliateUpdated(const class FString& AffiliateName);
	void BndEvt__SupportAffliateButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__AcceptButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void SetSpectatorButtonText(ESpectatorQueueType InSpectatorQueueType);
	void SetServerAccessText(EServerAccessSetting InServerAccessSetting);
	void UpdateMMButtonStatusBP(bool bPlaylistIsEnabled, EFillDisableReason FillDisableReason);
	void BP_OnDeactivated();
	void ApplyCMSOverrides();
	void Start_Closing_Matchmaking_Options();
	void OnTileDoubleClicked(class UCommonButton* ButtonClicked);
	void RepresentedPlaylistChanged(const struct FPlaylistFrontEndData& NewRepresentedPlaylist);
	void OnRightPanelIntroFinshed();
	void OnBeginIntro();
	void OnRightPanelOutroFinshed();
	void BndEvt__CancelButton_K2Node_ComponentBoundEvent_18_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void SetSquadFillText(ESquadFillSetting InSquadFillSetting);
	void SetupInput();
	void Handle_InputAction_Cancel(bool* PassThrough);
	struct FEventReply Touch_To_Close(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void TriggerMatchmakingPageTileIntroAnim();
	void TriggerMatchmakingPageTileOutroAnim();
	void OnCustomMatchmaking(bool* PassThrough);
	void SetScrollWidget();
	void OnSpectateMatch(bool* PassThrough);
	void Is_Performing_Transition(bool* Performing_Transition);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaMatchmakingOptionsDisplay_v2_C">();
	}
	static class UAthenaMatchmakingOptionsDisplay_v2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaMatchmakingOptionsDisplay_v2_C>();
	}
};
static_assert(alignof(UAthenaMatchmakingOptionsDisplay_v2_C) == 0x000008, "Wrong alignment on UAthenaMatchmakingOptionsDisplay_v2_C");
static_assert(sizeof(UAthenaMatchmakingOptionsDisplay_v2_C) == 0x000738, "Wrong size on UAthenaMatchmakingOptionsDisplay_v2_C");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, UberGraphFrame) == 0x000598, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, IntroRightPanel) == 0x0005A0, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::IntroRightPanel' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, OutroRightPanel) == 0x0005A8, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::OutroRightPanel' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, AcceptButton) == 0x0005B0, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::AcceptButton' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, AthenaMatchmakingTile) == 0x0005B8, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::AthenaMatchmakingTile' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, AthenaMatchmakingTile_0) == 0x0005C0, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::AthenaMatchmakingTile_0' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, AthenaMatchmakingTile_1) == 0x0005C8, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::AthenaMatchmakingTile_1' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, BangSwitcher) == 0x0005D0, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::BangSwitcher' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, BGImage) == 0x0005D8, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::BGImage' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, BorderLTMBang) == 0x0005E0, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::BorderLTMBang' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, BorderLTMBang_Heist) == 0x0005E8, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::BorderLTMBang_Heist' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, ChoosePromptSB) == 0x0005F0, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::ChoosePromptSB' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, CloseButton) == 0x0005F8, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::CloseButton' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, ConfirmSelectionShine) == 0x000600, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::ConfirmSelectionShine' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, CurrentGameModeDescription) == 0x000608, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::CurrentGameModeDescription' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, CurrentGameModeDisabledDescription) == 0x000610, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::CurrentGameModeDisabledDescription' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, CurrentGameModeName) == 0x000618, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::CurrentGameModeName' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, GameModeGlow) == 0x000620, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::GameModeGlow' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, GameModeIcon) == 0x000628, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::GameModeIcon' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, GameModes) == 0x000630, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::GameModes' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, GameModeSlideShow) == 0x000638, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::GameModeSlideShow' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, IconSpacer) == 0x000640, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::IconSpacer' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, Lightbox) == 0x000648, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::Lightbox' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, LineRule) == 0x000650, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::LineRule' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, LTMModeSubIcon) == 0x000658, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::LTMModeSubIcon' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, ModeDescriptionScrollBox) == 0x000660, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::ModeDescriptionScrollBox' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, RootBorder) == 0x000668, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::RootBorder' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, RootOverlay) == 0x000670, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::RootOverlay' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, SubGameModeName) == 0x000678, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::SubGameModeName' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, SubGameModeNameHB) == 0x000680, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::SubGameModeNameHB' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, SupportAffliateButton) == 0x000688, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::SupportAffliateButton' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, T_LTMBangText) == 0x000690, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::T_LTMBangText' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, T_LTMBangText_Heist) == 0x000698, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::T_LTMBangText_Heist' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, TouchTOCloseZone) == 0x0006A0, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::TouchTOCloseZone' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, WarningHB) == 0x0006A8, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::WarningHB' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, Input_Cancel) == 0x0006B0, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::Input_Cancel' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, MyLTM) == 0x0006C0, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::MyLTM' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, LastHoveredStandardModeIndex) == 0x0006C8, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::LastHoveredStandardModeIndex' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, SM_Button_IndexMax) == 0x0006CC, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::SM_Button_IndexMax' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, SM_Button_IndexCurrent) == 0x0006D0, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::SM_Button_IndexCurrent' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, DefaultPlaylists) == 0x0006D8, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::DefaultPlaylists' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, InitialButtonSelection) == 0x0006E0, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::InitialButtonSelection' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, CurrentPlaylist) == 0x0006E8, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::CurrentPlaylist' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, MatchmakingPageTileIndex) == 0x0006F0, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::MatchmakingPageTileIndex' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, IntroOutroTileDelayTime) == 0x0006F4, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::IntroOutroTileDelayTime' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, InputCustomMatchmaking) == 0x0006F8, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::InputCustomMatchmaking' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, IsPerformingOutro) == 0x000708, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::IsPerformingOutro' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, PlayIntroAnim) == 0x000709, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::PlayIntroAnim' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, InputSpectateMatch) == 0x000710, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::InputSpectateMatch' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, IsShowingSupportCreator) == 0x000720, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::IsShowingSupportCreator' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, IsPerformingIntro) == 0x000721, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::IsPerformingIntro' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingOptionsDisplay_v2_C, Confirm) == 0x000728, "Member 'UAthenaMatchmakingOptionsDisplay_v2_C::Confirm' has a wrong offset!");

}

