#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaViewStreamingReplayModal

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function AthenaViewStreamingReplayModal.AthenaViewStreamingReplayModal_C.ExecuteUbergraph_AthenaViewStreamingReplayModal
// 0x00A0 (0x00A0 - 0x0000)
struct AthenaViewStreamingReplayModal_C_ExecuteUbergraph_AthenaViewStreamingReplayModal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button_1;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_ComponentBoundEvent_Text_1;                 // 0x0010(0x0018)(ConstParm)
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x0028(0x0018)(ConstParm)
	ETextCommit                                   K2Node_ComponentBoundEvent_CommitMethod;           // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidGameSessionId_ReturnValue;         // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0078(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaViewStreamingReplayModal_C_ExecuteUbergraph_AthenaViewStreamingReplayModal) == 0x000008, "Wrong alignment on AthenaViewStreamingReplayModal_C_ExecuteUbergraph_AthenaViewStreamingReplayModal");
static_assert(sizeof(AthenaViewStreamingReplayModal_C_ExecuteUbergraph_AthenaViewStreamingReplayModal) == 0x0000A0, "Wrong size on AthenaViewStreamingReplayModal_C_ExecuteUbergraph_AthenaViewStreamingReplayModal");
static_assert(offsetof(AthenaViewStreamingReplayModal_C_ExecuteUbergraph_AthenaViewStreamingReplayModal, EntryPoint) == 0x000000, "Member 'AthenaViewStreamingReplayModal_C_ExecuteUbergraph_AthenaViewStreamingReplayModal::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaViewStreamingReplayModal_C_ExecuteUbergraph_AthenaViewStreamingReplayModal, K2Node_ComponentBoundEvent_Button_1) == 0x000008, "Member 'AthenaViewStreamingReplayModal_C_ExecuteUbergraph_AthenaViewStreamingReplayModal::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(AthenaViewStreamingReplayModal_C_ExecuteUbergraph_AthenaViewStreamingReplayModal, K2Node_ComponentBoundEvent_Text_1) == 0x000010, "Member 'AthenaViewStreamingReplayModal_C_ExecuteUbergraph_AthenaViewStreamingReplayModal::K2Node_ComponentBoundEvent_Text_1' has a wrong offset!");
static_assert(offsetof(AthenaViewStreamingReplayModal_C_ExecuteUbergraph_AthenaViewStreamingReplayModal, K2Node_ComponentBoundEvent_Text) == 0x000028, "Member 'AthenaViewStreamingReplayModal_C_ExecuteUbergraph_AthenaViewStreamingReplayModal::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(AthenaViewStreamingReplayModal_C_ExecuteUbergraph_AthenaViewStreamingReplayModal, K2Node_ComponentBoundEvent_CommitMethod) == 0x000040, "Member 'AthenaViewStreamingReplayModal_C_ExecuteUbergraph_AthenaViewStreamingReplayModal::K2Node_ComponentBoundEvent_CommitMethod' has a wrong offset!");
static_assert(offsetof(AthenaViewStreamingReplayModal_C_ExecuteUbergraph_AthenaViewStreamingReplayModal, CallFunc_Conv_TextToString_ReturnValue) == 0x000048, "Member 'AthenaViewStreamingReplayModal_C_ExecuteUbergraph_AthenaViewStreamingReplayModal::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaViewStreamingReplayModal_C_ExecuteUbergraph_AthenaViewStreamingReplayModal, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000058, "Member 'AthenaViewStreamingReplayModal_C_ExecuteUbergraph_AthenaViewStreamingReplayModal::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaViewStreamingReplayModal_C_ExecuteUbergraph_AthenaViewStreamingReplayModal, CallFunc_IsValidGameSessionId_ReturnValue) == 0x000059, "Member 'AthenaViewStreamingReplayModal_C_ExecuteUbergraph_AthenaViewStreamingReplayModal::CallFunc_IsValidGameSessionId_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaViewStreamingReplayModal_C_ExecuteUbergraph_AthenaViewStreamingReplayModal, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000060, "Member 'AthenaViewStreamingReplayModal_C_ExecuteUbergraph_AthenaViewStreamingReplayModal::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaViewStreamingReplayModal_C_ExecuteUbergraph_AthenaViewStreamingReplayModal, K2Node_ComponentBoundEvent_Button) == 0x000070, "Member 'AthenaViewStreamingReplayModal_C_ExecuteUbergraph_AthenaViewStreamingReplayModal::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(AthenaViewStreamingReplayModal_C_ExecuteUbergraph_AthenaViewStreamingReplayModal, CallFunc_GetText_ReturnValue) == 0x000078, "Member 'AthenaViewStreamingReplayModal_C_ExecuteUbergraph_AthenaViewStreamingReplayModal::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaViewStreamingReplayModal_C_ExecuteUbergraph_AthenaViewStreamingReplayModal, CallFunc_Conv_TextToString_ReturnValue_2) == 0x000090, "Member 'AthenaViewStreamingReplayModal_C_ExecuteUbergraph_AthenaViewStreamingReplayModal::CallFunc_Conv_TextToString_ReturnValue_2' has a wrong offset!");

// Function AthenaViewStreamingReplayModal.AthenaViewStreamingReplayModal_C.BndEvt__SearchButton_K2Node_ComponentBoundEvent_8_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaViewStreamingReplayModal_C_BndEvt__SearchButton_K2Node_ComponentBoundEvent_8_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaViewStreamingReplayModal_C_BndEvt__SearchButton_K2Node_ComponentBoundEvent_8_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaViewStreamingReplayModal_C_BndEvt__SearchButton_K2Node_ComponentBoundEvent_8_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaViewStreamingReplayModal_C_BndEvt__SearchButton_K2Node_ComponentBoundEvent_8_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaViewStreamingReplayModal_C_BndEvt__SearchButton_K2Node_ComponentBoundEvent_8_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaViewStreamingReplayModal_C_BndEvt__SearchButton_K2Node_ComponentBoundEvent_8_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaViewStreamingReplayModal_C_BndEvt__SearchButton_K2Node_ComponentBoundEvent_8_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaViewStreamingReplayModal.AthenaViewStreamingReplayModal_C.BndEvt__GameSessionSearchText_K2Node_ComponentBoundEvent_7_OnEditableTextCommittedEvent__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct AthenaViewStreamingReplayModal_C_BndEvt__GameSessionSearchText_K2Node_ComponentBoundEvent_7_OnEditableTextCommittedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ETextCommit                                   CommitMethod;                                      // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaViewStreamingReplayModal_C_BndEvt__GameSessionSearchText_K2Node_ComponentBoundEvent_7_OnEditableTextCommittedEvent__DelegateSignature) == 0x000008, "Wrong alignment on AthenaViewStreamingReplayModal_C_BndEvt__GameSessionSearchText_K2Node_ComponentBoundEvent_7_OnEditableTextCommittedEvent__DelegateSignature");
static_assert(sizeof(AthenaViewStreamingReplayModal_C_BndEvt__GameSessionSearchText_K2Node_ComponentBoundEvent_7_OnEditableTextCommittedEvent__DelegateSignature) == 0x000020, "Wrong size on AthenaViewStreamingReplayModal_C_BndEvt__GameSessionSearchText_K2Node_ComponentBoundEvent_7_OnEditableTextCommittedEvent__DelegateSignature");
static_assert(offsetof(AthenaViewStreamingReplayModal_C_BndEvt__GameSessionSearchText_K2Node_ComponentBoundEvent_7_OnEditableTextCommittedEvent__DelegateSignature, Text) == 0x000000, "Member 'AthenaViewStreamingReplayModal_C_BndEvt__GameSessionSearchText_K2Node_ComponentBoundEvent_7_OnEditableTextCommittedEvent__DelegateSignature::Text' has a wrong offset!");
static_assert(offsetof(AthenaViewStreamingReplayModal_C_BndEvt__GameSessionSearchText_K2Node_ComponentBoundEvent_7_OnEditableTextCommittedEvent__DelegateSignature, CommitMethod) == 0x000018, "Member 'AthenaViewStreamingReplayModal_C_BndEvt__GameSessionSearchText_K2Node_ComponentBoundEvent_7_OnEditableTextCommittedEvent__DelegateSignature::CommitMethod' has a wrong offset!");

// Function AthenaViewStreamingReplayModal.AthenaViewStreamingReplayModal_C.BndEvt__GameSessionSearchText_K2Node_ComponentBoundEvent_5_OnEditableTextChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct AthenaViewStreamingReplayModal_C_BndEvt__GameSessionSearchText_K2Node_ComponentBoundEvent_5_OnEditableTextChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaViewStreamingReplayModal_C_BndEvt__GameSessionSearchText_K2Node_ComponentBoundEvent_5_OnEditableTextChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on AthenaViewStreamingReplayModal_C_BndEvt__GameSessionSearchText_K2Node_ComponentBoundEvent_5_OnEditableTextChangedEvent__DelegateSignature");
static_assert(sizeof(AthenaViewStreamingReplayModal_C_BndEvt__GameSessionSearchText_K2Node_ComponentBoundEvent_5_OnEditableTextChangedEvent__DelegateSignature) == 0x000018, "Wrong size on AthenaViewStreamingReplayModal_C_BndEvt__GameSessionSearchText_K2Node_ComponentBoundEvent_5_OnEditableTextChangedEvent__DelegateSignature");
static_assert(offsetof(AthenaViewStreamingReplayModal_C_BndEvt__GameSessionSearchText_K2Node_ComponentBoundEvent_5_OnEditableTextChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'AthenaViewStreamingReplayModal_C_BndEvt__GameSessionSearchText_K2Node_ComponentBoundEvent_5_OnEditableTextChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function AthenaViewStreamingReplayModal.AthenaViewStreamingReplayModal_C.BndEvt__CloseButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaViewStreamingReplayModal_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaViewStreamingReplayModal_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaViewStreamingReplayModal_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaViewStreamingReplayModal_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaViewStreamingReplayModal_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaViewStreamingReplayModal_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaViewStreamingReplayModal_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

}

