#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaLockerTab

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaLockerTab.AthenaLockerTab_C
// 0x01D8 (0x0FB0 - 0x0DD8)
class UAthenaLockerTab_C final : public UAthenaCustomizationScreenBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0DD8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ItemInfoIntroOutro;                                // 0x0DE0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               AccountOvr;                                        // 0x0DE8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaLocker_ItemInfo_C*               AthenaLocker_ItemInfo;                             // 0x0DF0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* BackpackSlot;                                      // 0x0DF8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationBannerButton_C*     BannerSlot;                                        // 0x0E00(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* BattleBusSlot;                                     // 0x0E08(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* CallingCardSlot;                                   // 0x0E10(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               CameraFramingWidget;                               // 0x0E18(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* CharacterSlot;                                     // 0x0E20(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULoadoutSaveConfirmation_C*             Confirmation_Save;                                 // 0x0E28(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* ContrailSlot;                                      // 0x0E30(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* DanceSlot1;                                        // 0x0E38(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* DanceSlot2;                                        // 0x0E40(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* DanceSlot3;                                        // 0x0E48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* DanceSlot4;                                        // 0x0E50(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* DanceSlot5;                                        // 0x0E58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* DanceSlot6;                                        // 0x0E60(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               EmotesOvr;                                         // 0x0E68(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               GearOvr;                                           // 0x0E70(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* GliderSlot;                                        // 0x0E78(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* HarvestToolSlot;                                   // 0x0E80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* HatSlot;                                           // 0x0E88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_93;                                          // 0x0E90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UItemInfoHeaderWidget_C*                ItemInfoHeaderWidget;                              // 0x0E98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* ItemWrapSlot1;                                     // 0x0EA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* ItemWrapSlot2;                                     // 0x0EA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* ItemWrapSlot3;                                     // 0x0EB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* ItemWrapSlot4;                                     // 0x0EB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* ItemWrapSlot5;                                     // 0x0EC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* ItemWrapSlot6;                                     // 0x0EC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* ItemWrapSlot7;                                     // 0x0ED0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               ItemWrapsOvr;                                      // 0x0ED8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* LoadScreenSlot;                                    // 0x0EE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* MapMarkerSlot;                                     // 0x0EE8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* MusicPackSlot;                                     // 0x0EF0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       NextRandom;                                        // 0x0EF8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Random_Disclaimer;                                 // 0x0F00(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_2;                                        // 0x0F08(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_iteminfo;                                 // 0x0F10(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ShortDescriptionText;                              // 0x0F18(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_nextrando;                                 // 0x0F20(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       StatsHeader;                                       // 0x0F28(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* TauntSlot;                                         // 0x0F30(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       UnsavedText;                                       // 0x0F38(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* VehicleSkinSlot;                                   // 0x0F40(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_buttons;                               // 0x0F48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* VictoryPoseSlot;                                   // 0x0F50(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UAthenaCustomizationSlotButtonWrapper_C*> AllSlots;                                          // 0x0F58(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference)
	EAthenaCustomizationCategory                  CurrentCustomizationType;                          // 0x0F68(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F69[0x3];                                      // 0x0F69(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrentSubslotIndex;                               // 0x0F6C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaItemCustomizationSelector_C*     ItemCustomizationSelector;                         // 0x0F70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButton_C*       CustomizationSlotButtonToPlayConfirmationOn;       // 0x0F78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           AutoHideDetailsForDances;                          // 0x0F80(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAthenaCustomizationSlotButtonWrapper_C* FirstSlotInMenu;                                   // 0x0F88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsFirstSlotBannerSlot;                            // 0x0F90(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F91[0x7];                                      // 0x0F91(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                LastHoveredSlot;                                   // 0x0F98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UAthenaCustomizationSlotButtonWrapper_C*> AnimBoundSlotArray;                                // 0x0FA0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference)

public:
	void ExecuteUbergraph_AthenaLockerTab(int32 EntryPoint);
	void BndEvt__Button_Loadouts_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void OnBeginPickingLoadouts();
	void OnScratchPadSaveStateUpdated(bool bSaved);
	void OnRefreshForNewLoadout(const class FString& LoadoutName, bool bIsShuffleTile);
	void PreConstruct(bool IsDesignTime);
	void BannerModalDeactivated();
	void OnTransitionedBySwitcher();
	void SetSlotToBannerSlot();
	void HideDetailsForDances();
	void BndEvt__BannerSlot_K2Node_ComponentBoundEvent_547_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__AthenaCustomizationBannerButton_490_K2Node_ComponentBoundEvent_205_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void Destruct();
	void Construct();
	void BP_OnDeactivated();
	void OnInputModeChanged(bool bUsingGamepad);
	void BP_OnActivated();
	void RegisterInputActions();
	void SelectInitialWidgetForGamepad();
	void SelectFirstWidget();
	void HandleSlotHovered(class UAthenaCustomizationSlotButtonWrapper_C* HoveredSlot, EAthenaCustomizationCategory Type, const class FText& HeaderText, const class FText& DescriptionText, int32 SubslotIndex);
	void ShowVaultItemByCategory(EAthenaCustomizationCategory CustomizationType, int32 SubslotIndex, bool CanShowEmpty);
	void SetItemDetailsToDisplay(class UFortItem* InputPin);
	class UWidget* GetWidgetForFramingViewedItem();
	void BeginPickingCustomization(class UCommonButton* WidgetToReturnFocusTo, const struct FAthenaCustomizationParams& CustomizationParams_0);
	void SetHeaderToBanner();
	void SelectWidget(class UAthenaCustomizationSlotButtonWrapper_C* InSelection);
	void CanShowEmptyForType(EAthenaCustomizationCategory CustomizationType, bool* bCanShowEmpty);
	void PlaySlotClickedAnimation(class UAthenaCustomizationSlotButton_C* SlotToPlayAnimOn);
	void OkToReshowOnHover(EAthenaCustomizationCategory Type, int32 Index_0, bool* Ok);
	void EnableSlotsForSTW();
	void PlayEquippedLockerMusic_STW();
	void SetupNavigation();
	void SetupWarningForSlot(class UAthenaCustomizationSlotButtonWrapper_C* InSlot);
	void PlaySlotAnimationAndCenterSlot();
	void CheckOverrideCampaignHeroItemDetails(class UAthenaCustomizationSlotButtonWrapper_C* SlotButtonWrapper);
	void ShowBannerLockerSlot(bool bCanShowEmpty);
	void SetHeaderToLoadouts();
	void PopulationAnim();
	void CreatePopulationAnimArray();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaLockerTab_C">();
	}
	static class UAthenaLockerTab_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaLockerTab_C>();
	}
};
static_assert(alignof(UAthenaLockerTab_C) == 0x000008, "Wrong alignment on UAthenaLockerTab_C");
static_assert(sizeof(UAthenaLockerTab_C) == 0x000FB0, "Wrong size on UAthenaLockerTab_C");
static_assert(offsetof(UAthenaLockerTab_C, UberGraphFrame) == 0x000DD8, "Member 'UAthenaLockerTab_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, ItemInfoIntroOutro) == 0x000DE0, "Member 'UAthenaLockerTab_C::ItemInfoIntroOutro' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, AccountOvr) == 0x000DE8, "Member 'UAthenaLockerTab_C::AccountOvr' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, AthenaLocker_ItemInfo) == 0x000DF0, "Member 'UAthenaLockerTab_C::AthenaLocker_ItemInfo' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, BackpackSlot) == 0x000DF8, "Member 'UAthenaLockerTab_C::BackpackSlot' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, BannerSlot) == 0x000E00, "Member 'UAthenaLockerTab_C::BannerSlot' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, BattleBusSlot) == 0x000E08, "Member 'UAthenaLockerTab_C::BattleBusSlot' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, CallingCardSlot) == 0x000E10, "Member 'UAthenaLockerTab_C::CallingCardSlot' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, CameraFramingWidget) == 0x000E18, "Member 'UAthenaLockerTab_C::CameraFramingWidget' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, CharacterSlot) == 0x000E20, "Member 'UAthenaLockerTab_C::CharacterSlot' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, Confirmation_Save) == 0x000E28, "Member 'UAthenaLockerTab_C::Confirmation_Save' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, ContrailSlot) == 0x000E30, "Member 'UAthenaLockerTab_C::ContrailSlot' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, DanceSlot1) == 0x000E38, "Member 'UAthenaLockerTab_C::DanceSlot1' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, DanceSlot2) == 0x000E40, "Member 'UAthenaLockerTab_C::DanceSlot2' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, DanceSlot3) == 0x000E48, "Member 'UAthenaLockerTab_C::DanceSlot3' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, DanceSlot4) == 0x000E50, "Member 'UAthenaLockerTab_C::DanceSlot4' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, DanceSlot5) == 0x000E58, "Member 'UAthenaLockerTab_C::DanceSlot5' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, DanceSlot6) == 0x000E60, "Member 'UAthenaLockerTab_C::DanceSlot6' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, EmotesOvr) == 0x000E68, "Member 'UAthenaLockerTab_C::EmotesOvr' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, GearOvr) == 0x000E70, "Member 'UAthenaLockerTab_C::GearOvr' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, GliderSlot) == 0x000E78, "Member 'UAthenaLockerTab_C::GliderSlot' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, HarvestToolSlot) == 0x000E80, "Member 'UAthenaLockerTab_C::HarvestToolSlot' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, HatSlot) == 0x000E88, "Member 'UAthenaLockerTab_C::HatSlot' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, Image_93) == 0x000E90, "Member 'UAthenaLockerTab_C::Image_93' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, ItemInfoHeaderWidget) == 0x000E98, "Member 'UAthenaLockerTab_C::ItemInfoHeaderWidget' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, ItemWrapSlot1) == 0x000EA0, "Member 'UAthenaLockerTab_C::ItemWrapSlot1' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, ItemWrapSlot2) == 0x000EA8, "Member 'UAthenaLockerTab_C::ItemWrapSlot2' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, ItemWrapSlot3) == 0x000EB0, "Member 'UAthenaLockerTab_C::ItemWrapSlot3' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, ItemWrapSlot4) == 0x000EB8, "Member 'UAthenaLockerTab_C::ItemWrapSlot4' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, ItemWrapSlot5) == 0x000EC0, "Member 'UAthenaLockerTab_C::ItemWrapSlot5' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, ItemWrapSlot6) == 0x000EC8, "Member 'UAthenaLockerTab_C::ItemWrapSlot6' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, ItemWrapSlot7) == 0x000ED0, "Member 'UAthenaLockerTab_C::ItemWrapSlot7' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, ItemWrapsOvr) == 0x000ED8, "Member 'UAthenaLockerTab_C::ItemWrapsOvr' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, LoadScreenSlot) == 0x000EE0, "Member 'UAthenaLockerTab_C::LoadScreenSlot' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, MapMarkerSlot) == 0x000EE8, "Member 'UAthenaLockerTab_C::MapMarkerSlot' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, MusicPackSlot) == 0x000EF0, "Member 'UAthenaLockerTab_C::MusicPackSlot' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, NextRandom) == 0x000EF8, "Member 'UAthenaLockerTab_C::NextRandom' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, Random_Disclaimer) == 0x000F00, "Member 'UAthenaLockerTab_C::Random_Disclaimer' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, SafeZone_2) == 0x000F08, "Member 'UAthenaLockerTab_C::SafeZone_2' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, SafeZone_iteminfo) == 0x000F10, "Member 'UAthenaLockerTab_C::SafeZone_iteminfo' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, ShortDescriptionText) == 0x000F18, "Member 'UAthenaLockerTab_C::ShortDescriptionText' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, SizeBox_nextrando) == 0x000F20, "Member 'UAthenaLockerTab_C::SizeBox_nextrando' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, StatsHeader) == 0x000F28, "Member 'UAthenaLockerTab_C::StatsHeader' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, TauntSlot) == 0x000F30, "Member 'UAthenaLockerTab_C::TauntSlot' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, UnsavedText) == 0x000F38, "Member 'UAthenaLockerTab_C::UnsavedText' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, VehicleSkinSlot) == 0x000F40, "Member 'UAthenaLockerTab_C::VehicleSkinSlot' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, VerticalBox_buttons) == 0x000F48, "Member 'UAthenaLockerTab_C::VerticalBox_buttons' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, VictoryPoseSlot) == 0x000F50, "Member 'UAthenaLockerTab_C::VictoryPoseSlot' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, AllSlots) == 0x000F58, "Member 'UAthenaLockerTab_C::AllSlots' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, CurrentCustomizationType) == 0x000F68, "Member 'UAthenaLockerTab_C::CurrentCustomizationType' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, CurrentSubslotIndex) == 0x000F6C, "Member 'UAthenaLockerTab_C::CurrentSubslotIndex' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, ItemCustomizationSelector) == 0x000F70, "Member 'UAthenaLockerTab_C::ItemCustomizationSelector' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, CustomizationSlotButtonToPlayConfirmationOn) == 0x000F78, "Member 'UAthenaLockerTab_C::CustomizationSlotButtonToPlayConfirmationOn' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, AutoHideDetailsForDances) == 0x000F80, "Member 'UAthenaLockerTab_C::AutoHideDetailsForDances' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, FirstSlotInMenu) == 0x000F88, "Member 'UAthenaLockerTab_C::FirstSlotInMenu' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, bIsFirstSlotBannerSlot) == 0x000F90, "Member 'UAthenaLockerTab_C::bIsFirstSlotBannerSlot' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, LastHoveredSlot) == 0x000F98, "Member 'UAthenaLockerTab_C::LastHoveredSlot' has a wrong offset!");
static_assert(offsetof(UAthenaLockerTab_C, AnimBoundSlotArray) == 0x000FA0, "Member 'UAthenaLockerTab_C::AnimBoundSlotArray' has a wrong offset!");

}

