#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaMatchmakingKnobsModal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaMatchmakingKnobsModal.AthenaMatchmakingKnobsModal_C
// 0x0060 (0x05D0 - 0x0570)
class UAthenaMatchmakingKnobsModal_C final : public UFortMatchmakingKnobsModal
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0570(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OutIn;                                             // 0x0578(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCloseButton_C*                         Button_CloseMobile;                                // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      CancelButton;                                      // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ConfirmSelectionShine;                             // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULightbox_C*                            Lightbox;                                          // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          ModalContent;                                      // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      RestoreDefaultsButton;                             // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class FString>                         DebugOptions;                                      // 0x05B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UObject*>                        ListItems;                                         // 0x05C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_AthenaMatchmakingKnobsModal(int32 EntryPoint);
	void BndEvt__RestoreDefaultsButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__CancelButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__Button_CloseMobile_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void WidgetAnimationEvt_OutIn_K2Node_WidgetAnimationEvent_0();
	void WidgetAnimationEvt_OutIn_K2Node_WidgetAnimationEvent_1();
	void BndEvt__CloseButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__AcceptButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void OnInputModeChanged(bool bUsingGamepad);
	void BP_OnActivated();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaMatchmakingKnobsModal_C">();
	}
	static class UAthenaMatchmakingKnobsModal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaMatchmakingKnobsModal_C>();
	}
};
static_assert(alignof(UAthenaMatchmakingKnobsModal_C) == 0x000008, "Wrong alignment on UAthenaMatchmakingKnobsModal_C");
static_assert(sizeof(UAthenaMatchmakingKnobsModal_C) == 0x0005D0, "Wrong size on UAthenaMatchmakingKnobsModal_C");
static_assert(offsetof(UAthenaMatchmakingKnobsModal_C, UberGraphFrame) == 0x000570, "Member 'UAthenaMatchmakingKnobsModal_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingKnobsModal_C, OutIn) == 0x000578, "Member 'UAthenaMatchmakingKnobsModal_C::OutIn' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingKnobsModal_C, Button_CloseMobile) == 0x000580, "Member 'UAthenaMatchmakingKnobsModal_C::Button_CloseMobile' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingKnobsModal_C, CancelButton) == 0x000588, "Member 'UAthenaMatchmakingKnobsModal_C::CancelButton' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingKnobsModal_C, ConfirmSelectionShine) == 0x000590, "Member 'UAthenaMatchmakingKnobsModal_C::ConfirmSelectionShine' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingKnobsModal_C, Lightbox) == 0x000598, "Member 'UAthenaMatchmakingKnobsModal_C::Lightbox' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingKnobsModal_C, ModalContent) == 0x0005A0, "Member 'UAthenaMatchmakingKnobsModal_C::ModalContent' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingKnobsModal_C, RestoreDefaultsButton) == 0x0005A8, "Member 'UAthenaMatchmakingKnobsModal_C::RestoreDefaultsButton' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingKnobsModal_C, DebugOptions) == 0x0005B0, "Member 'UAthenaMatchmakingKnobsModal_C::DebugOptions' has a wrong offset!");
static_assert(offsetof(UAthenaMatchmakingKnobsModal_C, ListItems) == 0x0005C0, "Member 'UAthenaMatchmakingKnobsModal_C::ListItems' has a wrong offset!");

}

