#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaChallengePageView

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaChallengePageView.AthenaChallengePageView_C
// 0x0048 (0x0398 - 0x0350)
class UAthenaChallengePageView_C final : public UAthenaChallengePageView
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       PageCycleIn_Right;                                 // 0x0358(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PageCycleIn_Left;                                  // 0x0360(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PageCycleOut_Right;                                // 0x0368(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PageCycleOut_Left;                                 // 0x0370(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FrontendIntroAnim;                                 // 0x0378(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       InGameIntroAnim;                                   // 0x0380(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         HB_PageNumber;                                     // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       IntroAnim;                                         // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AthenaChallengePageView(int32 EntryPoint);
	void OnAnimFinished();
	void BP_OnIsInGameSet(bool bIsInGame);
	void BP_OnCyclePageOut(bool bForward);
	void BP_OnCyclePageIn(bool bForward);
	void BP_OnNumPagesSet(int32 NumPages);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaChallengePageView_C">();
	}
	static class UAthenaChallengePageView_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaChallengePageView_C>();
	}
};
static_assert(alignof(UAthenaChallengePageView_C) == 0x000008, "Wrong alignment on UAthenaChallengePageView_C");
static_assert(sizeof(UAthenaChallengePageView_C) == 0x000398, "Wrong size on UAthenaChallengePageView_C");
static_assert(offsetof(UAthenaChallengePageView_C, UberGraphFrame) == 0x000350, "Member 'UAthenaChallengePageView_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaChallengePageView_C, PageCycleIn_Right) == 0x000358, "Member 'UAthenaChallengePageView_C::PageCycleIn_Right' has a wrong offset!");
static_assert(offsetof(UAthenaChallengePageView_C, PageCycleIn_Left) == 0x000360, "Member 'UAthenaChallengePageView_C::PageCycleIn_Left' has a wrong offset!");
static_assert(offsetof(UAthenaChallengePageView_C, PageCycleOut_Right) == 0x000368, "Member 'UAthenaChallengePageView_C::PageCycleOut_Right' has a wrong offset!");
static_assert(offsetof(UAthenaChallengePageView_C, PageCycleOut_Left) == 0x000370, "Member 'UAthenaChallengePageView_C::PageCycleOut_Left' has a wrong offset!");
static_assert(offsetof(UAthenaChallengePageView_C, FrontendIntroAnim) == 0x000378, "Member 'UAthenaChallengePageView_C::FrontendIntroAnim' has a wrong offset!");
static_assert(offsetof(UAthenaChallengePageView_C, InGameIntroAnim) == 0x000380, "Member 'UAthenaChallengePageView_C::InGameIntroAnim' has a wrong offset!");
static_assert(offsetof(UAthenaChallengePageView_C, HB_PageNumber) == 0x000388, "Member 'UAthenaChallengePageView_C::HB_PageNumber' has a wrong offset!");
static_assert(offsetof(UAthenaChallengePageView_C, IntroAnim) == 0x000390, "Member 'UAthenaChallengePageView_C::IntroAnim' has a wrong offset!");

}

