#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaLeaderboardTab

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"
#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AthenaLeaderboardTab.AthenaLeaderboardTab_C.ExecuteUbergraph_AthenaLeaderboardTab
// 0x0260 (0x0260 - 0x0000)
struct AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortLeaderboardContext*                CallFunc_GetContext_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanShowLeaderboards_ReturnValue;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortLeaderboardContext*                CallFunc_GetContext_ReturnValue_1;                 // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanShowGlobalLeaderboards_ReturnValue;    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate;              // 0x003C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable_3;                              // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_8;                              // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_9;                              // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x004F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_10;                             // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_11;                             // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortLeaderboardContext*                CallFunc_GetContext_ReturnValue_2;                 // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanShowStats_ReturnValue;                 // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_12;                             // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_13;                             // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_14;                             // 0x0066(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_15;                             // 0x0067(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_ComponentBoundEvent_TabId_1;                // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_TabButton_1;            // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_ComponentBoundEvent_ActiveWidget;           // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_ActiveWidgetIndex;      // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Value_1;                // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Value;                  // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_TabId;                  // 0x0094(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_TabButton;              // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Remove_ReturnValue;                   // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_Event_Button;                               // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAthenaPlaylistLeaderboardData         K2Node_Event_PlaylistTabData_1;                    // 0x00B8(0x0068)(ConstParm)
	bool                                          K2Node_Event_bWasSuccessful;                       // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortLeaderboardRowProxyInstance*       K2Node_Event_LocalUserRow;                         // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event_QueryErrorStr;                        // 0x0130(0x0018)(ConstParm)
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0148(0x0018)()
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_162[0x6];                                      // 0x0162(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaLeaderboardTabButton_C*          K2Node_DynamicCast_AsAthena_Leaderboard_Tab_Button; // 0x0168(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAthenaPlaylistLeaderboardData         K2Node_Event_PlaylistTabData;                      // 0x0178(0x0068)(ConstParm)
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate_1;            // 0x01E0(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate_2;            // 0x01F0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable_7;                              // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_4;                           // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanShowFriendsOnlyLeaderboard_ReturnValue; // 0x0202(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_16;                             // 0x0203(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_17;                             // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_205[0x3];                                      // 0x0205(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x020C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_5;                           // 0x020D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x020E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x020F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_6;                           // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SelectTabByID_ReturnValue;                // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_8;                              // 0x0212(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HandleBackAction_PassThrough;             // 0x0213(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_214[0x4];                                      // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortLeaderboardContext*                CallFunc_GetContext_ReturnValue_3;                 // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue_4;                 // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanShowLeaderboards_ReturnValue_1;        // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_229[0x3];                                      // 0x0229(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_7;                           // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              K2Node_CustomEvent_bNewInputType;                  // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_232[0x6];                                      // 0x0232(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue;            // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_8;                           // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_241[0x3];                                      // 0x0241(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_1;                               // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_9;                              // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_249[0x3];                                      // 0x0249(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_9;                           // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button_1;               // 0x0250(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0258(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab) == 0x000008, "Wrong alignment on AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab");
static_assert(sizeof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab) == 0x000260, "Wrong size on AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, EntryPoint) == 0x000000, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, Temp_byte_Variable) == 0x000004, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, Temp_byte_Variable_1) == 0x000005, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, Temp_bool_Variable) == 0x000006, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, Temp_byte_Variable_2) == 0x000007, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, Temp_byte_Variable_3) == 0x000008, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, CallFunc_GetContext_ReturnValue) == 0x000010, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, Temp_bool_Variable_1) == 0x000018, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, CallFunc_CanShowLeaderboards_ReturnValue) == 0x000019, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::CallFunc_CanShowLeaderboards_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, Temp_byte_Variable_4) == 0x00001A, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, Temp_byte_Variable_5) == 0x00001B, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, CallFunc_GetContext_ReturnValue_1) == 0x000020, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, CallFunc_CanShowGlobalLeaderboards_ReturnValue) == 0x000028, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::CallFunc_CanShowGlobalLeaderboards_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, Temp_bool_Variable_2) == 0x000029, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, Temp_byte_Variable_6) == 0x00002A, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, Temp_byte_Variable_7) == 0x00002B, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000030, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, K2Node_Select_Default) == 0x000038, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, K2Node_CreateDelegate_OutputDelegate) == 0x00003C, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, Temp_bool_Variable_3) == 0x00004C, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, Temp_byte_Variable_8) == 0x00004D, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, Temp_byte_Variable_9) == 0x00004E, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::Temp_byte_Variable_9' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, Temp_bool_Variable_4) == 0x00004F, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, Temp_byte_Variable_10) == 0x000050, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::Temp_byte_Variable_10' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, Temp_byte_Variable_11) == 0x000051, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::Temp_byte_Variable_11' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, CallFunc_GetContext_ReturnValue_2) == 0x000058, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::CallFunc_GetContext_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, Temp_bool_Variable_5) == 0x000060, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, CallFunc_CanShowStats_ReturnValue) == 0x000061, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::CallFunc_CanShowStats_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, Temp_byte_Variable_12) == 0x000062, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::Temp_byte_Variable_12' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, Temp_byte_Variable_13) == 0x000063, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::Temp_byte_Variable_13' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, Temp_bool_Variable_6) == 0x000064, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, K2Node_Select_Default_1) == 0x000065, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, Temp_byte_Variable_14) == 0x000066, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::Temp_byte_Variable_14' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, Temp_byte_Variable_15) == 0x000067, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::Temp_byte_Variable_15' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, K2Node_Select_Default_2) == 0x000068, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, K2Node_ComponentBoundEvent_TabId_1) == 0x00006C, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::K2Node_ComponentBoundEvent_TabId_1' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, K2Node_ComponentBoundEvent_TabButton_1) == 0x000078, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::K2Node_ComponentBoundEvent_TabButton_1' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, K2Node_ComponentBoundEvent_ActiveWidget) == 0x000080, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::K2Node_ComponentBoundEvent_ActiveWidget' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, K2Node_ComponentBoundEvent_ActiveWidgetIndex) == 0x000088, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::K2Node_ComponentBoundEvent_ActiveWidgetIndex' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, K2Node_ComponentBoundEvent_Value_1) == 0x00008C, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::K2Node_ComponentBoundEvent_Value_1' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, K2Node_ComponentBoundEvent_Value) == 0x000090, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::K2Node_ComponentBoundEvent_Value' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, K2Node_ComponentBoundEvent_TabId) == 0x000094, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::K2Node_ComponentBoundEvent_TabId' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, K2Node_ComponentBoundEvent_TabButton) == 0x0000A0, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::K2Node_ComponentBoundEvent_TabButton' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, CallFunc_Map_Remove_ReturnValue) == 0x0000A8, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::CallFunc_Map_Remove_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, K2Node_Event_Button) == 0x0000B0, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::K2Node_Event_Button' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, K2Node_Event_PlaylistTabData_1) == 0x0000B8, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::K2Node_Event_PlaylistTabData_1' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, K2Node_Event_bWasSuccessful) == 0x000120, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::K2Node_Event_bWasSuccessful' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, K2Node_Event_LocalUserRow) == 0x000128, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::K2Node_Event_LocalUserRow' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, K2Node_Event_QueryErrorStr) == 0x000130, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::K2Node_Event_QueryErrorStr' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, CallFunc_TextToUpper_ReturnValue) == 0x000148, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000160, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, K2Node_Select_Default_3) == 0x000161, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, K2Node_DynamicCast_AsAthena_Leaderboard_Tab_Button) == 0x000168, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::K2Node_DynamicCast_AsAthena_Leaderboard_Tab_Button' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, K2Node_DynamicCast_bSuccess) == 0x000170, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, K2Node_Event_PlaylistTabData) == 0x000178, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::K2Node_Event_PlaylistTabData' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, K2Node_CreateDelegate_OutputDelegate_1) == 0x0001E0, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, K2Node_CreateDelegate_OutputDelegate_2) == 0x0001F0, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, Temp_bool_Variable_7) == 0x000200, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::Temp_bool_Variable_7' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, K2Node_Select_Default_4) == 0x000201, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, CallFunc_CanShowFriendsOnlyLeaderboard_ReturnValue) == 0x000202, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::CallFunc_CanShowFriendsOnlyLeaderboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, Temp_byte_Variable_16) == 0x000203, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::Temp_byte_Variable_16' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, Temp_byte_Variable_17) == 0x000204, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::Temp_byte_Variable_17' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, CallFunc_Array_Length_ReturnValue) == 0x000208, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, CallFunc_Greater_IntInt_ReturnValue) == 0x00020C, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, K2Node_Select_Default_5) == 0x00020D, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, CallFunc_BooleanAND_ReturnValue) == 0x00020E, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, CallFunc_BooleanAND_ReturnValue_1) == 0x00020F, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, K2Node_Select_Default_6) == 0x000210, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::K2Node_Select_Default_6' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, CallFunc_SelectTabByID_ReturnValue) == 0x000211, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::CallFunc_SelectTabByID_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, Temp_bool_Variable_8) == 0x000212, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::Temp_bool_Variable_8' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, CallFunc_HandleBackAction_PassThrough) == 0x000213, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::CallFunc_HandleBackAction_PassThrough' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, CallFunc_GetContext_ReturnValue_3) == 0x000218, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::CallFunc_GetContext_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, CallFunc_GetContext_ReturnValue_4) == 0x000220, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::CallFunc_GetContext_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, CallFunc_CanShowLeaderboards_ReturnValue_1) == 0x000228, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::CallFunc_CanShowLeaderboards_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, Temp_int_Variable) == 0x00022C, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, K2Node_Select_Default_7) == 0x000230, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::K2Node_Select_Default_7' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, K2Node_CustomEvent_bNewInputType) == 0x000231, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::K2Node_CustomEvent_bNewInputType' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, CallFunc_GetRuntimeOptions_ReturnValue) == 0x000238, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::CallFunc_GetRuntimeOptions_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, K2Node_Select_Default_8) == 0x000240, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::K2Node_Select_Default_8' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, Temp_int_Variable_1) == 0x000244, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, Temp_bool_Variable_9) == 0x000248, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::Temp_bool_Variable_9' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, K2Node_Select_Default_9) == 0x00024C, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::K2Node_Select_Default_9' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, K2Node_ComponentBoundEvent_Button_1) == 0x000250, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab, K2Node_ComponentBoundEvent_Button) == 0x000258, "Member 'AthenaLeaderboardTab_C_ExecuteUbergraph_AthenaLeaderboardTab::K2Node_ComponentBoundEvent_Button' has a wrong offset!");

// Function AthenaLeaderboardTab.AthenaLeaderboardTab_C.BndEvt__CloseButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaLeaderboardTab_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLeaderboardTab_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaLeaderboardTab_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaLeaderboardTab_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaLeaderboardTab_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaLeaderboardTab_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaLeaderboardTab_C_BndEvt__CloseButton_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaLeaderboardTab.AthenaLeaderboardTab_C.BndEvt__CloseButton_2_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct AthenaLeaderboardTab_C_BndEvt__CloseButton_2_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLeaderboardTab_C_BndEvt__CloseButton_2_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on AthenaLeaderboardTab_C_BndEvt__CloseButton_2_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(AthenaLeaderboardTab_C_BndEvt__CloseButton_2_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on AthenaLeaderboardTab_C_BndEvt__CloseButton_2_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(AthenaLeaderboardTab_C_BndEvt__CloseButton_2_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'AthenaLeaderboardTab_C_BndEvt__CloseButton_2_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function AthenaLeaderboardTab.AthenaLeaderboardTab_C.OnInputMethodChanged_Event_0
// 0x0001 (0x0001 - 0x0000)
struct AthenaLeaderboardTab_C_OnInputMethodChanged_Event_0 final
{
public:
	ECommonInputType                              bNewInputType;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLeaderboardTab_C_OnInputMethodChanged_Event_0) == 0x000001, "Wrong alignment on AthenaLeaderboardTab_C_OnInputMethodChanged_Event_0");
static_assert(sizeof(AthenaLeaderboardTab_C_OnInputMethodChanged_Event_0) == 0x000001, "Wrong size on AthenaLeaderboardTab_C_OnInputMethodChanged_Event_0");
static_assert(offsetof(AthenaLeaderboardTab_C_OnInputMethodChanged_Event_0, bNewInputType) == 0x000000, "Member 'AthenaLeaderboardTab_C_OnInputMethodChanged_Event_0::bNewInputType' has a wrong offset!");

// Function AthenaLeaderboardTab.AthenaLeaderboardTab_C.OnUpdateListHeader
// 0x0068 (0x0068 - 0x0000)
struct AthenaLeaderboardTab_C_OnUpdateListHeader final
{
public:
	struct FAthenaPlaylistLeaderboardData         PlaylistTabData;                                   // 0x0000(0x0068)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaLeaderboardTab_C_OnUpdateListHeader) == 0x000008, "Wrong alignment on AthenaLeaderboardTab_C_OnUpdateListHeader");
static_assert(sizeof(AthenaLeaderboardTab_C_OnUpdateListHeader) == 0x000068, "Wrong size on AthenaLeaderboardTab_C_OnUpdateListHeader");
static_assert(offsetof(AthenaLeaderboardTab_C_OnUpdateListHeader, PlaylistTabData) == 0x000000, "Member 'AthenaLeaderboardTab_C_OnUpdateListHeader::PlaylistTabData' has a wrong offset!");

// Function AthenaLeaderboardTab.AthenaLeaderboardTab_C.OnUpdateLeaderboardListUI
// 0x0028 (0x0028 - 0x0000)
struct AthenaLeaderboardTab_C_OnUpdateLeaderboardListUI final
{
public:
	bool                                          bWasSuccessful;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortLeaderboardRowProxyInstance*       LocalUserRow_0;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   QueryErrorStr;                                     // 0x0010(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaLeaderboardTab_C_OnUpdateLeaderboardListUI) == 0x000008, "Wrong alignment on AthenaLeaderboardTab_C_OnUpdateLeaderboardListUI");
static_assert(sizeof(AthenaLeaderboardTab_C_OnUpdateLeaderboardListUI) == 0x000028, "Wrong size on AthenaLeaderboardTab_C_OnUpdateLeaderboardListUI");
static_assert(offsetof(AthenaLeaderboardTab_C_OnUpdateLeaderboardListUI, bWasSuccessful) == 0x000000, "Member 'AthenaLeaderboardTab_C_OnUpdateLeaderboardListUI::bWasSuccessful' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_OnUpdateLeaderboardListUI, LocalUserRow_0) == 0x000008, "Member 'AthenaLeaderboardTab_C_OnUpdateLeaderboardListUI::LocalUserRow_0' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_OnUpdateLeaderboardListUI, QueryErrorStr) == 0x000010, "Member 'AthenaLeaderboardTab_C_OnUpdateLeaderboardListUI::QueryErrorStr' has a wrong offset!");

// Function AthenaLeaderboardTab.AthenaLeaderboardTab_C.OnUpdateTabButtonText
// 0x0070 (0x0070 - 0x0000)
struct AthenaLeaderboardTab_C_OnUpdateTabButtonText final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAthenaPlaylistLeaderboardData         PlaylistTabData;                                   // 0x0008(0x0068)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(AthenaLeaderboardTab_C_OnUpdateTabButtonText) == 0x000008, "Wrong alignment on AthenaLeaderboardTab_C_OnUpdateTabButtonText");
static_assert(sizeof(AthenaLeaderboardTab_C_OnUpdateTabButtonText) == 0x000070, "Wrong size on AthenaLeaderboardTab_C_OnUpdateTabButtonText");
static_assert(offsetof(AthenaLeaderboardTab_C_OnUpdateTabButtonText, Button) == 0x000000, "Member 'AthenaLeaderboardTab_C_OnUpdateTabButtonText::Button' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_OnUpdateTabButtonText, PlaylistTabData) == 0x000008, "Member 'AthenaLeaderboardTab_C_OnUpdateTabButtonText::PlaylistTabData' has a wrong offset!");

// Function AthenaLeaderboardTab.AthenaLeaderboardTab_C.BndEvt__LeaderboardTabList_K2Node_ComponentBoundEvent_57_OnTabButtonRemoved__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct AthenaLeaderboardTab_C_BndEvt__LeaderboardTabList_K2Node_ComponentBoundEvent_57_OnTabButtonRemoved__DelegateSignature final
{
public:
	class FName                                   TabId;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          TabButton;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLeaderboardTab_C_BndEvt__LeaderboardTabList_K2Node_ComponentBoundEvent_57_OnTabButtonRemoved__DelegateSignature) == 0x000008, "Wrong alignment on AthenaLeaderboardTab_C_BndEvt__LeaderboardTabList_K2Node_ComponentBoundEvent_57_OnTabButtonRemoved__DelegateSignature");
static_assert(sizeof(AthenaLeaderboardTab_C_BndEvt__LeaderboardTabList_K2Node_ComponentBoundEvent_57_OnTabButtonRemoved__DelegateSignature) == 0x000010, "Wrong size on AthenaLeaderboardTab_C_BndEvt__LeaderboardTabList_K2Node_ComponentBoundEvent_57_OnTabButtonRemoved__DelegateSignature");
static_assert(offsetof(AthenaLeaderboardTab_C_BndEvt__LeaderboardTabList_K2Node_ComponentBoundEvent_57_OnTabButtonRemoved__DelegateSignature, TabId) == 0x000000, "Member 'AthenaLeaderboardTab_C_BndEvt__LeaderboardTabList_K2Node_ComponentBoundEvent_57_OnTabButtonRemoved__DelegateSignature::TabId' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_BndEvt__LeaderboardTabList_K2Node_ComponentBoundEvent_57_OnTabButtonRemoved__DelegateSignature, TabButton) == 0x000008, "Member 'AthenaLeaderboardTab_C_BndEvt__LeaderboardTabList_K2Node_ComponentBoundEvent_57_OnTabButtonRemoved__DelegateSignature::TabButton' has a wrong offset!");

// Function AthenaLeaderboardTab.AthenaLeaderboardTab_C.BndEvt__FriendsRotator_K2Node_ComponentBoundEvent_63_OnRotated__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct AthenaLeaderboardTab_C_BndEvt__FriendsRotator_K2Node_ComponentBoundEvent_63_OnRotated__DelegateSignature final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLeaderboardTab_C_BndEvt__FriendsRotator_K2Node_ComponentBoundEvent_63_OnRotated__DelegateSignature) == 0x000004, "Wrong alignment on AthenaLeaderboardTab_C_BndEvt__FriendsRotator_K2Node_ComponentBoundEvent_63_OnRotated__DelegateSignature");
static_assert(sizeof(AthenaLeaderboardTab_C_BndEvt__FriendsRotator_K2Node_ComponentBoundEvent_63_OnRotated__DelegateSignature) == 0x000004, "Wrong size on AthenaLeaderboardTab_C_BndEvt__FriendsRotator_K2Node_ComponentBoundEvent_63_OnRotated__DelegateSignature");
static_assert(offsetof(AthenaLeaderboardTab_C_BndEvt__FriendsRotator_K2Node_ComponentBoundEvent_63_OnRotated__DelegateSignature, Value) == 0x000000, "Member 'AthenaLeaderboardTab_C_BndEvt__FriendsRotator_K2Node_ComponentBoundEvent_63_OnRotated__DelegateSignature::Value' has a wrong offset!");

// Function AthenaLeaderboardTab.AthenaLeaderboardTab_C.BndEvt__MatchRotator_K2Node_ComponentBoundEvent_39_OnRotated__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct AthenaLeaderboardTab_C_BndEvt__MatchRotator_K2Node_ComponentBoundEvent_39_OnRotated__DelegateSignature final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLeaderboardTab_C_BndEvt__MatchRotator_K2Node_ComponentBoundEvent_39_OnRotated__DelegateSignature) == 0x000004, "Wrong alignment on AthenaLeaderboardTab_C_BndEvt__MatchRotator_K2Node_ComponentBoundEvent_39_OnRotated__DelegateSignature");
static_assert(sizeof(AthenaLeaderboardTab_C_BndEvt__MatchRotator_K2Node_ComponentBoundEvent_39_OnRotated__DelegateSignature) == 0x000004, "Wrong size on AthenaLeaderboardTab_C_BndEvt__MatchRotator_K2Node_ComponentBoundEvent_39_OnRotated__DelegateSignature");
static_assert(offsetof(AthenaLeaderboardTab_C_BndEvt__MatchRotator_K2Node_ComponentBoundEvent_39_OnRotated__DelegateSignature, Value) == 0x000000, "Member 'AthenaLeaderboardTab_C_BndEvt__MatchRotator_K2Node_ComponentBoundEvent_39_OnRotated__DelegateSignature::Value' has a wrong offset!");

// Function AthenaLeaderboardTab.AthenaLeaderboardTab_C.BndEvt__LeaderboardSwitcher_K2Node_ComponentBoundEvent_17_OnActiveWidgetChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct AthenaLeaderboardTab_C_BndEvt__LeaderboardSwitcher_K2Node_ComponentBoundEvent_17_OnActiveWidgetChanged__DelegateSignature final
{
public:
	class UWidget*                                ActiveWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ActiveWidgetIndex;                                 // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLeaderboardTab_C_BndEvt__LeaderboardSwitcher_K2Node_ComponentBoundEvent_17_OnActiveWidgetChanged__DelegateSignature) == 0x000008, "Wrong alignment on AthenaLeaderboardTab_C_BndEvt__LeaderboardSwitcher_K2Node_ComponentBoundEvent_17_OnActiveWidgetChanged__DelegateSignature");
static_assert(sizeof(AthenaLeaderboardTab_C_BndEvt__LeaderboardSwitcher_K2Node_ComponentBoundEvent_17_OnActiveWidgetChanged__DelegateSignature) == 0x000010, "Wrong size on AthenaLeaderboardTab_C_BndEvt__LeaderboardSwitcher_K2Node_ComponentBoundEvent_17_OnActiveWidgetChanged__DelegateSignature");
static_assert(offsetof(AthenaLeaderboardTab_C_BndEvt__LeaderboardSwitcher_K2Node_ComponentBoundEvent_17_OnActiveWidgetChanged__DelegateSignature, ActiveWidget) == 0x000000, "Member 'AthenaLeaderboardTab_C_BndEvt__LeaderboardSwitcher_K2Node_ComponentBoundEvent_17_OnActiveWidgetChanged__DelegateSignature::ActiveWidget' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_BndEvt__LeaderboardSwitcher_K2Node_ComponentBoundEvent_17_OnActiveWidgetChanged__DelegateSignature, ActiveWidgetIndex) == 0x000008, "Member 'AthenaLeaderboardTab_C_BndEvt__LeaderboardSwitcher_K2Node_ComponentBoundEvent_17_OnActiveWidgetChanged__DelegateSignature::ActiveWidgetIndex' has a wrong offset!");

// Function AthenaLeaderboardTab.AthenaLeaderboardTab_C.BndEvt__SecondaryTabList_K2Node_ComponentBoundEvent_189_OnTabButtonCreated__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct AthenaLeaderboardTab_C_BndEvt__SecondaryTabList_K2Node_ComponentBoundEvent_189_OnTabButtonCreated__DelegateSignature final
{
public:
	class FName                                   TabId;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          TabButton;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaLeaderboardTab_C_BndEvt__SecondaryTabList_K2Node_ComponentBoundEvent_189_OnTabButtonCreated__DelegateSignature) == 0x000008, "Wrong alignment on AthenaLeaderboardTab_C_BndEvt__SecondaryTabList_K2Node_ComponentBoundEvent_189_OnTabButtonCreated__DelegateSignature");
static_assert(sizeof(AthenaLeaderboardTab_C_BndEvt__SecondaryTabList_K2Node_ComponentBoundEvent_189_OnTabButtonCreated__DelegateSignature) == 0x000010, "Wrong size on AthenaLeaderboardTab_C_BndEvt__SecondaryTabList_K2Node_ComponentBoundEvent_189_OnTabButtonCreated__DelegateSignature");
static_assert(offsetof(AthenaLeaderboardTab_C_BndEvt__SecondaryTabList_K2Node_ComponentBoundEvent_189_OnTabButtonCreated__DelegateSignature, TabId) == 0x000000, "Member 'AthenaLeaderboardTab_C_BndEvt__SecondaryTabList_K2Node_ComponentBoundEvent_189_OnTabButtonCreated__DelegateSignature::TabId' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_BndEvt__SecondaryTabList_K2Node_ComponentBoundEvent_189_OnTabButtonCreated__DelegateSignature, TabButton) == 0x000008, "Member 'AthenaLeaderboardTab_C_BndEvt__SecondaryTabList_K2Node_ComponentBoundEvent_189_OnTabButtonCreated__DelegateSignature::TabButton' has a wrong offset!");

// Function AthenaLeaderboardTab.AthenaLeaderboardTab_C.OnPlaylistChangeGamepad
// 0x0028 (0x0028 - 0x0000)
struct AthenaLeaderboardTab_C_OnPlaylistChangeGamepad final
{
public:
	bool                                          bCommitted;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAthenaRotator_C*                       K2Node_DynamicCast_AsAthena_Rotator;               // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaLeaderboardTab_C_OnPlaylistChangeGamepad) == 0x000008, "Wrong alignment on AthenaLeaderboardTab_C_OnPlaylistChangeGamepad");
static_assert(sizeof(AthenaLeaderboardTab_C_OnPlaylistChangeGamepad) == 0x000028, "Wrong size on AthenaLeaderboardTab_C_OnPlaylistChangeGamepad");
static_assert(offsetof(AthenaLeaderboardTab_C_OnPlaylistChangeGamepad, bCommitted) == 0x000000, "Member 'AthenaLeaderboardTab_C_OnPlaylistChangeGamepad::bCommitted' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_OnPlaylistChangeGamepad, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'AthenaLeaderboardTab_C_OnPlaylistChangeGamepad::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_OnPlaylistChangeGamepad, CallFunc_GetCurrentInputType_ReturnValue) == 0x000010, "Member 'AthenaLeaderboardTab_C_OnPlaylistChangeGamepad::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_OnPlaylistChangeGamepad, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000011, "Member 'AthenaLeaderboardTab_C_OnPlaylistChangeGamepad::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_OnPlaylistChangeGamepad, K2Node_DynamicCast_AsAthena_Rotator) == 0x000018, "Member 'AthenaLeaderboardTab_C_OnPlaylistChangeGamepad::K2Node_DynamicCast_AsAthena_Rotator' has a wrong offset!");
static_assert(offsetof(AthenaLeaderboardTab_C_OnPlaylistChangeGamepad, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'AthenaLeaderboardTab_C_OnPlaylistChangeGamepad::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function AthenaLeaderboardTab.AthenaLeaderboardTab_C.OnFriendTypeChangeGamepad
// 0x0028 (0x0028 - 0x0000)
struct AthenaLeaderboardTab_C_OnFriendTypeChangeGamepad final
{
public:
	bool                                          bCommitted;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
