#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaReplayBrowserRow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaReplayBrowserRow.AthenaReplayBrowserRow_C
// 0x0028 (0x0BC8 - 0x0BA0)
class UAthenaReplayBrowserRow_C final : public UAthenaReplayBrowserEntryWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BA0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Selected_Hovered;                                  // 0x0BA8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hovered;                                           // 0x0BB0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Selected_Direct;                                   // 0x0BB8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonBorder*                          Border_Background;                                 // 0x0BC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AthenaReplayBrowserRow(int32 EntryPoint);
	void BP_HandleReplayStateSet(bool bSaved, bool Bold, bool bCorrupt);
	void BP_OnUnhovered();
	void BP_OnHovered();
	void BP_OnDeselected();
	void BP_OnSelected();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaReplayBrowserRow_C">();
	}
	static class UAthenaReplayBrowserRow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaReplayBrowserRow_C>();
	}
};
static_assert(alignof(UAthenaReplayBrowserRow_C) == 0x000008, "Wrong alignment on UAthenaReplayBrowserRow_C");
static_assert(sizeof(UAthenaReplayBrowserRow_C) == 0x000BC8, "Wrong size on UAthenaReplayBrowserRow_C");
static_assert(offsetof(UAthenaReplayBrowserRow_C, UberGraphFrame) == 0x000BA0, "Member 'UAthenaReplayBrowserRow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaReplayBrowserRow_C, Selected_Hovered) == 0x000BA8, "Member 'UAthenaReplayBrowserRow_C::Selected_Hovered' has a wrong offset!");
static_assert(offsetof(UAthenaReplayBrowserRow_C, Hovered) == 0x000BB0, "Member 'UAthenaReplayBrowserRow_C::Hovered' has a wrong offset!");
static_assert(offsetof(UAthenaReplayBrowserRow_C, Selected_Direct) == 0x000BB8, "Member 'UAthenaReplayBrowserRow_C::Selected_Direct' has a wrong offset!");
static_assert(offsetof(UAthenaReplayBrowserRow_C, Border_Background) == 0x000BC0, "Member 'UAthenaReplayBrowserRow_C::Border_Background' has a wrong offset!");

}

