#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_BGA_Athena_SilverBlazer_V2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function B_BGA_Athena_SilverBlazer_V2.B_BGA_Athena_SilverBlazer_V2_C.ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2
// 0x0510 (0x0510 - 0x0000)
struct B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue_1;       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0044(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_Event_MyComp;                               // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Other;                                // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp;                            // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSelfMoved;                           // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_HitLocation;                          // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_NormalImpulse;                        // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x00A8(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0134(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortVehicleInterface> K2Node_DynamicCast_AsFort_Vehicle_Interface;       // 0x0148(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortWeapon*                            K2Node_DynamicCast_AsFort_Weapon;                  // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16A[0x6];                                      // 0x016A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortWeaponItemDefinition*              CallFunc_GetWeaponData_ReturnValue;                // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0182(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_1;                     // 0x0183(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0185(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0186(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0187(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue_1;     // 0x0190(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Damage;                               // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  K2Node_Event_DamageTags;                           // 0x01A0(0x0020)(ConstParm)
	struct FVector                                K2Node_Event_Momentum;                             // 0x01C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitInfo;                              // 0x01CC(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AFortPawn*                              K2Node_Event_InstigatedBy;                         // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectContextHandle           K2Node_Event_EffectContext;                        // 0x0268(0x0018)()
	class AFortWeapon*                            K2Node_DynamicCast_AsFort_Weapon_1;                // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_289[0x3];                                      // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWeaponItemDefinition*              CallFunc_GetWeaponData_ReturnValue_1;              // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29A[0x2];                                      // 0x029A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x02A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x02B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x02BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x02C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x02E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0300(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x030C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue_1;       // 0x0318(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_2;                     // 0x0324(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_325[0x3];                                      // 0x0325(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetValueAtLevel_ReturnValue_1;            // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_2;            // 0x032C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_334[0x4];                                      // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0338(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0341(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_342[0x2];                                      // 0x0342(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue_2;     // 0x0348(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0350(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_2;                       // 0x035C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_ImpactLoc_1;                    // 0x0360(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_ImpactLoc;                      // 0x036C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_NormalizeToRange_ReturnValue;             // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_3;                       // 0x037C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_4;                       // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_5;                       // 0x0384(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_6;                       // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValueAtLevel_ReturnValue_3;            // 0x038C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_394[0x4];                                      // 0x0394(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0398(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x03A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x03B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B5[0x3];                                      // 0x03B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x03B8(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_444[0x4];                                      // 0x0444(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0448(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0458(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0460(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_464[0x4];                                      // 0x0464(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_Actor_1;                        // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_Actor;                          // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena;           // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0480(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_481[0x7];                                      // 0x0481(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena_1;         // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0490(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_491[0x3];                                      // 0x0491(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0494(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x04A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4AC[0x4];                                      // 0x04AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AEmitterCameraLensEffectBase*           CallFunc_SpawnCameraLensEffect_ReturnValue;        // 0x04B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEmitterCameraLensEffectBase*           CallFunc_SpawnCameraLensEffect_ReturnValue_1;      // 0x04B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C1[0x3];                                      // 0x04C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x04C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_5;        // 0x04D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x04DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue_3;     // 0x04E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue_1;         // 0x04F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4FC[0x4];                                      // 0x04FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue_4;     // 0x0500(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAttached_ReturnValue;           // 0x0508(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2) == 0x000008, "Wrong alignment on B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2");
static_assert(sizeof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2) == 0x000510, "Wrong size on B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, EntryPoint) == 0x000000, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_IsValid_ReturnValue_1) == 0x000005, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_IsValid_ReturnValue_2) == 0x000006, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_Lerp_ReturnValue) == 0x000008, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_Lerp_ReturnValue_1) == 0x00000C, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_IsValid_ReturnValue_3) == 0x000010, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_IsValid_ReturnValue_4) == 0x000011, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_SpawnSoundAtLocation_ReturnValue) == 0x000018, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_SpawnSoundAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_SpawnSoundAtLocation_ReturnValue_1) == 0x000020, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_SpawnSoundAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_HasAuthority_ReturnValue) == 0x000028, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_HasAuthority_ReturnValue_1) == 0x000029, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00002C, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000038, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, K2Node_CreateDelegate_OutputDelegate) == 0x000044, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000058, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_IsValid_ReturnValue_5) == 0x000060, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, K2Node_Event_MyComp) == 0x000068, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::K2Node_Event_MyComp' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, K2Node_Event_Other) == 0x000070, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::K2Node_Event_Other' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, K2Node_Event_OtherComp) == 0x000078, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::K2Node_Event_OtherComp' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, K2Node_Event_bSelfMoved) == 0x000080, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::K2Node_Event_bSelfMoved' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, K2Node_Event_HitLocation) == 0x000084, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, K2Node_Event_HitNormal) == 0x000090, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::K2Node_Event_HitNormal' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, K2Node_Event_NormalImpulse) == 0x00009C, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::K2Node_Event_NormalImpulse' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, K2Node_Event_Hit) == 0x0000A8, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000134, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_GetOwner_ReturnValue) == 0x000140, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, K2Node_DynamicCast_AsFort_Vehicle_Interface) == 0x000148, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::K2Node_DynamicCast_AsFort_Vehicle_Interface' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, K2Node_DynamicCast_bSuccess) == 0x000158, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, K2Node_DynamicCast_AsFort_Weapon) == 0x000160, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::K2Node_DynamicCast_AsFort_Weapon' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, K2Node_DynamicCast_bSuccess_1) == 0x000168, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_Not_PreBool_ReturnValue) == 0x000169, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_GetWeaponData_ReturnValue) == 0x000170, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_GetWeaponData_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000178, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, K2Node_DynamicCast_bSuccess_2) == 0x000180, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_Not_PreBool_ReturnValue_1) == 0x000181, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_HasTag_ReturnValue) == 0x000182, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_HasTag_ReturnValue_1) == 0x000183, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_HasTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000184, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_BooleanOR_ReturnValue) == 0x000185, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_BooleanAND_ReturnValue) == 0x000186, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_BooleanAND_ReturnValue_1) == 0x000187, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, Temp_bool_Has_Been_Initd_Variable) == 0x000188, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_SpawnEmitterAtLocation_ReturnValue_1) == 0x000190, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_SpawnEmitterAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, K2Node_Event_Damage) == 0x000198, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, K2Node_Event_DamageTags) == 0x0001A0, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::K2Node_Event_DamageTags' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, K2Node_Event_Momentum) == 0x0001C0, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::K2Node_Event_Momentum' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, K2Node_Event_HitInfo) == 0x0001CC, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::K2Node_Event_HitInfo' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, K2Node_Event_InstigatedBy) == 0x000258, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, K2Node_Event_DamageCauser) == 0x000260, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, K2Node_Event_EffectContext) == 0x000268, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::K2Node_Event_EffectContext' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, K2Node_DynamicCast_AsFort_Weapon_1) == 0x000280, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::K2Node_DynamicCast_AsFort_Weapon_1' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, K2Node_DynamicCast_bSuccess_3) == 0x000288, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_GetValueAtLevel_ReturnValue) == 0x00028C, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_GetWeaponData_ReturnValue_1) == 0x000290, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_GetWeaponData_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_BreakHitResult_bBlockingHit) == 0x000298, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_BreakHitResult_bInitialOverlap) == 0x000299, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_BreakHitResult_Time) == 0x00029C, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_BreakHitResult_Distance) == 0x0002A0, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_BreakHitResult_Location) == 0x0002A4, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_BreakHitResult_ImpactPoint) == 0x0002B0, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_BreakHitResult_Normal) == 0x0002BC, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_BreakHitResult_ImpactNormal) == 0x0002C8, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_BreakHitResult_PhysMat) == 0x0002D8, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_BreakHitResult_HitActor) == 0x0002E0, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_BreakHitResult_HitComponent) == 0x0002E8, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_BreakHitResult_HitBoneName) == 0x0002F0, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_BreakHitResult_HitItem) == 0x0002F8, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_BreakHitResult_FaceIndex) == 0x0002FC, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_BreakHitResult_TraceStart) == 0x000300, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_BreakHitResult_TraceEnd) == 0x00030C, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_Conv_VectorToRotator_ReturnValue_1) == 0x000318, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_Conv_VectorToRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_HasTag_ReturnValue_2) == 0x000324, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_HasTag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_GetValueAtLevel_ReturnValue_1) == 0x000328, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_GetValueAtLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_GetValueAtLevel_ReturnValue_2) == 0x00032C, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_GetValueAtLevel_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000330, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000338, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_IsValid_ReturnValue_6) == 0x000340, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_IsValid_ReturnValue_7) == 0x000341, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000344, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_SpawnEmitterAtLocation_ReturnValue_2) == 0x000348, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_SpawnEmitterAtLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000350, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_Lerp_ReturnValue_2) == 0x00035C, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_Lerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, K2Node_CustomEvent_ImpactLoc_1) == 0x000360, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::K2Node_CustomEvent_ImpactLoc_1' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, K2Node_CustomEvent_ImpactLoc) == 0x00036C, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::K2Node_CustomEvent_ImpactLoc' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_NormalizeToRange_ReturnValue) == 0x000378, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_NormalizeToRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_Lerp_ReturnValue_3) == 0x00037C, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_Lerp_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_Lerp_ReturnValue_4) == 0x000380, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_Lerp_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_Lerp_ReturnValue_5) == 0x000384, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_Lerp_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_Lerp_ReturnValue_6) == 0x000388, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_Lerp_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_GetValueAtLevel_ReturnValue_3) == 0x00038C, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_GetValueAtLevel_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000390, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000398, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, K2Node_ComponentBoundEvent_OtherActor_1) == 0x0003A0, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, K2Node_ComponentBoundEvent_OtherComp_1) == 0x0003A8, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x0003B0, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, K2Node_ComponentBoundEvent_bFromSweep) == 0x0003B4, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, K2Node_ComponentBoundEvent_SweepResult) == 0x0003B8, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000448, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, K2Node_ComponentBoundEvent_OtherActor) == 0x000450, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, K2Node_ComponentBoundEvent_OtherComp) == 0x000458, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000460, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, K2Node_CustomEvent_Actor_1) == 0x000468, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::K2Node_CustomEvent_Actor_1' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, K2Node_CustomEvent_Actor) == 0x000470, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::K2Node_CustomEvent_Actor' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, K2Node_DynamicCast_AsPlayer_Pawn_Athena) == 0x000478, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::K2Node_DynamicCast_AsPlayer_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, K2Node_DynamicCast_bSuccess_4) == 0x000480, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, K2Node_DynamicCast_AsPlayer_Pawn_Athena_1) == 0x000488, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::K2Node_DynamicCast_AsPlayer_Pawn_Athena_1' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, K2Node_DynamicCast_bSuccess_5) == 0x000490, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000494, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x0004A0, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_SpawnCameraLensEffect_ReturnValue) == 0x0004B0, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_SpawnCameraLensEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_SpawnCameraLensEffect_ReturnValue_1) == 0x0004B8, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_SpawnCameraLensEffect_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, Temp_bool_IsClosed_Variable) == 0x0004C0, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2, CallFunc_K2_GetActorLocation_ReturnValue_4) == 0x0004C4, "Member 'B_BGA_Athena_SilverBlazer_V2_C_ExecuteUbergraph_B_BGA_Athena_SilverBlazer_V2::CallFunc_K2_GetActorLocation_ReturnValue_4' has a wrong offset!");
