#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Hookgun_Athena

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "B_Ranged_Generic_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Hookgun_Athena.B_Hookgun_Athena_C
// 0x0018 (0x11C8 - 0x11B0)
class AB_Hookgun_Athena_C final : public AB_Ranged_Generic_C
{
public:
	struct FTimerHandle                           Timer;                                             // 0x11B0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawnAthena*                  Player_Pawn;                                       // 0x11B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Debug;                                             // 0x11C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Hookgun_Athena_C">();
	}
	static class AB_Hookgun_Athena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Hookgun_Athena_C>();
	}
};
static_assert(alignof(AB_Hookgun_Athena_C) == 0x000008, "Wrong alignment on AB_Hookgun_Athena_C");
static_assert(sizeof(AB_Hookgun_Athena_C) == 0x0011C8, "Wrong size on AB_Hookgun_Athena_C");
static_assert(offsetof(AB_Hookgun_Athena_C, Timer) == 0x0011B0, "Member 'AB_Hookgun_Athena_C::Timer' has a wrong offset!");
static_assert(offsetof(AB_Hookgun_Athena_C, Player_Pawn) == 0x0011B8, "Member 'AB_Hookgun_Athena_C::Player_Pawn' has a wrong offset!");
static_assert(offsetof(AB_Hookgun_Athena_C, Debug) == 0x0011C0, "Member 'AB_Hookgun_Athena_C::Debug' has a wrong offset!");

}

