#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Minigun_Athena

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "B_Ranged_Generic_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Minigun_Athena.B_Minigun_Athena_C
// 0x0080 (0x1230 - 0x11B0)
class AB_Minigun_Athena_C final : public AB_Ranged_Generic_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_B_Minigun_Athena_C;                 // 0x11B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        OnOverheatSound;                                   // 0x11B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        OverheatLoopSound;                                 // 0x11C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               OverheatedFX;                                      // 0x11C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BarrelGlowFX;                                      // 0x11D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        SpinUpSound;                                       // 0x11D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        SpinDownSound;                                     // 0x11E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_MinigunChargeUp;                                 // 0x11E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SpinAudioVolumeTimeline_Volume_18EF57D9444836E65E22B6A5DFE3BF4A; // 0x11F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            SpinAudioVolumeTimeline__Direction_18EF57D9444836E65E22B6A5DFE3BF4A; // 0x11F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11F5[0x3];                                     // 0x11F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     SpinAudioVolumeTimeline;                           // 0x11F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MuzzleGlowMID;                                     // 0x1200(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CurrentSpinAudioComponent;                         // 0x1208(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentAmmo;                                       // 0x1210(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPlayedSpinUpAudio;                                // 0x1214(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bPlayedSpinDownAudio;                              // 0x1215(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1216[0x2];                                     // 0x1216(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SpinVolumeMultiplier;                              // 0x1218(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_121C[0x4];                                     // 0x121C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           GlowTimer;                                         // 0x1220(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         OverheatSmoothed;                                  // 0x1228(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HitHeatThreshold;                                  // 0x122C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_B_Minigun_Athena(int32 EntryPoint);
	void BarrelOverheatFXandSound();
	void OnStartOverheated();
	void Start_Spin_Down_Audio();
	void Start_Spin_Up_Audio();
	void OnAmmoCountChanged();
	void OnChargeDown();
	void OnChargeUp();
	void SpinAudioVolumeTimeline__UpdateFunc();
	void SpinAudioVolumeTimeline__FinishedFunc();
	float CurrentScalarValue();
	void K2_OnUnEquip();
	void OnWeaponAttached();
	void OnInitCosmeticAlterations(const struct FFortCosmeticModification& CosmeticMod);
	void OnPlayWeaponFireFX(bool bPersistentFire, bool bSecondaryFire);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Minigun_Athena_C">();
	}
	static class AB_Minigun_Athena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Minigun_Athena_C>();
	}
};
static_assert(alignof(AB_Minigun_Athena_C) == 0x000008, "Wrong alignment on AB_Minigun_Athena_C");
static_assert(sizeof(AB_Minigun_Athena_C) == 0x001230, "Wrong size on AB_Minigun_Athena_C");
static_assert(offsetof(AB_Minigun_Athena_C, UberGraphFrame_B_Minigun_Athena_C) == 0x0011B0, "Member 'AB_Minigun_Athena_C::UberGraphFrame_B_Minigun_Athena_C' has a wrong offset!");
static_assert(offsetof(AB_Minigun_Athena_C, OnOverheatSound) == 0x0011B8, "Member 'AB_Minigun_Athena_C::OnOverheatSound' has a wrong offset!");
static_assert(offsetof(AB_Minigun_Athena_C, OverheatLoopSound) == 0x0011C0, "Member 'AB_Minigun_Athena_C::OverheatLoopSound' has a wrong offset!");
static_assert(offsetof(AB_Minigun_Athena_C, OverheatedFX) == 0x0011C8, "Member 'AB_Minigun_Athena_C::OverheatedFX' has a wrong offset!");
static_assert(offsetof(AB_Minigun_Athena_C, BarrelGlowFX) == 0x0011D0, "Member 'AB_Minigun_Athena_C::BarrelGlowFX' has a wrong offset!");
static_assert(offsetof(AB_Minigun_Athena_C, SpinUpSound) == 0x0011D8, "Member 'AB_Minigun_Athena_C::SpinUpSound' has a wrong offset!");
static_assert(offsetof(AB_Minigun_Athena_C, SpinDownSound) == 0x0011E0, "Member 'AB_Minigun_Athena_C::SpinDownSound' has a wrong offset!");
static_assert(offsetof(AB_Minigun_Athena_C, P_MinigunChargeUp) == 0x0011E8, "Member 'AB_Minigun_Athena_C::P_MinigunChargeUp' has a wrong offset!");
static_assert(offsetof(AB_Minigun_Athena_C, SpinAudioVolumeTimeline_Volume_18EF57D9444836E65E22B6A5DFE3BF4A) == 0x0011F0, "Member 'AB_Minigun_Athena_C::SpinAudioVolumeTimeline_Volume_18EF57D9444836E65E22B6A5DFE3BF4A' has a wrong offset!");
static_assert(offsetof(AB_Minigun_Athena_C, SpinAudioVolumeTimeline__Direction_18EF57D9444836E65E22B6A5DFE3BF4A) == 0x0011F4, "Member 'AB_Minigun_Athena_C::SpinAudioVolumeTimeline__Direction_18EF57D9444836E65E22B6A5DFE3BF4A' has a wrong offset!");
static_assert(offsetof(AB_Minigun_Athena_C, SpinAudioVolumeTimeline) == 0x0011F8, "Member 'AB_Minigun_Athena_C::SpinAudioVolumeTimeline' has a wrong offset!");
static_assert(offsetof(AB_Minigun_Athena_C, MuzzleGlowMID) == 0x001200, "Member 'AB_Minigun_Athena_C::MuzzleGlowMID' has a wrong offset!");
static_assert(offsetof(AB_Minigun_Athena_C, CurrentSpinAudioComponent) == 0x001208, "Member 'AB_Minigun_Athena_C::CurrentSpinAudioComponent' has a wrong offset!");
static_assert(offsetof(AB_Minigun_Athena_C, CurrentAmmo) == 0x001210, "Member 'AB_Minigun_Athena_C::CurrentAmmo' has a wrong offset!");
static_assert(offsetof(AB_Minigun_Athena_C, bPlayedSpinUpAudio) == 0x001214, "Member 'AB_Minigun_Athena_C::bPlayedSpinUpAudio' has a wrong offset!");
static_assert(offsetof(AB_Minigun_Athena_C, bPlayedSpinDownAudio) == 0x001215, "Member 'AB_Minigun_Athena_C::bPlayedSpinDownAudio' has a wrong offset!");
static_assert(offsetof(AB_Minigun_Athena_C, SpinVolumeMultiplier) == 0x001218, "Member 'AB_Minigun_Athena_C::SpinVolumeMultiplier' has a wrong offset!");
static_assert(offsetof(AB_Minigun_Athena_C, GlowTimer) == 0x001220, "Member 'AB_Minigun_Athena_C::GlowTimer' has a wrong offset!");
static_assert(offsetof(AB_Minigun_Athena_C, OverheatSmoothed) == 0x001228, "Member 'AB_Minigun_Athena_C::OverheatSmoothed' has a wrong offset!");
static_assert(offsetof(AB_Minigun_Athena_C, HitHeatThreshold) == 0x00122C, "Member 'AB_Minigun_Athena_C::HitHeatThreshold' has a wrong offset!");

}

