#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Hook_Athena

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ToyAngleSelectorInfo_structs.hpp"


namespace SDK::Params
{

// Function B_Prj_Hook_Athena.B_Prj_Hook_Athena_C.ExecuteUbergraph_B_Prj_Hook_Athena
// 0x0860 (0x0860 - 0x0000)
struct B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_9;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_8;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_7;                   // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_6;                   // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x0068(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_5;                   // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_5;            // 0x0080(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable;                                // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_3;                              // 0x009B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_4;                              // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_5;                              // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9E[0x2];                                       // 0x009E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_6;            // 0x00A8(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_7;            // 0x00C0(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_8;            // 0x00D8(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_9;            // 0x00F0(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_10;           // 0x0108(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable_1;                              // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0122(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0123(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerPawn*>                Temp_object_Variable;                              // 0x0128(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerPawn*>                Temp_object_Variable_1;                            // 0x0140(0x0010)(ZeroConstructor, ReferenceParm)
	class FName                                   K2Node_CustomEvent_NotifyName_12;                  // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x3];                                      // 0x0161(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_Array_Get_Item;                           // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x3];                                      // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_HitLocation;                    // 0x0184(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0190(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_Hookgun_Athena_C*                    K2Node_DynamicCast_AsB_Hookgun_Athena;             // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x3];                                      // 0x01B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_11;           // 0x01B4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectContextHandle           K2Node_MakeStruct_GameplayEffectContextHandle;     // 0x01C8(0x0018)()
	class FName                                   K2Node_CustomEvent_NotifyName_13;                  // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EA[0x2];                                      // 0x01EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_12;           // 0x01EC(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetBaseAimPitchQuantized_ReturnValue;     // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0200(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetInstigatorController_ReturnValue;      // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0219(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21A[0x2];                                      // 0x021A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x021C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0228(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_14;                  // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortVehicleInterface> CallFunc_GetVehicleUInterface_ReturnValue;         // 0x0238(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInVehicle_ReturnValue;                  // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetVehicleActorPtr_ReturnValue;           // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortVehicleInterface> K2Node_DynamicCast_AsFort_Vehicle_Interface;       // 0x0258(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerPawn*>                CallFunc_GetAllPassengers_ReturnValue;             // 0x0270(0x0010)(ZeroConstructor, ReferenceParm)
	TScriptInterface<class IFortVehicleInterface> CallFunc_GetVehicleUInterface_ReturnValue_1;       // 0x0280(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_InterfaceToObject_ReturnValue;       // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAthenaJackalVehicle*               K2Node_DynamicCast_AsFort_Athena_Jackal_Vehicle;   // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_PickGrappleMontage_SectionName;           // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1; // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_12;                   // 0x02D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x02D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_13;                   // 0x02D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInVehicle_ReturnValue_1;                // 0x02D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D5[0x3];                                      // 0x02D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x02D8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x02E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x02E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E3[0x5];                                      // 0x02E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_Select_Default;                             // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_MyComp;                               // 0x02F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Other;                                // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp;                            // 0x0300(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSelfMoved;                           // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_309[0x3];                                      // 0x0309(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_HitLocation;                          // 0x030C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x0318(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_NormalImpulse;                        // 0x0324(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0330(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_3BC[0x4];                                      // 0x03BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_HandleHits_Target;                        // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x03C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3CA[0x2];                                      // 0x03CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x03CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x03D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x03D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x03E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x03EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x03F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_404[0x4];                                      // 0x0404(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0418(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x042C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0430(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x043C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData;               // 0x0448(0x00B0)()
	struct FGameplayEventData                     K2Node_MakeStruct_GameplayEventData_1;             // 0x04F8(0x00B0)()
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_13;           // 0x05A8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_14;           // 0x05B8(0x0010)(ZeroConstructor, NoDestructor)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue_1; // 0x05C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HandleLaunch_JumpPadding_;                // 0x05D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D1[0x7];                                      // 0x05D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerControllerAthena*            K2Node_DynamicCast_AsFort_Player_Controller_Athena; // 0x05D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x05E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_14;                   // 0x05E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HandleLaunch_JumpPadding__1;              // 0x05E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x05E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E4[0x4];                                      // 0x05E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> CallFunc_GetVehicleUInterface_ReturnValue_2;       // 0x05E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetVehicleVelocity_ReturnValue;           // 0x05F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetOwnerLocation_ReturnValue;             // 0x0604(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetVehicleActorPtr_ReturnValue_1;         // 0x0610(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_GetGameplayTags_ReturnValue;              // 0x0618(0x0020)()
	TScriptInterface<class IFortVehicleInterface> K2Node_DynamicCast_AsFort_Vehicle_Interface_1;     // 0x0638(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0648(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_649[0x7];                                      // 0x0649(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortAthenaJackalVehicle*               K2Node_DynamicCast_AsFort_Athena_Jackal_Vehicle_1; // 0x0650(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0658(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_659[0x7];                                      // 0x0659(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AFortPlayerPawn*>                CallFunc_GetAllPassengers_ReturnValue_1;           // 0x0660(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue_15;                   // 0x0670(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_671[0x3];                                      // 0x0671(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0674(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_2; // 0x0680(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_16;                   // 0x0688(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_17;                   // 0x0689(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasInfiniteAmmo_ReturnValue;              // 0x068A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x068B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x068C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_68D[0x3];                                      // 0x068D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_2;                              // 0x0690(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_1;                           // 0x0698(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SuggestProjectileVelocity_CustomArc_OutLaunchVelocity; // 0x069C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SuggestProjectileVelocity_CustomArc_ReturnValue; // 0x06A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A9[0x3];                                      // 0x06A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x06AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x06B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_2;                           // 0x06C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x06C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SuggestProjectileVelocity_CustomArc_OutLaunchVelocity_1; // 0x06CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SuggestProjectileVelocity_CustomArc_ReturnValue_1; // 0x06D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D9[0x3];                                      // 0x06D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_VSize_ReturnValue_1;                      // 0x06DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x06E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x06EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6ED[0x3];                                      // 0x06ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_3;                           // 0x06F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SuggestProjectileVelocity_CustomArc_OutLaunchVelocity_2; // 0x06F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SuggestProjectileVelocity_CustomArc_ReturnValue_2; // 0x0700(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_701[0x3];                                      // 0x0701(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Select_Default_4;                           // 0x0704(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_5;                           // 0x0710(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0714(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsZiplining_ReturnValue;                  // 0x0720(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0721(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_722[0x6];                                      // 0x0722(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue_2; // 0x0728(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0730(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SendComplexCustomStatEvent_QuestActive;   // 0x0738(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SendComplexCustomStatEvent_QuestCompleted; // 0x0739(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73A[0x2];                                      // 0x073A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_10;                  // 0x073C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_18;                   // 0x0744(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_745[0x3];                                      // 0x0745(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0748(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0750(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0758(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_764[0xC];                                      // 0x0764(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0770(0x0030)(IsPlainOldData, NoDestructor)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_15;           // 0x07A0(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x07B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_HookGunRope_C*                       CallFunc_FinishSpawningActor_ReturnValue;          // 0x07B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLastWaterSurfaceInfo_WaterPlaneLocation; // 0x07C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLastWaterSurfaceInfo_WaterPlaneNormal; // 0x07CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLastWaterSurfaceInfo_WaterSurfacePosition; // 0x07D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetLastWaterSurfaceInfo_WaterDepth;       // 0x07E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLastWaterSurfaceInfo_WaterBodyIdx;     // 0x07E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLastWaterSurfaceInfo_WaterVelocity;    // 0x07EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortWaterBodyActor*                    K2Node_CustomEvent_WaterBody;                      // 0x07F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWaterInteractionComponent*         K2Node_CustomEvent_WaterInteractionComponent;      // 0x0800(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsFirstBody;                   // 0x0808(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_809[0x3];                                      // 0x0809(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x080C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue;                 // 0x0810(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81C[0x4];                                      // 0x081C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x0820(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue_1;     // 0x0828(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AFortWaterBodyActor* WaterBody, class UFortWaterInteractionComponent* WaterInteractionComponent, bool bIsFirstBody)> K2Node_CreateDelegate_OutputDelegate_16;           // 0x0830(0x0010)(ZeroConstructor, NoDestructor)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn_1;           // 0x0840(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0848(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAnyTags_ReturnValue;                   // 0x0849(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x084A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_84B[0x1];                                      // 0x084B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_11;                  // 0x084C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena) == 0x000010, "Wrong alignment on B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena");
static_assert(sizeof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena) == 0x000860, "Wrong size on B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, EntryPoint) == 0x000000, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_IsValid_ReturnValue) == 0x000014, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_IsValid_ReturnValue_1) == 0x000015, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_CustomEvent_NotifyName_9) == 0x000018, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_CustomEvent_NotifyName_9' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_CreateDelegate_OutputDelegate_1) == 0x000020, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_CustomEvent_NotifyName_8) == 0x000030, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_CustomEvent_NotifyName_8' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_CreateDelegate_OutputDelegate_2) == 0x000038, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_CustomEvent_NotifyName_7) == 0x000048, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_CustomEvent_NotifyName_7' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_CreateDelegate_OutputDelegate_3) == 0x000050, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_CustomEvent_NotifyName_6) == 0x000060, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_CustomEvent_NotifyName_6' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_CreateDelegate_OutputDelegate_4) == 0x000068, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_CustomEvent_NotifyName_5) == 0x000078, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_CustomEvent_NotifyName_5' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_CreateDelegate_OutputDelegate_5) == 0x000080, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, Temp_name_Variable) == 0x000090, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, Temp_bool_Variable) == 0x000098, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, Temp_bool_Variable_1) == 0x000099, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, Temp_bool_Variable_2) == 0x00009A, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, Temp_bool_Variable_3) == 0x00009B, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, Temp_bool_Variable_4) == 0x00009C, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, Temp_bool_Variable_5) == 0x00009D, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_CustomEvent_NotifyName_4) == 0x0000A0, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_CustomEvent_NotifyName_4' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_CreateDelegate_OutputDelegate_6) == 0x0000A8, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_CustomEvent_NotifyName_3) == 0x0000B8, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_CustomEvent_NotifyName_3' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_CreateDelegate_OutputDelegate_7) == 0x0000C0, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_CustomEvent_NotifyName_2) == 0x0000D0, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_CustomEvent_NotifyName_2' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_CreateDelegate_OutputDelegate_8) == 0x0000D8, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_CustomEvent_NotifyName_1) == 0x0000E8, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_CustomEvent_NotifyName_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_CreateDelegate_OutputDelegate_9) == 0x0000F0, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_CustomEvent_NotifyName) == 0x000100, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_CreateDelegate_OutputDelegate_10) == 0x000108, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, Temp_name_Variable_1) == 0x000118, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_IsValid_ReturnValue_2) == 0x000120, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_IsValid_ReturnValue_3) == 0x000121, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_IsValid_ReturnValue_4) == 0x000122, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_IsValid_ReturnValue_5) == 0x000123, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_IsValid_ReturnValue_6) == 0x000124, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, Temp_object_Variable) == 0x000128, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_IsValid_ReturnValue_7) == 0x000138, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, Temp_object_Variable_1) == 0x000140, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_CustomEvent_NotifyName_12) == 0x000150, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_CustomEvent_NotifyName_12' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_Array_Length_ReturnValue) == 0x000158, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, Temp_int_Loop_Counter_Variable) == 0x00015C, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_Less_IntInt_ReturnValue) == 0x000160, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_Add_IntInt_ReturnValue) == 0x000164, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, Temp_int_Array_Index_Variable) == 0x000168, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_Array_Get_Item) == 0x000170, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000178, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_DynamicCast_bSuccess) == 0x000180, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_CustomEvent_HitLocation) == 0x000184, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_CustomEvent_HitLocation' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000190, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_GetOwner_ReturnValue) == 0x0001A0, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_DynamicCast_AsB_Hookgun_Athena) == 0x0001A8, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_DynamicCast_AsB_Hookgun_Athena' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_DynamicCast_bSuccess_1) == 0x0001B0, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_CreateDelegate_OutputDelegate_11) == 0x0001B4, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_MakeStruct_GameplayEffectContextHandle) == 0x0001C8, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_MakeStruct_GameplayEffectContextHandle' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_CustomEvent_NotifyName_13) == 0x0001E0, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_CustomEvent_NotifyName_13' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_IsValid_ReturnValue_8) == 0x0001E8, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_IsDedicatedServer_ReturnValue) == 0x0001E9, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_CreateDelegate_OutputDelegate_12) == 0x0001EC, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_GetBaseAimPitchQuantized_ReturnValue) == 0x0001FC, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_GetBaseAimPitchQuantized_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000200, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_GetInstigatorController_ReturnValue) == 0x000210, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_GetInstigatorController_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_IsValid_ReturnValue_9) == 0x000218, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_BooleanAND_ReturnValue) == 0x000219, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x00021C, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000228, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_CustomEvent_NotifyName_14) == 0x000230, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_CustomEvent_NotifyName_14' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_GetVehicleUInterface_ReturnValue) == 0x000238, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_GetVehicleUInterface_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_IsInVehicle_ReturnValue) == 0x000248, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_IsInVehicle_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, CallFunc_GetVehicleActorPtr_ReturnValue) == 0x000250, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::CallFunc_GetVehicleActorPtr_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena, K2Node_DynamicCast_AsFort_Vehicle_Interface) == 0x000258, "Member 'B_Prj_Hook_Athena_C_ExecuteUbergraph_B_Prj_Hook_Athena::K2Node_DynamicCast_AsFort_Vehicle_Interface' has a wrong offset!");
