#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Athena_SneakySnowmanV2

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Prj_Athena_SneakySnowmanV2.B_Prj_Athena_SneakySnowmanV2_C
// 0x00B0 (0x0918 - 0x0868)
class AB_Prj_Athena_SneakySnowmanV2_C : public AFortProjectileBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0868(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 SK_Sneaky_Snowman_Throw;                           // 0x0870(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               FX_Trail;                                          // 0x0878(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortCollisionAudioComponent*           FortCollisionAudio;                                // 0x0880(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URotatingMovementComponent*             RotatingMovement;                                  // 0x0888(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Audio_InAir;                                       // 0x0890(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Cue_HitPlayer;                                     // 0x0898(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortWorldItemDefinition*               SnowmanItemDef;                                    // 0x08A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HitPlayer;                                         // 0x08A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A9[0x7];                                      // 0x08A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 GE_ApplyEnemySnowman;                              // 0x08B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        SnowmanSpawnFX;                                    // 0x08B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         ShouldSnowmanEnemies;                              // 0x08C0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class USoundBase*                             SoundOnExplo;                                      // 0x08E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitLocation;                                       // 0x08E8(0x000C)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8F4[0x4];                                      // 0x08F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 HitActor;                                          // 0x08F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UFortItem*>                      SnowmanItemInstances;                              // 0x0900(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UClass*                                 PropClass;                                         // 0x0910(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_B_Prj_Athena_SneakySnowmanV2(int32 EntryPoint);
	void Apply_Snowman_To_Self();
	void BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnEnterWater__DelegateSignature(class AFortWaterBodyActor* WaterBody, class UFortWaterInteractionComponent* WaterInteractionComponent_0, bool bIsFirstBody);
	void ReceiveBeginPlay();
	void OnExploded(const TArray<class AActor*>& HitActors, const TArray<struct FHitResult>& HitResults);
	void Explode();
	void OnTouched(class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FHitResult& HitResult, bool bIsOverlap);
	void UserConstructionScript();
	void Should_Bounce_(const struct FVector& Hit_Normal);
	bool ShouldApplySnowman_(class UObject* PlayerPawn);
	void UpdateQuest(class AFortPlayerController* FortPC);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Prj_Athena_SneakySnowmanV2_C">();
	}
	static class AB_Prj_Athena_SneakySnowmanV2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Prj_Athena_SneakySnowmanV2_C>();
	}
};
static_assert(alignof(AB_Prj_Athena_SneakySnowmanV2_C) == 0x000008, "Wrong alignment on AB_Prj_Athena_SneakySnowmanV2_C");
static_assert(sizeof(AB_Prj_Athena_SneakySnowmanV2_C) == 0x000918, "Wrong size on AB_Prj_Athena_SneakySnowmanV2_C");
static_assert(offsetof(AB_Prj_Athena_SneakySnowmanV2_C, UberGraphFrame) == 0x000868, "Member 'AB_Prj_Athena_SneakySnowmanV2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_SneakySnowmanV2_C, SK_Sneaky_Snowman_Throw) == 0x000870, "Member 'AB_Prj_Athena_SneakySnowmanV2_C::SK_Sneaky_Snowman_Throw' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_SneakySnowmanV2_C, FX_Trail) == 0x000878, "Member 'AB_Prj_Athena_SneakySnowmanV2_C::FX_Trail' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_SneakySnowmanV2_C, FortCollisionAudio) == 0x000880, "Member 'AB_Prj_Athena_SneakySnowmanV2_C::FortCollisionAudio' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_SneakySnowmanV2_C, RotatingMovement) == 0x000888, "Member 'AB_Prj_Athena_SneakySnowmanV2_C::RotatingMovement' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_SneakySnowmanV2_C, Audio_InAir) == 0x000890, "Member 'AB_Prj_Athena_SneakySnowmanV2_C::Audio_InAir' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_SneakySnowmanV2_C, Cue_HitPlayer) == 0x000898, "Member 'AB_Prj_Athena_SneakySnowmanV2_C::Cue_HitPlayer' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_SneakySnowmanV2_C, SnowmanItemDef) == 0x0008A0, "Member 'AB_Prj_Athena_SneakySnowmanV2_C::SnowmanItemDef' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_SneakySnowmanV2_C, HitPlayer) == 0x0008A8, "Member 'AB_Prj_Athena_SneakySnowmanV2_C::HitPlayer' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_SneakySnowmanV2_C, GE_ApplyEnemySnowman) == 0x0008B0, "Member 'AB_Prj_Athena_SneakySnowmanV2_C::GE_ApplyEnemySnowman' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_SneakySnowmanV2_C, SnowmanSpawnFX) == 0x0008B8, "Member 'AB_Prj_Athena_SneakySnowmanV2_C::SnowmanSpawnFX' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_SneakySnowmanV2_C, ShouldSnowmanEnemies) == 0x0008C0, "Member 'AB_Prj_Athena_SneakySnowmanV2_C::ShouldSnowmanEnemies' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_SneakySnowmanV2_C, SoundOnExplo) == 0x0008E0, "Member 'AB_Prj_Athena_SneakySnowmanV2_C::SoundOnExplo' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_SneakySnowmanV2_C, HitLocation) == 0x0008E8, "Member 'AB_Prj_Athena_SneakySnowmanV2_C::HitLocation' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_SneakySnowmanV2_C, HitActor) == 0x0008F8, "Member 'AB_Prj_Athena_SneakySnowmanV2_C::HitActor' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_SneakySnowmanV2_C, SnowmanItemInstances) == 0x000900, "Member 'AB_Prj_Athena_SneakySnowmanV2_C::SnowmanItemInstances' has a wrong offset!");
static_assert(offsetof(AB_Prj_Athena_SneakySnowmanV2_C, PropClass) == 0x000910, "Member 'AB_Prj_Athena_SneakySnowmanV2_C::PropClass' has a wrong offset!");

}

