#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Hook_Athena

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "ToyAngleSelectorInfo_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Prj_Hook_Athena.B_Prj_Hook_Athena_C
// 0x0148 (0x0A70 - 0x0928)
class AB_Prj_Hook_Athena_C : public AFortAttachableProjectileBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0928(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x0930(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh3;                                       // 0x0938(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              Target;                                            // 0x0940(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0948(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HookStopped;                                       // 0x0950(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_951[0x3];                                      // 0x0951(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HitLocation;                                       // 0x0954(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AirControl;                                        // 0x0960(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_961[0x7];                                      // 0x0961(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             StickSound;                                        // 0x0968(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             StuckToPlayerSound;                                // 0x0970(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DistanceFromInstigator;                            // 0x0978(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_97C[0x4];                                      // 0x097C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             TravelSound;                                       // 0x0980(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FToyAngleSelectorInfo>          LaunchAngleVariations;                             // 0x0988(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class AB_Hookgun_Athena_C*                    Weapon_Actor;                                      // 0x0998(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_HookGunRope_C*                       Rope;                                              // 0x09A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PreLaunchVelocity;                                 // 0x09A8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FireAImPitch;                                      // 0x09B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DownPitchMin;                                      // 0x09B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DownPitchMax;                                      // 0x09BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AdditionalZ;                                       // 0x09C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C4[0x4];                                      // 0x09C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             YankBackSound;                                     // 0x09C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             RopeDestroySound;                                  // 0x09D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           RopeActiveTag;                                     // 0x09D8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           BlockIncomingPickups;                              // 0x09E0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ImpactNormal;                                      // 0x09E8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9F4[0x4];                                      // 0x09F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             StickSound2D;                                      // 0x09F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Offset_Distance_from_Physics_Mesh;                 // 0x0A00(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OffsetDistanceFromBone;                            // 0x0A04(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 StruckActor;                                       // 0x0A08(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Momentum;                                          // 0x0A10(0x000C)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	bool                                          Launchpad;                                         // 0x0A1C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1D[0x3];                                      // 0x0A1D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                VehicleVelocity;                                   // 0x0A20(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ConsumesAmmo;                                      // 0x0A2C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A2D[0x3];                                      // 0x0A2D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         VehicleArc;                                        // 0x0A30(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         JackalArc;                                         // 0x0A34(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInHoverboard;                                     // 0x0A38(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A39[0x3];                                      // 0x0A39(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         VehicleForceMultiplier;                            // 0x0A3C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         JackalForceMultiplier;                             // 0x0A40(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Lifespan_on_Hit;                                   // 0x0A44(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsBadgerGrape_;                                    // 0x0A48(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A49[0x7];                                      // 0x0A49(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  TC_VehicleIgnorePull;                              // 0x0A50(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_B_Prj_Hook_Athena(int32 EntryPoint);
	void OnEnterWaterEvent_Event_0(class AFortWaterBodyActor* WaterBody, class UFortWaterInteractionComponent* WaterInteractionComponent_0, bool bIsFirstBody);
	void LaunchCheck();
	void GrappleVehicle();
	void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, const struct FVector& HitLocation_0, const struct FVector& HitNormal, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void WeaponCheck();
	void Travel(const struct FVector& HitLocation_0);
	void ReceiveDestroyed();
	void ReceiveBeginPlay();
	void OnCompleted_93AE81F64BBD13E0E55C399F05E160E3(class FName NotifyName);
	void OnBlendOut_93AE81F64BBD13E0E55C399F05E160E3(class FName NotifyName);
	void OnInterrupted_93AE81F64BBD13E0E55C399F05E160E3(class FName NotifyName);
	void OnNotifyBegin_93AE81F64BBD13E0E55C399F05E160E3(class FName NotifyName);
	void OnNotifyEnd_93AE81F64BBD13E0E55C399F05E160E3(class FName NotifyName);
	void OnCompleted_46D1167E4A05BB9A8529A6981DFAD6A4(class FName NotifyName);
	void OnBlendOut_46D1167E4A05BB9A8529A6981DFAD6A4(class FName NotifyName);
	void OnInterrupted_46D1167E4A05BB9A8529A6981DFAD6A4(class FName NotifyName);
	void OnNotifyBegin_46D1167E4A05BB9A8529A6981DFAD6A4(class FName NotifyName);
	void OnNotifyEnd_46D1167E4A05BB9A8529A6981DFAD6A4(class FName NotifyName);
	void OnCompleted_0A1B172F45DE2A614770489FAD619748(class FName NotifyName);
	void OnBlendOut_0A1B172F45DE2A614770489FAD619748(class FName NotifyName);
	void OnInterrupted_0A1B172F45DE2A614770489FAD619748(class FName NotifyName);
	void OnNotifyBegin_0A1B172F45DE2A614770489FAD619748(class FName NotifyName);
	void OnNotifyEnd_0A1B172F45DE2A614770489FAD619748(class FName NotifyName);
	void UserConstructionScript();
	void PlayStickSounds(const struct FVector& Location, class AActor* HitActor);
	void HandleHits(const struct FHitResult& Hit, class AActor** Target_0);
	void IncapacitateTarget();
	void CalculateYankForce();
	void Grapple();
	void OnRep_Target();
	void OnRep_HookStopped();
	void PickGrappleMontage(float PitchAngle, bool InHoverboard, class FName* SectionName);
	void HandleSticks(class UObject* Object, class UPrimitiveComponent* Component);
	void HandleStuckVehicle(class UObject* Object, class UPrimitiveComponent* Component);
	void HandleStuckBuilding(class UObject* Object, class UPrimitiveComponent* Component);
	void HandleStuckSupplyDrop(class UObject* Object, class UPrimitiveComponent* Component);
	void OnRep_StruckActor();
	void HandleStuckProjectiles(class UObject* Object, class UPrimitiveComponent* Component);
	void HandleMomentum();
	void OnRep_Momentum();
	void HandleLaunch(bool* JumpPadding_);
	void JackalCheck();

	void PickGrappleMontageSection(float PitchAngle, class FName* SectionName) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Prj_Hook_Athena_C">();
	}
	static class AB_Prj_Hook_Athena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Prj_Hook_Athena_C>();
	}
};
static_assert(alignof(AB_Prj_Hook_Athena_C) == 0x000008, "Wrong alignment on AB_Prj_Hook_Athena_C");
static_assert(sizeof(AB_Prj_Hook_Athena_C) == 0x000A70, "Wrong size on AB_Prj_Hook_Athena_C");
static_assert(offsetof(AB_Prj_Hook_Athena_C, UberGraphFrame) == 0x000928, "Member 'AB_Prj_Hook_Athena_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_Prj_Hook_Athena_C, ParticleSystem) == 0x000930, "Member 'AB_Prj_Hook_Athena_C::ParticleSystem' has a wrong offset!");
static_assert(offsetof(AB_Prj_Hook_Athena_C, StaticMesh3) == 0x000938, "Member 'AB_Prj_Hook_Athena_C::StaticMesh3' has a wrong offset!");
static_assert(offsetof(AB_Prj_Hook_Athena_C, Target) == 0x000940, "Member 'AB_Prj_Hook_Athena_C::Target' has a wrong offset!");
static_assert(offsetof(AB_Prj_Hook_Athena_C, PlayerPawn) == 0x000948, "Member 'AB_Prj_Hook_Athena_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(AB_Prj_Hook_Athena_C, HookStopped) == 0x000950, "Member 'AB_Prj_Hook_Athena_C::HookStopped' has a wrong offset!");
static_assert(offsetof(AB_Prj_Hook_Athena_C, HitLocation) == 0x000954, "Member 'AB_Prj_Hook_Athena_C::HitLocation' has a wrong offset!");
static_assert(offsetof(AB_Prj_Hook_Athena_C, AirControl) == 0x000960, "Member 'AB_Prj_Hook_Athena_C::AirControl' has a wrong offset!");
static_assert(offsetof(AB_Prj_Hook_Athena_C, StickSound) == 0x000968, "Member 'AB_Prj_Hook_Athena_C::StickSound' has a wrong offset!");
static_assert(offsetof(AB_Prj_Hook_Athena_C, StuckToPlayerSound) == 0x000970, "Member 'AB_Prj_Hook_Athena_C::StuckToPlayerSound' has a wrong offset!");
static_assert(offsetof(AB_Prj_Hook_Athena_C, DistanceFromInstigator) == 0x000978, "Member 'AB_Prj_Hook_Athena_C::DistanceFromInstigator' has a wrong offset!");
static_assert(offsetof(AB_Prj_Hook_Athena_C, TravelSound) == 0x000980, "Member 'AB_Prj_Hook_Athena_C::TravelSound' has a wrong offset!");
static_assert(offsetof(AB_Prj_Hook_Athena_C, LaunchAngleVariations) == 0x000988, "Member 'AB_Prj_Hook_Athena_C::LaunchAngleVariations' has a wrong offset!");
static_assert(offsetof(AB_Prj_Hook_Athena_C, Weapon_Actor) == 0x000998, "Member 'AB_Prj_Hook_Athena_C::Weapon_Actor' has a wrong offset!");
static_assert(offsetof(AB_Prj_Hook_Athena_C, Rope) == 0x0009A0, "Member 'AB_Prj_Hook_Athena_C::Rope' has a wrong offset!");
static_assert(offsetof(AB_Prj_Hook_Athena_C, PreLaunchVelocity) == 0x0009A8, "Member 'AB_Prj_Hook_Athena_C::PreLaunchVelocity' has a wrong offset!");
static_assert(offsetof(AB_Prj_Hook_Athena_C, FireAImPitch) == 0x0009B4, "Member 'AB_Prj_Hook_Athena_C::FireAImPitch' has a wrong offset!");
static_assert(offsetof(AB_Prj_Hook_Athena_C, DownPitchMin) == 0x0009B8, "Member 'AB_Prj_Hook_Athena_C::DownPitchMin' has a wrong offset!");
static_assert(offsetof(AB_Prj_Hook_Athena_C, DownPitchMax) == 0x0009BC, "Member 'AB_Prj_Hook_Athena_C::DownPitchMax' has a wrong offset!");
static_assert(offsetof(AB_Prj_Hook_Athena_C, AdditionalZ) == 0x0009C0, "Member 'AB_Prj_Hook_Athena_C::AdditionalZ' has a wrong offset!");
static_assert(offsetof(AB_Prj_Hook_Athena_C, YankBackSound) == 0x0009C8, "Member 'AB_Prj_Hook_Athena_C::YankBackSound' has a wrong offset!");
static_assert(offsetof(AB_Prj_Hook_Athena_C, RopeDestroySound) == 0x0009D0, "Member 'AB_Prj_Hook_Athena_C::RopeDestroySound' has a wrong offset!");
static_assert(offsetof(AB_Prj_Hook_Athena_C, RopeActiveTag) == 0x0009D8, "Member 'AB_Prj_Hook_Athena_C::RopeActiveTag' has a wrong offset!");
static_assert(offsetof(AB_Prj_Hook_Athena_C, BlockIncomingPickups) == 0x0009E0, "Member 'AB_Prj_Hook_Athena_C::BlockIncomingPickups' has a wrong offset!");
static_assert(offsetof(AB_Prj_Hook_Athena_C, ImpactNormal) == 0x0009E8, "Member 'AB_Prj_Hook_Athena_C::ImpactNormal' has a wrong offset!");
static_assert(offsetof(AB_Prj_Hook_Athena_C, StickSound2D) == 0x0009F8, "Member 'AB_Prj_Hook_Athena_C::StickSound2D' has a wrong offset!");
static_assert(offsetof(AB_Prj_Hook_Athena_C, Offset_Distance_from_Physics_Mesh) == 0x000A00, "Member 'AB_Prj_Hook_Athena_C::Offset_Distance_from_Physics_Mesh' has a wrong offset!");
static_assert(offsetof(AB_Prj_Hook_Athena_C, OffsetDistanceFromBone) == 0x000A04, "Member 'AB_Prj_Hook_Athena_C::OffsetDistanceFromBone' has a wrong offset!");
static_assert(offsetof(AB_Prj_Hook_Athena_C, StruckActor) == 0x000A08, "Member 'AB_Prj_Hook_Athena_C::StruckActor' has a wrong offset!");
static_assert(offsetof(AB_Prj_Hook_Athena_C, Momentum) == 0x000A10, "Member 'AB_Prj_Hook_Athena_C::Momentum' has a wrong offset!");
static_assert(offsetof(AB_Prj_Hook_Athena_C, Launchpad) == 0x000A1C, "Member 'AB_Prj_Hook_Athena_C::Launchpad' has a wrong offset!");
static_assert(offsetof(AB_Prj_Hook_Athena_C, VehicleVelocity) == 0x000A20, "Member 'AB_Prj_Hook_Athena_C::VehicleVelocity' has a wrong offset!");
static_assert(offsetof(AB_Prj_Hook_Athena_C, ConsumesAmmo) == 0x000A2C, "Member 'AB_Prj_Hook_Athena_C::ConsumesAmmo' has a wrong offset!");
static_assert(offsetof(AB_Prj_Hook_Athena_C, VehicleArc) == 0x000A30, "Member 'AB_Prj_Hook_Athena_C::VehicleArc' has a wrong offset!");
static_assert(offsetof(AB_Prj_Hook_Athena_C, JackalArc) == 0x000A34, "Member 'AB_Prj_Hook_Athena_C::JackalArc' has a wrong offset!");
static_assert(offsetof(AB_Prj_Hook_Athena_C, bInHoverboard) == 0x000A38, "Member 'AB_Prj_Hook_Athena_C::bInHoverboard' has a wrong offset!");
static_assert(offsetof(AB_Prj_Hook_Athena_C, VehicleForceMultiplier) == 0x000A3C, "Member 'AB_Prj_Hook_Athena_C::VehicleForceMultiplier' has a wrong offset!");
static_assert(offsetof(AB_Prj_Hook_Athena_C, JackalForceMultiplier) == 0x000A40, "Member 'AB_Prj_Hook_Athena_C::JackalForceMultiplier' has a wrong offset!");
static_assert(offsetof(AB_Prj_Hook_Athena_C, Lifespan_on_Hit) == 0x000A44, "Member 'AB_Prj_Hook_Athena_C::Lifespan_on_Hit' has a wrong offset!");
static_assert(offsetof(AB_Prj_Hook_Athena_C, IsBadgerGrape_) == 0x000A48, "Member 'AB_Prj_Hook_Athena_C::IsBadgerGrape_' has a wrong offset!");
static_assert(offsetof(AB_Prj_Hook_Athena_C, TC_VehicleIgnorePull) == 0x000A50, "Member 'AB_Prj_Hook_Athena_C::TC_VehicleIgnorePull' has a wrong offset!");

}

