#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Prj_Bullet_Sniper

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_Prj_Bullet_Sniper.B_Prj_Bullet_Sniper_C
// 0x0128 (0x0AA0 - 0x0978)
class AB_Prj_Bullet_Sniper_C : public AFortProjectileAthena
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0978(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   TracerMesh;                                        // 0x0980(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_Sniper_Bullet_Trail;                             // 0x0988(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Sniper_Rifle_SurfaceImpactSound;                   // 0x0990(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Sniper_Rifle_PlayerImpactSound;                    // 0x0998(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DecalSize;                                         // 0x09A0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9AC[0x4];                                      // 0x09AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         ProjectileGravityScale;                            // 0x09B0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UParticleSystem*                        WaterImpactFX;                                     // 0x09D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             WaterHit;                                          // 0x09D8(0x008C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_A64[0x4];                                      // 0x0A64(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      WaterHitMat;                                       // 0x0A68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WaterDepthTrace;                                   // 0x0A70(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         WaterIndexTrace;                                   // 0x0A74(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TraceImpactLocation;                               // 0x0A78(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TraceImpactNormal;                                 // 0x0A84(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Sniper_Rifle_WaterImpactSound;                     // 0x0A90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasPlayedWaterSound;                              // 0x0A98(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_B_Prj_Bullet_Sniper(int32 EntryPoint);
	void OnSniperTraceWaterHit(const struct FHitResult& WaterHit_0, class AFortWaterBodyActor* WaterBody);
	void OnTouched(class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FHitResult& HitResult, bool bIsOverlap);
	void ReceiveBeginPlay();
	void OnStop(const struct FHitResult& Hit);
	void UserConstructionScript();
	void PlayImpactSFX(bool IsPlayer, bool IsWater);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_Prj_Bullet_Sniper_C">();
	}
	static class AB_Prj_Bullet_Sniper_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_Prj_Bullet_Sniper_C>();
	}
};
static_assert(alignof(AB_Prj_Bullet_Sniper_C) == 0x000008, "Wrong alignment on AB_Prj_Bullet_Sniper_C");
static_assert(sizeof(AB_Prj_Bullet_Sniper_C) == 0x000AA0, "Wrong size on AB_Prj_Bullet_Sniper_C");
static_assert(offsetof(AB_Prj_Bullet_Sniper_C, UberGraphFrame) == 0x000978, "Member 'AB_Prj_Bullet_Sniper_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_Prj_Bullet_Sniper_C, TracerMesh) == 0x000980, "Member 'AB_Prj_Bullet_Sniper_C::TracerMesh' has a wrong offset!");
static_assert(offsetof(AB_Prj_Bullet_Sniper_C, P_Sniper_Bullet_Trail) == 0x000988, "Member 'AB_Prj_Bullet_Sniper_C::P_Sniper_Bullet_Trail' has a wrong offset!");
static_assert(offsetof(AB_Prj_Bullet_Sniper_C, Sniper_Rifle_SurfaceImpactSound) == 0x000990, "Member 'AB_Prj_Bullet_Sniper_C::Sniper_Rifle_SurfaceImpactSound' has a wrong offset!");
static_assert(offsetof(AB_Prj_Bullet_Sniper_C, Sniper_Rifle_PlayerImpactSound) == 0x000998, "Member 'AB_Prj_Bullet_Sniper_C::Sniper_Rifle_PlayerImpactSound' has a wrong offset!");
static_assert(offsetof(AB_Prj_Bullet_Sniper_C, DecalSize) == 0x0009A0, "Member 'AB_Prj_Bullet_Sniper_C::DecalSize' has a wrong offset!");
static_assert(offsetof(AB_Prj_Bullet_Sniper_C, ProjectileGravityScale) == 0x0009B0, "Member 'AB_Prj_Bullet_Sniper_C::ProjectileGravityScale' has a wrong offset!");
static_assert(offsetof(AB_Prj_Bullet_Sniper_C, WaterImpactFX) == 0x0009D0, "Member 'AB_Prj_Bullet_Sniper_C::WaterImpactFX' has a wrong offset!");
static_assert(offsetof(AB_Prj_Bullet_Sniper_C, WaterHit) == 0x0009D8, "Member 'AB_Prj_Bullet_Sniper_C::WaterHit' has a wrong offset!");
static_assert(offsetof(AB_Prj_Bullet_Sniper_C, WaterHitMat) == 0x000A68, "Member 'AB_Prj_Bullet_Sniper_C::WaterHitMat' has a wrong offset!");
static_assert(offsetof(AB_Prj_Bullet_Sniper_C, WaterDepthTrace) == 0x000A70, "Member 'AB_Prj_Bullet_Sniper_C::WaterDepthTrace' has a wrong offset!");
static_assert(offsetof(AB_Prj_Bullet_Sniper_C, WaterIndexTrace) == 0x000A74, "Member 'AB_Prj_Bullet_Sniper_C::WaterIndexTrace' has a wrong offset!");
static_assert(offsetof(AB_Prj_Bullet_Sniper_C, TraceImpactLocation) == 0x000A78, "Member 'AB_Prj_Bullet_Sniper_C::TraceImpactLocation' has a wrong offset!");
static_assert(offsetof(AB_Prj_Bullet_Sniper_C, TraceImpactNormal) == 0x000A84, "Member 'AB_Prj_Bullet_Sniper_C::TraceImpactNormal' has a wrong offset!");
static_assert(offsetof(AB_Prj_Bullet_Sniper_C, Sniper_Rifle_WaterImpactSound) == 0x000A90, "Member 'AB_Prj_Bullet_Sniper_C::Sniper_Rifle_WaterImpactSound' has a wrong offset!");
static_assert(offsetof(AB_Prj_Bullet_Sniper_C, bHasPlayedWaterSound) == 0x000A98, "Member 'AB_Prj_Bullet_Sniper_C::bHasPlayedWaterSound' has a wrong offset!");

}

