#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Ranged_Lotus_Mustache

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function B_Ranged_Lotus_Mustache.B_Ranged_Lotus_Mustache_C.ExecuteUbergraph_B_Ranged_Lotus_Mustache
// 0x01C0 (0x01C0 - 0x0000)
struct B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortProjectileBase*                    K2Node_Event_SpawnProjectile;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortProjectileMovementInterface> CallFunc_SetHomingStyle_self_CastInput;            // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IFortProjectileMovementInterface> CallFunc_SetHomingLockTargetDistanceThreshold_self_CastInput; // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IFortProjectileMovementInterface> CallFunc_SetHomingTurnSpeedMax_self_CastInput;     // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class IFortProjectileMovementInterface> CallFunc_SetHomingTurnSpeedMin_self_CastInput;     // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortProjectileMovementInterface> CallFunc_SetHomingTarget_self_CastInput;           // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bPersistentFire;                      // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bSecondaryFire;                       // 0x0076(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_77[0x1];                                       // 0x0077(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena;      // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_HealthPercent;                  // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxHealth_ReturnValue;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHealth_ReturnValue;                    // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A2[0x2];                                       // 0x00A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Conv_VectorToTransform_ReturnValue;       // 0x00C0(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x00F0(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17D[0x3];                                      // 0x017D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAthena_LockOnWidgetActor_Proto_C*      CallFunc_FinishSpawningActor_ReturnValue;          // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue;          // 0x0190(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULotus_Mustache_HealthBar_C*            K2Node_DynamicCast_AsLotus_Mustache_Health_Bar;    // 0x0198(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A2[0x2];                                      // 0x01A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDistanceTo_ReturnValue;                // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RowToBool_ReturnValue;                    // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1AA[0x2];                                      // 0x01AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IFortProjectileMovementInterface> CallFunc_SetHomingTimeUntilMaxTurnSpeed_self_CastInput; // 0x01B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache) == 0x000010, "Wrong alignment on B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache");
static_assert(sizeof(B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache) == 0x0001C0, "Wrong size on B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache");
static_assert(offsetof(B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache, EntryPoint) == 0x000000, "Member 'B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache, K2Node_Event_SpawnProjectile) == 0x000008, "Member 'B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache::K2Node_Event_SpawnProjectile' has a wrong offset!");
static_assert(offsetof(B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache, CallFunc_SetHomingStyle_self_CastInput) == 0x000018, "Member 'B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache::CallFunc_SetHomingStyle_self_CastInput' has a wrong offset!");
static_assert(offsetof(B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache, CallFunc_SetHomingLockTargetDistanceThreshold_self_CastInput) == 0x000028, "Member 'B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache::CallFunc_SetHomingLockTargetDistanceThreshold_self_CastInput' has a wrong offset!");
static_assert(offsetof(B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache, CallFunc_SetHomingTurnSpeedMax_self_CastInput) == 0x000038, "Member 'B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache::CallFunc_SetHomingTurnSpeedMax_self_CastInput' has a wrong offset!");
static_assert(offsetof(B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache, CallFunc_SetHomingTurnSpeedMin_self_CastInput) == 0x000048, "Member 'B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache::CallFunc_SetHomingTurnSpeedMin_self_CastInput' has a wrong offset!");
static_assert(offsetof(B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache, CallFunc_IsValid_ReturnValue_1) == 0x000058, "Member 'B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache, CallFunc_SetHomingTarget_self_CastInput) == 0x000060, "Member 'B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache::CallFunc_SetHomingTarget_self_CastInput' has a wrong offset!");
static_assert(offsetof(B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache, K2Node_Event_DeltaSeconds) == 0x000070, "Member 'B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache, CallFunc_IsLocallyControlled_ReturnValue) == 0x000074, "Member 'B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache, K2Node_Event_bPersistentFire) == 0x000075, "Member 'B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache::K2Node_Event_bPersistentFire' has a wrong offset!");
static_assert(offsetof(B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache, K2Node_Event_bSecondaryFire) == 0x000076, "Member 'B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache::K2Node_Event_bSecondaryFire' has a wrong offset!");
static_assert(offsetof(B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache, K2Node_DynamicCast_AsFort_Player_Pawn_Athena) == 0x000078, "Member 'B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache::K2Node_DynamicCast_AsFort_Player_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache, K2Node_CustomEvent_HealthPercent) == 0x000084, "Member 'B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache::K2Node_CustomEvent_HealthPercent' has a wrong offset!");
static_assert(offsetof(B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache, CallFunc_GetMaxHealth_ReturnValue) == 0x000088, "Member 'B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache::CallFunc_GetMaxHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache, CallFunc_GetHealth_ReturnValue) == 0x00008C, "Member 'B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache::CallFunc_GetHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache, CallFunc_IsServer_ReturnValue) == 0x000090, "Member 'B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000094, "Member 'B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000098, "Member 'B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache, K2Node_DynamicCast_bSuccess_1) == 0x0000A0, "Member 'B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache, CallFunc_IsValid_ReturnValue_2) == 0x0000A1, "Member 'B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache, CallFunc_GetSocketLocation_ReturnValue) == 0x0000A4, "Member 'B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000B0, "Member 'B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache, CallFunc_Conv_VectorToTransform_ReturnValue) == 0x0000C0, "Member 'B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache::CallFunc_Conv_VectorToTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x0000F0, "Member 'B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache, CallFunc_K2_SetActorLocation_ReturnValue) == 0x00017C, "Member 'B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000180, "Member 'B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache, CallFunc_FinishSpawningActor_ReturnValue) == 0x000188, "Member 'B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache, CallFunc_GetUserWidgetObject_ReturnValue) == 0x000190, "Member 'B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache::CallFunc_GetUserWidgetObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache, K2Node_DynamicCast_AsLotus_Mustache_Health_Bar) == 0x000198, "Member 'B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache::K2Node_DynamicCast_AsLotus_Mustache_Health_Bar' has a wrong offset!");
static_assert(offsetof(B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache, K2Node_DynamicCast_bSuccess_2) == 0x0001A0, "Member 'B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache, CallFunc_IsValid_ReturnValue_3) == 0x0001A1, "Member 'B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache, CallFunc_GetDistanceTo_ReturnValue) == 0x0001A4, "Member 'B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache::CallFunc_GetDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache, CallFunc_RowToBool_ReturnValue) == 0x0001A8, "Member 'B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache::CallFunc_RowToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x0001A9, "Member 'B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache, CallFunc_SelectFloat_ReturnValue) == 0x0001AC, "Member 'B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache, CallFunc_SetHomingTimeUntilMaxTurnSpeed_self_CastInput) == 0x0001B0, "Member 'B_Ranged_Lotus_Mustache_C_ExecuteUbergraph_B_Ranged_Lotus_Mustache::CallFunc_SetHomingTimeUntilMaxTurnSpeed_self_CastInput' has a wrong offset!");

// Function B_Ranged_Lotus_Mustache.B_Ranged_Lotus_Mustache_C.SetHealthPercentClient
// 0x0004 (0x0004 - 0x0000)
struct B_Ranged_Lotus_Mustache_C_SetHealthPercentClient final
{
public:
	float                                         HealthPercent_0;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Ranged_Lotus_Mustache_C_SetHealthPercentClient) == 0x000004, "Wrong alignment on B_Ranged_Lotus_Mustache_C_SetHealthPercentClient");
static_assert(sizeof(B_Ranged_Lotus_Mustache_C_SetHealthPercentClient) == 0x000004, "Wrong size on B_Ranged_Lotus_Mustache_C_SetHealthPercentClient");
static_assert(offsetof(B_Ranged_Lotus_Mustache_C_SetHealthPercentClient, HealthPercent_0) == 0x000000, "Member 'B_Ranged_Lotus_Mustache_C_SetHealthPercentClient::HealthPercent_0' has a wrong offset!");

// Function B_Ranged_Lotus_Mustache.B_Ranged_Lotus_Mustache_C.OnPlayWeaponFireFX
// 0x0002 (0x0002 - 0x0000)
struct B_Ranged_Lotus_Mustache_C_OnPlayWeaponFireFX final
{
public:
	bool                                          bPersistentFire;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bSecondaryFire;                                    // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Ranged_Lotus_Mustache_C_OnPlayWeaponFireFX) == 0x000001, "Wrong alignment on B_Ranged_Lotus_Mustache_C_OnPlayWeaponFireFX");
static_assert(sizeof(B_Ranged_Lotus_Mustache_C_OnPlayWeaponFireFX) == 0x000002, "Wrong size on B_Ranged_Lotus_Mustache_C_OnPlayWeaponFireFX");
static_assert(offsetof(B_Ranged_Lotus_Mustache_C_OnPlayWeaponFireFX, bPersistentFire) == 0x000000, "Member 'B_Ranged_Lotus_Mustache_C_OnPlayWeaponFireFX::bPersistentFire' has a wrong offset!");
static_assert(offsetof(B_Ranged_Lotus_Mustache_C_OnPlayWeaponFireFX, bSecondaryFire) == 0x000001, "Member 'B_Ranged_Lotus_Mustache_C_OnPlayWeaponFireFX::bSecondaryFire' has a wrong offset!");

// Function B_Ranged_Lotus_Mustache.B_Ranged_Lotus_Mustache_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct B_Ranged_Lotus_Mustache_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Ranged_Lotus_Mustache_C_ReceiveTick) == 0x000004, "Wrong alignment on B_Ranged_Lotus_Mustache_C_ReceiveTick");
static_assert(sizeof(B_Ranged_Lotus_Mustache_C_ReceiveTick) == 0x000004, "Wrong size on B_Ranged_Lotus_Mustache_C_ReceiveTick");
static_assert(offsetof(B_Ranged_Lotus_Mustache_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'B_Ranged_Lotus_Mustache_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function B_Ranged_Lotus_Mustache.B_Ranged_Lotus_Mustache_C.OnSpawnProjectile
// 0x0008 (0x0008 - 0x0000)
struct B_Ranged_Lotus_Mustache_C_OnSpawnProjectile final
{
public:
	class AFortProjectileBase*                    SpawnProjectile;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Ranged_Lotus_Mustache_C_OnSpawnProjectile) == 0x000008, "Wrong alignment on B_Ranged_Lotus_Mustache_C_OnSpawnProjectile");
static_assert(sizeof(B_Ranged_Lotus_Mustache_C_OnSpawnProjectile) == 0x000008, "Wrong size on B_Ranged_Lotus_Mustache_C_OnSpawnProjectile");
static_assert(offsetof(B_Ranged_Lotus_Mustache_C_OnSpawnProjectile, SpawnProjectile) == 0x000000, "Member 'B_Ranged_Lotus_Mustache_C_OnSpawnProjectile::SpawnProjectile' has a wrong offset!");

}

