#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Rifle_Sniper_Heavy_Athena

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function B_Rifle_Sniper_Heavy_Athena.B_Rifle_Sniper_Heavy_Athena_C.ExecuteUbergraph_B_Rifle_Sniper_Heavy_Athena
// 0x0008 (0x0008 - 0x0000)
struct B_Rifle_Sniper_Heavy_Athena_C_ExecuteUbergraph_B_Rifle_Sniper_Heavy_Athena final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Rifle_Sniper_Heavy_Athena_C_ExecuteUbergraph_B_Rifle_Sniper_Heavy_Athena) == 0x000004, "Wrong alignment on B_Rifle_Sniper_Heavy_Athena_C_ExecuteUbergraph_B_Rifle_Sniper_Heavy_Athena");
static_assert(sizeof(B_Rifle_Sniper_Heavy_Athena_C_ExecuteUbergraph_B_Rifle_Sniper_Heavy_Athena) == 0x000008, "Wrong size on B_Rifle_Sniper_Heavy_Athena_C_ExecuteUbergraph_B_Rifle_Sniper_Heavy_Athena");
static_assert(offsetof(B_Rifle_Sniper_Heavy_Athena_C_ExecuteUbergraph_B_Rifle_Sniper_Heavy_Athena, EntryPoint) == 0x000000, "Member 'B_Rifle_Sniper_Heavy_Athena_C_ExecuteUbergraph_B_Rifle_Sniper_Heavy_Athena::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Rifle_Sniper_Heavy_Athena_C_ExecuteUbergraph_B_Rifle_Sniper_Heavy_Athena, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'B_Rifle_Sniper_Heavy_Athena_C_ExecuteUbergraph_B_Rifle_Sniper_Heavy_Athena::K2Node_Event_DeltaSeconds' has a wrong offset!");

// Function B_Rifle_Sniper_Heavy_Athena.B_Rifle_Sniper_Heavy_Athena_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct B_Rifle_Sniper_Heavy_Athena_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Rifle_Sniper_Heavy_Athena_C_ReceiveTick) == 0x000004, "Wrong alignment on B_Rifle_Sniper_Heavy_Athena_C_ReceiveTick");
static_assert(sizeof(B_Rifle_Sniper_Heavy_Athena_C_ReceiveTick) == 0x000004, "Wrong size on B_Rifle_Sniper_Heavy_Athena_C_ReceiveTick");
static_assert(offsetof(B_Rifle_Sniper_Heavy_Athena_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'B_Rifle_Sniper_Heavy_Athena_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function B_Rifle_Sniper_Heavy_Athena.B_Rifle_Sniper_Heavy_Athena_C.CalculateTraceDistance
// 0x00B0 (0x00B0 - 0x0000)
struct B_Rifle_Sniper_Heavy_Athena_C_CalculateTraceDistance final
{
public:
	struct FVector                                StartPoint;                                        // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                EndPoint;                                          // 0x000C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetCameraRotation_ReturnValue;            // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue;            // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetUpVector_ReturnValue;                  // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetRightVector_ReturnValue;               // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_3;           // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_4;           // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_5;           // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Rifle_Sniper_Heavy_Athena_C_CalculateTraceDistance) == 0x000008, "Wrong alignment on B_Rifle_Sniper_Heavy_Athena_C_CalculateTraceDistance");
static_assert(sizeof(B_Rifle_Sniper_Heavy_Athena_C_CalculateTraceDistance) == 0x0000B0, "Wrong size on B_Rifle_Sniper_Heavy_Athena_C_CalculateTraceDistance");
static_assert(offsetof(B_Rifle_Sniper_Heavy_Athena_C_CalculateTraceDistance, StartPoint) == 0x000000, "Member 'B_Rifle_Sniper_Heavy_Athena_C_CalculateTraceDistance::StartPoint' has a wrong offset!");
static_assert(offsetof(B_Rifle_Sniper_Heavy_Athena_C_CalculateTraceDistance, EndPoint) == 0x00000C, "Member 'B_Rifle_Sniper_Heavy_Athena_C_CalculateTraceDistance::EndPoint' has a wrong offset!");
static_assert(offsetof(B_Rifle_Sniper_Heavy_Athena_C_CalculateTraceDistance, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000018, "Member 'B_Rifle_Sniper_Heavy_Athena_C_CalculateTraceDistance::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Rifle_Sniper_Heavy_Athena_C_CalculateTraceDistance, CallFunc_GetCameraRotation_ReturnValue) == 0x000020, "Member 'B_Rifle_Sniper_Heavy_Athena_C_CalculateTraceDistance::CallFunc_GetCameraRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Rifle_Sniper_Heavy_Athena_C_CalculateTraceDistance, CallFunc_GetCameraLocation_ReturnValue) == 0x00002C, "Member 'B_Rifle_Sniper_Heavy_Athena_C_CalculateTraceDistance::CallFunc_GetCameraLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Rifle_Sniper_Heavy_Athena_C_CalculateTraceDistance, CallFunc_GetForwardVector_ReturnValue) == 0x000038, "Member 'B_Rifle_Sniper_Heavy_Athena_C_CalculateTraceDistance::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Rifle_Sniper_Heavy_Athena_C_CalculateTraceDistance, CallFunc_GetUpVector_ReturnValue) == 0x000044, "Member 'B_Rifle_Sniper_Heavy_Athena_C_CalculateTraceDistance::CallFunc_GetUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Rifle_Sniper_Heavy_Athena_C_CalculateTraceDistance, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000050, "Member 'B_Rifle_Sniper_Heavy_Athena_C_CalculateTraceDistance::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Rifle_Sniper_Heavy_Athena_C_CalculateTraceDistance, CallFunc_GetRightVector_ReturnValue) == 0x00005C, "Member 'B_Rifle_Sniper_Heavy_Athena_C_CalculateTraceDistance::CallFunc_GetRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Rifle_Sniper_Heavy_Athena_C_CalculateTraceDistance, CallFunc_Add_VectorVector_ReturnValue) == 0x000068, "Member 'B_Rifle_Sniper_Heavy_Athena_C_CalculateTraceDistance::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Rifle_Sniper_Heavy_Athena_C_CalculateTraceDistance, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000074, "Member 'B_Rifle_Sniper_Heavy_Athena_C_CalculateTraceDistance::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(B_Rifle_Sniper_Heavy_Athena_C_CalculateTraceDistance, CallFunc_Add_VectorVector_ReturnValue_2) == 0x000080, "Member 'B_Rifle_Sniper_Heavy_Athena_C_CalculateTraceDistance::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(B_Rifle_Sniper_Heavy_Athena_C_CalculateTraceDistance, CallFunc_Add_VectorVector_ReturnValue_3) == 0x00008C, "Member 'B_Rifle_Sniper_Heavy_Athena_C_CalculateTraceDistance::CallFunc_Add_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(B_Rifle_Sniper_Heavy_Athena_C_CalculateTraceDistance, CallFunc_Add_VectorVector_ReturnValue_4) == 0x000098, "Member 'B_Rifle_Sniper_Heavy_Athena_C_CalculateTraceDistance::CallFunc_Add_VectorVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(B_Rifle_Sniper_Heavy_Athena_C_CalculateTraceDistance, CallFunc_Add_VectorVector_ReturnValue_5) == 0x0000A4, "Member 'B_Rifle_Sniper_Heavy_Athena_C_CalculateTraceDistance::CallFunc_Add_VectorVector_ReturnValue_5' has a wrong offset!");

}

