#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_SneakySnowmanV2_Athena

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "B_UtilityItem_Generic_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass B_SneakySnowmanV2_Athena.B_SneakySnowmanV2_Athena_C
// 0x0048 (0x0BC0 - 0x0B78)
class AB_SneakySnowmanV2_Athena_C : public AB_UtilityItem_Generic_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B78(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFortWorldItemDefinition*               SnowmanItemDef;                                    // 0x0B80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0B88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         ShouldSnowmanInTurret;                             // 0x0B90(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UFortItem*>                      SnowmanItemInstances;                              // 0x0BB0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_B_SneakySnowmanV2_Athena(int32 EntryPoint);
	void K2_OnUnEquip();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"B_SneakySnowmanV2_Athena_C">();
	}
	static class AB_SneakySnowmanV2_Athena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AB_SneakySnowmanV2_Athena_C>();
	}
};
static_assert(alignof(AB_SneakySnowmanV2_Athena_C) == 0x000008, "Wrong alignment on AB_SneakySnowmanV2_Athena_C");
static_assert(sizeof(AB_SneakySnowmanV2_Athena_C) == 0x000BC0, "Wrong size on AB_SneakySnowmanV2_Athena_C");
static_assert(offsetof(AB_SneakySnowmanV2_Athena_C, UberGraphFrame) == 0x000B78, "Member 'AB_SneakySnowmanV2_Athena_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AB_SneakySnowmanV2_Athena_C, SnowmanItemDef) == 0x000B80, "Member 'AB_SneakySnowmanV2_Athena_C::SnowmanItemDef' has a wrong offset!");
static_assert(offsetof(AB_SneakySnowmanV2_Athena_C, PlayerPawn) == 0x000B88, "Member 'AB_SneakySnowmanV2_Athena_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(AB_SneakySnowmanV2_Athena_C, ShouldSnowmanInTurret) == 0x000B90, "Member 'AB_SneakySnowmanV2_Athena_C::ShouldSnowmanInTurret' has a wrong offset!");
static_assert(offsetof(AB_SneakySnowmanV2_Athena_C, SnowmanItemInstances) == 0x000BB0, "Member 'AB_SneakySnowmanV2_Athena_C::SnowmanItemInstances' has a wrong offset!");

}

