#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattlePassScreen_SideMessaging_NewTech

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function BattlePassScreen_SideMessaging_NewTech.BattlePassScreen_SideMessaging_NewTech_C.ExecuteUbergraph_BattlePassScreen_SideMessaging_NewTech
// 0x00C8 (0x00C8 - 0x0000)
struct BattlePassScreen_SideMessaging_NewTech_C_ExecuteUbergraph_BattlePassScreen_SideMessaging_NewTech final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable;                              // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_2;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable_3;                            // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_4;                            // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_5;                            // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue;      // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_3;                              // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemDefinition*                    K2Node_CustomEvent_NewItem;                        // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A[0x2];                                       // 0x009A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_Select_Default;                             // 0x009C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_Select_Default_1;                           // 0x00A4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector2D                              K2Node_Select_Default_2;                           // 0x00B4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Select_Default_3;                           // 0x00BC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattlePassScreen_SideMessaging_NewTech_C_ExecuteUbergraph_BattlePassScreen_SideMessaging_NewTech) == 0x000008, "Wrong alignment on BattlePassScreen_SideMessaging_NewTech_C_ExecuteUbergraph_BattlePassScreen_SideMessaging_NewTech");
static_assert(sizeof(BattlePassScreen_SideMessaging_NewTech_C_ExecuteUbergraph_BattlePassScreen_SideMessaging_NewTech) == 0x0000C8, "Wrong size on BattlePassScreen_SideMessaging_NewTech_C_ExecuteUbergraph_BattlePassScreen_SideMessaging_NewTech");
static_assert(offsetof(BattlePassScreen_SideMessaging_NewTech_C_ExecuteUbergraph_BattlePassScreen_SideMessaging_NewTech, EntryPoint) == 0x000000, "Member 'BattlePassScreen_SideMessaging_NewTech_C_ExecuteUbergraph_BattlePassScreen_SideMessaging_NewTech::EntryPoint' has a wrong offset!");
static_assert(offsetof(BattlePassScreen_SideMessaging_NewTech_C_ExecuteUbergraph_BattlePassScreen_SideMessaging_NewTech, Temp_struct_Variable) == 0x000004, "Member 'BattlePassScreen_SideMessaging_NewTech_C_ExecuteUbergraph_BattlePassScreen_SideMessaging_NewTech::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BattlePassScreen_SideMessaging_NewTech_C_ExecuteUbergraph_BattlePassScreen_SideMessaging_NewTech, Temp_bool_Variable) == 0x00000C, "Member 'BattlePassScreen_SideMessaging_NewTech_C_ExecuteUbergraph_BattlePassScreen_SideMessaging_NewTech::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BattlePassScreen_SideMessaging_NewTech_C_ExecuteUbergraph_BattlePassScreen_SideMessaging_NewTech, Temp_bool_Variable_1) == 0x00000D, "Member 'BattlePassScreen_SideMessaging_NewTech_C_ExecuteUbergraph_BattlePassScreen_SideMessaging_NewTech::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BattlePassScreen_SideMessaging_NewTech_C_ExecuteUbergraph_BattlePassScreen_SideMessaging_NewTech, Temp_struct_Variable_1) == 0x000010, "Member 'BattlePassScreen_SideMessaging_NewTech_C_ExecuteUbergraph_BattlePassScreen_SideMessaging_NewTech::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BattlePassScreen_SideMessaging_NewTech_C_ExecuteUbergraph_BattlePassScreen_SideMessaging_NewTech, Temp_struct_Variable_2) == 0x000018, "Member 'BattlePassScreen_SideMessaging_NewTech_C_ExecuteUbergraph_BattlePassScreen_SideMessaging_NewTech::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(BattlePassScreen_SideMessaging_NewTech_C_ExecuteUbergraph_BattlePassScreen_SideMessaging_NewTech, Temp_bool_Variable_2) == 0x000020, "Member 'BattlePassScreen_SideMessaging_NewTech_C_ExecuteUbergraph_BattlePassScreen_SideMessaging_NewTech::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BattlePassScreen_SideMessaging_NewTech_C_ExecuteUbergraph_BattlePassScreen_SideMessaging_NewTech, Temp_struct_Variable_3) == 0x000024, "Member 'BattlePassScreen_SideMessaging_NewTech_C_ExecuteUbergraph_BattlePassScreen_SideMessaging_NewTech::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(BattlePassScreen_SideMessaging_NewTech_C_ExecuteUbergraph_BattlePassScreen_SideMessaging_NewTech, Temp_struct_Variable_4) == 0x00002C, "Member 'BattlePassScreen_SideMessaging_NewTech_C_ExecuteUbergraph_BattlePassScreen_SideMessaging_NewTech::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(BattlePassScreen_SideMessaging_NewTech_C_ExecuteUbergraph_BattlePassScreen_SideMessaging_NewTech, Temp_struct_Variable_5) == 0x000034, "Member 'BattlePassScreen_SideMessaging_NewTech_C_ExecuteUbergraph_BattlePassScreen_SideMessaging_NewTech::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(BattlePassScreen_SideMessaging_NewTech_C_ExecuteUbergraph_BattlePassScreen_SideMessaging_NewTech, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue) == 0x000040, "Member 'BattlePassScreen_SideMessaging_NewTech_C_ExecuteUbergraph_BattlePassScreen_SideMessaging_NewTech::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePassScreen_SideMessaging_NewTech_C_ExecuteUbergraph_BattlePassScreen_SideMessaging_NewTech, K2Node_MakeStruct_Margin) == 0x000048, "Member 'BattlePassScreen_SideMessaging_NewTech_C_ExecuteUbergraph_BattlePassScreen_SideMessaging_NewTech::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(BattlePassScreen_SideMessaging_NewTech_C_ExecuteUbergraph_BattlePassScreen_SideMessaging_NewTech, K2Node_MakeStruct_Margin_1) == 0x000058, "Member 'BattlePassScreen_SideMessaging_NewTech_C_ExecuteUbergraph_BattlePassScreen_SideMessaging_NewTech::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(BattlePassScreen_SideMessaging_NewTech_C_ExecuteUbergraph_BattlePassScreen_SideMessaging_NewTech, Temp_bool_Variable_3) == 0x000068, "Member 'BattlePassScreen_SideMessaging_NewTech_C_ExecuteUbergraph_BattlePassScreen_SideMessaging_NewTech::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(BattlePassScreen_SideMessaging_NewTech_C_ExecuteUbergraph_BattlePassScreen_SideMessaging_NewTech, CallFunc_PlayAnimation_ReturnValue) == 0x000070, "Member 'BattlePassScreen_SideMessaging_NewTech_C_ExecuteUbergraph_BattlePassScreen_SideMessaging_NewTech::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePassScreen_SideMessaging_NewTech_C_ExecuteUbergraph_BattlePassScreen_SideMessaging_NewTech, K2Node_CustomEvent_NewItem) == 0x000078, "Member 'BattlePassScreen_SideMessaging_NewTech_C_ExecuteUbergraph_BattlePassScreen_SideMessaging_NewTech::K2Node_CustomEvent_NewItem' has a wrong offset!");
static_assert(offsetof(BattlePassScreen_SideMessaging_NewTech_C_ExecuteUbergraph_BattlePassScreen_SideMessaging_NewTech, CallFunc_IsValid_ReturnValue) == 0x000080, "Member 'BattlePassScreen_SideMessaging_NewTech_C_ExecuteUbergraph_BattlePassScreen_SideMessaging_NewTech::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePassScreen_SideMessaging_NewTech_C_ExecuteUbergraph_BattlePassScreen_SideMessaging_NewTech, CallFunc_PlayAnimation_ReturnValue_1) == 0x000088, "Member 'BattlePassScreen_SideMessaging_NewTech_C_ExecuteUbergraph_BattlePassScreen_SideMessaging_NewTech::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattlePassScreen_SideMessaging_NewTech_C_ExecuteUbergraph_BattlePassScreen_SideMessaging_NewTech, CallFunc_PlayAnimation_ReturnValue_2) == 0x000090, "Member 'BattlePassScreen_SideMessaging_NewTech_C_ExecuteUbergraph_BattlePassScreen_SideMessaging_NewTech::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BattlePassScreen_SideMessaging_NewTech_C_ExecuteUbergraph_BattlePassScreen_SideMessaging_NewTech, CallFunc_HasTag_ReturnValue) == 0x000098, "Member 'BattlePassScreen_SideMessaging_NewTech_C_ExecuteUbergraph_BattlePassScreen_SideMessaging_NewTech::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePassScreen_SideMessaging_NewTech_C_ExecuteUbergraph_BattlePassScreen_SideMessaging_NewTech, K2Node_Event_IsDesignTime) == 0x000099, "Member 'BattlePassScreen_SideMessaging_NewTech_C_ExecuteUbergraph_BattlePassScreen_SideMessaging_NewTech::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BattlePassScreen_SideMessaging_NewTech_C_ExecuteUbergraph_BattlePassScreen_SideMessaging_NewTech, K2Node_Select_Default) == 0x00009C, "Member 'BattlePassScreen_SideMessaging_NewTech_C_ExecuteUbergraph_BattlePassScreen_SideMessaging_NewTech::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BattlePassScreen_SideMessaging_NewTech_C_ExecuteUbergraph_BattlePassScreen_SideMessaging_NewTech, K2Node_Select_Default_1) == 0x0000A4, "Member 'BattlePassScreen_SideMessaging_NewTech_C_ExecuteUbergraph_BattlePassScreen_SideMessaging_NewTech::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BattlePassScreen_SideMessaging_NewTech_C_ExecuteUbergraph_BattlePassScreen_SideMessaging_NewTech, K2Node_Select_Default_2) == 0x0000B4, "Member 'BattlePassScreen_SideMessaging_NewTech_C_ExecuteUbergraph_BattlePassScreen_SideMessaging_NewTech::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BattlePassScreen_SideMessaging_NewTech_C_ExecuteUbergraph_BattlePassScreen_SideMessaging_NewTech, K2Node_Select_Default_3) == 0x0000BC, "Member 'BattlePassScreen_SideMessaging_NewTech_C_ExecuteUbergraph_BattlePassScreen_SideMessaging_NewTech::K2Node_Select_Default_3' has a wrong offset!");

// Function BattlePassScreen_SideMessaging_NewTech.BattlePassScreen_SideMessaging_NewTech_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BattlePassScreen_SideMessaging_NewTech_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattlePassScreen_SideMessaging_NewTech_C_PreConstruct) == 0x000001, "Wrong alignment on BattlePassScreen_SideMessaging_NewTech_C_PreConstruct");
static_assert(sizeof(BattlePassScreen_SideMessaging_NewTech_C_PreConstruct) == 0x000001, "Wrong size on BattlePassScreen_SideMessaging_NewTech_C_PreConstruct");
static_assert(offsetof(BattlePassScreen_SideMessaging_NewTech_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BattlePassScreen_SideMessaging_NewTech_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BattlePassScreen_SideMessaging_NewTech.BattlePassScreen_SideMessaging_NewTech_C.HandleItemSet
// 0x0008 (0x0008 - 0x0000)
struct BattlePassScreen_SideMessaging_NewTech_C_HandleItemSet final
{
public:
	class UFortItemDefinition*                    NewItem;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BattlePassScreen_SideMessaging_NewTech_C_HandleItemSet) == 0x000008, "Wrong alignment on BattlePassScreen_SideMessaging_NewTech_C_HandleItemSet");
static_assert(sizeof(BattlePassScreen_SideMessaging_NewTech_C_HandleItemSet) == 0x000008, "Wrong size on BattlePassScreen_SideMessaging_NewTech_C_HandleItemSet");
static_assert(offsetof(BattlePassScreen_SideMessaging_NewTech_C_HandleItemSet, NewItem) == 0x000000, "Member 'BattlePassScreen_SideMessaging_NewTech_C_HandleItemSet::NewItem' has a wrong offset!");

// Function BattlePassScreen_SideMessaging_NewTech.BattlePassScreen_SideMessaging_NewTech_C.SetTechText
// 0x0028 (0x0028 - 0x0000)
struct BattlePassScreen_SideMessaging_NewTech_C_SetTechText final
{
public:
	struct FGameplayTagContainer                  NewParam;                                          // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_1;                     // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_2;                     // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_3;                     // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_4;                     // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_5;                     // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue_6;                     // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BattlePassScreen_SideMessaging_NewTech_C_SetTechText) == 0x000008, "Wrong alignment on BattlePassScreen_SideMessaging_NewTech_C_SetTechText");
static_assert(sizeof(BattlePassScreen_SideMessaging_NewTech_C_SetTechText) == 0x000028, "Wrong size on BattlePassScreen_SideMessaging_NewTech_C_SetTechText");
static_assert(offsetof(BattlePassScreen_SideMessaging_NewTech_C_SetTechText, NewParam) == 0x000000, "Member 'BattlePassScreen_SideMessaging_NewTech_C_SetTechText::NewParam' has a wrong offset!");
static_assert(offsetof(BattlePassScreen_SideMessaging_NewTech_C_SetTechText, CallFunc_HasTag_ReturnValue) == 0x000020, "Member 'BattlePassScreen_SideMessaging_NewTech_C_SetTechText::CallFunc_HasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BattlePassScreen_SideMessaging_NewTech_C_SetTechText, CallFunc_HasTag_ReturnValue_1) == 0x000021, "Member 'BattlePassScreen_SideMessaging_NewTech_C_SetTechText::CallFunc_HasTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BattlePassScreen_SideMessaging_NewTech_C_SetTechText, CallFunc_HasTag_ReturnValue_2) == 0x000022, "Member 'BattlePassScreen_SideMessaging_NewTech_C_SetTechText::CallFunc_HasTag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BattlePassScreen_SideMessaging_NewTech_C_SetTechText, CallFunc_HasTag_ReturnValue_3) == 0x000023, "Member 'BattlePassScreen_SideMessaging_NewTech_C_SetTechText::CallFunc_HasTag_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BattlePassScreen_SideMessaging_NewTech_C_SetTechText, CallFunc_HasTag_ReturnValue_4) == 0x000024, "Member 'BattlePassScreen_SideMessaging_NewTech_C_SetTechText::CallFunc_HasTag_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BattlePassScreen_SideMessaging_NewTech_C_SetTechText, CallFunc_HasTag_ReturnValue_5) == 0x000025, "Member 'BattlePassScreen_SideMessaging_NewTech_C_SetTechText::CallFunc_HasTag_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BattlePassScreen_SideMessaging_NewTech_C_SetTechText, CallFunc_HasTag_ReturnValue_6) == 0x000026, "Member 'BattlePassScreen_SideMessaging_NewTech_C_SetTechText::CallFunc_HasTag_ReturnValue_6' has a wrong offset!");

}

