#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattlePassScreen_SideMessaging

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BattlePassScreen_SideMessaging.BattlePassScreen_SideMessaging_C
// 0x0060 (0x0290 - 0x0230)
class UBattlePassScreen_SideMessaging_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Backing;                                           // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BottomAngle;                                       // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FreeGlow;                                          // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FreeTag_Backing;                                   // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               FreeTrack_FreeTag;                                 // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_191;                                         // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Messaging;                                         // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Free;                                         // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TopAngle;                                          // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          FlipAxis;                                          // 0x0288(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BattlePassScreen_SideMessaging(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BattlePassScreen_SideMessaging_C">();
	}
	static class UBattlePassScreen_SideMessaging_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattlePassScreen_SideMessaging_C>();
	}
};
static_assert(alignof(UBattlePassScreen_SideMessaging_C) == 0x000008, "Wrong alignment on UBattlePassScreen_SideMessaging_C");
static_assert(sizeof(UBattlePassScreen_SideMessaging_C) == 0x000290, "Wrong size on UBattlePassScreen_SideMessaging_C");
static_assert(offsetof(UBattlePassScreen_SideMessaging_C, UberGraphFrame) == 0x000230, "Member 'UBattlePassScreen_SideMessaging_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBattlePassScreen_SideMessaging_C, Backing) == 0x000238, "Member 'UBattlePassScreen_SideMessaging_C::Backing' has a wrong offset!");
static_assert(offsetof(UBattlePassScreen_SideMessaging_C, BottomAngle) == 0x000240, "Member 'UBattlePassScreen_SideMessaging_C::BottomAngle' has a wrong offset!");
static_assert(offsetof(UBattlePassScreen_SideMessaging_C, FreeGlow) == 0x000248, "Member 'UBattlePassScreen_SideMessaging_C::FreeGlow' has a wrong offset!");
static_assert(offsetof(UBattlePassScreen_SideMessaging_C, FreeTag_Backing) == 0x000250, "Member 'UBattlePassScreen_SideMessaging_C::FreeTag_Backing' has a wrong offset!");
static_assert(offsetof(UBattlePassScreen_SideMessaging_C, FreeTrack_FreeTag) == 0x000258, "Member 'UBattlePassScreen_SideMessaging_C::FreeTrack_FreeTag' has a wrong offset!");
static_assert(offsetof(UBattlePassScreen_SideMessaging_C, Image_191) == 0x000260, "Member 'UBattlePassScreen_SideMessaging_C::Image_191' has a wrong offset!");
static_assert(offsetof(UBattlePassScreen_SideMessaging_C, Messaging) == 0x000268, "Member 'UBattlePassScreen_SideMessaging_C::Messaging' has a wrong offset!");
static_assert(offsetof(UBattlePassScreen_SideMessaging_C, SafeZone_0) == 0x000270, "Member 'UBattlePassScreen_SideMessaging_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(UBattlePassScreen_SideMessaging_C, Text_Free) == 0x000278, "Member 'UBattlePassScreen_SideMessaging_C::Text_Free' has a wrong offset!");
static_assert(offsetof(UBattlePassScreen_SideMessaging_C, TopAngle) == 0x000280, "Member 'UBattlePassScreen_SideMessaging_C::TopAngle' has a wrong offset!");
static_assert(offsetof(UBattlePassScreen_SideMessaging_C, FlipAxis) == 0x000288, "Member 'UBattlePassScreen_SideMessaging_C::FlipAxis' has a wrong offset!");

}

