#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattlePassPagePipButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BattlePassPagePipButton.BattlePassPagePipButton_C
// 0x0020 (0x0B90 - 0x0B70)
class UBattlePassPagePipButton_C final : public UCommonButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Pressed;                                           // 0x0B78(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x0B80(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ButtonBacking;                                     // 0x0B88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BattlePassPagePipButton(int32 EntryPoint);
	void BP_OnDeselected();
	void BP_OnSelected();
	void BP_OnClicked();
	void BP_OnUnhovered();
	void BP_OnHovered();
	void Construct();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BattlePassPagePipButton_C">();
	}
	static class UBattlePassPagePipButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattlePassPagePipButton_C>();
	}
};
static_assert(alignof(UBattlePassPagePipButton_C) == 0x000008, "Wrong alignment on UBattlePassPagePipButton_C");
static_assert(sizeof(UBattlePassPagePipButton_C) == 0x000B90, "Wrong size on UBattlePassPagePipButton_C");
static_assert(offsetof(UBattlePassPagePipButton_C, UberGraphFrame) == 0x000B70, "Member 'UBattlePassPagePipButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBattlePassPagePipButton_C, Pressed) == 0x000B78, "Member 'UBattlePassPagePipButton_C::Pressed' has a wrong offset!");
static_assert(offsetof(UBattlePassPagePipButton_C, Hover) == 0x000B80, "Member 'UBattlePassPagePipButton_C::Hover' has a wrong offset!");
static_assert(offsetof(UBattlePassPagePipButton_C, ButtonBacking) == 0x000B88, "Member 'UBattlePassPagePipButton_C::ButtonBacking' has a wrong offset!");

}

