#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BattlePassDirectAcquisitionScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BattlePassDirectAcquisitionScreen.BattlePassDirectAcquisitionScreen_C
// 0x00B0 (0x05F0 - 0x0540)
class UBattlePassDirectAcquisitionScreen_C final : public UFortDirectAcquisitionWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0540(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Entrance_Tiles_0;                                  // 0x0548(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Entrance_OR;                                       // 0x0550(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Entrance_Tiles;                                    // 0x0558(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Entrance_Header;                                   // 0x0560(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCloseButton_C*                         CloseButton;                                       // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorderTouchToClose;                          // 0x0570(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Glow;                                              // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         LeftTileHB;                                        // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMTXButton_C*                           MTXButton;                                         // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               MTXButtonBox;                                      // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          NoOffersBox;                                       // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlayProgressSpinner;                            // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ProgressSpinner;                                   // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         RightTileHB;                                       // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonDateTimeTextBlock*               SeasonCountdown;                                   // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SeasonEndsLabel;                                   // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  SwitcherItemsProgress;                             // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBOffers;                                          // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FMargin                                TilePadding;                                       // 0x05D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	int32                                         ItemCount;                                         // 0x05E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BattlePassDirectAcquisitionScreen(int32 EntryPoint);
	void BndEvt__CloseButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void NoOffersAvailable();
	void OnBeginIntro();
	void BndEvt__PanelButton_K2Node_ComponentBoundEvent_97_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void Construct();
	void BP_OnActivated();
	void OnOffersGenerated();
	void OnStartReadingOffers();
	void GenerateOfferWidget(class UFortStoreFrontOfferInfo* OfferData);
	void HandleBack(bool* bPassThrough);
	struct FEventReply On_CommonBorderTouchToClose_MouseButtonUp(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void Intro_Anim__OR_();
	void Intro_Anim__Tiles_();
	void Intro_Anim_Reset();
	void Intro_Anim__Header_();
	void GetSeasonEndLabelText(class FText* Result);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BattlePassDirectAcquisitionScreen_C">();
	}
	static class UBattlePassDirectAcquisitionScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattlePassDirectAcquisitionScreen_C>();
	}
};
static_assert(alignof(UBattlePassDirectAcquisitionScreen_C) == 0x000008, "Wrong alignment on UBattlePassDirectAcquisitionScreen_C");
static_assert(sizeof(UBattlePassDirectAcquisitionScreen_C) == 0x0005F0, "Wrong size on UBattlePassDirectAcquisitionScreen_C");
static_assert(offsetof(UBattlePassDirectAcquisitionScreen_C, UberGraphFrame) == 0x000540, "Member 'UBattlePassDirectAcquisitionScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBattlePassDirectAcquisitionScreen_C, Entrance_Tiles_0) == 0x000548, "Member 'UBattlePassDirectAcquisitionScreen_C::Entrance_Tiles_0' has a wrong offset!");
static_assert(offsetof(UBattlePassDirectAcquisitionScreen_C, Entrance_OR) == 0x000550, "Member 'UBattlePassDirectAcquisitionScreen_C::Entrance_OR' has a wrong offset!");
static_assert(offsetof(UBattlePassDirectAcquisitionScreen_C, Entrance_Tiles) == 0x000558, "Member 'UBattlePassDirectAcquisitionScreen_C::Entrance_Tiles' has a wrong offset!");
static_assert(offsetof(UBattlePassDirectAcquisitionScreen_C, Entrance_Header) == 0x000560, "Member 'UBattlePassDirectAcquisitionScreen_C::Entrance_Header' has a wrong offset!");
static_assert(offsetof(UBattlePassDirectAcquisitionScreen_C, CloseButton) == 0x000568, "Member 'UBattlePassDirectAcquisitionScreen_C::CloseButton' has a wrong offset!");
static_assert(offsetof(UBattlePassDirectAcquisitionScreen_C, CommonBorderTouchToClose) == 0x000570, "Member 'UBattlePassDirectAcquisitionScreen_C::CommonBorderTouchToClose' has a wrong offset!");
static_assert(offsetof(UBattlePassDirectAcquisitionScreen_C, Glow) == 0x000578, "Member 'UBattlePassDirectAcquisitionScreen_C::Glow' has a wrong offset!");
static_assert(offsetof(UBattlePassDirectAcquisitionScreen_C, LeftTileHB) == 0x000580, "Member 'UBattlePassDirectAcquisitionScreen_C::LeftTileHB' has a wrong offset!");
static_assert(offsetof(UBattlePassDirectAcquisitionScreen_C, MTXButton) == 0x000588, "Member 'UBattlePassDirectAcquisitionScreen_C::MTXButton' has a wrong offset!");
static_assert(offsetof(UBattlePassDirectAcquisitionScreen_C, MTXButtonBox) == 0x000590, "Member 'UBattlePassDirectAcquisitionScreen_C::MTXButtonBox' has a wrong offset!");
static_assert(offsetof(UBattlePassDirectAcquisitionScreen_C, NoOffersBox) == 0x000598, "Member 'UBattlePassDirectAcquisitionScreen_C::NoOffersBox' has a wrong offset!");
static_assert(offsetof(UBattlePassDirectAcquisitionScreen_C, OverlayProgressSpinner) == 0x0005A0, "Member 'UBattlePassDirectAcquisitionScreen_C::OverlayProgressSpinner' has a wrong offset!");
static_assert(offsetof(UBattlePassDirectAcquisitionScreen_C, ProgressSpinner) == 0x0005A8, "Member 'UBattlePassDirectAcquisitionScreen_C::ProgressSpinner' has a wrong offset!");
static_assert(offsetof(UBattlePassDirectAcquisitionScreen_C, RightTileHB) == 0x0005B0, "Member 'UBattlePassDirectAcquisitionScreen_C::RightTileHB' has a wrong offset!");
static_assert(offsetof(UBattlePassDirectAcquisitionScreen_C, SeasonCountdown) == 0x0005B8, "Member 'UBattlePassDirectAcquisitionScreen_C::SeasonCountdown' has a wrong offset!");
static_assert(offsetof(UBattlePassDirectAcquisitionScreen_C, SeasonEndsLabel) == 0x0005C0, "Member 'UBattlePassDirectAcquisitionScreen_C::SeasonEndsLabel' has a wrong offset!");
static_assert(offsetof(UBattlePassDirectAcquisitionScreen_C, SwitcherItemsProgress) == 0x0005C8, "Member 'UBattlePassDirectAcquisitionScreen_C::SwitcherItemsProgress' has a wrong offset!");
static_assert(offsetof(UBattlePassDirectAcquisitionScreen_C, VBOffers) == 0x0005D0, "Member 'UBattlePassDirectAcquisitionScreen_C::VBOffers' has a wrong offset!");
static_assert(offsetof(UBattlePassDirectAcquisitionScreen_C, TilePadding) == 0x0005D8, "Member 'UBattlePassDirectAcquisitionScreen_C::TilePadding' has a wrong offset!");
static_assert(offsetof(UBattlePassDirectAcquisitionScreen_C, ItemCount) == 0x0005E8, "Member 'UBattlePassDirectAcquisitionScreen_C::ItemCount' has a wrong offset!");

}

