#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP12_PaperDoll_Mannequin

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP12_PaperDoll_Mannequin.BP12_PaperDoll_Mannequin_C.ExecuteUbergraph_BP12_PaperDoll_Mannequin
// 0x0068 (0x0068 - 0x0000)
struct BP12_PaperDoll_Mannequin_C_ExecuteUbergraph_BP12_PaperDoll_Mannequin final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Event_VariantChannel;                       // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Event_OldVariantTag;                        // 0x000C(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Event_NewVariantTag;                        // 0x0014(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess;   // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemComponent*                     CallFunc_SpawnFXSystemAttached_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemComponent*                     CallFunc_SpawnFXSystemAttached_ReturnValue_1;      // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemComponent*                     CallFunc_SpawnFXSystemAttached_ReturnValue_2;      // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemComponent*                     CallFunc_SpawnFXSystemAttached_ReturnValue_3;      // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFXSystemComponent*                     CallFunc_SpawnFXSystemAttached_ReturnValue_4;      // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UCustomCharacterPart*             K2Node_Event_OldPart;                              // 0x0048(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UCustomCharacterPart*             K2Node_Event_NewPart;                              // 0x0050(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortCustomPartType                           K2Node_Event_PartType;                             // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP12_PaperDoll_Mannequin_C_ExecuteUbergraph_BP12_PaperDoll_Mannequin) == 0x000008, "Wrong alignment on BP12_PaperDoll_Mannequin_C_ExecuteUbergraph_BP12_PaperDoll_Mannequin");
static_assert(sizeof(BP12_PaperDoll_Mannequin_C_ExecuteUbergraph_BP12_PaperDoll_Mannequin) == 0x000068, "Wrong size on BP12_PaperDoll_Mannequin_C_ExecuteUbergraph_BP12_PaperDoll_Mannequin");
static_assert(offsetof(BP12_PaperDoll_Mannequin_C_ExecuteUbergraph_BP12_PaperDoll_Mannequin, EntryPoint) == 0x000000, "Member 'BP12_PaperDoll_Mannequin_C_ExecuteUbergraph_BP12_PaperDoll_Mannequin::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP12_PaperDoll_Mannequin_C_ExecuteUbergraph_BP12_PaperDoll_Mannequin, K2Node_Event_VariantChannel) == 0x000004, "Member 'BP12_PaperDoll_Mannequin_C_ExecuteUbergraph_BP12_PaperDoll_Mannequin::K2Node_Event_VariantChannel' has a wrong offset!");
static_assert(offsetof(BP12_PaperDoll_Mannequin_C_ExecuteUbergraph_BP12_PaperDoll_Mannequin, K2Node_Event_OldVariantTag) == 0x00000C, "Member 'BP12_PaperDoll_Mannequin_C_ExecuteUbergraph_BP12_PaperDoll_Mannequin::K2Node_Event_OldVariantTag' has a wrong offset!");
static_assert(offsetof(BP12_PaperDoll_Mannequin_C_ExecuteUbergraph_BP12_PaperDoll_Mannequin, K2Node_Event_NewVariantTag) == 0x000014, "Member 'BP12_PaperDoll_Mannequin_C_ExecuteUbergraph_BP12_PaperDoll_Mannequin::K2Node_Event_NewVariantTag' has a wrong offset!");
static_assert(offsetof(BP12_PaperDoll_Mannequin_C_ExecuteUbergraph_BP12_PaperDoll_Mannequin, GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess) == 0x00001C, "Member 'BP12_PaperDoll_Mannequin_C_ExecuteUbergraph_BP12_PaperDoll_Mannequin::GameplayTagsK2Node_SwitchGameplayTag_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP12_PaperDoll_Mannequin_C_ExecuteUbergraph_BP12_PaperDoll_Mannequin, CallFunc_SpawnFXSystemAttached_ReturnValue) == 0x000020, "Member 'BP12_PaperDoll_Mannequin_C_ExecuteUbergraph_BP12_PaperDoll_Mannequin::CallFunc_SpawnFXSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP12_PaperDoll_Mannequin_C_ExecuteUbergraph_BP12_PaperDoll_Mannequin, CallFunc_SpawnFXSystemAttached_ReturnValue_1) == 0x000028, "Member 'BP12_PaperDoll_Mannequin_C_ExecuteUbergraph_BP12_PaperDoll_Mannequin::CallFunc_SpawnFXSystemAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP12_PaperDoll_Mannequin_C_ExecuteUbergraph_BP12_PaperDoll_Mannequin, CallFunc_SpawnFXSystemAttached_ReturnValue_2) == 0x000030, "Member 'BP12_PaperDoll_Mannequin_C_ExecuteUbergraph_BP12_PaperDoll_Mannequin::CallFunc_SpawnFXSystemAttached_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP12_PaperDoll_Mannequin_C_ExecuteUbergraph_BP12_PaperDoll_Mannequin, CallFunc_SpawnFXSystemAttached_ReturnValue_3) == 0x000038, "Member 'BP12_PaperDoll_Mannequin_C_ExecuteUbergraph_BP12_PaperDoll_Mannequin::CallFunc_SpawnFXSystemAttached_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP12_PaperDoll_Mannequin_C_ExecuteUbergraph_BP12_PaperDoll_Mannequin, CallFunc_SpawnFXSystemAttached_ReturnValue_4) == 0x000040, "Member 'BP12_PaperDoll_Mannequin_C_ExecuteUbergraph_BP12_PaperDoll_Mannequin::CallFunc_SpawnFXSystemAttached_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP12_PaperDoll_Mannequin_C_ExecuteUbergraph_BP12_PaperDoll_Mannequin, K2Node_Event_OldPart) == 0x000048, "Member 'BP12_PaperDoll_Mannequin_C_ExecuteUbergraph_BP12_PaperDoll_Mannequin::K2Node_Event_OldPart' has a wrong offset!");
static_assert(offsetof(BP12_PaperDoll_Mannequin_C_ExecuteUbergraph_BP12_PaperDoll_Mannequin, K2Node_Event_NewPart) == 0x000050, "Member 'BP12_PaperDoll_Mannequin_C_ExecuteUbergraph_BP12_PaperDoll_Mannequin::K2Node_Event_NewPart' has a wrong offset!");
static_assert(offsetof(BP12_PaperDoll_Mannequin_C_ExecuteUbergraph_BP12_PaperDoll_Mannequin, K2Node_Event_PartType) == 0x000058, "Member 'BP12_PaperDoll_Mannequin_C_ExecuteUbergraph_BP12_PaperDoll_Mannequin::K2Node_Event_PartType' has a wrong offset!");
static_assert(offsetof(BP12_PaperDoll_Mannequin_C_ExecuteUbergraph_BP12_PaperDoll_Mannequin, K2Node_SwitchEnum_CmpSuccess) == 0x000059, "Member 'BP12_PaperDoll_Mannequin_C_ExecuteUbergraph_BP12_PaperDoll_Mannequin::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP12_PaperDoll_Mannequin_C_ExecuteUbergraph_BP12_PaperDoll_Mannequin, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x00005C, "Member 'BP12_PaperDoll_Mannequin_C_ExecuteUbergraph_BP12_PaperDoll_Mannequin::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");

// Function BP12_PaperDoll_Mannequin.BP12_PaperDoll_Mannequin_C.OnPartChanged
// 0x0018 (0x0018 - 0x0000)
struct BP12_PaperDoll_Mannequin_C_OnPartChanged final
{
public:
	const class UCustomCharacterPart*             OldPart;                                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UCustomCharacterPart*             NewPart;                                           // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortCustomPartType                           PartType;                                          // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP12_PaperDoll_Mannequin_C_OnPartChanged) == 0x000008, "Wrong alignment on BP12_PaperDoll_Mannequin_C_OnPartChanged");
static_assert(sizeof(BP12_PaperDoll_Mannequin_C_OnPartChanged) == 0x000018, "Wrong size on BP12_PaperDoll_Mannequin_C_OnPartChanged");
static_assert(offsetof(BP12_PaperDoll_Mannequin_C_OnPartChanged, OldPart) == 0x000000, "Member 'BP12_PaperDoll_Mannequin_C_OnPartChanged::OldPart' has a wrong offset!");
static_assert(offsetof(BP12_PaperDoll_Mannequin_C_OnPartChanged, NewPart) == 0x000008, "Member 'BP12_PaperDoll_Mannequin_C_OnPartChanged::NewPart' has a wrong offset!");
static_assert(offsetof(BP12_PaperDoll_Mannequin_C_OnPartChanged, PartType) == 0x000010, "Member 'BP12_PaperDoll_Mannequin_C_OnPartChanged::PartType' has a wrong offset!");

// Function BP12_PaperDoll_Mannequin.BP12_PaperDoll_Mannequin_C.OnVariantChanged
// 0x0018 (0x0018 - 0x0000)
struct BP12_PaperDoll_Mannequin_C_OnVariantChanged final
{
public:
	struct FGameplayTag                           VariantChannel;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           OldVariantTag;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           NewVariantTag;                                     // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP12_PaperDoll_Mannequin_C_OnVariantChanged) == 0x000004, "Wrong alignment on BP12_PaperDoll_Mannequin_C_OnVariantChanged");
static_assert(sizeof(BP12_PaperDoll_Mannequin_C_OnVariantChanged) == 0x000018, "Wrong size on BP12_PaperDoll_Mannequin_C_OnVariantChanged");
static_assert(offsetof(BP12_PaperDoll_Mannequin_C_OnVariantChanged, VariantChannel) == 0x000000, "Member 'BP12_PaperDoll_Mannequin_C_OnVariantChanged::VariantChannel' has a wrong offset!");
static_assert(offsetof(BP12_PaperDoll_Mannequin_C_OnVariantChanged, OldVariantTag) == 0x000008, "Member 'BP12_PaperDoll_Mannequin_C_OnVariantChanged::OldVariantTag' has a wrong offset!");
static_assert(offsetof(BP12_PaperDoll_Mannequin_C_OnVariantChanged, NewVariantTag) == 0x000010, "Member 'BP12_PaperDoll_Mannequin_C_OnVariantChanged::NewVariantTag' has a wrong offset!");

}

