#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Frontend_IntertiveCatToy

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Frontend_IntertiveCatToy.BP_Frontend_IntertiveCatToy_C.ExecuteUbergraph_BP_Frontend_IntertiveCatToy
// 0x02C0 (0x02C0 - 0x0000)
struct BP_Frontend_IntertiveCatToy_C_ExecuteUbergraph_BP_Frontend_IntertiveCatToy final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RLerp_ReturnValue;                        // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_RLerp_ReturnValue_1;                      // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_RLerp_ReturnValue_2;                      // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_RLerp_ReturnValue_3;                      // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Event_ActionTag;                            // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Event_CameraTag;                            // 0x0048(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult; // 0x006C(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_VLerp_ReturnValue_1;                      // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult_1; // 0x0104(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_VLerp_ReturnValue_2;                      // 0x0190(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult_2; // 0x019C(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_VLerp_ReturnValue_3;                      // 0x0228(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult_3; // 0x0234(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Frontend_IntertiveCatToy_C_ExecuteUbergraph_BP_Frontend_IntertiveCatToy) == 0x000004, "Wrong alignment on BP_Frontend_IntertiveCatToy_C_ExecuteUbergraph_BP_Frontend_IntertiveCatToy");
static_assert(sizeof(BP_Frontend_IntertiveCatToy_C_ExecuteUbergraph_BP_Frontend_IntertiveCatToy) == 0x0002C0, "Wrong size on BP_Frontend_IntertiveCatToy_C_ExecuteUbergraph_BP_Frontend_IntertiveCatToy");
static_assert(offsetof(BP_Frontend_IntertiveCatToy_C_ExecuteUbergraph_BP_Frontend_IntertiveCatToy, EntryPoint) == 0x000000, "Member 'BP_Frontend_IntertiveCatToy_C_ExecuteUbergraph_BP_Frontend_IntertiveCatToy::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Frontend_IntertiveCatToy_C_ExecuteUbergraph_BP_Frontend_IntertiveCatToy, CallFunc_RLerp_ReturnValue) == 0x000004, "Member 'BP_Frontend_IntertiveCatToy_C_ExecuteUbergraph_BP_Frontend_IntertiveCatToy::CallFunc_RLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Frontend_IntertiveCatToy_C_ExecuteUbergraph_BP_Frontend_IntertiveCatToy, CallFunc_RLerp_ReturnValue_1) == 0x000010, "Member 'BP_Frontend_IntertiveCatToy_C_ExecuteUbergraph_BP_Frontend_IntertiveCatToy::CallFunc_RLerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Frontend_IntertiveCatToy_C_ExecuteUbergraph_BP_Frontend_IntertiveCatToy, CallFunc_RLerp_ReturnValue_2) == 0x00001C, "Member 'BP_Frontend_IntertiveCatToy_C_ExecuteUbergraph_BP_Frontend_IntertiveCatToy::CallFunc_RLerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Frontend_IntertiveCatToy_C_ExecuteUbergraph_BP_Frontend_IntertiveCatToy, CallFunc_RLerp_ReturnValue_3) == 0x000028, "Member 'BP_Frontend_IntertiveCatToy_C_ExecuteUbergraph_BP_Frontend_IntertiveCatToy::CallFunc_RLerp_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Frontend_IntertiveCatToy_C_ExecuteUbergraph_BP_Frontend_IntertiveCatToy, Temp_int_Variable) == 0x000034, "Member 'BP_Frontend_IntertiveCatToy_C_ExecuteUbergraph_BP_Frontend_IntertiveCatToy::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_Frontend_IntertiveCatToy_C_ExecuteUbergraph_BP_Frontend_IntertiveCatToy, Temp_int_Variable_1) == 0x000038, "Member 'BP_Frontend_IntertiveCatToy_C_ExecuteUbergraph_BP_Frontend_IntertiveCatToy::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Frontend_IntertiveCatToy_C_ExecuteUbergraph_BP_Frontend_IntertiveCatToy, Temp_int_Variable_2) == 0x00003C, "Member 'BP_Frontend_IntertiveCatToy_C_ExecuteUbergraph_BP_Frontend_IntertiveCatToy::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Frontend_IntertiveCatToy_C_ExecuteUbergraph_BP_Frontend_IntertiveCatToy, K2Node_Event_ActionTag) == 0x000040, "Member 'BP_Frontend_IntertiveCatToy_C_ExecuteUbergraph_BP_Frontend_IntertiveCatToy::K2Node_Event_ActionTag' has a wrong offset!");
static_assert(offsetof(BP_Frontend_IntertiveCatToy_C_ExecuteUbergraph_BP_Frontend_IntertiveCatToy, K2Node_Event_CameraTag) == 0x000048, "Member 'BP_Frontend_IntertiveCatToy_C_ExecuteUbergraph_BP_Frontend_IntertiveCatToy::K2Node_Event_CameraTag' has a wrong offset!");
static_assert(offsetof(BP_Frontend_IntertiveCatToy_C_ExecuteUbergraph_BP_Frontend_IntertiveCatToy, K2Node_SwitchInteger_CmpSuccess) == 0x000050, "Member 'BP_Frontend_IntertiveCatToy_C_ExecuteUbergraph_BP_Frontend_IntertiveCatToy::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Frontend_IntertiveCatToy_C_ExecuteUbergraph_BP_Frontend_IntertiveCatToy, CallFunc_Add_IntInt_ReturnValue) == 0x000054, "Member 'BP_Frontend_IntertiveCatToy_C_ExecuteUbergraph_BP_Frontend_IntertiveCatToy::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Frontend_IntertiveCatToy_C_ExecuteUbergraph_BP_Frontend_IntertiveCatToy, CallFunc_Add_IntInt_ReturnValue_1) == 0x000058, "Member 'BP_Frontend_IntertiveCatToy_C_ExecuteUbergraph_BP_Frontend_IntertiveCatToy::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Frontend_IntertiveCatToy_C_ExecuteUbergraph_BP_Frontend_IntertiveCatToy, CallFunc_Add_IntInt_ReturnValue_2) == 0x00005C, "Member 'BP_Frontend_IntertiveCatToy_C_ExecuteUbergraph_BP_Frontend_IntertiveCatToy::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Frontend_IntertiveCatToy_C_ExecuteUbergraph_BP_Frontend_IntertiveCatToy, CallFunc_VLerp_ReturnValue) == 0x000060, "Member 'BP_Frontend_IntertiveCatToy_C_ExecuteUbergraph_BP_Frontend_IntertiveCatToy::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Frontend_IntertiveCatToy_C_ExecuteUbergraph_BP_Frontend_IntertiveCatToy, CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult) == 0x00006C, "Member 'BP_Frontend_IntertiveCatToy_C_ExecuteUbergraph_BP_Frontend_IntertiveCatToy::CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Frontend_IntertiveCatToy_C_ExecuteUbergraph_BP_Frontend_IntertiveCatToy, CallFunc_VLerp_ReturnValue_1) == 0x0000F8, "Member 'BP_Frontend_IntertiveCatToy_C_ExecuteUbergraph_BP_Frontend_IntertiveCatToy::CallFunc_VLerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Frontend_IntertiveCatToy_C_ExecuteUbergraph_BP_Frontend_IntertiveCatToy, CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult_1) == 0x000104, "Member 'BP_Frontend_IntertiveCatToy_C_ExecuteUbergraph_BP_Frontend_IntertiveCatToy::CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_Frontend_IntertiveCatToy_C_ExecuteUbergraph_BP_Frontend_IntertiveCatToy, CallFunc_VLerp_ReturnValue_2) == 0x000190, "Member 'BP_Frontend_IntertiveCatToy_C_ExecuteUbergraph_BP_Frontend_IntertiveCatToy::CallFunc_VLerp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Frontend_IntertiveCatToy_C_ExecuteUbergraph_BP_Frontend_IntertiveCatToy, CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult_2) == 0x00019C, "Member 'BP_Frontend_IntertiveCatToy_C_ExecuteUbergraph_BP_Frontend_IntertiveCatToy::CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult_2' has a wrong offset!");
static_assert(offsetof(BP_Frontend_IntertiveCatToy_C_ExecuteUbergraph_BP_Frontend_IntertiveCatToy, CallFunc_VLerp_ReturnValue_3) == 0x000228, "Member 'BP_Frontend_IntertiveCatToy_C_ExecuteUbergraph_BP_Frontend_IntertiveCatToy::CallFunc_VLerp_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Frontend_IntertiveCatToy_C_ExecuteUbergraph_BP_Frontend_IntertiveCatToy, CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult_3) == 0x000234, "Member 'BP_Frontend_IntertiveCatToy_C_ExecuteUbergraph_BP_Frontend_IntertiveCatToy::CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult_3' has a wrong offset!");

// Function BP_Frontend_IntertiveCatToy.BP_Frontend_IntertiveCatToy_C.HandleObjectSpecialInteraction
// 0x0010 (0x0010 - 0x0000)
struct BP_Frontend_IntertiveCatToy_C_HandleObjectSpecialInteraction final
{
public:
	struct FGameplayTag                           ActionTag;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CameraTag;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Frontend_IntertiveCatToy_C_HandleObjectSpecialInteraction) == 0x000004, "Wrong alignment on BP_Frontend_IntertiveCatToy_C_HandleObjectSpecialInteraction");
static_assert(sizeof(BP_Frontend_IntertiveCatToy_C_HandleObjectSpecialInteraction) == 0x000010, "Wrong size on BP_Frontend_IntertiveCatToy_C_HandleObjectSpecialInteraction");
static_assert(offsetof(BP_Frontend_IntertiveCatToy_C_HandleObjectSpecialInteraction, ActionTag) == 0x000000, "Member 'BP_Frontend_IntertiveCatToy_C_HandleObjectSpecialInteraction::ActionTag' has a wrong offset!");
static_assert(offsetof(BP_Frontend_IntertiveCatToy_C_HandleObjectSpecialInteraction, CameraTag) == 0x000008, "Member 'BP_Frontend_IntertiveCatToy_C_HandleObjectSpecialInteraction::CameraTag' has a wrong offset!");

// Function BP_Frontend_IntertiveCatToy.BP_Frontend_IntertiveCatToy_C.CanCommitNavigationRequest
// 0x0001 (0x0001 - 0x0000)
struct BP_Frontend_IntertiveCatToy_C_CanCommitNavigationRequest final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Frontend_IntertiveCatToy_C_CanCommitNavigationRequest) == 0x000001, "Wrong alignment on BP_Frontend_IntertiveCatToy_C_CanCommitNavigationRequest");
static_assert(sizeof(BP_Frontend_IntertiveCatToy_C_CanCommitNavigationRequest) == 0x000001, "Wrong size on BP_Frontend_IntertiveCatToy_C_CanCommitNavigationRequest");
static_assert(offsetof(BP_Frontend_IntertiveCatToy_C_CanCommitNavigationRequest, ReturnValue) == 0x000000, "Member 'BP_Frontend_IntertiveCatToy_C_CanCommitNavigationRequest::ReturnValue' has a wrong offset!");

}

