#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Frontend_Meow_SpeedBag_1

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Frontend_Meow_SpeedBag_1.BP_Frontend_Meow_SpeedBag_1_C.ExecuteUbergraph_BP_Frontend_Meow_SpeedBag_1
// 0x0030 (0x0030 - 0x0000)
struct BP_Frontend_Meow_SpeedBag_1_C_ExecuteUbergraph_BP_Frontend_Meow_SpeedBag_1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Event_ActionTag;                            // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Event_CameraTag;                            // 0x000C(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Frontend_Meow_SpeedBag_1_C_ExecuteUbergraph_BP_Frontend_Meow_SpeedBag_1) == 0x000008, "Wrong alignment on BP_Frontend_Meow_SpeedBag_1_C_ExecuteUbergraph_BP_Frontend_Meow_SpeedBag_1");
static_assert(sizeof(BP_Frontend_Meow_SpeedBag_1_C_ExecuteUbergraph_BP_Frontend_Meow_SpeedBag_1) == 0x000030, "Wrong size on BP_Frontend_Meow_SpeedBag_1_C_ExecuteUbergraph_BP_Frontend_Meow_SpeedBag_1");
static_assert(offsetof(BP_Frontend_Meow_SpeedBag_1_C_ExecuteUbergraph_BP_Frontend_Meow_SpeedBag_1, EntryPoint) == 0x000000, "Member 'BP_Frontend_Meow_SpeedBag_1_C_ExecuteUbergraph_BP_Frontend_Meow_SpeedBag_1::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Frontend_Meow_SpeedBag_1_C_ExecuteUbergraph_BP_Frontend_Meow_SpeedBag_1, K2Node_Event_ActionTag) == 0x000004, "Member 'BP_Frontend_Meow_SpeedBag_1_C_ExecuteUbergraph_BP_Frontend_Meow_SpeedBag_1::K2Node_Event_ActionTag' has a wrong offset!");
static_assert(offsetof(BP_Frontend_Meow_SpeedBag_1_C_ExecuteUbergraph_BP_Frontend_Meow_SpeedBag_1, K2Node_Event_CameraTag) == 0x00000C, "Member 'BP_Frontend_Meow_SpeedBag_1_C_ExecuteUbergraph_BP_Frontend_Meow_SpeedBag_1::K2Node_Event_CameraTag' has a wrong offset!");
static_assert(offsetof(BP_Frontend_Meow_SpeedBag_1_C_ExecuteUbergraph_BP_Frontend_Meow_SpeedBag_1, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000014, "Member 'BP_Frontend_Meow_SpeedBag_1_C_ExecuteUbergraph_BP_Frontend_Meow_SpeedBag_1::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Frontend_Meow_SpeedBag_1_C_ExecuteUbergraph_BP_Frontend_Meow_SpeedBag_1, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000020, "Member 'BP_Frontend_Meow_SpeedBag_1_C_ExecuteUbergraph_BP_Frontend_Meow_SpeedBag_1::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Frontend_Meow_SpeedBag_1_C_ExecuteUbergraph_BP_Frontend_Meow_SpeedBag_1, CallFunc_FClamp_ReturnValue) == 0x000028, "Member 'BP_Frontend_Meow_SpeedBag_1_C_ExecuteUbergraph_BP_Frontend_Meow_SpeedBag_1::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Frontend_Meow_SpeedBag_1_C_ExecuteUbergraph_BP_Frontend_Meow_SpeedBag_1, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00002C, "Member 'BP_Frontend_Meow_SpeedBag_1_C_ExecuteUbergraph_BP_Frontend_Meow_SpeedBag_1::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_Frontend_Meow_SpeedBag_1.BP_Frontend_Meow_SpeedBag_1_C.HandleObjectSpecialInteraction
// 0x0010 (0x0010 - 0x0000)
struct BP_Frontend_Meow_SpeedBag_1_C_HandleObjectSpecialInteraction final
{
public:
	struct FGameplayTag                           ActionTag;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CameraTag;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Frontend_Meow_SpeedBag_1_C_HandleObjectSpecialInteraction) == 0x000004, "Wrong alignment on BP_Frontend_Meow_SpeedBag_1_C_HandleObjectSpecialInteraction");
static_assert(sizeof(BP_Frontend_Meow_SpeedBag_1_C_HandleObjectSpecialInteraction) == 0x000010, "Wrong size on BP_Frontend_Meow_SpeedBag_1_C_HandleObjectSpecialInteraction");
static_assert(offsetof(BP_Frontend_Meow_SpeedBag_1_C_HandleObjectSpecialInteraction, ActionTag) == 0x000000, "Member 'BP_Frontend_Meow_SpeedBag_1_C_HandleObjectSpecialInteraction::ActionTag' has a wrong offset!");
static_assert(offsetof(BP_Frontend_Meow_SpeedBag_1_C_HandleObjectSpecialInteraction, CameraTag) == 0x000008, "Member 'BP_Frontend_Meow_SpeedBag_1_C_HandleObjectSpecialInteraction::CameraTag' has a wrong offset!");

// Function BP_Frontend_Meow_SpeedBag_1.BP_Frontend_Meow_SpeedBag_1_C.CanCommitNavigationRequest
// 0x0001 (0x0001 - 0x0000)
struct BP_Frontend_Meow_SpeedBag_1_C_CanCommitNavigationRequest final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Frontend_Meow_SpeedBag_1_C_CanCommitNavigationRequest) == 0x000001, "Wrong alignment on BP_Frontend_Meow_SpeedBag_1_C_CanCommitNavigationRequest");
static_assert(sizeof(BP_Frontend_Meow_SpeedBag_1_C_CanCommitNavigationRequest) == 0x000001, "Wrong size on BP_Frontend_Meow_SpeedBag_1_C_CanCommitNavigationRequest");
static_assert(offsetof(BP_Frontend_Meow_SpeedBag_1_C_CanCommitNavigationRequest, ReturnValue) == 0x000000, "Member 'BP_Frontend_Meow_SpeedBag_1_C_CanCommitNavigationRequest::ReturnValue' has a wrong offset!");

}

