#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_IronDoor_Transition1

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_IronDoor_Transition1.BP_IronDoor_Transition1_C
// 0x00C8 (0x02E0 - 0x0218)
class ABP_IronDoor_Transition1_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0218(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   BP_IronRoomTransition_Deco;                        // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPostProcessComponent*                  PostProcess;                                       // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       Camera;                                            // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    LightComponent1;                                   // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    LightComponent0;                                   // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Elevator;                                          // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Doors;                                             // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_2_NormalizedProgress_8B6A21E741A8608C26E21885F3FF6F78; // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_2__Direction_8B6A21E741A8608C26E21885F3FF6F78; // 0x0274(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_275[0x3];                                      // 0x0275(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_2;                                        // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_1_NormalizedProgress_FDAB547D46C75BDCF017CEA12A76C8D2; // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_1__Direction_FDAB547D46C75BDCF017CEA12A76C8D2; // 0x0284(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_285[0x3];                                      // 0x0285(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_1;                                        // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_NormalizedProgress_6F2ACE584FC29200559B44AB39990305; // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_6F2ACE584FC29200559B44AB39990305; // 0x0294(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_295[0x3];                                      // 0x0295(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Transform_for_Copy;                                // 0x02A0(0x0030)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               MID_Doors;                                         // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_Doors_2;                                       // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_IronDoor_Transition1(int32 EntryPoint);
	void CloseInstant();
	void OpenInstant();
	void StopMoveDown();
	void StartMoveDown();
	void StopMoveUp();
	void StartMoveUp();
	void CloseDoors();
	void Open_Doors();
	void Output_Camera_Position();
	void Timeline_2__UpdateFunc();
	void Timeline_2__FinishedFunc();
	void Timeline_1__UpdateFunc();
	void Timeline_1__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_IronDoor_Transition1_C">();
	}
	static class ABP_IronDoor_Transition1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_IronDoor_Transition1_C>();
	}
};
static_assert(alignof(ABP_IronDoor_Transition1_C) == 0x000010, "Wrong alignment on ABP_IronDoor_Transition1_C");
static_assert(sizeof(ABP_IronDoor_Transition1_C) == 0x0002E0, "Wrong size on ABP_IronDoor_Transition1_C");
static_assert(offsetof(ABP_IronDoor_Transition1_C, UberGraphFrame) == 0x000218, "Member 'ABP_IronDoor_Transition1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_IronDoor_Transition1_C, Box) == 0x000220, "Member 'ABP_IronDoor_Transition1_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_IronDoor_Transition1_C, BP_IronRoomTransition_Deco) == 0x000228, "Member 'ABP_IronDoor_Transition1_C::BP_IronRoomTransition_Deco' has a wrong offset!");
static_assert(offsetof(ABP_IronDoor_Transition1_C, PostProcess) == 0x000230, "Member 'ABP_IronDoor_Transition1_C::PostProcess' has a wrong offset!");
static_assert(offsetof(ABP_IronDoor_Transition1_C, Camera) == 0x000238, "Member 'ABP_IronDoor_Transition1_C::Camera' has a wrong offset!");
static_assert(offsetof(ABP_IronDoor_Transition1_C, LightComponent1) == 0x000240, "Member 'ABP_IronDoor_Transition1_C::LightComponent1' has a wrong offset!");
static_assert(offsetof(ABP_IronDoor_Transition1_C, LightComponent0) == 0x000248, "Member 'ABP_IronDoor_Transition1_C::LightComponent0' has a wrong offset!");
static_assert(offsetof(ABP_IronDoor_Transition1_C, Elevator) == 0x000250, "Member 'ABP_IronDoor_Transition1_C::Elevator' has a wrong offset!");
static_assert(offsetof(ABP_IronDoor_Transition1_C, Doors) == 0x000258, "Member 'ABP_IronDoor_Transition1_C::Doors' has a wrong offset!");
static_assert(offsetof(ABP_IronDoor_Transition1_C, SharedRoot) == 0x000260, "Member 'ABP_IronDoor_Transition1_C::SharedRoot' has a wrong offset!");
static_assert(offsetof(ABP_IronDoor_Transition1_C, DefaultSceneRoot) == 0x000268, "Member 'ABP_IronDoor_Transition1_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_IronDoor_Transition1_C, Timeline_2_NormalizedProgress_8B6A21E741A8608C26E21885F3FF6F78) == 0x000270, "Member 'ABP_IronDoor_Transition1_C::Timeline_2_NormalizedProgress_8B6A21E741A8608C26E21885F3FF6F78' has a wrong offset!");
static_assert(offsetof(ABP_IronDoor_Transition1_C, Timeline_2__Direction_8B6A21E741A8608C26E21885F3FF6F78) == 0x000274, "Member 'ABP_IronDoor_Transition1_C::Timeline_2__Direction_8B6A21E741A8608C26E21885F3FF6F78' has a wrong offset!");
static_assert(offsetof(ABP_IronDoor_Transition1_C, Timeline_2) == 0x000278, "Member 'ABP_IronDoor_Transition1_C::Timeline_2' has a wrong offset!");
static_assert(offsetof(ABP_IronDoor_Transition1_C, Timeline_1_NormalizedProgress_FDAB547D46C75BDCF017CEA12A76C8D2) == 0x000280, "Member 'ABP_IronDoor_Transition1_C::Timeline_1_NormalizedProgress_FDAB547D46C75BDCF017CEA12A76C8D2' has a wrong offset!");
static_assert(offsetof(ABP_IronDoor_Transition1_C, Timeline_1__Direction_FDAB547D46C75BDCF017CEA12A76C8D2) == 0x000284, "Member 'ABP_IronDoor_Transition1_C::Timeline_1__Direction_FDAB547D46C75BDCF017CEA12A76C8D2' has a wrong offset!");
static_assert(offsetof(ABP_IronDoor_Transition1_C, Timeline_1) == 0x000288, "Member 'ABP_IronDoor_Transition1_C::Timeline_1' has a wrong offset!");
static_assert(offsetof(ABP_IronDoor_Transition1_C, Timeline_0_NormalizedProgress_6F2ACE584FC29200559B44AB39990305) == 0x000290, "Member 'ABP_IronDoor_Transition1_C::Timeline_0_NormalizedProgress_6F2ACE584FC29200559B44AB39990305' has a wrong offset!");
static_assert(offsetof(ABP_IronDoor_Transition1_C, Timeline_0__Direction_6F2ACE584FC29200559B44AB39990305) == 0x000294, "Member 'ABP_IronDoor_Transition1_C::Timeline_0__Direction_6F2ACE584FC29200559B44AB39990305' has a wrong offset!");
static_assert(offsetof(ABP_IronDoor_Transition1_C, Timeline_0) == 0x000298, "Member 'ABP_IronDoor_Transition1_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ABP_IronDoor_Transition1_C, Transform_for_Copy) == 0x0002A0, "Member 'ABP_IronDoor_Transition1_C::Transform_for_Copy' has a wrong offset!");
static_assert(offsetof(ABP_IronDoor_Transition1_C, MID_Doors) == 0x0002D0, "Member 'ABP_IronDoor_Transition1_C::MID_Doors' has a wrong offset!");
static_assert(offsetof(ABP_IronDoor_Transition1_C, MID_Doors_2) == 0x0002D8, "Member 'ABP_IronDoor_Transition1_C::MID_Doors_2' has a wrong offset!");

}

