#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ProjectileTrajectory_Athena_SnapBoxToGrid

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "ECardinalDirection_structs.hpp"
#include "BP_ProjectileTrajectory_Athena_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ProjectileTrajectory_Athena_SnapBoxToGrid.BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C
// 0x0088 (0x02F0 - 0x0268)
class ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C : public ABP_ProjectileTrajectory_Athena_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C; // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_BuildingPreview;                                // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Building;                                          // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         GridSizeXY;                                        // 0x0280(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GridSizeZ;                                         // 0x0284(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GridYOffset;                                       // 0x0288(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LastPointDist;                                     // 0x028C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GridZOffset;                                       // 0x0290(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               YawOffset;                                         // 0x0294(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               LastYawOffset;                                     // 0x02A0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                GridSnapPosition;                                  // 0x02AC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LastGridSnapPosition;                              // 0x02B8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C4[0x4];                                      // 0x02C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             GridSnapSound;                                     // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECardinalDirection                            CardinalDirection;                                 // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            BuildingPreviewMesh;                               // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortPlaysetItemDefinition*             CachedPlayset;                                     // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Throw_Loop_Sound;                                  // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ProjectileTrajectory_Athena_SnapBoxToGrid(int32 EntryPoint);
	void SetTrajectorySpline(const TArray<struct FVector>& SplinePoints, const TArray<struct FVector>& SplineTangents);
	void ReceiveActorBeginOverlap(class AActor* OtherActor);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void HandleGridSnapUpdates(const struct FVector& NewLocation);
	void UpdateScaleForPlayset();
	void GetPlaysetFromController(bool* bSuccess);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C">();
	}
	static class ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C>();
	}
};
static_assert(alignof(ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C) == 0x000008, "Wrong alignment on ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C");
static_assert(sizeof(ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C) == 0x0002F0, "Wrong size on ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C, UberGraphFrame_BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C) == 0x000268, "Member 'ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C::UberGraphFrame_BP_ProjectileTrajectory_Athena_SnapBoxToGrid_C' has a wrong offset!");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C, SM_BuildingPreview) == 0x000270, "Member 'ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C::SM_BuildingPreview' has a wrong offset!");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C, Building) == 0x000278, "Member 'ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C::Building' has a wrong offset!");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C, GridSizeXY) == 0x000280, "Member 'ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C::GridSizeXY' has a wrong offset!");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C, GridSizeZ) == 0x000284, "Member 'ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C::GridSizeZ' has a wrong offset!");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C, GridYOffset) == 0x000288, "Member 'ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C::GridYOffset' has a wrong offset!");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C, LastPointDist) == 0x00028C, "Member 'ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C::LastPointDist' has a wrong offset!");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C, GridZOffset) == 0x000290, "Member 'ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C::GridZOffset' has a wrong offset!");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C, YawOffset) == 0x000294, "Member 'ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C::YawOffset' has a wrong offset!");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C, LastYawOffset) == 0x0002A0, "Member 'ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C::LastYawOffset' has a wrong offset!");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C, GridSnapPosition) == 0x0002AC, "Member 'ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C::GridSnapPosition' has a wrong offset!");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C, LastGridSnapPosition) == 0x0002B8, "Member 'ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C::LastGridSnapPosition' has a wrong offset!");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C, GridSnapSound) == 0x0002C8, "Member 'ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C::GridSnapSound' has a wrong offset!");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C, CardinalDirection) == 0x0002D0, "Member 'ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C::CardinalDirection' has a wrong offset!");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C, BuildingPreviewMesh) == 0x0002D8, "Member 'ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C::BuildingPreviewMesh' has a wrong offset!");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C, CachedPlayset) == 0x0002E0, "Member 'ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C::CachedPlayset' has a wrong offset!");
static_assert(offsetof(ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C, Throw_Loop_Sound) == 0x0002E8, "Member 'ABP_ProjectileTrajectory_Athena_SnapBoxToGrid_C::Throw_Loop_Sound' has a wrong offset!");

}

