#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RoundSplineMesh

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_RoundSplineMesh.BP_RoundSplineMesh_C.UserConstructionScript
// 0x00F0 (0x00F0 - 0x0000)
struct BP_RoundSplineMesh_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0xF];                                        // 0x0001(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0010(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USplineMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue_1;          // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue_1;            // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue;           // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue_1;         // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RoundSplineMesh_C_UserConstructionScript) == 0x000010, "Wrong alignment on BP_RoundSplineMesh_C_UserConstructionScript");
static_assert(sizeof(BP_RoundSplineMesh_C_UserConstructionScript) == 0x0000F0, "Wrong size on BP_RoundSplineMesh_C_UserConstructionScript");
static_assert(offsetof(BP_RoundSplineMesh_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_RoundSplineMesh_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoundSplineMesh_C_UserConstructionScript, Temp_struct_Variable) == 0x000010, "Member 'BP_RoundSplineMesh_C_UserConstructionScript::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_RoundSplineMesh_C_UserConstructionScript, Temp_int_Variable) == 0x000040, "Member 'BP_RoundSplineMesh_C_UserConstructionScript::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_RoundSplineMesh_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'BP_RoundSplineMesh_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoundSplineMesh_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue) == 0x000048, "Member 'BP_RoundSplineMesh_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoundSplineMesh_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x000050, "Member 'BP_RoundSplineMesh_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoundSplineMesh_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue_1) == 0x000054, "Member 'BP_RoundSplineMesh_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RoundSplineMesh_C_UserConstructionScript, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000058, "Member 'BP_RoundSplineMesh_C_UserConstructionScript::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoundSplineMesh_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x00005C, "Member 'BP_RoundSplineMesh_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoundSplineMesh_C_UserConstructionScript, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000068, "Member 'BP_RoundSplineMesh_C_UserConstructionScript::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoundSplineMesh_C_UserConstructionScript, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x00006C, "Member 'BP_RoundSplineMesh_C_UserConstructionScript::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RoundSplineMesh_C_UserConstructionScript, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000070, "Member 'BP_RoundSplineMesh_C_UserConstructionScript::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoundSplineMesh_C_UserConstructionScript, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000074, "Member 'BP_RoundSplineMesh_C_UserConstructionScript::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoundSplineMesh_C_UserConstructionScript, CallFunc_Multiply_IntFloat_ReturnValue_1) == 0x000078, "Member 'BP_RoundSplineMesh_C_UserConstructionScript::CallFunc_Multiply_IntFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RoundSplineMesh_C_UserConstructionScript, CallFunc_RotateAngleAxis_ReturnValue) == 0x00007C, "Member 'BP_RoundSplineMesh_C_UserConstructionScript::CallFunc_RotateAngleAxis_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoundSplineMesh_C_UserConstructionScript, CallFunc_RotateAngleAxis_ReturnValue_1) == 0x000088, "Member 'BP_RoundSplineMesh_C_UserConstructionScript::CallFunc_RotateAngleAxis_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RoundSplineMesh_C_UserConstructionScript, CallFunc_Cross_VectorVector_ReturnValue) == 0x000094, "Member 'BP_RoundSplineMesh_C_UserConstructionScript::CallFunc_Cross_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoundSplineMesh_C_UserConstructionScript, CallFunc_Vector_Distance_ReturnValue) == 0x0000A0, "Member 'BP_RoundSplineMesh_C_UserConstructionScript::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoundSplineMesh_C_UserConstructionScript, CallFunc_Normal_ReturnValue) == 0x0000A4, "Member 'BP_RoundSplineMesh_C_UserConstructionScript::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoundSplineMesh_C_UserConstructionScript, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000B0, "Member 'BP_RoundSplineMesh_C_UserConstructionScript::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoundSplineMesh_C_UserConstructionScript, CallFunc_Cross_VectorVector_ReturnValue_1) == 0x0000B4, "Member 'BP_RoundSplineMesh_C_UserConstructionScript::CallFunc_Cross_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RoundSplineMesh_C_UserConstructionScript, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0000C0, "Member 'BP_RoundSplineMesh_C_UserConstructionScript::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RoundSplineMesh_C_UserConstructionScript, CallFunc_Normal_ReturnValue_1) == 0x0000CC, "Member 'BP_RoundSplineMesh_C_UserConstructionScript::CallFunc_Normal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RoundSplineMesh_C_UserConstructionScript, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x0000D8, "Member 'BP_RoundSplineMesh_C_UserConstructionScript::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");

}

