#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TimeSynthController_Base

#include "Basic.hpp"

#include "TimeSynth_TrackStemData_structs.hpp"
#include "TimeSynth_TransitionData_structs.hpp"
#include "TimeSynth_structs.hpp"
#include "TimeSynth_TrackPlayStates_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_TimeSynthController_Base.BP_TimeSynthController_Base_C.ExecuteUbergraph_BP_TimeSynthController_Base
// 0x00A0 (0x00A0 - 0x0000)
struct BP_TimeSynthController_Base_C_ExecuteUbergraph_BP_TimeSynthController_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_AuthorityMatchReady*   CallFunc_MatchReadyAsync_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(ETimeSynthEventQuantization QuantizationType, int32 NumBars, float Beat)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor)
	ETimeSynth_TrackPlayStates                    K2Node_ComponentBoundEvent_Previous_2;             // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimeSynth_TrackPlayStates                    K2Node_ComponentBoundEvent_New_2;                  // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Index;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Volume_Multiplier;              // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ETimeSynthEventQuantization QuantizationType, int32 NumBars, float Beat)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimeSynthVolumeGroup*                  CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimeSynth_TrackPlayStates                    K2Node_ComponentBoundEvent_Previous_1;             // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimeSynth_TrackPlayStates                    K2Node_ComponentBoundEvent_New_1;                  // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimeSynth_TrackPlayStates                    K2Node_ComponentBoundEvent_Previous;               // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimeSynth_TrackPlayStates                    K2Node_ComponentBoundEvent_New;                    // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFirstLocalFortPlayerController_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBP_TimeSynthTrackComponent_C*>  CallFunc_GetTracksForRegistration_Tracks;          // 0x0080(0x0010)(ZeroConstructor, ReferenceParm, ContainsInstancedReference)
	class UBP_TimeSynthTrackComponent_C*          CallFunc_Array_Get_Item_1;                         // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TimeSynthController_Base_C_ExecuteUbergraph_BP_TimeSynthController_Base) == 0x000008, "Wrong alignment on BP_TimeSynthController_Base_C_ExecuteUbergraph_BP_TimeSynthController_Base");
static_assert(sizeof(BP_TimeSynthController_Base_C_ExecuteUbergraph_BP_TimeSynthController_Base) == 0x0000A0, "Wrong size on BP_TimeSynthController_Base_C_ExecuteUbergraph_BP_TimeSynthController_Base");
static_assert(offsetof(BP_TimeSynthController_Base_C_ExecuteUbergraph_BP_TimeSynthController_Base, EntryPoint) == 0x000000, "Member 'BP_TimeSynthController_Base_C_ExecuteUbergraph_BP_TimeSynthController_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_ExecuteUbergraph_BP_TimeSynthController_Base, CallFunc_MatchReadyAsync_ReturnValue) == 0x000008, "Member 'BP_TimeSynthController_Base_C_ExecuteUbergraph_BP_TimeSynthController_Base::CallFunc_MatchReadyAsync_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_ExecuteUbergraph_BP_TimeSynthController_Base, Temp_int_Variable) == 0x000010, "Member 'BP_TimeSynthController_Base_C_ExecuteUbergraph_BP_TimeSynthController_Base::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_ExecuteUbergraph_BP_TimeSynthController_Base, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'BP_TimeSynthController_Base_C_ExecuteUbergraph_BP_TimeSynthController_Base::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_ExecuteUbergraph_BP_TimeSynthController_Base, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_TimeSynthController_Base_C_ExecuteUbergraph_BP_TimeSynthController_Base::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_ExecuteUbergraph_BP_TimeSynthController_Base, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'BP_TimeSynthController_Base_C_ExecuteUbergraph_BP_TimeSynthController_Base::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_ExecuteUbergraph_BP_TimeSynthController_Base, K2Node_CreateDelegate_OutputDelegate_1) == 0x00002C, "Member 'BP_TimeSynthController_Base_C_ExecuteUbergraph_BP_TimeSynthController_Base::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_ExecuteUbergraph_BP_TimeSynthController_Base, K2Node_ComponentBoundEvent_Previous_2) == 0x00003C, "Member 'BP_TimeSynthController_Base_C_ExecuteUbergraph_BP_TimeSynthController_Base::K2Node_ComponentBoundEvent_Previous_2' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_ExecuteUbergraph_BP_TimeSynthController_Base, K2Node_ComponentBoundEvent_New_2) == 0x00003D, "Member 'BP_TimeSynthController_Base_C_ExecuteUbergraph_BP_TimeSynthController_Base::K2Node_ComponentBoundEvent_New_2' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_ExecuteUbergraph_BP_TimeSynthController_Base, K2Node_CustomEvent_Index) == 0x000040, "Member 'BP_TimeSynthController_Base_C_ExecuteUbergraph_BP_TimeSynthController_Base::K2Node_CustomEvent_Index' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_ExecuteUbergraph_BP_TimeSynthController_Base, K2Node_CustomEvent_Volume_Multiplier) == 0x000044, "Member 'BP_TimeSynthController_Base_C_ExecuteUbergraph_BP_TimeSynthController_Base::K2Node_CustomEvent_Volume_Multiplier' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_ExecuteUbergraph_BP_TimeSynthController_Base, K2Node_CreateDelegate_OutputDelegate_2) == 0x000048, "Member 'BP_TimeSynthController_Base_C_ExecuteUbergraph_BP_TimeSynthController_Base::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_ExecuteUbergraph_BP_TimeSynthController_Base, CallFunc_MapRangeClamped_ReturnValue) == 0x000058, "Member 'BP_TimeSynthController_Base_C_ExecuteUbergraph_BP_TimeSynthController_Base::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_ExecuteUbergraph_BP_TimeSynthController_Base, CallFunc_Array_Get_Item) == 0x000060, "Member 'BP_TimeSynthController_Base_C_ExecuteUbergraph_BP_TimeSynthController_Base::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_ExecuteUbergraph_BP_TimeSynthController_Base, K2Node_ComponentBoundEvent_Previous_1) == 0x000068, "Member 'BP_TimeSynthController_Base_C_ExecuteUbergraph_BP_TimeSynthController_Base::K2Node_ComponentBoundEvent_Previous_1' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_ExecuteUbergraph_BP_TimeSynthController_Base, K2Node_ComponentBoundEvent_New_1) == 0x000069, "Member 'BP_TimeSynthController_Base_C_ExecuteUbergraph_BP_TimeSynthController_Base::K2Node_ComponentBoundEvent_New_1' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_ExecuteUbergraph_BP_TimeSynthController_Base, K2Node_ComponentBoundEvent_Previous) == 0x00006A, "Member 'BP_TimeSynthController_Base_C_ExecuteUbergraph_BP_TimeSynthController_Base::K2Node_ComponentBoundEvent_Previous' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_ExecuteUbergraph_BP_TimeSynthController_Base, K2Node_ComponentBoundEvent_New) == 0x00006B, "Member 'BP_TimeSynthController_Base_C_ExecuteUbergraph_BP_TimeSynthController_Base::K2Node_ComponentBoundEvent_New' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_ExecuteUbergraph_BP_TimeSynthController_Base, CallFunc_GetFirstLocalFortPlayerController_ReturnValue) == 0x000070, "Member 'BP_TimeSynthController_Base_C_ExecuteUbergraph_BP_TimeSynthController_Base::CallFunc_GetFirstLocalFortPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_ExecuteUbergraph_BP_TimeSynthController_Base, K2Node_Event_EndPlayReason) == 0x000078, "Member 'BP_TimeSynthController_Base_C_ExecuteUbergraph_BP_TimeSynthController_Base::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_ExecuteUbergraph_BP_TimeSynthController_Base, CallFunc_GetTracksForRegistration_Tracks) == 0x000080, "Member 'BP_TimeSynthController_Base_C_ExecuteUbergraph_BP_TimeSynthController_Base::CallFunc_GetTracksForRegistration_Tracks' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_ExecuteUbergraph_BP_TimeSynthController_Base, CallFunc_Array_Get_Item_1) == 0x000090, "Member 'BP_TimeSynthController_Base_C_ExecuteUbergraph_BP_TimeSynthController_Base::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_ExecuteUbergraph_BP_TimeSynthController_Base, CallFunc_Array_Length_ReturnValue) == 0x000098, "Member 'BP_TimeSynthController_Base_C_ExecuteUbergraph_BP_TimeSynthController_Base::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_ExecuteUbergraph_BP_TimeSynthController_Base, CallFunc_Less_IntInt_ReturnValue) == 0x00009C, "Member 'BP_TimeSynthController_Base_C_ExecuteUbergraph_BP_TimeSynthController_Base::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_TimeSynthController_Base.BP_TimeSynthController_Base_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_TimeSynthController_Base_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TimeSynthController_Base_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_TimeSynthController_Base_C_ReceiveEndPlay");
static_assert(sizeof(BP_TimeSynthController_Base_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_TimeSynthController_Base_C_ReceiveEndPlay");
static_assert(offsetof(BP_TimeSynthController_Base_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_TimeSynthController_Base_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_TimeSynthController_Base.BP_TimeSynthController_Base_C.BndEvt__BP_TimeSynthTrackComponent_Alerted_K2Node_ComponentBoundEvent_2_OnPlayStateChanged__DelegateSignature
// 0x0002 (0x0002 - 0x0000)
struct BP_TimeSynthController_Base_C_BndEvt__BP_TimeSynthTrackComponent_Alerted_K2Node_ComponentBoundEvent_2_OnPlayStateChanged__DelegateSignature final
{
public:
	ETimeSynth_TrackPlayStates                    Previous;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimeSynth_TrackPlayStates                    New;                                               // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TimeSynthController_Base_C_BndEvt__BP_TimeSynthTrackComponent_Alerted_K2Node_ComponentBoundEvent_2_OnPlayStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on BP_TimeSynthController_Base_C_BndEvt__BP_TimeSynthTrackComponent_Alerted_K2Node_ComponentBoundEvent_2_OnPlayStateChanged__DelegateSignature");
static_assert(sizeof(BP_TimeSynthController_Base_C_BndEvt__BP_TimeSynthTrackComponent_Alerted_K2Node_ComponentBoundEvent_2_OnPlayStateChanged__DelegateSignature) == 0x000002, "Wrong size on BP_TimeSynthController_Base_C_BndEvt__BP_TimeSynthTrackComponent_Alerted_K2Node_ComponentBoundEvent_2_OnPlayStateChanged__DelegateSignature");
static_assert(offsetof(BP_TimeSynthController_Base_C_BndEvt__BP_TimeSynthTrackComponent_Alerted_K2Node_ComponentBoundEvent_2_OnPlayStateChanged__DelegateSignature, Previous) == 0x000000, "Member 'BP_TimeSynthController_Base_C_BndEvt__BP_TimeSynthTrackComponent_Alerted_K2Node_ComponentBoundEvent_2_OnPlayStateChanged__DelegateSignature::Previous' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_BndEvt__BP_TimeSynthTrackComponent_Alerted_K2Node_ComponentBoundEvent_2_OnPlayStateChanged__DelegateSignature, New) == 0x000001, "Member 'BP_TimeSynthController_Base_C_BndEvt__BP_TimeSynthTrackComponent_Alerted_K2Node_ComponentBoundEvent_2_OnPlayStateChanged__DelegateSignature::New' has a wrong offset!");

// Function BP_TimeSynthController_Base.BP_TimeSynthController_Base_C.BndEvt__BP_TimeSynthTrackComponent_Suspicious_K2Node_ComponentBoundEvent_1_OnPlayStateChanged__DelegateSignature
// 0x0002 (0x0002 - 0x0000)
struct BP_TimeSynthController_Base_C_BndEvt__BP_TimeSynthTrackComponent_Suspicious_K2Node_ComponentBoundEvent_1_OnPlayStateChanged__DelegateSignature final
{
public:
	ETimeSynth_TrackPlayStates                    Previous;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimeSynth_TrackPlayStates                    New;                                               // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TimeSynthController_Base_C_BndEvt__BP_TimeSynthTrackComponent_Suspicious_K2Node_ComponentBoundEvent_1_OnPlayStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on BP_TimeSynthController_Base_C_BndEvt__BP_TimeSynthTrackComponent_Suspicious_K2Node_ComponentBoundEvent_1_OnPlayStateChanged__DelegateSignature");
static_assert(sizeof(BP_TimeSynthController_Base_C_BndEvt__BP_TimeSynthTrackComponent_Suspicious_K2Node_ComponentBoundEvent_1_OnPlayStateChanged__DelegateSignature) == 0x000002, "Wrong size on BP_TimeSynthController_Base_C_BndEvt__BP_TimeSynthTrackComponent_Suspicious_K2Node_ComponentBoundEvent_1_OnPlayStateChanged__DelegateSignature");
static_assert(offsetof(BP_TimeSynthController_Base_C_BndEvt__BP_TimeSynthTrackComponent_Suspicious_K2Node_ComponentBoundEvent_1_OnPlayStateChanged__DelegateSignature, Previous) == 0x000000, "Member 'BP_TimeSynthController_Base_C_BndEvt__BP_TimeSynthTrackComponent_Suspicious_K2Node_ComponentBoundEvent_1_OnPlayStateChanged__DelegateSignature::Previous' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_BndEvt__BP_TimeSynthTrackComponent_Suspicious_K2Node_ComponentBoundEvent_1_OnPlayStateChanged__DelegateSignature, New) == 0x000001, "Member 'BP_TimeSynthController_Base_C_BndEvt__BP_TimeSynthTrackComponent_Suspicious_K2Node_ComponentBoundEvent_1_OnPlayStateChanged__DelegateSignature::New' has a wrong offset!");

// Function BP_TimeSynthController_Base.BP_TimeSynthController_Base_C.SetVolumeGroup
// 0x0008 (0x0008 - 0x0000)
struct BP_TimeSynthController_Base_C_SetVolumeGroup final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Volume_Multiplier;                                 // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TimeSynthController_Base_C_SetVolumeGroup) == 0x000004, "Wrong alignment on BP_TimeSynthController_Base_C_SetVolumeGroup");
static_assert(sizeof(BP_TimeSynthController_Base_C_SetVolumeGroup) == 0x000008, "Wrong size on BP_TimeSynthController_Base_C_SetVolumeGroup");
static_assert(offsetof(BP_TimeSynthController_Base_C_SetVolumeGroup, Index_0) == 0x000000, "Member 'BP_TimeSynthController_Base_C_SetVolumeGroup::Index_0' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_SetVolumeGroup, Volume_Multiplier) == 0x000004, "Member 'BP_TimeSynthController_Base_C_SetVolumeGroup::Volume_Multiplier' has a wrong offset!");

// Function BP_TimeSynthController_Base.BP_TimeSynthController_Base_C.BndEvt__BP_TimeSynthTrackComponent_Infiltration_K2Node_ComponentBoundEvent_0_OnPlayStateChanged__DelegateSignature
// 0x0002 (0x0002 - 0x0000)
struct BP_TimeSynthController_Base_C_BndEvt__BP_TimeSynthTrackComponent_Infiltration_K2Node_ComponentBoundEvent_0_OnPlayStateChanged__DelegateSignature final
{
public:
	ETimeSynth_TrackPlayStates                    Previous;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimeSynth_TrackPlayStates                    New;                                               // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TimeSynthController_Base_C_BndEvt__BP_TimeSynthTrackComponent_Infiltration_K2Node_ComponentBoundEvent_0_OnPlayStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on BP_TimeSynthController_Base_C_BndEvt__BP_TimeSynthTrackComponent_Infiltration_K2Node_ComponentBoundEvent_0_OnPlayStateChanged__DelegateSignature");
static_assert(sizeof(BP_TimeSynthController_Base_C_BndEvt__BP_TimeSynthTrackComponent_Infiltration_K2Node_ComponentBoundEvent_0_OnPlayStateChanged__DelegateSignature) == 0x000002, "Wrong size on BP_TimeSynthController_Base_C_BndEvt__BP_TimeSynthTrackComponent_Infiltration_K2Node_ComponentBoundEvent_0_OnPlayStateChanged__DelegateSignature");
static_assert(offsetof(BP_TimeSynthController_Base_C_BndEvt__BP_TimeSynthTrackComponent_Infiltration_K2Node_ComponentBoundEvent_0_OnPlayStateChanged__DelegateSignature, Previous) == 0x000000, "Member 'BP_TimeSynthController_Base_C_BndEvt__BP_TimeSynthTrackComponent_Infiltration_K2Node_ComponentBoundEvent_0_OnPlayStateChanged__DelegateSignature::Previous' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_BndEvt__BP_TimeSynthTrackComponent_Infiltration_K2Node_ComponentBoundEvent_0_OnPlayStateChanged__DelegateSignature, New) == 0x000001, "Member 'BP_TimeSynthController_Base_C_BndEvt__BP_TimeSynthTrackComponent_Infiltration_K2Node_ComponentBoundEvent_0_OnPlayStateChanged__DelegateSignature::New' has a wrong offset!");

// Function BP_TimeSynthController_Base.BP_TimeSynthController_Base_C.ChangeTrack
// 0x0038 (0x0038 - 0x0000)
struct BP_TimeSynthController_Base_C_ChangeTrack final
{
public:
	class UBP_TimeSynthTrackComponent_C*          New_Track;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_TimeSynthTrackComponent_C*          NewTrack;                                          // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckPlaystate_Result;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckPlaystate_Result_1;                  // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTransitionForTrack_Transition_Found;   // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimeSynth_TransitionData              CallFunc_HasTransitionForTrack_Transition_Data;    // 0x0018(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TimeSynthController_Base_C_ChangeTrack) == 0x000008, "Wrong alignment on BP_TimeSynthController_Base_C_ChangeTrack");
static_assert(sizeof(BP_TimeSynthController_Base_C_ChangeTrack) == 0x000038, "Wrong size on BP_TimeSynthController_Base_C_ChangeTrack");
static_assert(offsetof(BP_TimeSynthController_Base_C_ChangeTrack, New_Track) == 0x000000, "Member 'BP_TimeSynthController_Base_C_ChangeTrack::New_Track' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_ChangeTrack, NewTrack) == 0x000008, "Member 'BP_TimeSynthController_Base_C_ChangeTrack::NewTrack' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_ChangeTrack, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_TimeSynthController_Base_C_ChangeTrack::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_ChangeTrack, CallFunc_CheckPlaystate_Result) == 0x000011, "Member 'BP_TimeSynthController_Base_C_ChangeTrack::CallFunc_CheckPlaystate_Result' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_ChangeTrack, CallFunc_CheckPlaystate_Result_1) == 0x000012, "Member 'BP_TimeSynthController_Base_C_ChangeTrack::CallFunc_CheckPlaystate_Result_1' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_ChangeTrack, CallFunc_BooleanOR_ReturnValue) == 0x000013, "Member 'BP_TimeSynthController_Base_C_ChangeTrack::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_ChangeTrack, CallFunc_HasTransitionForTrack_Transition_Found) == 0x000014, "Member 'BP_TimeSynthController_Base_C_ChangeTrack::CallFunc_HasTransitionForTrack_Transition_Found' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_ChangeTrack, CallFunc_HasTransitionForTrack_Transition_Data) == 0x000018, "Member 'BP_TimeSynthController_Base_C_ChangeTrack::CallFunc_HasTransitionForTrack_Transition_Data' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_ChangeTrack, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000030, "Member 'BP_TimeSynthController_Base_C_ChangeTrack::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function BP_TimeSynthController_Base.BP_TimeSynthController_Base_C.StopAllMusic
// 0x0002 (0x0002 - 0x0000)
struct BP_TimeSynthController_Base_C_StopAllMusic final
{
public:
	bool                                          Play_Outro;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TimeSynthController_Base_C_StopAllMusic) == 0x000001, "Wrong alignment on BP_TimeSynthController_Base_C_StopAllMusic");
static_assert(sizeof(BP_TimeSynthController_Base_C_StopAllMusic) == 0x000002, "Wrong size on BP_TimeSynthController_Base_C_StopAllMusic");
static_assert(offsetof(BP_TimeSynthController_Base_C_StopAllMusic, Play_Outro) == 0x000000, "Member 'BP_TimeSynthController_Base_C_StopAllMusic::Play_Outro' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_StopAllMusic, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'BP_TimeSynthController_Base_C_StopAllMusic::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_TimeSynthController_Base.BP_TimeSynthController_Base_C.PlayTransition
// 0x0058 (0x0058 - 0x0000)
struct BP_TimeSynthController_Base_C_PlayTransition final
{
public:
	struct FTimeSynth_TransitionData              Transition_Data;                                   // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UBP_TimeSynthTrackComponent_C*          Queued_Track;                                      // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimeSynth_TrackStemData               CallFunc_Array_Get_Item;                           // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CalculateMaxClipDuration_Duration;        // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimeSynthClipHandle                   CallFunc_PlayClip_ReturnValue;                     // 0x0048(0x000C)(NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TimeSynthController_Base_C_PlayTransition) == 0x000008, "Wrong alignment on BP_TimeSynthController_Base_C_PlayTransition");
static_assert(sizeof(BP_TimeSynthController_Base_C_PlayTransition) == 0x000058, "Wrong size on BP_TimeSynthController_Base_C_PlayTransition");
static_assert(offsetof(BP_TimeSynthController_Base_C_PlayTransition, Transition_Data) == 0x000000, "Member 'BP_TimeSynthController_Base_C_PlayTransition::Transition_Data' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_PlayTransition, Queued_Track) == 0x000018, "Member 'BP_TimeSynthController_Base_C_PlayTransition::Queued_Track' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_PlayTransition, Temp_int_Array_Index_Variable) == 0x000020, "Member 'BP_TimeSynthController_Base_C_PlayTransition::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_PlayTransition, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'BP_TimeSynthController_Base_C_PlayTransition::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_PlayTransition, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_TimeSynthController_Base_C_PlayTransition::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_PlayTransition, CallFunc_CalculateMaxClipDuration_Duration) == 0x000038, "Member 'BP_TimeSynthController_Base_C_PlayTransition::CallFunc_CalculateMaxClipDuration_Duration' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_PlayTransition, Temp_int_Loop_Counter_Variable) == 0x00003C, "Member 'BP_TimeSynthController_Base_C_PlayTransition::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_PlayTransition, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'BP_TimeSynthController_Base_C_PlayTransition::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_PlayTransition, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'BP_TimeSynthController_Base_C_PlayTransition::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_PlayTransition, CallFunc_PlayClip_ReturnValue) == 0x000048, "Member 'BP_TimeSynthController_Base_C_PlayTransition::CallFunc_PlayClip_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_PlayTransition, CallFunc_Array_Add_ReturnValue) == 0x000054, "Member 'BP_TimeSynthController_Base_C_PlayTransition::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_TimeSynthController_Base.BP_TimeSynthController_Base_C.OnQuantizationBeat
// 0x000C (0x000C - 0x0000)
struct BP_TimeSynthController_Base_C_OnQuantizationBeat final
{
public:
	ETimeSynthEventQuantization                   QuantizationType;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumBars;                                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Beat;                                              // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TimeSynthController_Base_C_OnQuantizationBeat) == 0x000004, "Wrong alignment on BP_TimeSynthController_Base_C_OnQuantizationBeat");
static_assert(sizeof(BP_TimeSynthController_Base_C_OnQuantizationBeat) == 0x00000C, "Wrong size on BP_TimeSynthController_Base_C_OnQuantizationBeat");
static_assert(offsetof(BP_TimeSynthController_Base_C_OnQuantizationBeat, QuantizationType) == 0x000000, "Member 'BP_TimeSynthController_Base_C_OnQuantizationBeat::QuantizationType' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_OnQuantizationBeat, NumBars) == 0x000004, "Member 'BP_TimeSynthController_Base_C_OnQuantizationBeat::NumBars' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_OnQuantizationBeat, Beat) == 0x000008, "Member 'BP_TimeSynthController_Base_C_OnQuantizationBeat::Beat' has a wrong offset!");

// Function BP_TimeSynthController_Base.BP_TimeSynthController_Base_C.FlushExtraClips
// 0x0040 (0x0040 - 0x0000)
struct BP_TimeSynthController_Base_C_FlushExtraClips final
{
public:
	bool                                          Exclude_Current;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_TimeSynthTrackComponent_C*          CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F[0x1];                                       // 0x001F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TimeSynthController_Base_C_FlushExtraClips) == 0x000008, "Wrong alignment on BP_TimeSynthController_Base_C_FlushExtraClips");
static_assert(sizeof(BP_TimeSynthController_Base_C_FlushExtraClips) == 0x000040, "Wrong size on BP_TimeSynthController_Base_C_FlushExtraClips");
static_assert(offsetof(BP_TimeSynthController_Base_C_FlushExtraClips, Exclude_Current) == 0x000000, "Member 'BP_TimeSynthController_Base_C_FlushExtraClips::Exclude_Current' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_FlushExtraClips, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_TimeSynthController_Base_C_FlushExtraClips::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_FlushExtraClips, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_TimeSynthController_Base_C_FlushExtraClips::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_FlushExtraClips, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_TimeSynthController_Base_C_FlushExtraClips::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_FlushExtraClips, CallFunc_Array_Get_Item) == 0x000010, "Member 'BP_TimeSynthController_Base_C_FlushExtraClips::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_FlushExtraClips, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'BP_TimeSynthController_Base_C_FlushExtraClips::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_FlushExtraClips, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x00001C, "Member 'BP_TimeSynthController_Base_C_FlushExtraClips::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_FlushExtraClips, CallFunc_Less_IntInt_ReturnValue) == 0x00001D, "Member 'BP_TimeSynthController_Base_C_FlushExtraClips::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_FlushExtraClips, CallFunc_BooleanAND_ReturnValue) == 0x00001E, "Member 'BP_TimeSynthController_Base_C_FlushExtraClips::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_FlushExtraClips, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000020, "Member 'BP_TimeSynthController_Base_C_FlushExtraClips::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_FlushExtraClips, CallFunc_Concat_StrStr_ReturnValue) == 0x000030, "Member 'BP_TimeSynthController_Base_C_FlushExtraClips::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");

// Function BP_TimeSynthController_Base.BP_TimeSynthController_Base_C.OnQuantizationBar
// 0x0014 (0x0014 - 0x0000)
struct BP_TimeSynthController_Base_C_OnQuantizationBar final
{
public:
	ETimeSynthEventQuantization                   QuantizationType;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumBars;                                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Beat;                                              // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TimeSynthController_Base_C_OnQuantizationBar) == 0x000004, "Wrong alignment on BP_TimeSynthController_Base_C_OnQuantizationBar");
static_assert(sizeof(BP_TimeSynthController_Base_C_OnQuantizationBar) == 0x000014, "Wrong size on BP_TimeSynthController_Base_C_OnQuantizationBar");
static_assert(offsetof(BP_TimeSynthController_Base_C_OnQuantizationBar, QuantizationType) == 0x000000, "Member 'BP_TimeSynthController_Base_C_OnQuantizationBar::QuantizationType' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_OnQuantizationBar, NumBars) == 0x000004, "Member 'BP_TimeSynthController_Base_C_OnQuantizationBar::NumBars' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_OnQuantizationBar, Beat) == 0x000008, "Member 'BP_TimeSynthController_Base_C_OnQuantizationBar::Beat' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_OnQuantizationBar, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00000C, "Member 'BP_TimeSynthController_Base_C_OnQuantizationBar::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_OnQuantizationBar, CallFunc_Subtract_IntInt_ReturnValue) == 0x000010, "Member 'BP_TimeSynthController_Base_C_OnQuantizationBar::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");

// Function BP_TimeSynthController_Base.BP_TimeSynthController_Base_C.QueueTrackStartInternal
// 0x0010 (0x0010 - 0x0000)
struct BP_TimeSynthController_Base_C_QueueTrackStartInternal final
{
public:
	class UBP_TimeSynthTrackComponent_C*          NewTrack;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetBPM_Result;                            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TimeSynthController_Base_C_QueueTrackStartInternal) == 0x000008, "Wrong alignment on BP_TimeSynthController_Base_C_QueueTrackStartInternal");
static_assert(sizeof(BP_TimeSynthController_Base_C_QueueTrackStartInternal) == 0x000010, "Wrong size on BP_TimeSynthController_Base_C_QueueTrackStartInternal");
static_assert(offsetof(BP_TimeSynthController_Base_C_QueueTrackStartInternal, NewTrack) == 0x000000, "Member 'BP_TimeSynthController_Base_C_QueueTrackStartInternal::NewTrack' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_QueueTrackStartInternal, CallFunc_GetBPM_Result) == 0x000008, "Member 'BP_TimeSynthController_Base_C_QueueTrackStartInternal::CallFunc_GetBPM_Result' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_QueueTrackStartInternal, CallFunc_Array_Add_ReturnValue) == 0x00000C, "Member 'BP_TimeSynthController_Base_C_QueueTrackStartInternal::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_TimeSynthController_Base.BP_TimeSynthController_Base_C.CalculateMaxClipDuration
// 0x0050 (0x0050 - 0x0000)
struct BP_TimeSynthController_Base_C_CalculateMaxClipDuration final
{
public:
	TArray<struct FTimeSynth_TrackStemData>       Clips;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	int32                                         Duration;                                          // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxDuration;                                       // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimeSynth_TrackStemData               CallFunc_Array_Get_Item;                           // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TimeSynthController_Base_C_CalculateMaxClipDuration) == 0x000008, "Wrong alignment on BP_TimeSynthController_Base_C_CalculateMaxClipDuration");
static_assert(sizeof(BP_TimeSynthController_Base_C_CalculateMaxClipDuration) == 0x000050, "Wrong size on BP_TimeSynthController_Base_C_CalculateMaxClipDuration");
static_assert(offsetof(BP_TimeSynthController_Base_C_CalculateMaxClipDuration, Clips) == 0x000000, "Member 'BP_TimeSynthController_Base_C_CalculateMaxClipDuration::Clips' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_CalculateMaxClipDuration, Duration) == 0x000010, "Member 'BP_TimeSynthController_Base_C_CalculateMaxClipDuration::Duration' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_CalculateMaxClipDuration, MaxDuration) == 0x000014, "Member 'BP_TimeSynthController_Base_C_CalculateMaxClipDuration::MaxDuration' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_CalculateMaxClipDuration, Temp_bool_Variable) == 0x000018, "Member 'BP_TimeSynthController_Base_C_CalculateMaxClipDuration::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_CalculateMaxClipDuration, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'BP_TimeSynthController_Base_C_CalculateMaxClipDuration::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_CalculateMaxClipDuration, Temp_int_Array_Index_Variable) == 0x000020, "Member 'BP_TimeSynthController_Base_C_CalculateMaxClipDuration::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_CalculateMaxClipDuration, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'BP_TimeSynthController_Base_C_CalculateMaxClipDuration::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_CalculateMaxClipDuration, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_TimeSynthController_Base_C_CalculateMaxClipDuration::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_CalculateMaxClipDuration, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'BP_TimeSynthController_Base_C_CalculateMaxClipDuration::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_CalculateMaxClipDuration, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'BP_TimeSynthController_Base_C_CalculateMaxClipDuration::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_CalculateMaxClipDuration, CallFunc_Multiply_IntInt_ReturnValue) == 0x000040, "Member 'BP_TimeSynthController_Base_C_CalculateMaxClipDuration::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_CalculateMaxClipDuration, CallFunc_Greater_IntInt_ReturnValue) == 0x000044, "Member 'BP_TimeSynthController_Base_C_CalculateMaxClipDuration::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_CalculateMaxClipDuration, K2Node_Select_Default) == 0x000048, "Member 'BP_TimeSynthController_Base_C_CalculateMaxClipDuration::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_TimeSynthController_Base_C_CalculateMaxClipDuration, CallFunc_Greater_IntInt_ReturnValue_1) == 0x00004C, "Member 'BP_TimeSynthController_Base_C_CalculateMaxClipDuration::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");

// Function BP_TimeSynthController_Base.BP_TimeSynthController_Base_C.GetTracksForRegistration
// 0x0010 (0x0010 - 0x0000)
struct BP_TimeSynthController_Base_C_GetTracksForRegistration final
{
public:
	TArray<class UBP_TimeSynthTrackComponent_C*>  Tracks;                                            // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ContainsInstancedReference)
};
static_assert(alignof(BP_TimeSynthController_Base_C_GetTracksForRegistration) == 0x000008, "Wrong alignment on BP_TimeSynthController_Base_C_GetTracksForRegistration");
static_assert(sizeof(BP_TimeSynthController_Base_C_GetTracksForRegistration) == 0x000010, "Wrong size on BP_TimeSynthController_Base_C_GetTracksForRegistration");
static_assert(offsetof(BP_TimeSynthController_Base_C_GetTracksForRegistration, Tracks) == 0x000000, "Member 'BP_TimeSynthController_Base_C_GetTracksForRegistration::Tracks' has a wrong offset!");

// Function BP_TimeSynthController_Base.BP_TimeSynthController_Base_C.GetIsPlaying
// 0x0001 (0x0001 - 0x0000)
struct BP_TimeSynthController_Base_C_GetIsPlaying final
{
public:
	bool                                          IsPlaying_0;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TimeSynthController_Base_C_GetIsPlaying) == 0x000001, "Wrong alignment on BP_TimeSynthController_Base_C_GetIsPlaying");
static_assert(sizeof(BP_TimeSynthController_Base_C_GetIsPlaying) == 0x000001, "Wrong size on BP_TimeSynthController_Base_C_GetIsPlaying");
static_assert(offsetof(BP_TimeSynthController_Base_C_GetIsPlaying, IsPlaying_0) == 0x000000, "Member 'BP_TimeSynthController_Base_C_GetIsPlaying::IsPlaying_0' has a wrong offset!");

}

