#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UI_ScannerScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_UI_ScannerScreen.BP_UI_ScannerScreen_C
// 0x0038 (0x07C0 - 0x0788)
class ABP_UI_ScannerScreen_C final : public ABuildingGameplayActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0788(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetComponent*                       ScreenWidget;                                      // 0x0790(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0798(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         ErrorTimeline_Switch_EBBEA5504EC9CD2C274D38AA3BFC1EEF; // 0x07A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ErrorTimeline__Direction_EBBEA5504EC9CD2C274D38AA3BFC1EEF; // 0x07A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A5[0x3];                                      // 0x07A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     ErrorTimeline;                                     // 0x07A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUI_ScannerScreen_C*                    Widget_Screen;                                     // 0x07B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           TimeoutHandle;                                     // 0x07B8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_UI_ScannerScreen(int32 EntryPoint);
	void ScreenEventTargetLost(const class FText& LostText);
	void ScreenEventDismiss();
	void ScreenEventScan();
	void ScreenEventFailure(const class FText& FailureText);
	void ScreenEventSuccess(const class FText& SuccessText);
	void ScreenEventError(bool Reverse);
	void ReceiveBeginPlay();
	void ErrorTimeline__UpdateFunc();
	void ErrorTimeline__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_UI_ScannerScreen_C">();
	}
	static class ABP_UI_ScannerScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_UI_ScannerScreen_C>();
	}
};
static_assert(alignof(ABP_UI_ScannerScreen_C) == 0x000008, "Wrong alignment on ABP_UI_ScannerScreen_C");
static_assert(sizeof(ABP_UI_ScannerScreen_C) == 0x0007C0, "Wrong size on ABP_UI_ScannerScreen_C");
static_assert(offsetof(ABP_UI_ScannerScreen_C, UberGraphFrame) == 0x000788, "Member 'ABP_UI_ScannerScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_UI_ScannerScreen_C, ScreenWidget) == 0x000790, "Member 'ABP_UI_ScannerScreen_C::ScreenWidget' has a wrong offset!");
static_assert(offsetof(ABP_UI_ScannerScreen_C, DefaultSceneRoot) == 0x000798, "Member 'ABP_UI_ScannerScreen_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_UI_ScannerScreen_C, ErrorTimeline_Switch_EBBEA5504EC9CD2C274D38AA3BFC1EEF) == 0x0007A0, "Member 'ABP_UI_ScannerScreen_C::ErrorTimeline_Switch_EBBEA5504EC9CD2C274D38AA3BFC1EEF' has a wrong offset!");
static_assert(offsetof(ABP_UI_ScannerScreen_C, ErrorTimeline__Direction_EBBEA5504EC9CD2C274D38AA3BFC1EEF) == 0x0007A4, "Member 'ABP_UI_ScannerScreen_C::ErrorTimeline__Direction_EBBEA5504EC9CD2C274D38AA3BFC1EEF' has a wrong offset!");
static_assert(offsetof(ABP_UI_ScannerScreen_C, ErrorTimeline) == 0x0007A8, "Member 'ABP_UI_ScannerScreen_C::ErrorTimeline' has a wrong offset!");
static_assert(offsetof(ABP_UI_ScannerScreen_C, Widget_Screen) == 0x0007B0, "Member 'ABP_UI_ScannerScreen_C::Widget_Screen' has a wrong offset!");
static_assert(offsetof(ABP_UI_ScannerScreen_C, TimeoutHandle) == 0x0007B8, "Member 'ABP_UI_ScannerScreen_C::TimeoutHandle' has a wrong offset!");

}

