#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPS12ElevatorPanel

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPS12ElevatorPanel.BPS12ElevatorPanel_C.ExecuteUbergraph_BPS12ElevatorPanel
// 0x0048 (0x0048 - 0x0000)
struct BPS12ElevatorPanel_C_ExecuteUbergraph_BPS12ElevatorPanel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button_4;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button_3;               // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button_2;               // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button_1;               // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS12ElevatorPanel_C_ExecuteUbergraph_BPS12ElevatorPanel) == 0x000008, "Wrong alignment on BPS12ElevatorPanel_C_ExecuteUbergraph_BPS12ElevatorPanel");
static_assert(sizeof(BPS12ElevatorPanel_C_ExecuteUbergraph_BPS12ElevatorPanel) == 0x000048, "Wrong size on BPS12ElevatorPanel_C_ExecuteUbergraph_BPS12ElevatorPanel");
static_assert(offsetof(BPS12ElevatorPanel_C_ExecuteUbergraph_BPS12ElevatorPanel, EntryPoint) == 0x000000, "Member 'BPS12ElevatorPanel_C_ExecuteUbergraph_BPS12ElevatorPanel::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPS12ElevatorPanel_C_ExecuteUbergraph_BPS12ElevatorPanel, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'BPS12ElevatorPanel_C_ExecuteUbergraph_BPS12ElevatorPanel::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS12ElevatorPanel_C_ExecuteUbergraph_BPS12ElevatorPanel, K2Node_ComponentBoundEvent_Button_4) == 0x000010, "Member 'BPS12ElevatorPanel_C_ExecuteUbergraph_BPS12ElevatorPanel::K2Node_ComponentBoundEvent_Button_4' has a wrong offset!");
static_assert(offsetof(BPS12ElevatorPanel_C_ExecuteUbergraph_BPS12ElevatorPanel, K2Node_ComponentBoundEvent_Button_3) == 0x000018, "Member 'BPS12ElevatorPanel_C_ExecuteUbergraph_BPS12ElevatorPanel::K2Node_ComponentBoundEvent_Button_3' has a wrong offset!");
static_assert(offsetof(BPS12ElevatorPanel_C_ExecuteUbergraph_BPS12ElevatorPanel, K2Node_ComponentBoundEvent_Button_2) == 0x000020, "Member 'BPS12ElevatorPanel_C_ExecuteUbergraph_BPS12ElevatorPanel::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(BPS12ElevatorPanel_C_ExecuteUbergraph_BPS12ElevatorPanel, K2Node_ComponentBoundEvent_Button_1) == 0x000028, "Member 'BPS12ElevatorPanel_C_ExecuteUbergraph_BPS12ElevatorPanel::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(BPS12ElevatorPanel_C_ExecuteUbergraph_BPS12ElevatorPanel, K2Node_ComponentBoundEvent_Button) == 0x000030, "Member 'BPS12ElevatorPanel_C_ExecuteUbergraph_BPS12ElevatorPanel::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(BPS12ElevatorPanel_C_ExecuteUbergraph_BPS12ElevatorPanel, K2Node_SwitchInteger_CmpSuccess) == 0x000038, "Member 'BPS12ElevatorPanel_C_ExecuteUbergraph_BPS12ElevatorPanel::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BPS12ElevatorPanel_C_ExecuteUbergraph_BPS12ElevatorPanel, CallFunc_GetOwningPlayer_ReturnValue) == 0x000040, "Member 'BPS12ElevatorPanel_C_ExecuteUbergraph_BPS12ElevatorPanel::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");

// Function BPS12ElevatorPanel.BPS12ElevatorPanel_C.BndEvt__Floor_5_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BPS12ElevatorPanel_C_BndEvt__Floor_5_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS12ElevatorPanel_C_BndEvt__Floor_5_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on BPS12ElevatorPanel_C_BndEvt__Floor_5_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(BPS12ElevatorPanel_C_BndEvt__Floor_5_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on BPS12ElevatorPanel_C_BndEvt__Floor_5_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(BPS12ElevatorPanel_C_BndEvt__Floor_5_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'BPS12ElevatorPanel_C_BndEvt__Floor_5_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function BPS12ElevatorPanel.BPS12ElevatorPanel_C.BndEvt__Floor_4_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BPS12ElevatorPanel_C_BndEvt__Floor_4_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS12ElevatorPanel_C_BndEvt__Floor_4_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on BPS12ElevatorPanel_C_BndEvt__Floor_4_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(BPS12ElevatorPanel_C_BndEvt__Floor_4_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on BPS12ElevatorPanel_C_BndEvt__Floor_4_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(BPS12ElevatorPanel_C_BndEvt__Floor_4_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'BPS12ElevatorPanel_C_BndEvt__Floor_4_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function BPS12ElevatorPanel.BPS12ElevatorPanel_C.BndEvt__Floor_3_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BPS12ElevatorPanel_C_BndEvt__Floor_3_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS12ElevatorPanel_C_BndEvt__Floor_3_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on BPS12ElevatorPanel_C_BndEvt__Floor_3_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(BPS12ElevatorPanel_C_BndEvt__Floor_3_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on BPS12ElevatorPanel_C_BndEvt__Floor_3_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(BPS12ElevatorPanel_C_BndEvt__Floor_3_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'BPS12ElevatorPanel_C_BndEvt__Floor_3_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function BPS12ElevatorPanel.BPS12ElevatorPanel_C.BndEvt__Floor_2_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BPS12ElevatorPanel_C_BndEvt__Floor_2_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS12ElevatorPanel_C_BndEvt__Floor_2_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on BPS12ElevatorPanel_C_BndEvt__Floor_2_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(BPS12ElevatorPanel_C_BndEvt__Floor_2_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on BPS12ElevatorPanel_C_BndEvt__Floor_2_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(BPS12ElevatorPanel_C_BndEvt__Floor_2_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'BPS12ElevatorPanel_C_BndEvt__Floor_2_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function BPS12ElevatorPanel.BPS12ElevatorPanel_C.BndEvt__Floor_1_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BPS12ElevatorPanel_C_BndEvt__Floor_1_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS12ElevatorPanel_C_BndEvt__Floor_1_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on BPS12ElevatorPanel_C_BndEvt__Floor_1_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(BPS12ElevatorPanel_C_BndEvt__Floor_1_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on BPS12ElevatorPanel_C_BndEvt__Floor_1_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(BPS12ElevatorPanel_C_BndEvt__Floor_1_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'BPS12ElevatorPanel_C_BndEvt__Floor_1_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function BPS12ElevatorPanel.BPS12ElevatorPanel_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct BPS12ElevatorPanel_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS12ElevatorPanel_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on BPS12ElevatorPanel_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(BPS12ElevatorPanel_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on BPS12ElevatorPanel_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(BPS12ElevatorPanel_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'BPS12ElevatorPanel_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

