#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPS12_AboutModal

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function BPS12_AboutModal.BPS12_AboutModal_C.ExecuteUbergraph_BPS12_AboutModal
// 0x0060 (0x0060 - 0x0000)
struct BPS12_AboutModal_C_ExecuteUbergraph_BPS12_AboutModal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button_1;               // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	class FText                                   K2Node_Event_InTitle;                              // 0x0038(0x0018)(ConstParm)
	TArray<class FText>                           K2Node_Event_InEntries;                            // 0x0050(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(BPS12_AboutModal_C_ExecuteUbergraph_BPS12_AboutModal) == 0x000008, "Wrong alignment on BPS12_AboutModal_C_ExecuteUbergraph_BPS12_AboutModal");
static_assert(sizeof(BPS12_AboutModal_C_ExecuteUbergraph_BPS12_AboutModal) == 0x000060, "Wrong size on BPS12_AboutModal_C_ExecuteUbergraph_BPS12_AboutModal");
static_assert(offsetof(BPS12_AboutModal_C_ExecuteUbergraph_BPS12_AboutModal, EntryPoint) == 0x000000, "Member 'BPS12_AboutModal_C_ExecuteUbergraph_BPS12_AboutModal::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPS12_AboutModal_C_ExecuteUbergraph_BPS12_AboutModal, K2Node_ComponentBoundEvent_Button) == 0x000008, "Member 'BPS12_AboutModal_C_ExecuteUbergraph_BPS12_AboutModal::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(BPS12_AboutModal_C_ExecuteUbergraph_BPS12_AboutModal, K2Node_Event_IsDesignTime) == 0x000010, "Member 'BPS12_AboutModal_C_ExecuteUbergraph_BPS12_AboutModal::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BPS12_AboutModal_C_ExecuteUbergraph_BPS12_AboutModal, K2Node_ComponentBoundEvent_Button_1) == 0x000018, "Member 'BPS12_AboutModal_C_ExecuteUbergraph_BPS12_AboutModal::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(BPS12_AboutModal_C_ExecuteUbergraph_BPS12_AboutModal, CallFunc_PlayAnimationForward_ReturnValue) == 0x000020, "Member 'BPS12_AboutModal_C_ExecuteUbergraph_BPS12_AboutModal::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS12_AboutModal_C_ExecuteUbergraph_BPS12_AboutModal, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'BPS12_AboutModal_C_ExecuteUbergraph_BPS12_AboutModal::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BPS12_AboutModal_C_ExecuteUbergraph_BPS12_AboutModal, K2Node_Event_InTitle) == 0x000038, "Member 'BPS12_AboutModal_C_ExecuteUbergraph_BPS12_AboutModal::K2Node_Event_InTitle' has a wrong offset!");
static_assert(offsetof(BPS12_AboutModal_C_ExecuteUbergraph_BPS12_AboutModal, K2Node_Event_InEntries) == 0x000050, "Member 'BPS12_AboutModal_C_ExecuteUbergraph_BPS12_AboutModal::K2Node_Event_InEntries' has a wrong offset!");

// Function BPS12_AboutModal.BPS12_AboutModal_C.BndEvt__Button_CloseMobile_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BPS12_AboutModal_C_BndEvt__Button_CloseMobile_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS12_AboutModal_C_BndEvt__Button_CloseMobile_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on BPS12_AboutModal_C_BndEvt__Button_CloseMobile_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(BPS12_AboutModal_C_BndEvt__Button_CloseMobile_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on BPS12_AboutModal_C_BndEvt__Button_CloseMobile_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(BPS12_AboutModal_C_BndEvt__Button_CloseMobile_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'BPS12_AboutModal_C_BndEvt__Button_CloseMobile_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function BPS12_AboutModal.BPS12_AboutModal_C.OnSetContent
// 0x0028 (0x0028 - 0x0000)
struct BPS12_AboutModal_C_OnSetContent final
{
public:
	class FText                                   InTitle;                                           // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<class FText>                           InEntries;                                         // 0x0018(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(BPS12_AboutModal_C_OnSetContent) == 0x000008, "Wrong alignment on BPS12_AboutModal_C_OnSetContent");
static_assert(sizeof(BPS12_AboutModal_C_OnSetContent) == 0x000028, "Wrong size on BPS12_AboutModal_C_OnSetContent");
static_assert(offsetof(BPS12_AboutModal_C_OnSetContent, InTitle) == 0x000000, "Member 'BPS12_AboutModal_C_OnSetContent::InTitle' has a wrong offset!");
static_assert(offsetof(BPS12_AboutModal_C_OnSetContent, InEntries) == 0x000018, "Member 'BPS12_AboutModal_C_OnSetContent::InEntries' has a wrong offset!");

// Function BPS12_AboutModal.BPS12_AboutModal_C.BndEvt__Button_Accept_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BPS12_AboutModal_C_BndEvt__Button_Accept_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS12_AboutModal_C_BndEvt__Button_Accept_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on BPS12_AboutModal_C_BndEvt__Button_Accept_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(BPS12_AboutModal_C_BndEvt__Button_Accept_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on BPS12_AboutModal_C_BndEvt__Button_Accept_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(BPS12_AboutModal_C_BndEvt__Button_Accept_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'BPS12_AboutModal_C_BndEvt__Button_Accept_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function BPS12_AboutModal.BPS12_AboutModal_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BPS12_AboutModal_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPS12_AboutModal_C_PreConstruct) == 0x000001, "Wrong alignment on BPS12_AboutModal_C_PreConstruct");
static_assert(sizeof(BPS12_AboutModal_C_PreConstruct) == 0x000001, "Wrong size on BPS12_AboutModal_C_PreConstruct");
static_assert(offsetof(BPS12_AboutModal_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BPS12_AboutModal_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function BPS12_AboutModal.BPS12_AboutModal_C.SetupEntries
// 0x0050 (0x0050 - 0x0000)
struct BPS12_AboutModal_C_SetupEntries final
{
public:
	TArray<class FText>                           InEntries;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Array_Get_Item;                           // 0x0020(0x0018)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBPS12_AboutModal_Entry_C*              CallFunc_Create_ReturnValue;                       // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS12_AboutModal_C_SetupEntries) == 0x000008, "Wrong alignment on BPS12_AboutModal_C_SetupEntries");
static_assert(sizeof(BPS12_AboutModal_C_SetupEntries) == 0x000050, "Wrong size on BPS12_AboutModal_C_SetupEntries");
static_assert(offsetof(BPS12_AboutModal_C_SetupEntries, InEntries) == 0x000000, "Member 'BPS12_AboutModal_C_SetupEntries::InEntries' has a wrong offset!");
static_assert(offsetof(BPS12_AboutModal_C_SetupEntries, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'BPS12_AboutModal_C_SetupEntries::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS12_AboutModal_C_SetupEntries, Temp_int_Array_Index_Variable) == 0x000014, "Member 'BPS12_AboutModal_C_SetupEntries::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BPS12_AboutModal_C_SetupEntries, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'BPS12_AboutModal_C_SetupEntries::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BPS12_AboutModal_C_SetupEntries, CallFunc_Array_Get_Item) == 0x000020, "Member 'BPS12_AboutModal_C_SetupEntries::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BPS12_AboutModal_C_SetupEntries, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'BPS12_AboutModal_C_SetupEntries::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS12_AboutModal_C_SetupEntries, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'BPS12_AboutModal_C_SetupEntries::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS12_AboutModal_C_SetupEntries, CallFunc_Create_ReturnValue) == 0x000040, "Member 'BPS12_AboutModal_C_SetupEntries::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPS12_AboutModal_C_SetupEntries, CallFunc_AddChild_ReturnValue) == 0x000048, "Member 'BPS12_AboutModal_C_SetupEntries::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function BPS12_AboutModal.BPS12_AboutModal_C.SetupStyling
// 0x06C0 (0x06C0 - 0x0000)
struct BPS12_AboutModal_C_SetupStyling final
{
public:
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable_2;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_3;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable_4;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_5;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USpatial_Specialbutton_C*               K2Node_DynamicCast_AsSpatial_Specialbutton;        // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0058(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0080(0x0028)()
	struct FSlateColor                            K2Node_Select_Default;                             // 0x00A8(0x0028)()
	bool                                          Temp_bool_Variable_4;                              // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x00D8(0x0088)()
	class UMaterialInterface*                     K2Node_Select_Default_1;                           // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScrollBarStyle                        K2Node_MakeStruct_ScrollBarStyle;                  // 0x0168(0x04D0)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0638(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x0660(0x0028)()
	struct FSlateColor                            K2Node_Select_Default_2;                           // 0x0688(0x0028)()
	class UMaterialInterface*                     K2Node_Select_Default_3;                           // 0x06B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_Select_Default_4;                           // 0x06B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPS12_AboutModal_C_SetupStyling) == 0x000008, "Wrong alignment on BPS12_AboutModal_C_SetupStyling");
static_assert(sizeof(BPS12_AboutModal_C_SetupStyling) == 0x0006C0, "Wrong size on BPS12_AboutModal_C_SetupStyling");
static_assert(offsetof(BPS12_AboutModal_C_SetupStyling, Temp_object_Variable) == 0x000000, "Member 'BPS12_AboutModal_C_SetupStyling::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BPS12_AboutModal_C_SetupStyling, Temp_object_Variable_1) == 0x000008, "Member 'BPS12_AboutModal_C_SetupStyling::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BPS12_AboutModal_C_SetupStyling, Temp_bool_Variable) == 0x000010, "Member 'BPS12_AboutModal_C_SetupStyling::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BPS12_AboutModal_C_SetupStyling, Temp_bool_Variable_1) == 0x000011, "Member 'BPS12_AboutModal_C_SetupStyling::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BPS12_AboutModal_C_SetupStyling, Temp_object_Variable_2) == 0x000018, "Member 'BPS12_AboutModal_C_SetupStyling::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(BPS12_AboutModal_C_SetupStyling, Temp_object_Variable_3) == 0x000020, "Member 'BPS12_AboutModal_C_SetupStyling::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(BPS12_AboutModal_C_SetupStyling, Temp_bool_Variable_2) == 0x000028, "Member 'BPS12_AboutModal_C_SetupStyling::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BPS12_AboutModal_C_SetupStyling, Temp_object_Variable_4) == 0x000030, "Member 'BPS12_AboutModal_C_SetupStyling::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(BPS12_AboutModal_C_SetupStyling, Temp_object_Variable_5) == 0x000038, "Member 'BPS12_AboutModal_C_SetupStyling::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(BPS12_AboutModal_C_SetupStyling, Temp_bool_Variable_3) == 0x000040, "Member 'BPS12_AboutModal_C_SetupStyling::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(BPS12_AboutModal_C_SetupStyling, K2Node_DynamicCast_AsSpatial_Specialbutton) == 0x000048, "Member 'BPS12_AboutModal_C_SetupStyling::K2Node_DynamicCast_AsSpatial_Specialbutton' has a wrong offset!");
static_assert(offsetof(BPS12_AboutModal_C_SetupStyling, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'BPS12_AboutModal_C_SetupStyling::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BPS12_AboutModal_C_SetupStyling, K2Node_MakeStruct_SlateColor) == 0x000058, "Member 'BPS12_AboutModal_C_SetupStyling::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(BPS12_AboutModal_C_SetupStyling, K2Node_MakeStruct_SlateColor_1) == 0x000080, "Member 'BPS12_AboutModal_C_SetupStyling::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(BPS12_AboutModal_C_SetupStyling, K2Node_Select_Default) == 0x0000A8, "Member 'BPS12_AboutModal_C_SetupStyling::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BPS12_AboutModal_C_SetupStyling, Temp_bool_Variable_4) == 0x0000D0, "Member 'BPS12_AboutModal_C_SetupStyling::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(BPS12_AboutModal_C_SetupStyling, K2Node_MakeStruct_SlateBrush) == 0x0000D8, "Member 'BPS12_AboutModal_C_SetupStyling::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(BPS12_AboutModal_C_SetupStyling, K2Node_Select_Default_1) == 0x000160, "Member 'BPS12_AboutModal_C_SetupStyling::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BPS12_AboutModal_C_SetupStyling, K2Node_MakeStruct_ScrollBarStyle) == 0x000168, "Member 'BPS12_AboutModal_C_SetupStyling::K2Node_MakeStruct_ScrollBarStyle' has a wrong offset!");
static_assert(offsetof(BPS12_AboutModal_C_SetupStyling, K2Node_MakeStruct_SlateColor_2) == 0x000638, "Member 'BPS12_AboutModal_C_SetupStyling::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(BPS12_AboutModal_C_SetupStyling, K2Node_MakeStruct_SlateColor_3) == 0x000660, "Member 'BPS12_AboutModal_C_SetupStyling::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");
static_assert(offsetof(BPS12_AboutModal_C_SetupStyling, K2Node_Select_Default_2) == 0x000688, "Member 'BPS12_AboutModal_C_SetupStyling::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BPS12_AboutModal_C_SetupStyling, K2Node_Select_Default_3) == 0x0006B0, "Member 'BPS12_AboutModal_C_SetupStyling::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(BPS12_AboutModal_C_SetupStyling, K2Node_Select_Default_4) == 0x0006B8, "Member 'BPS12_AboutModal_C_SetupStyling::K2Node_Select_Default_4' has a wrong offset!");

// Function BPS12_AboutModal.BPS12_AboutModal_C.SetupContent
// 0x0028 (0x0028 - 0x0000)
struct BPS12_AboutModal_C_SetupContent final
{
public:
	class FText                                   InTitle;                                           // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	TArray<class FText>                           InEntries;                                         // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(BPS12_AboutModal_C_SetupContent) == 0x000008, "Wrong alignment on BPS12_AboutModal_C_SetupContent");
static_assert(sizeof(BPS12_AboutModal_C_SetupContent) == 0x000028, "Wrong size on BPS12_AboutModal_C_SetupContent");
static_assert(offsetof(BPS12_AboutModal_C_SetupContent, InTitle) == 0x000000, "Member 'BPS12_AboutModal_C_SetupContent::InTitle' has a wrong offset!");
static_assert(offsetof(BPS12_AboutModal_C_SetupContent, InEntries) == 0x000018, "Member 'BPS12_AboutModal_C_SetupContent::InEntries' has a wrong offset!");

}

