#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPS12MainRoomInteractionIndicator

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPS12MainRoomInteractionIndicator.BPS12MainRoomInteractionIndicator_C
// 0x0018 (0x02A0 - 0x0288)
class UBPS12MainRoomInteractionIndicator_C final : public UFortEventLevelNavigationWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0288(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnHover;                                           // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonActionWidget*                    InputActionWidget;                                 // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPS12MainRoomInteractionIndicator(int32 EntryPoint);
	void OnObjectHoverEnd();
	void OnObjectHoverBegin();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPS12MainRoomInteractionIndicator_C">();
	}
	static class UBPS12MainRoomInteractionIndicator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPS12MainRoomInteractionIndicator_C>();
	}
};
static_assert(alignof(UBPS12MainRoomInteractionIndicator_C) == 0x000008, "Wrong alignment on UBPS12MainRoomInteractionIndicator_C");
static_assert(sizeof(UBPS12MainRoomInteractionIndicator_C) == 0x0002A0, "Wrong size on UBPS12MainRoomInteractionIndicator_C");
static_assert(offsetof(UBPS12MainRoomInteractionIndicator_C, UberGraphFrame) == 0x000288, "Member 'UBPS12MainRoomInteractionIndicator_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPS12MainRoomInteractionIndicator_C, OnHover) == 0x000290, "Member 'UBPS12MainRoomInteractionIndicator_C::OnHover' has a wrong offset!");
static_assert(offsetof(UBPS12MainRoomInteractionIndicator_C, InputActionWidget) == 0x000298, "Member 'UBPS12MainRoomInteractionIndicator_C::InputActionWidget' has a wrong offset!");

}

