#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPS12ElevatorPanel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPS12ElevatorPanel.BPS12ElevatorPanel_C
// 0x0070 (0x03E0 - 0x0370)
class UBPS12ElevatorPanel_C final : public UAthenaSpatialScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro_Populate;                                    // 0x0378(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Block_ProjectionTexture;                           // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DetailsPanelDarkening_Left;                        // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPS12_Elevator_Floor_Entry_C*          Floor_1;                                           // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPS12_Elevator_Floor_Entry_C*          Floor_2;                                           // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPS12_Elevator_Floor_Entry_C*          Floor_3;                                           // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPS12_Elevator_Floor_Entry_C*          Floor_4;                                           // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBPS12_Elevator_Floor_Entry_C*          Floor_5;                                           // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LongFalloff_ProjectionTexture;                     // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SceenSpaceTexture;                                 // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ShortFalloff_ProjectionTexture;                    // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         LastSelectedFloor;                                 // 0x03D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPS12ElevatorPanel(int32 EntryPoint);
	void BndEvt__Floor_5_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__Floor_4_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__Floor_3_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__Floor_2_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__Floor_1_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BP_OnActivated();
	void Intro();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPS12ElevatorPanel_C">();
	}
	static class UBPS12ElevatorPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPS12ElevatorPanel_C>();
	}
};
static_assert(alignof(UBPS12ElevatorPanel_C) == 0x000008, "Wrong alignment on UBPS12ElevatorPanel_C");
static_assert(sizeof(UBPS12ElevatorPanel_C) == 0x0003E0, "Wrong size on UBPS12ElevatorPanel_C");
static_assert(offsetof(UBPS12ElevatorPanel_C, UberGraphFrame) == 0x000370, "Member 'UBPS12ElevatorPanel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPS12ElevatorPanel_C, Intro_Populate) == 0x000378, "Member 'UBPS12ElevatorPanel_C::Intro_Populate' has a wrong offset!");
static_assert(offsetof(UBPS12ElevatorPanel_C, Block_ProjectionTexture) == 0x000380, "Member 'UBPS12ElevatorPanel_C::Block_ProjectionTexture' has a wrong offset!");
static_assert(offsetof(UBPS12ElevatorPanel_C, DetailsPanelDarkening_Left) == 0x000388, "Member 'UBPS12ElevatorPanel_C::DetailsPanelDarkening_Left' has a wrong offset!");
static_assert(offsetof(UBPS12ElevatorPanel_C, Floor_1) == 0x000390, "Member 'UBPS12ElevatorPanel_C::Floor_1' has a wrong offset!");
static_assert(offsetof(UBPS12ElevatorPanel_C, Floor_2) == 0x000398, "Member 'UBPS12ElevatorPanel_C::Floor_2' has a wrong offset!");
static_assert(offsetof(UBPS12ElevatorPanel_C, Floor_3) == 0x0003A0, "Member 'UBPS12ElevatorPanel_C::Floor_3' has a wrong offset!");
static_assert(offsetof(UBPS12ElevatorPanel_C, Floor_4) == 0x0003A8, "Member 'UBPS12ElevatorPanel_C::Floor_4' has a wrong offset!");
static_assert(offsetof(UBPS12ElevatorPanel_C, Floor_5) == 0x0003B0, "Member 'UBPS12ElevatorPanel_C::Floor_5' has a wrong offset!");
static_assert(offsetof(UBPS12ElevatorPanel_C, LongFalloff_ProjectionTexture) == 0x0003B8, "Member 'UBPS12ElevatorPanel_C::LongFalloff_ProjectionTexture' has a wrong offset!");
static_assert(offsetof(UBPS12ElevatorPanel_C, SafeZone_0) == 0x0003C0, "Member 'UBPS12ElevatorPanel_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(UBPS12ElevatorPanel_C, SceenSpaceTexture) == 0x0003C8, "Member 'UBPS12ElevatorPanel_C::SceenSpaceTexture' has a wrong offset!");
static_assert(offsetof(UBPS12ElevatorPanel_C, ShortFalloff_ProjectionTexture) == 0x0003D0, "Member 'UBPS12ElevatorPanel_C::ShortFalloff_ProjectionTexture' has a wrong offset!");
static_assert(offsetof(UBPS12ElevatorPanel_C, LastSelectedFloor) == 0x0003D8, "Member 'UBPS12ElevatorPanel_C::LastSelectedFloor' has a wrong offset!");

}

