#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Bucket_Old_Gadget_Skeleton_AnimBP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Bucket_Old_Gadget_Skeleton_AnimBP.Bucket_Old_Gadget_Skeleton_AnimBP_C
// 0x07A0 (0x0BC0 - 0x0420)
class UBucket_Old_Gadget_Skeleton_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	uint8                                         Pad_418[0x8];                                      // 0x0418(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0420(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	uint8                                         Pad_428[0x8];                                      // 0x0428(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x0430(0x05A0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x09D0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x09F0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_SubInput;                            // 0x0A10(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0A80(0x0030)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0AB0(0x0108)()

public:
	void ExecuteUbergraph_Bucket_Old_Gadget_Skeleton_AnimBP(int32 EntryPoint);
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Bucket_Old_Gadget_Skeleton_AnimBP_C">();
	}
	static class UBucket_Old_Gadget_Skeleton_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBucket_Old_Gadget_Skeleton_AnimBP_C>();
	}
};
static_assert(alignof(UBucket_Old_Gadget_Skeleton_AnimBP_C) == 0x000010, "Wrong alignment on UBucket_Old_Gadget_Skeleton_AnimBP_C");
static_assert(sizeof(UBucket_Old_Gadget_Skeleton_AnimBP_C) == 0x000BC0, "Wrong size on UBucket_Old_Gadget_Skeleton_AnimBP_C");
static_assert(offsetof(UBucket_Old_Gadget_Skeleton_AnimBP_C, UberGraphFrame) == 0x000420, "Member 'UBucket_Old_Gadget_Skeleton_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBucket_Old_Gadget_Skeleton_AnimBP_C, AnimGraphNode_RigidBody) == 0x000430, "Member 'UBucket_Old_Gadget_Skeleton_AnimBP_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(UBucket_Old_Gadget_Skeleton_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x0009D0, "Member 'UBucket_Old_Gadget_Skeleton_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UBucket_Old_Gadget_Skeleton_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x0009F0, "Member 'UBucket_Old_Gadget_Skeleton_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UBucket_Old_Gadget_Skeleton_AnimBP_C, AnimGraphNode_SubInput) == 0x000A10, "Member 'UBucket_Old_Gadget_Skeleton_AnimBP_C::AnimGraphNode_SubInput' has a wrong offset!");
static_assert(offsetof(UBucket_Old_Gadget_Skeleton_AnimBP_C, AnimGraphNode_Root) == 0x000A80, "Member 'UBucket_Old_Gadget_Skeleton_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UBucket_Old_Gadget_Skeleton_AnimBP_C, AnimGraphNode_ModifyBone) == 0x000AB0, "Member 'UBucket_Old_Gadget_Skeleton_AnimBP_C::AnimGraphNode_ModifyBone' has a wrong offset!");

}

