#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CareerScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CareerScreen.CareerScreen_C
// 0x0050 (0x04C0 - 0x0470)
class UCareerScreen_C final : public UAthenaCareerScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0470(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetSwitcher*                        FeatDisplaySwitcher;                               // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 GradOvr;                                           // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   NoAchievementMessage;                              // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SeasonHeadingTextLabel;                            // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switcher;                                          // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FDataTableRowHandle                    Input_ReplayCinematic;                             // 0x04A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class UActivatableMovieWidget_C*              ActivatableMovieWidget;                            // 0x04B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AutoPlayVideo;                                     // 0x04B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_CareerScreen(int32 EntryPoint);
	void OnInitialized();
	void BP_OnActivated();
	void ShowFeats(bool bShowFeats, bool bHasCompletedFeats);
	void PlayCinematic();
	void ReplayCinematic(bool* PassThrough);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CareerScreen_C">();
	}
	static class UCareerScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCareerScreen_C>();
	}
};
static_assert(alignof(UCareerScreen_C) == 0x000008, "Wrong alignment on UCareerScreen_C");
static_assert(sizeof(UCareerScreen_C) == 0x0004C0, "Wrong size on UCareerScreen_C");
static_assert(offsetof(UCareerScreen_C, UberGraphFrame) == 0x000470, "Member 'UCareerScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCareerScreen_C, FeatDisplaySwitcher) == 0x000478, "Member 'UCareerScreen_C::FeatDisplaySwitcher' has a wrong offset!");
static_assert(offsetof(UCareerScreen_C, GradOvr) == 0x000480, "Member 'UCareerScreen_C::GradOvr' has a wrong offset!");
static_assert(offsetof(UCareerScreen_C, NoAchievementMessage) == 0x000488, "Member 'UCareerScreen_C::NoAchievementMessage' has a wrong offset!");
static_assert(offsetof(UCareerScreen_C, SeasonHeadingTextLabel) == 0x000490, "Member 'UCareerScreen_C::SeasonHeadingTextLabel' has a wrong offset!");
static_assert(offsetof(UCareerScreen_C, Switcher) == 0x000498, "Member 'UCareerScreen_C::Switcher' has a wrong offset!");
static_assert(offsetof(UCareerScreen_C, Input_ReplayCinematic) == 0x0004A0, "Member 'UCareerScreen_C::Input_ReplayCinematic' has a wrong offset!");
static_assert(offsetof(UCareerScreen_C, ActivatableMovieWidget) == 0x0004B0, "Member 'UCareerScreen_C::ActivatableMovieWidget' has a wrong offset!");
static_assert(offsetof(UCareerScreen_C, AutoPlayVideo) == 0x0004B8, "Member 'UCareerScreen_C::AutoPlayVideo' has a wrong offset!");

}

