#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CCPM_M_GoldenSkeleton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CCPM_Parent_WatchCosmeticStat_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CCPM_M_GoldenSkeleton.CCPM_M_GoldenSkeleton_C
// 0x0048 (0x0450 - 0x0408)
class ACCPM_M_GoldenSkeleton_C final : public ACCPM_Parent_WatchCosmeticStat_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_CCPM_M_GoldenSkeleton_C;            // 0x0408(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               P_Skeleton_BuffCat_Top;                            // 0x0410(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_BuffCat_Update;                                  // 0x0418(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_MED_The_Golden_Skeleton_Glow;                    // 0x0420(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class APlayerPawn_Athena_C*                   LastPawn;                                          // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Kill;                                              // 0x0430(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SL_LastValue;                                      // 0x0434(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           SL_RefreshTimeHandler;                             // 0x0438(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         SL_StartLevel;                                     // 0x0440(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SL_EndLevel;                                       // 0x0444(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EndRadius;                                         // 0x0448(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CCPM_M_GoldenSkeleton(int32 EntryPoint);
	void InitializeVariabels();
	void OnPostResIn();
	void ResetSafetyGate();
	void HackyWorkaroundRefreshTimerGuy();
	void OnActualStatChange();
	void OnPawnAndPartChanged();
	void OnStatChanged_A4D4C55946C69552A0D4EFBD92EA9526(class FName StatName, int32 StatValue);
	void UserConstructionScript();
	void Death_Check();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CCPM_M_GoldenSkeleton_C">();
	}
	static class ACCPM_M_GoldenSkeleton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACCPM_M_GoldenSkeleton_C>();
	}
};
static_assert(alignof(ACCPM_M_GoldenSkeleton_C) == 0x000008, "Wrong alignment on ACCPM_M_GoldenSkeleton_C");
static_assert(sizeof(ACCPM_M_GoldenSkeleton_C) == 0x000450, "Wrong size on ACCPM_M_GoldenSkeleton_C");
static_assert(offsetof(ACCPM_M_GoldenSkeleton_C, UberGraphFrame_CCPM_M_GoldenSkeleton_C) == 0x000408, "Member 'ACCPM_M_GoldenSkeleton_C::UberGraphFrame_CCPM_M_GoldenSkeleton_C' has a wrong offset!");
static_assert(offsetof(ACCPM_M_GoldenSkeleton_C, P_Skeleton_BuffCat_Top) == 0x000410, "Member 'ACCPM_M_GoldenSkeleton_C::P_Skeleton_BuffCat_Top' has a wrong offset!");
static_assert(offsetof(ACCPM_M_GoldenSkeleton_C, P_BuffCat_Update) == 0x000418, "Member 'ACCPM_M_GoldenSkeleton_C::P_BuffCat_Update' has a wrong offset!");
static_assert(offsetof(ACCPM_M_GoldenSkeleton_C, P_MED_The_Golden_Skeleton_Glow) == 0x000420, "Member 'ACCPM_M_GoldenSkeleton_C::P_MED_The_Golden_Skeleton_Glow' has a wrong offset!");
static_assert(offsetof(ACCPM_M_GoldenSkeleton_C, LastPawn) == 0x000428, "Member 'ACCPM_M_GoldenSkeleton_C::LastPawn' has a wrong offset!");
static_assert(offsetof(ACCPM_M_GoldenSkeleton_C, Kill) == 0x000430, "Member 'ACCPM_M_GoldenSkeleton_C::Kill' has a wrong offset!");
static_assert(offsetof(ACCPM_M_GoldenSkeleton_C, SL_LastValue) == 0x000434, "Member 'ACCPM_M_GoldenSkeleton_C::SL_LastValue' has a wrong offset!");
static_assert(offsetof(ACCPM_M_GoldenSkeleton_C, SL_RefreshTimeHandler) == 0x000438, "Member 'ACCPM_M_GoldenSkeleton_C::SL_RefreshTimeHandler' has a wrong offset!");
static_assert(offsetof(ACCPM_M_GoldenSkeleton_C, SL_StartLevel) == 0x000440, "Member 'ACCPM_M_GoldenSkeleton_C::SL_StartLevel' has a wrong offset!");
static_assert(offsetof(ACCPM_M_GoldenSkeleton_C, SL_EndLevel) == 0x000444, "Member 'ACCPM_M_GoldenSkeleton_C::SL_EndLevel' has a wrong offset!");
static_assert(offsetof(ACCPM_M_GoldenSkeleton_C, EndRadius) == 0x000448, "Member 'ACCPM_M_GoldenSkeleton_C::EndRadius' has a wrong offset!");

}

