#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CCPM_PartModifier_SpawnPet

#include "Basic.hpp"


namespace SDK::Params
{

// Function CCPM_PartModifier_SpawnPet.CCPM_PartModifier_SpawnPet_C.ExecuteUbergraph_CCPM_PartModifier_SpawnPet
// 0x0018 (0x0018 - 0x0000)
struct CCPM_PartModifier_SpawnPet_C_ExecuteUbergraph_CCPM_PartModifier_SpawnPet final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetAssociatedPlayerPawn_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        CallFunc_GetAssociatedPlayerPawn_ReturnValue_1;    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CCPM_PartModifier_SpawnPet_C_ExecuteUbergraph_CCPM_PartModifier_SpawnPet) == 0x000008, "Wrong alignment on CCPM_PartModifier_SpawnPet_C_ExecuteUbergraph_CCPM_PartModifier_SpawnPet");
static_assert(sizeof(CCPM_PartModifier_SpawnPet_C_ExecuteUbergraph_CCPM_PartModifier_SpawnPet) == 0x000018, "Wrong size on CCPM_PartModifier_SpawnPet_C_ExecuteUbergraph_CCPM_PartModifier_SpawnPet");
static_assert(offsetof(CCPM_PartModifier_SpawnPet_C_ExecuteUbergraph_CCPM_PartModifier_SpawnPet, EntryPoint) == 0x000000, "Member 'CCPM_PartModifier_SpawnPet_C_ExecuteUbergraph_CCPM_PartModifier_SpawnPet::EntryPoint' has a wrong offset!");
static_assert(offsetof(CCPM_PartModifier_SpawnPet_C_ExecuteUbergraph_CCPM_PartModifier_SpawnPet, CallFunc_GetAssociatedPlayerPawn_ReturnValue) == 0x000008, "Member 'CCPM_PartModifier_SpawnPet_C_ExecuteUbergraph_CCPM_PartModifier_SpawnPet::CallFunc_GetAssociatedPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_PartModifier_SpawnPet_C_ExecuteUbergraph_CCPM_PartModifier_SpawnPet, CallFunc_GetAssociatedPlayerPawn_ReturnValue_1) == 0x000010, "Member 'CCPM_PartModifier_SpawnPet_C_ExecuteUbergraph_CCPM_PartModifier_SpawnPet::CallFunc_GetAssociatedPlayerPawn_ReturnValue_1' has a wrong offset!");

}

