#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CCPM_M_CatBurglar_Head

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function CCPM_M_CatBurglar_Head.CCPM_M_CatBurglar_Head_C.ExecuteUbergraph_CCPM_M_CatBurglar_Head
// 0x00B8 (0x00B8 - 0x0000)
struct CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName StatName, int32 StatValue)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         CallFunc_GetSkeletalMeshForAssociatedPlayerPawnPartType_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMeshComponent*                         CallFunc_GetSkeletalMeshForAssociatedPlayerPawnPartType_ReturnValue_1; // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        CallFunc_GetAssociatedPlayerPawn_ReturnValue;      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAsyncAction_CosmeticAdaptiveStatWatcher* CallFunc_WatchCosmeticStat_ReturnValue;            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         CallFunc_GetSkeletalMeshForAssociatedPlayerPawnPartType_ReturnValue_2; // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0074(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8B[0x1];                                       // 0x008B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_2;            // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMeshComponent*                         CallFunc_GetSkeletalMeshForAssociatedPlayerPawnPartType_ReturnValue_3; // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_3;            // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_4;            // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMeshComponent*                         CallFunc_GetSkeletalMeshForAssociatedPlayerPawnPartType_ReturnValue_4; // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_StatName;                       // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_StatValue;                      // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head) == 0x000008, "Wrong alignment on CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head");
static_assert(sizeof(CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head) == 0x0000B8, "Wrong size on CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head");
static_assert(offsetof(CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head, EntryPoint) == 0x000000, "Member 'CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head::EntryPoint' has a wrong offset!");
static_assert(offsetof(CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head, K2Node_CreateDelegate_OutputDelegate_1) == 0x000020, "Member 'CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head, Temp_bool_IsClosed_Variable) == 0x000030, "Member 'CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head, Temp_bool_Has_Been_Initd_Variable) == 0x000031, "Member 'CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head, Temp_bool_Has_Been_Initd_Variable_1) == 0x000032, "Member 'CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head, CallFunc_GetSkeletalMeshForAssociatedPlayerPawnPartType_ReturnValue) == 0x000038, "Member 'CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head::CallFunc_GetSkeletalMeshForAssociatedPlayerPawnPartType_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000040, "Member 'CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000041, "Member 'CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000044, "Member 'CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head, CallFunc_GetSkeletalMeshForAssociatedPlayerPawnPartType_ReturnValue_1) == 0x000048, "Member 'CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head::CallFunc_GetSkeletalMeshForAssociatedPlayerPawnPartType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head, CallFunc_GetAssociatedPlayerPawn_ReturnValue) == 0x000050, "Member 'CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head::CallFunc_GetAssociatedPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head, CallFunc_WatchCosmeticStat_ReturnValue) == 0x000058, "Member 'CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head::CallFunc_WatchCosmeticStat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head, Temp_bool_IsClosed_Variable_1) == 0x000061, "Member 'CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head, CallFunc_GetSkeletalMeshForAssociatedPlayerPawnPartType_ReturnValue_2) == 0x000068, "Member 'CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head::CallFunc_GetSkeletalMeshForAssociatedPlayerPawnPartType_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000070, "Member 'CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head, Temp_name_Variable) == 0x000074, "Member 'CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head, Temp_int_Variable) == 0x00007C, "Member 'CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head, CallFunc_Max_ReturnValue) == 0x000080, "Member 'CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000084, "Member 'CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head, CallFunc_Less_IntInt_ReturnValue) == 0x000088, "Member 'CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head, CallFunc_Greater_IntInt_ReturnValue) == 0x000089, "Member 'CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head, CallFunc_BooleanAND_ReturnValue) == 0x00008A, "Member 'CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head, CallFunc_Conv_IntToFloat_ReturnValue_2) == 0x00008C, "Member 'CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head::CallFunc_Conv_IntToFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head, CallFunc_GetSkeletalMeshForAssociatedPlayerPawnPartType_ReturnValue_3) == 0x000090, "Member 'CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head::CallFunc_GetSkeletalMeshForAssociatedPlayerPawnPartType_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head, CallFunc_Conv_IntToFloat_ReturnValue_3) == 0x000098, "Member 'CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head::CallFunc_Conv_IntToFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head, CallFunc_Conv_IntToFloat_ReturnValue_4) == 0x00009C, "Member 'CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head::CallFunc_Conv_IntToFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head, CallFunc_GetSkeletalMeshForAssociatedPlayerPawnPartType_ReturnValue_4) == 0x0000A0, "Member 'CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head::CallFunc_GetSkeletalMeshForAssociatedPlayerPawnPartType_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head, K2Node_CustomEvent_StatName) == 0x0000A8, "Member 'CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head::K2Node_CustomEvent_StatName' has a wrong offset!");
static_assert(offsetof(CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head, K2Node_CustomEvent_StatValue) == 0x0000B0, "Member 'CCPM_M_CatBurglar_Head_C_ExecuteUbergraph_CCPM_M_CatBurglar_Head::K2Node_CustomEvent_StatValue' has a wrong offset!");

// Function CCPM_M_CatBurglar_Head.CCPM_M_CatBurglar_Head_C.OnStatChanged_6429FF264C5FC42E64F53EB173B73660
// 0x000C (0x000C - 0x0000)
struct CCPM_M_CatBurglar_Head_C_OnStatChanged_6429FF264C5FC42E64F53EB173B73660 final
{
public:
	class FName                                   StatName;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StatValue;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CCPM_M_CatBurglar_Head_C_OnStatChanged_6429FF264C5FC42E64F53EB173B73660) == 0x000004, "Wrong alignment on CCPM_M_CatBurglar_Head_C_OnStatChanged_6429FF264C5FC42E64F53EB173B73660");
static_assert(sizeof(CCPM_M_CatBurglar_Head_C_OnStatChanged_6429FF264C5FC42E64F53EB173B73660) == 0x00000C, "Wrong size on CCPM_M_CatBurglar_Head_C_OnStatChanged_6429FF264C5FC42E64F53EB173B73660");
static_assert(offsetof(CCPM_M_CatBurglar_Head_C_OnStatChanged_6429FF264C5FC42E64F53EB173B73660, StatName) == 0x000000, "Member 'CCPM_M_CatBurglar_Head_C_OnStatChanged_6429FF264C5FC42E64F53EB173B73660::StatName' has a wrong offset!");
static_assert(offsetof(CCPM_M_CatBurglar_Head_C_OnStatChanged_6429FF264C5FC42E64F53EB173B73660, StatValue) == 0x000008, "Member 'CCPM_M_CatBurglar_Head_C_OnStatChanged_6429FF264C5FC42E64F53EB173B73660::StatValue' has a wrong offset!");

// Function CCPM_M_CatBurglar_Head.CCPM_M_CatBurglar_Head_C.UserConstructionScript
// 0x0018 (0x0018 - 0x0000)
struct CCPM_M_CatBurglar_Head_C_UserConstructionScript final
{
public:
	class UMeshComponent*                         CallFunc_GetSkeletalMeshForAssociatedPlayerPawnPartType_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMeshComponent*                         CallFunc_GetSkeletalMeshForAssociatedPlayerPawnPartType_ReturnValue_1; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CCPM_M_CatBurglar_Head_C_UserConstructionScript) == 0x000008, "Wrong alignment on CCPM_M_CatBurglar_Head_C_UserConstructionScript");
static_assert(sizeof(CCPM_M_CatBurglar_Head_C_UserConstructionScript) == 0x000018, "Wrong size on CCPM_M_CatBurglar_Head_C_UserConstructionScript");
static_assert(offsetof(CCPM_M_CatBurglar_Head_C_UserConstructionScript, CallFunc_GetSkeletalMeshForAssociatedPlayerPawnPartType_ReturnValue) == 0x000000, "Member 'CCPM_M_CatBurglar_Head_C_UserConstructionScript::CallFunc_GetSkeletalMeshForAssociatedPlayerPawnPartType_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_M_CatBurglar_Head_C_UserConstructionScript, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000008, "Member 'CCPM_M_CatBurglar_Head_C_UserConstructionScript::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_M_CatBurglar_Head_C_UserConstructionScript, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x00000C, "Member 'CCPM_M_CatBurglar_Head_C_UserConstructionScript::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CCPM_M_CatBurglar_Head_C_UserConstructionScript, CallFunc_GetSkeletalMeshForAssociatedPlayerPawnPartType_ReturnValue_1) == 0x000010, "Member 'CCPM_M_CatBurglar_Head_C_UserConstructionScript::CallFunc_GetSkeletalMeshForAssociatedPlayerPawnPartType_ReturnValue_1' has a wrong offset!");

// Function CCPM_M_CatBurglar_Head.CCPM_M_CatBurglar_Head_C.Death Check
// 0x0048 (0x0048 - 0x0000)
struct CCPM_M_CatBurglar_Head_C_Death_Check final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class AFortPlayerPawn*                        CallFunc_GetAssociatedPlayerPawn_ReturnValue;      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerPawn_Athena_C*                   K2Node_DynamicCast_AsPlayer_Pawn_Athena;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        CallFunc_GetAssociatedPlayerPawn_ReturnValue_1;    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CCPM_M_CatBurglar_Head_C_Death_Check) == 0x000008, "Wrong alignment on CCPM_M_CatBurglar_Head_C_Death_Check");
static_assert(sizeof(CCPM_M_CatBurglar_Head_C_Death_Check) == 0x000048, "Wrong size on CCPM_M_CatBurglar_Head_C_Death_Check");
static_assert(offsetof(CCPM_M_CatBurglar_Head_C_Death_Check, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'CCPM_M_CatBurglar_Head_C_Death_Check::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(CCPM_M_CatBurglar_Head_C_Death_Check, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'CCPM_M_CatBurglar_Head_C_Death_Check::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(CCPM_M_CatBurglar_Head_C_Death_Check, CallFunc_GetAssociatedPlayerPawn_ReturnValue) == 0x000020, "Member 'CCPM_M_CatBurglar_Head_C_Death_Check::CallFunc_GetAssociatedPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_M_CatBurglar_Head_C_Death_Check, K2Node_DynamicCast_AsPlayer_Pawn_Athena) == 0x000028, "Member 'CCPM_M_CatBurglar_Head_C_Death_Check::K2Node_DynamicCast_AsPlayer_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(CCPM_M_CatBurglar_Head_C_Death_Check, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'CCPM_M_CatBurglar_Head_C_Death_Check::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CCPM_M_CatBurglar_Head_C_Death_Check, CallFunc_GetAssociatedPlayerPawn_ReturnValue_1) == 0x000038, "Member 'CCPM_M_CatBurglar_Head_C_Death_Check::CallFunc_GetAssociatedPlayerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CCPM_M_CatBurglar_Head_C_Death_Check, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000040, "Member 'CCPM_M_CatBurglar_Head_C_Death_Check::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_M_CatBurglar_Head_C_Death_Check, CallFunc_IsValid_ReturnValue) == 0x000041, "Member 'CCPM_M_CatBurglar_Head_C_Death_Check::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CCPM_M_CatBurglar_Head_C_Death_Check, CallFunc_BooleanAND_ReturnValue) == 0x000042, "Member 'CCPM_M_CatBurglar_Head_C_Death_Check::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

