#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CCPM_M_CatBurglar_Head

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CCPM_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CCPM_M_CatBurglar_Head.CCPM_M_CatBurglar_Head_C
// 0x0038 (0x03F0 - 0x03B8)
class ACCPM_M_CatBurglar_Head_C final : public ACCPM_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_CCPM_M_CatBurglar_Head_C;           // 0x03B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               P_BlankEffect;                                     // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class APlayerPawn_Athena_C*                   LastPawn;                                          // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SL_LastValue;                                      // 0x03D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D4[0x4];                                      // 0x03D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           SL_RefreshTimeHandler;                             // 0x03D8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         SL_StartLevel;                                     // 0x03E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SL_EndLevel;                                       // 0x03E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EndRadius;                                         // 0x03E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CCPM_M_CatBurglar_Head(int32 EntryPoint);
	void InitializeVariabels();
	void ReceiveBeginPlay();
	void ResetSafetyGate();
	void OnPostResIn();
	void HackyWorkaroundRefreshTimerGuy();
	void OnActualStatChange();
	void OnPawnAndPartChanged();
	void OnStatChanged_6429FF264C5FC42E64F53EB173B73660(class FName StatName, int32 StatValue);
	void UserConstructionScript();
	void Death_Check();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CCPM_M_CatBurglar_Head_C">();
	}
	static class ACCPM_M_CatBurglar_Head_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACCPM_M_CatBurglar_Head_C>();
	}
};
static_assert(alignof(ACCPM_M_CatBurglar_Head_C) == 0x000008, "Wrong alignment on ACCPM_M_CatBurglar_Head_C");
static_assert(sizeof(ACCPM_M_CatBurglar_Head_C) == 0x0003F0, "Wrong size on ACCPM_M_CatBurglar_Head_C");
static_assert(offsetof(ACCPM_M_CatBurglar_Head_C, UberGraphFrame_CCPM_M_CatBurglar_Head_C) == 0x0003B8, "Member 'ACCPM_M_CatBurglar_Head_C::UberGraphFrame_CCPM_M_CatBurglar_Head_C' has a wrong offset!");
static_assert(offsetof(ACCPM_M_CatBurglar_Head_C, P_BlankEffect) == 0x0003C0, "Member 'ACCPM_M_CatBurglar_Head_C::P_BlankEffect' has a wrong offset!");
static_assert(offsetof(ACCPM_M_CatBurglar_Head_C, LastPawn) == 0x0003C8, "Member 'ACCPM_M_CatBurglar_Head_C::LastPawn' has a wrong offset!");
static_assert(offsetof(ACCPM_M_CatBurglar_Head_C, SL_LastValue) == 0x0003D0, "Member 'ACCPM_M_CatBurglar_Head_C::SL_LastValue' has a wrong offset!");
static_assert(offsetof(ACCPM_M_CatBurglar_Head_C, SL_RefreshTimeHandler) == 0x0003D8, "Member 'ACCPM_M_CatBurglar_Head_C::SL_RefreshTimeHandler' has a wrong offset!");
static_assert(offsetof(ACCPM_M_CatBurglar_Head_C, SL_StartLevel) == 0x0003E0, "Member 'ACCPM_M_CatBurglar_Head_C::SL_StartLevel' has a wrong offset!");
static_assert(offsetof(ACCPM_M_CatBurglar_Head_C, SL_EndLevel) == 0x0003E4, "Member 'ACCPM_M_CatBurglar_Head_C::SL_EndLevel' has a wrong offset!");
static_assert(offsetof(ACCPM_M_CatBurglar_Head_C, EndRadius) == 0x0003E8, "Member 'ACCPM_M_CatBurglar_Head_C::EndRadius' has a wrong offset!");

}

