#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CMS_ML_BattlePass_LeftImageWidget1

#include "Basic.hpp"

#include "EpicCMSUIFramework_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CMS_ML_BattlePass_LeftImageWidget1.CMS_ML_BattlePass_LeftImageWidget1_C
// 0x0020 (0x0290 - 0x0270)
class UCMS_ML_BattlePass_LeftImageWidget1_C final : public UEpicCMSSimpleMessage
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       SeasonName;                                        // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SoftGlow;                                          // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SoftTextShadow;                                    // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CMS_ML_BattlePass_LeftImageWidget1(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CMS_ML_BattlePass_LeftImageWidget1_C">();
	}
	static class UCMS_ML_BattlePass_LeftImageWidget1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCMS_ML_BattlePass_LeftImageWidget1_C>();
	}
};
static_assert(alignof(UCMS_ML_BattlePass_LeftImageWidget1_C) == 0x000008, "Wrong alignment on UCMS_ML_BattlePass_LeftImageWidget1_C");
static_assert(sizeof(UCMS_ML_BattlePass_LeftImageWidget1_C) == 0x000290, "Wrong size on UCMS_ML_BattlePass_LeftImageWidget1_C");
static_assert(offsetof(UCMS_ML_BattlePass_LeftImageWidget1_C, UberGraphFrame) == 0x000270, "Member 'UCMS_ML_BattlePass_LeftImageWidget1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCMS_ML_BattlePass_LeftImageWidget1_C, SeasonName) == 0x000278, "Member 'UCMS_ML_BattlePass_LeftImageWidget1_C::SeasonName' has a wrong offset!");
static_assert(offsetof(UCMS_ML_BattlePass_LeftImageWidget1_C, SoftGlow) == 0x000280, "Member 'UCMS_ML_BattlePass_LeftImageWidget1_C::SoftGlow' has a wrong offset!");
static_assert(offsetof(UCMS_ML_BattlePass_LeftImageWidget1_C, SoftTextShadow) == 0x000288, "Member 'UCMS_ML_BattlePass_LeftImageWidget1_C::SoftTextShadow' has a wrong offset!");

}

