#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ColorSwatch

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ColorSwatch.ColorSwatch_C
// 0x0028 (0x0BD0 - 0x0BA8)
class UColorSwatch_C final : public UFortColorPickerSwatchTile
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BA8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x0BB0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_hoverbottom;                                 // 0x0BB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_hovertop;                                    // 0x0BC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_null;                                         // 0x0BC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ColorSwatch(int32 EntryPoint);
	void OnSwatchColorSet(bool bInNullColor);
	void BP_OnUnhovered();
	void BP_OnHovered();
	void OnListItemObjectSet(class UObject* ListItemObject);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnEntryReleased();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ColorSwatch_C">();
	}
	static class UColorSwatch_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UColorSwatch_C>();
	}
};
static_assert(alignof(UColorSwatch_C) == 0x000008, "Wrong alignment on UColorSwatch_C");
static_assert(sizeof(UColorSwatch_C) == 0x000BD0, "Wrong size on UColorSwatch_C");
static_assert(offsetof(UColorSwatch_C, UberGraphFrame) == 0x000BA8, "Member 'UColorSwatch_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UColorSwatch_C, Hover) == 0x000BB0, "Member 'UColorSwatch_C::Hover' has a wrong offset!");
static_assert(offsetof(UColorSwatch_C, Image_hoverbottom) == 0x000BB8, "Member 'UColorSwatch_C::Image_hoverbottom' has a wrong offset!");
static_assert(offsetof(UColorSwatch_C, Image_hovertop) == 0x000BC0, "Member 'UColorSwatch_C::Image_hovertop' has a wrong offset!");
static_assert(offsetof(UColorSwatch_C, Text_null) == 0x000BC8, "Member 'UColorSwatch_C::Text_null' has a wrong offset!");

}

