#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ColorPickerComponent

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function ColorPickerComponent.ColorPickerComponent_C.ExecuteUbergraph_ColorPickerComponent
// 0x0130 (0x0130 - 0x0000)
struct ColorPickerComponent_C_ExecuteUbergraph_ColorPickerComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0018(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0050(0x0070)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00C0(0x0070)(ConstParm)
};
static_assert(alignof(ColorPickerComponent_C_ExecuteUbergraph_ColorPickerComponent) == 0x000008, "Wrong alignment on ColorPickerComponent_C_ExecuteUbergraph_ColorPickerComponent");
static_assert(sizeof(ColorPickerComponent_C_ExecuteUbergraph_ColorPickerComponent) == 0x000130, "Wrong size on ColorPickerComponent_C_ExecuteUbergraph_ColorPickerComponent");
static_assert(offsetof(ColorPickerComponent_C_ExecuteUbergraph_ColorPickerComponent, EntryPoint) == 0x000000, "Member 'ColorPickerComponent_C_ExecuteUbergraph_ColorPickerComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(ColorPickerComponent_C_ExecuteUbergraph_ColorPickerComponent, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000008, "Member 'ColorPickerComponent_C_ExecuteUbergraph_ColorPickerComponent::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(ColorPickerComponent_C_ExecuteUbergraph_ColorPickerComponent, CallFunc_PlayAnimationForward_ReturnValue) == 0x000010, "Member 'ColorPickerComponent_C_ExecuteUbergraph_ColorPickerComponent::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(ColorPickerComponent_C_ExecuteUbergraph_ColorPickerComponent, K2Node_Event_MyGeometry) == 0x000018, "Member 'ColorPickerComponent_C_ExecuteUbergraph_ColorPickerComponent::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(ColorPickerComponent_C_ExecuteUbergraph_ColorPickerComponent, K2Node_Event_MouseEvent_1) == 0x000050, "Member 'ColorPickerComponent_C_ExecuteUbergraph_ColorPickerComponent::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(ColorPickerComponent_C_ExecuteUbergraph_ColorPickerComponent, K2Node_Event_MouseEvent) == 0x0000C0, "Member 'ColorPickerComponent_C_ExecuteUbergraph_ColorPickerComponent::K2Node_Event_MouseEvent' has a wrong offset!");

// Function ColorPickerComponent.ColorPickerComponent_C.OnMouseLeave
// 0x0070 (0x0070 - 0x0000)
struct ColorPickerComponent_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(ColorPickerComponent_C_OnMouseLeave) == 0x000008, "Wrong alignment on ColorPickerComponent_C_OnMouseLeave");
static_assert(sizeof(ColorPickerComponent_C_OnMouseLeave) == 0x000070, "Wrong size on ColorPickerComponent_C_OnMouseLeave");
static_assert(offsetof(ColorPickerComponent_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'ColorPickerComponent_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function ColorPickerComponent.ColorPickerComponent_C.OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct ColorPickerComponent_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(ColorPickerComponent_C_OnMouseEnter) == 0x000008, "Wrong alignment on ColorPickerComponent_C_OnMouseEnter");
static_assert(sizeof(ColorPickerComponent_C_OnMouseEnter) == 0x0000A8, "Wrong size on ColorPickerComponent_C_OnMouseEnter");
static_assert(offsetof(ColorPickerComponent_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'ColorPickerComponent_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(ColorPickerComponent_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'ColorPickerComponent_C_OnMouseEnter::MouseEvent' has a wrong offset!");

}

