#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ColorPickerComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ColorPickerComponent.ColorPickerComponent_C
// 0x0020 (0x02B0 - 0x0290)
class UColorPickerComponent_C final : public UFortColorPickerComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Plus_Hovered;                                      // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Minus_Hovered;                                     // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Selected;                                          // 0x02A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ColorPickerComponent(int32 EntryPoint);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ColorPickerComponent_C">();
	}
	static class UColorPickerComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UColorPickerComponent_C>();
	}
};
static_assert(alignof(UColorPickerComponent_C) == 0x000008, "Wrong alignment on UColorPickerComponent_C");
static_assert(sizeof(UColorPickerComponent_C) == 0x0002B0, "Wrong size on UColorPickerComponent_C");
static_assert(offsetof(UColorPickerComponent_C, UberGraphFrame) == 0x000290, "Member 'UColorPickerComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UColorPickerComponent_C, Plus_Hovered) == 0x000298, "Member 'UColorPickerComponent_C::Plus_Hovered' has a wrong offset!");
static_assert(offsetof(UColorPickerComponent_C, Minus_Hovered) == 0x0002A0, "Member 'UColorPickerComponent_C::Minus_Hovered' has a wrong offset!");
static_assert(offsetof(UColorPickerComponent_C, Selected) == 0x0002A8, "Member 'UColorPickerComponent_C::Selected' has a wrong offset!");

}

