#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ColorPicker

#include "Basic.hpp"

#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function ColorPicker.ColorPicker_C.ExecuteUbergraph_ColorPicker
// 0x0018 (0x0018 - 0x0000)
struct ColorPicker_C_ExecuteUbergraph_ColorPicker final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bToSwatch;                            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EColorPickerType                              K2Node_Event_InColorPickerType;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EColorPickerType                              Temp_byte_Variable;                                // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select_Default;                             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select_Default_1;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ColorPicker_C_ExecuteUbergraph_ColorPicker) == 0x000008, "Wrong alignment on ColorPicker_C_ExecuteUbergraph_ColorPicker");
static_assert(sizeof(ColorPicker_C_ExecuteUbergraph_ColorPicker) == 0x000018, "Wrong size on ColorPicker_C_ExecuteUbergraph_ColorPicker");
static_assert(offsetof(ColorPicker_C_ExecuteUbergraph_ColorPicker, EntryPoint) == 0x000000, "Member 'ColorPicker_C_ExecuteUbergraph_ColorPicker::EntryPoint' has a wrong offset!");
static_assert(offsetof(ColorPicker_C_ExecuteUbergraph_ColorPicker, K2Node_Event_bToSwatch) == 0x000004, "Member 'ColorPicker_C_ExecuteUbergraph_ColorPicker::K2Node_Event_bToSwatch' has a wrong offset!");
static_assert(offsetof(ColorPicker_C_ExecuteUbergraph_ColorPicker, K2Node_Event_InColorPickerType) == 0x000005, "Member 'ColorPicker_C_ExecuteUbergraph_ColorPicker::K2Node_Event_InColorPickerType' has a wrong offset!");
static_assert(offsetof(ColorPicker_C_ExecuteUbergraph_ColorPicker, Temp_bool_Variable) == 0x000006, "Member 'ColorPicker_C_ExecuteUbergraph_ColorPicker::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(ColorPicker_C_ExecuteUbergraph_ColorPicker, Temp_byte_Variable) == 0x000007, "Member 'ColorPicker_C_ExecuteUbergraph_ColorPicker::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(ColorPicker_C_ExecuteUbergraph_ColorPicker, K2Node_Select_Default) == 0x000008, "Member 'ColorPicker_C_ExecuteUbergraph_ColorPicker::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(ColorPicker_C_ExecuteUbergraph_ColorPicker, K2Node_Select_Default_1) == 0x000010, "Member 'ColorPicker_C_ExecuteUbergraph_ColorPicker::K2Node_Select_Default_1' has a wrong offset!");

// Function ColorPicker.ColorPicker_C.BP_OnSwapColorPickerType
// 0x0001 (0x0001 - 0x0000)
struct ColorPicker_C_BP_OnSwapColorPickerType final
{
public:
	bool                                          bToSwatch;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ColorPicker_C_BP_OnSwapColorPickerType) == 0x000001, "Wrong alignment on ColorPicker_C_BP_OnSwapColorPickerType");
static_assert(sizeof(ColorPicker_C_BP_OnSwapColorPickerType) == 0x000001, "Wrong size on ColorPicker_C_BP_OnSwapColorPickerType");
static_assert(offsetof(ColorPicker_C_BP_OnSwapColorPickerType, bToSwatch) == 0x000000, "Member 'ColorPicker_C_BP_OnSwapColorPickerType::bToSwatch' has a wrong offset!");

// Function ColorPicker.ColorPicker_C.OnSetupColorPicker
// 0x0001 (0x0001 - 0x0000)
struct ColorPicker_C_OnSetupColorPicker final
{
public:
	EColorPickerType                              InColorPickerType;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ColorPicker_C_OnSetupColorPicker) == 0x000001, "Wrong alignment on ColorPicker_C_OnSetupColorPicker");
static_assert(sizeof(ColorPicker_C_OnSetupColorPicker) == 0x000001, "Wrong size on ColorPicker_C_OnSetupColorPicker");
static_assert(offsetof(ColorPicker_C_OnSetupColorPicker, InColorPickerType) == 0x000000, "Member 'ColorPicker_C_OnSetupColorPicker::InColorPickerType' has a wrong offset!");

}

