#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CreativeServerBrowser

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CreativeServerBrowser.CreativeServerBrowser_C
// 0x0050 (0x03C0 - 0x0370)
class UCreativeServerBrowser_C final : public UFortServerBrowserCreative
{
public:
	class UIconTextButton_C*                      AddFriendsButton;                                  // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               AddFriendsContent;                                 // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       AddFriendsText;                                    // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCreativeLobbyAdSpace_C*                CreativeLobbyAdSpace;                              // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_158;                                         // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_IdlePulse;                                   // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               IslandCodeContent;                                 // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlayTitle;                                      // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_3;                                        // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CreativeServerBrowser_C">();
	}
	static class UCreativeServerBrowser_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCreativeServerBrowser_C>();
	}
};
static_assert(alignof(UCreativeServerBrowser_C) == 0x000008, "Wrong alignment on UCreativeServerBrowser_C");
static_assert(sizeof(UCreativeServerBrowser_C) == 0x0003C0, "Wrong size on UCreativeServerBrowser_C");
static_assert(offsetof(UCreativeServerBrowser_C, AddFriendsButton) == 0x000370, "Member 'UCreativeServerBrowser_C::AddFriendsButton' has a wrong offset!");
static_assert(offsetof(UCreativeServerBrowser_C, AddFriendsContent) == 0x000378, "Member 'UCreativeServerBrowser_C::AddFriendsContent' has a wrong offset!");
static_assert(offsetof(UCreativeServerBrowser_C, AddFriendsText) == 0x000380, "Member 'UCreativeServerBrowser_C::AddFriendsText' has a wrong offset!");
static_assert(offsetof(UCreativeServerBrowser_C, CreativeLobbyAdSpace) == 0x000388, "Member 'UCreativeServerBrowser_C::CreativeLobbyAdSpace' has a wrong offset!");
static_assert(offsetof(UCreativeServerBrowser_C, Image_158) == 0x000390, "Member 'UCreativeServerBrowser_C::Image_158' has a wrong offset!");
static_assert(offsetof(UCreativeServerBrowser_C, Image_IdlePulse) == 0x000398, "Member 'UCreativeServerBrowser_C::Image_IdlePulse' has a wrong offset!");
static_assert(offsetof(UCreativeServerBrowser_C, IslandCodeContent) == 0x0003A0, "Member 'UCreativeServerBrowser_C::IslandCodeContent' has a wrong offset!");
static_assert(offsetof(UCreativeServerBrowser_C, OverlayTitle) == 0x0003A8, "Member 'UCreativeServerBrowser_C::OverlayTitle' has a wrong offset!");
static_assert(offsetof(UCreativeServerBrowser_C, SafeZone_0) == 0x0003B0, "Member 'UCreativeServerBrowser_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(UCreativeServerBrowser_C, SafeZone_3) == 0x0003B8, "Member 'UCreativeServerBrowser_C::SafeZone_3' has a wrong offset!");

}

