#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Donut_fui_AcquisitionOffer

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Donut_fui_AcquisitionOffer.Donut_fui_AcquisitionOffer_C
// 0x0158 (0x0388 - 0x0230)
class UDonut_fui_AcquisitionOffer_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BattlePassGlow;                                    // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          BorderRarityColored;                               // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          BorderRarityColored_1;                             // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          BottomBorder;                                      // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          BottomBorder_1;                                    // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Check;                                             // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Currency1ItemImage;                                // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Currency1ItemImage_1;                              // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               CustomBadgeOverlay;                                // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MainImage;                                         // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MainImage_1;                                       // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLoadGuard*                       MainImageLoadGuard;                                // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLoadGuard*                       MainImageLoadGuard_1;                              // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       NameText;                                          // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       NameText_1;                                        // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               O_Sale_PreviousPrice;                              // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_7;                                         // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        OwnedSwitcher;                                     // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        OwnedSwitcher_1;                                   // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       OwnedText;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SBPriceBox;                                        // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SBPriceBox_1;                                      // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SBScaleDownArt;                                    // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SBScaleDownArt_1;                                  // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SBTileSize;                                        // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SBTileSize_1;                                      // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ShortDescriptionText;                              // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ShortDescriptionText_1;                            // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextOfferDisplayPrice;                             // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextOfferDisplayPrice_1;                           // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBHeaderAndDescription;                            // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBHeaderAndDescription_1;                          // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_0;                                  // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             DisplayTexture;                                    // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   DisplayTitle;                                      // 0x0348(0x0018)(Edit, BlueprintVisible)
	bool                                          bIsSmallTile;                                      // 0x0360(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_361[0x3];                                      // 0x0361(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Price;                                             // 0x0364(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortRarity                                   Rarity;                                            // 0x0368(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_369[0x7];                                      // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Descr;                                             // 0x0370(0x0018)(Edit, BlueprintVisible)

public:
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void Refresh();
	void ExecuteUbergraph_Donut_fui_AcquisitionOffer(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Donut_fui_AcquisitionOffer_C">();
	}
	static class UDonut_fui_AcquisitionOffer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDonut_fui_AcquisitionOffer_C>();
	}
};
static_assert(alignof(UDonut_fui_AcquisitionOffer_C) == 0x000008, "Wrong alignment on UDonut_fui_AcquisitionOffer_C");
static_assert(sizeof(UDonut_fui_AcquisitionOffer_C) == 0x000388, "Wrong size on UDonut_fui_AcquisitionOffer_C");
static_assert(offsetof(UDonut_fui_AcquisitionOffer_C, UberGraphFrame) == 0x000230, "Member 'UDonut_fui_AcquisitionOffer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDonut_fui_AcquisitionOffer_C, BattlePassGlow) == 0x000238, "Member 'UDonut_fui_AcquisitionOffer_C::BattlePassGlow' has a wrong offset!");
static_assert(offsetof(UDonut_fui_AcquisitionOffer_C, BorderRarityColored) == 0x000240, "Member 'UDonut_fui_AcquisitionOffer_C::BorderRarityColored' has a wrong offset!");
static_assert(offsetof(UDonut_fui_AcquisitionOffer_C, BorderRarityColored_1) == 0x000248, "Member 'UDonut_fui_AcquisitionOffer_C::BorderRarityColored_1' has a wrong offset!");
static_assert(offsetof(UDonut_fui_AcquisitionOffer_C, BottomBorder) == 0x000250, "Member 'UDonut_fui_AcquisitionOffer_C::BottomBorder' has a wrong offset!");
static_assert(offsetof(UDonut_fui_AcquisitionOffer_C, BottomBorder_1) == 0x000258, "Member 'UDonut_fui_AcquisitionOffer_C::BottomBorder_1' has a wrong offset!");
static_assert(offsetof(UDonut_fui_AcquisitionOffer_C, Check) == 0x000260, "Member 'UDonut_fui_AcquisitionOffer_C::Check' has a wrong offset!");
static_assert(offsetof(UDonut_fui_AcquisitionOffer_C, Currency1ItemImage) == 0x000268, "Member 'UDonut_fui_AcquisitionOffer_C::Currency1ItemImage' has a wrong offset!");
static_assert(offsetof(UDonut_fui_AcquisitionOffer_C, Currency1ItemImage_1) == 0x000270, "Member 'UDonut_fui_AcquisitionOffer_C::Currency1ItemImage_1' has a wrong offset!");
static_assert(offsetof(UDonut_fui_AcquisitionOffer_C, CustomBadgeOverlay) == 0x000278, "Member 'UDonut_fui_AcquisitionOffer_C::CustomBadgeOverlay' has a wrong offset!");
static_assert(offsetof(UDonut_fui_AcquisitionOffer_C, MainImage) == 0x000280, "Member 'UDonut_fui_AcquisitionOffer_C::MainImage' has a wrong offset!");
static_assert(offsetof(UDonut_fui_AcquisitionOffer_C, MainImage_1) == 0x000288, "Member 'UDonut_fui_AcquisitionOffer_C::MainImage_1' has a wrong offset!");
static_assert(offsetof(UDonut_fui_AcquisitionOffer_C, MainImageLoadGuard) == 0x000290, "Member 'UDonut_fui_AcquisitionOffer_C::MainImageLoadGuard' has a wrong offset!");
static_assert(offsetof(UDonut_fui_AcquisitionOffer_C, MainImageLoadGuard_1) == 0x000298, "Member 'UDonut_fui_AcquisitionOffer_C::MainImageLoadGuard_1' has a wrong offset!");
static_assert(offsetof(UDonut_fui_AcquisitionOffer_C, NameText) == 0x0002A0, "Member 'UDonut_fui_AcquisitionOffer_C::NameText' has a wrong offset!");
static_assert(offsetof(UDonut_fui_AcquisitionOffer_C, NameText_1) == 0x0002A8, "Member 'UDonut_fui_AcquisitionOffer_C::NameText_1' has a wrong offset!");
static_assert(offsetof(UDonut_fui_AcquisitionOffer_C, O_Sale_PreviousPrice) == 0x0002B0, "Member 'UDonut_fui_AcquisitionOffer_C::O_Sale_PreviousPrice' has a wrong offset!");
static_assert(offsetof(UDonut_fui_AcquisitionOffer_C, Overlay_7) == 0x0002B8, "Member 'UDonut_fui_AcquisitionOffer_C::Overlay_7' has a wrong offset!");
static_assert(offsetof(UDonut_fui_AcquisitionOffer_C, OwnedSwitcher) == 0x0002C0, "Member 'UDonut_fui_AcquisitionOffer_C::OwnedSwitcher' has a wrong offset!");
static_assert(offsetof(UDonut_fui_AcquisitionOffer_C, OwnedSwitcher_1) == 0x0002C8, "Member 'UDonut_fui_AcquisitionOffer_C::OwnedSwitcher_1' has a wrong offset!");
static_assert(offsetof(UDonut_fui_AcquisitionOffer_C, OwnedText) == 0x0002D0, "Member 'UDonut_fui_AcquisitionOffer_C::OwnedText' has a wrong offset!");
static_assert(offsetof(UDonut_fui_AcquisitionOffer_C, SBPriceBox) == 0x0002D8, "Member 'UDonut_fui_AcquisitionOffer_C::SBPriceBox' has a wrong offset!");
static_assert(offsetof(UDonut_fui_AcquisitionOffer_C, SBPriceBox_1) == 0x0002E0, "Member 'UDonut_fui_AcquisitionOffer_C::SBPriceBox_1' has a wrong offset!");
static_assert(offsetof(UDonut_fui_AcquisitionOffer_C, SBScaleDownArt) == 0x0002E8, "Member 'UDonut_fui_AcquisitionOffer_C::SBScaleDownArt' has a wrong offset!");
static_assert(offsetof(UDonut_fui_AcquisitionOffer_C, SBScaleDownArt_1) == 0x0002F0, "Member 'UDonut_fui_AcquisitionOffer_C::SBScaleDownArt_1' has a wrong offset!");
static_assert(offsetof(UDonut_fui_AcquisitionOffer_C, SBTileSize) == 0x0002F8, "Member 'UDonut_fui_AcquisitionOffer_C::SBTileSize' has a wrong offset!");
static_assert(offsetof(UDonut_fui_AcquisitionOffer_C, SBTileSize_1) == 0x000300, "Member 'UDonut_fui_AcquisitionOffer_C::SBTileSize_1' has a wrong offset!");
static_assert(offsetof(UDonut_fui_AcquisitionOffer_C, ShortDescriptionText) == 0x000308, "Member 'UDonut_fui_AcquisitionOffer_C::ShortDescriptionText' has a wrong offset!");
static_assert(offsetof(UDonut_fui_AcquisitionOffer_C, ShortDescriptionText_1) == 0x000310, "Member 'UDonut_fui_AcquisitionOffer_C::ShortDescriptionText_1' has a wrong offset!");
static_assert(offsetof(UDonut_fui_AcquisitionOffer_C, TextOfferDisplayPrice) == 0x000318, "Member 'UDonut_fui_AcquisitionOffer_C::TextOfferDisplayPrice' has a wrong offset!");
static_assert(offsetof(UDonut_fui_AcquisitionOffer_C, TextOfferDisplayPrice_1) == 0x000320, "Member 'UDonut_fui_AcquisitionOffer_C::TextOfferDisplayPrice_1' has a wrong offset!");
static_assert(offsetof(UDonut_fui_AcquisitionOffer_C, VBHeaderAndDescription) == 0x000328, "Member 'UDonut_fui_AcquisitionOffer_C::VBHeaderAndDescription' has a wrong offset!");
static_assert(offsetof(UDonut_fui_AcquisitionOffer_C, VBHeaderAndDescription_1) == 0x000330, "Member 'UDonut_fui_AcquisitionOffer_C::VBHeaderAndDescription_1' has a wrong offset!");
static_assert(offsetof(UDonut_fui_AcquisitionOffer_C, WidgetSwitcher_0) == 0x000338, "Member 'UDonut_fui_AcquisitionOffer_C::WidgetSwitcher_0' has a wrong offset!");
static_assert(offsetof(UDonut_fui_AcquisitionOffer_C, DisplayTexture) == 0x000340, "Member 'UDonut_fui_AcquisitionOffer_C::DisplayTexture' has a wrong offset!");
static_assert(offsetof(UDonut_fui_AcquisitionOffer_C, DisplayTitle) == 0x000348, "Member 'UDonut_fui_AcquisitionOffer_C::DisplayTitle' has a wrong offset!");
static_assert(offsetof(UDonut_fui_AcquisitionOffer_C, bIsSmallTile) == 0x000360, "Member 'UDonut_fui_AcquisitionOffer_C::bIsSmallTile' has a wrong offset!");
static_assert(offsetof(UDonut_fui_AcquisitionOffer_C, Price) == 0x000364, "Member 'UDonut_fui_AcquisitionOffer_C::Price' has a wrong offset!");
static_assert(offsetof(UDonut_fui_AcquisitionOffer_C, Rarity) == 0x000368, "Member 'UDonut_fui_AcquisitionOffer_C::Rarity' has a wrong offset!");
static_assert(offsetof(UDonut_fui_AcquisitionOffer_C, Descr) == 0x000370, "Member 'UDonut_fui_AcquisitionOffer_C::Descr' has a wrong offset!");

}

