#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Earpiece_Gadget_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Earpiece_Gadget_AnimBP.Earpiece_Gadget_AnimBP_C
// 0x00B0 (0x0320 - 0x0270)
class UEarpiece_Gadget_AnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_268[0x8];                                      // 0x0268(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0278(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x02A8(0x0070)()

public:
	void ExecuteUbergraph_Earpiece_Gadget_AnimBP(int32 EntryPoint);
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Earpiece_Gadget_AnimBP_C">();
	}
	static class UEarpiece_Gadget_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEarpiece_Gadget_AnimBP_C>();
	}
};
static_assert(alignof(UEarpiece_Gadget_AnimBP_C) == 0x000010, "Wrong alignment on UEarpiece_Gadget_AnimBP_C");
static_assert(sizeof(UEarpiece_Gadget_AnimBP_C) == 0x000320, "Wrong size on UEarpiece_Gadget_AnimBP_C");
static_assert(offsetof(UEarpiece_Gadget_AnimBP_C, UberGraphFrame) == 0x000270, "Member 'UEarpiece_Gadget_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UEarpiece_Gadget_AnimBP_C, AnimGraphNode_Root) == 0x000278, "Member 'UEarpiece_Gadget_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UEarpiece_Gadget_AnimBP_C, AnimGraphNode_LinkedInputPose) == 0x0002A8, "Member 'UEarpiece_Gadget_AnimBP_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");

}

