#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_Med_Soldier_01_Skeleton_AnimBP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass F_Med_Soldier_01_Skeleton_AnimBP.F_Med_Soldier_01_Skeleton_AnimBP_C
// 0x1100 (0x1520 - 0x0420)
class UF_Med_Soldier_01_Skeleton_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	uint8                                         Pad_418[0x8];                                      // 0x0418(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0420(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	uint8                                         Pad_428[0x8];                                      // 0x0428(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_1;                      // 0x0430(0x0440)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0870(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0890(0x0020)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x08B0(0x0140)(ContainsInstancedReference)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x09F0(0x0030)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics;                        // 0x0A20(0x0440)()
	struct FAnimNode_Constraint                   AnimGraphNode_Constraint;                          // 0x0E60(0x0108)()
	uint8                                         Pad_F68[0x8];                                      // 0x0F68(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x0F70(0x05A0)()
	class USkeletalMeshComponent*                 MeshToCopy;                                        // 0x1510(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_F_Med_Soldier_01_Skeleton_AnimBP(int32 EntryPoint);
	void BlueprintInitializeAnimation();
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"F_Med_Soldier_01_Skeleton_AnimBP_C">();
	}
	static class UF_Med_Soldier_01_Skeleton_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UF_Med_Soldier_01_Skeleton_AnimBP_C>();
	}
};
static_assert(alignof(UF_Med_Soldier_01_Skeleton_AnimBP_C) == 0x000010, "Wrong alignment on UF_Med_Soldier_01_Skeleton_AnimBP_C");
static_assert(sizeof(UF_Med_Soldier_01_Skeleton_AnimBP_C) == 0x001520, "Wrong size on UF_Med_Soldier_01_Skeleton_AnimBP_C");
static_assert(offsetof(UF_Med_Soldier_01_Skeleton_AnimBP_C, UberGraphFrame) == 0x000420, "Member 'UF_Med_Soldier_01_Skeleton_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UF_Med_Soldier_01_Skeleton_AnimBP_C, AnimGraphNode_AnimDynamics_1) == 0x000430, "Member 'UF_Med_Soldier_01_Skeleton_AnimBP_C::AnimGraphNode_AnimDynamics_1' has a wrong offset!");
static_assert(offsetof(UF_Med_Soldier_01_Skeleton_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x000870, "Member 'UF_Med_Soldier_01_Skeleton_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UF_Med_Soldier_01_Skeleton_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x000890, "Member 'UF_Med_Soldier_01_Skeleton_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UF_Med_Soldier_01_Skeleton_AnimBP_C, AnimGraphNode_CopyPoseFromMesh) == 0x0008B0, "Member 'UF_Med_Soldier_01_Skeleton_AnimBP_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UF_Med_Soldier_01_Skeleton_AnimBP_C, AnimGraphNode_Root) == 0x0009F0, "Member 'UF_Med_Soldier_01_Skeleton_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UF_Med_Soldier_01_Skeleton_AnimBP_C, AnimGraphNode_AnimDynamics) == 0x000A20, "Member 'UF_Med_Soldier_01_Skeleton_AnimBP_C::AnimGraphNode_AnimDynamics' has a wrong offset!");
static_assert(offsetof(UF_Med_Soldier_01_Skeleton_AnimBP_C, AnimGraphNode_Constraint) == 0x000E60, "Member 'UF_Med_Soldier_01_Skeleton_AnimBP_C::AnimGraphNode_Constraint' has a wrong offset!");
static_assert(offsetof(UF_Med_Soldier_01_Skeleton_AnimBP_C, AnimGraphNode_RigidBody) == 0x000F70, "Member 'UF_Med_Soldier_01_Skeleton_AnimBP_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(UF_Med_Soldier_01_Skeleton_AnimBP_C, MeshToCopy) == 0x001510, "Member 'UF_Med_Soldier_01_Skeleton_AnimBP_C::MeshToCopy' has a wrong offset!");

}

