#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_MED_Photographer_FaceAcc_CtrlRig

#include "Basic.hpp"

#include "ControlRig_structs.hpp"
#include "ControlRig_classes.hpp"


namespace SDK
{

// ControlRigBlueprintGeneratedClass F_MED_Photographer_FaceAcc_CtrlRig.F_MED_Photographer_FaceAcc_CtrlRig_C
// 0x0E30 (0x1170 - 0x0340)
class UF_MED_Photographer_FaceAcc_CtrlRig_C final : public UControlRig
{
public:
	struct FRigUnit_BeginExecution                BeginExecution;                                    // 0x0340(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_MathQuaternionGetAxis         MathQuaternionGetAxis_0;                           // 0x0370(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_MathVectorSub                 MathVectorSub_0;                                   // 0x03B0(0x0048)(Edit, BlueprintVisible, DisableEditOnInstance)
	uint8                                         Pad_3F8[0x8];                                      // 0x03F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_MathQuaternionFromTwoVectors  MathQuaternionFromTwoVectors_0;                    // 0x0400(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_MathQuaternionMul             MathQuaternionMul_0;                               // 0x0450(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_GetBoneTransform              GetBoneTransform_1;                                // 0x04A0(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_GetBoneTransform              GetBoneTransform_0;                                // 0x0510(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_MathTransformTransformVector  MathTransformTransformVector_0;                    // 0x0580(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_SetBoneRotation               SetBoneRotation_0;                                 // 0x05F0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_DebugTransformMutable         DebugTransformMutable_0;                           // 0x0640(0x00D0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_MathVectorAdd                 MathVectorAdd;                                     // 0x0710(0x0048)(Edit, BlueprintVisible, DisableEditOnInstance)
	uint8                                         Pad_758[0x8];                                      // 0x0758(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_SetBoneTransform              SetBoneTransform;                                  // 0x0760(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_GetBoneTransform              GetBoneTransform;                                  // 0x07D0(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_MathQuaternionToEuler         MathQuaternionToEuler;                             // 0x0840(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_MathFloatMul                  MathFloatMul;                                      // 0x0880(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_MathQuaternionFromEuler       MathQuaternionFromEuler;                           // 0x08B0(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_DebugTransformMutable         DebugTransformMutable_0_0;                         // 0x08F0(0x00D0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_SetBoneTransform              SetBoneTransform_0;                                // 0x09C0(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_MathQuaternionGetAxis         MathQuaternionGetAxis_0_0;                         // 0x0A30(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_MathVectorSub                 MathVectorSub_0_0;                                 // 0x0A70(0x0048)(Edit, BlueprintVisible, DisableEditOnInstance)
	uint8                                         Pad_AB8[0x8];                                      // 0x0AB8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_MathQuaternionFromTwoVectors  MathQuaternionFromTwoVectors_0_0;                  // 0x0AC0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_MathQuaternionMul             MathQuaternionMul_0_0;                             // 0x0B10(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_GetBoneTransform              GetBoneTransform_1_0;                              // 0x0B60(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_GetBoneTransform              GetBoneTransform_0_0;                              // 0x0BD0(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_MathTransformTransformVector  MathTransformTransformVector_0_0;                  // 0x0C40(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_SetBoneRotation               SetBoneRotation_0_0;                               // 0x0CB0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_MathVectorAdd                 MathVectorAdd_0;                                   // 0x0D00(0x0048)(Edit, BlueprintVisible, DisableEditOnInstance)
	uint8                                         Pad_D48[0x8];                                      // 0x0D48(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_GetRelativeBoneTransform      GetRelativeBoneTransform;                          // 0x0D50(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_MathQuaternionToEuler         MathQuaternionToEuler_0;                           // 0x0DC0(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_MathQuaternionFromEuler       MathQuaternionFromEuler_0;                         // 0x0E00(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_MathFloatRemap                MathFloatRemap;                                    // 0x0E40(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_ModifyBoneTransforms          ModifyBoneTransforms;                              // 0x0E80(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance)
	uint8                                         Pad_ED8[0x8];                                      // 0x0ED8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_GetRelativeBoneTransform      GetRelativeBoneTransform_0;                        // 0x0EE0(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_MathQuaternionToEuler         MathQuaternionToEuler_0_0;                         // 0x0F50(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_MathFloatRemap                MathFloatRemap_0;                                  // 0x0F90(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_MathFloatMul                  MathFloatMul_0;                                    // 0x0FD0(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_MathFloatAdd                  MathFloatAdd;                                      // 0x1000(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_ModifyBoneTransforms          ModifyBoneTransforms_0;                            // 0x1030(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance)
	uint8                                         Pad_1088[0x8];                                     // 0x1088(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_MathQuaternionFromEuler       MathQuaternionFromEuler_0_0;                       // 0x1090(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_ModifyBoneTransforms          ModifyBoneTransforms_0_0;                          // 0x10D0(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_MathFloatRemap                MathFloatRemap_1;                                  // 0x1128(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"F_MED_Photographer_FaceAcc_CtrlRig_C">();
	}
	static class UF_MED_Photographer_FaceAcc_CtrlRig_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UF_MED_Photographer_FaceAcc_CtrlRig_C>();
	}
};
static_assert(alignof(UF_MED_Photographer_FaceAcc_CtrlRig_C) == 0x000010, "Wrong alignment on UF_MED_Photographer_FaceAcc_CtrlRig_C");
static_assert(sizeof(UF_MED_Photographer_FaceAcc_CtrlRig_C) == 0x001170, "Wrong size on UF_MED_Photographer_FaceAcc_CtrlRig_C");
static_assert(offsetof(UF_MED_Photographer_FaceAcc_CtrlRig_C, BeginExecution) == 0x000340, "Member 'UF_MED_Photographer_FaceAcc_CtrlRig_C::BeginExecution' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_FaceAcc_CtrlRig_C, MathQuaternionGetAxis_0) == 0x000370, "Member 'UF_MED_Photographer_FaceAcc_CtrlRig_C::MathQuaternionGetAxis_0' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_FaceAcc_CtrlRig_C, MathVectorSub_0) == 0x0003B0, "Member 'UF_MED_Photographer_FaceAcc_CtrlRig_C::MathVectorSub_0' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_FaceAcc_CtrlRig_C, MathQuaternionFromTwoVectors_0) == 0x000400, "Member 'UF_MED_Photographer_FaceAcc_CtrlRig_C::MathQuaternionFromTwoVectors_0' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_FaceAcc_CtrlRig_C, MathQuaternionMul_0) == 0x000450, "Member 'UF_MED_Photographer_FaceAcc_CtrlRig_C::MathQuaternionMul_0' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_FaceAcc_CtrlRig_C, GetBoneTransform_1) == 0x0004A0, "Member 'UF_MED_Photographer_FaceAcc_CtrlRig_C::GetBoneTransform_1' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_FaceAcc_CtrlRig_C, GetBoneTransform_0) == 0x000510, "Member 'UF_MED_Photographer_FaceAcc_CtrlRig_C::GetBoneTransform_0' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_FaceAcc_CtrlRig_C, MathTransformTransformVector_0) == 0x000580, "Member 'UF_MED_Photographer_FaceAcc_CtrlRig_C::MathTransformTransformVector_0' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_FaceAcc_CtrlRig_C, SetBoneRotation_0) == 0x0005F0, "Member 'UF_MED_Photographer_FaceAcc_CtrlRig_C::SetBoneRotation_0' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_FaceAcc_CtrlRig_C, DebugTransformMutable_0) == 0x000640, "Member 'UF_MED_Photographer_FaceAcc_CtrlRig_C::DebugTransformMutable_0' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_FaceAcc_CtrlRig_C, MathVectorAdd) == 0x000710, "Member 'UF_MED_Photographer_FaceAcc_CtrlRig_C::MathVectorAdd' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_FaceAcc_CtrlRig_C, SetBoneTransform) == 0x000760, "Member 'UF_MED_Photographer_FaceAcc_CtrlRig_C::SetBoneTransform' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_FaceAcc_CtrlRig_C, GetBoneTransform) == 0x0007D0, "Member 'UF_MED_Photographer_FaceAcc_CtrlRig_C::GetBoneTransform' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_FaceAcc_CtrlRig_C, MathQuaternionToEuler) == 0x000840, "Member 'UF_MED_Photographer_FaceAcc_CtrlRig_C::MathQuaternionToEuler' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_FaceAcc_CtrlRig_C, MathFloatMul) == 0x000880, "Member 'UF_MED_Photographer_FaceAcc_CtrlRig_C::MathFloatMul' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_FaceAcc_CtrlRig_C, MathQuaternionFromEuler) == 0x0008B0, "Member 'UF_MED_Photographer_FaceAcc_CtrlRig_C::MathQuaternionFromEuler' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_FaceAcc_CtrlRig_C, DebugTransformMutable_0_0) == 0x0008F0, "Member 'UF_MED_Photographer_FaceAcc_CtrlRig_C::DebugTransformMutable_0_0' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_FaceAcc_CtrlRig_C, SetBoneTransform_0) == 0x0009C0, "Member 'UF_MED_Photographer_FaceAcc_CtrlRig_C::SetBoneTransform_0' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_FaceAcc_CtrlRig_C, MathQuaternionGetAxis_0_0) == 0x000A30, "Member 'UF_MED_Photographer_FaceAcc_CtrlRig_C::MathQuaternionGetAxis_0_0' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_FaceAcc_CtrlRig_C, MathVectorSub_0_0) == 0x000A70, "Member 'UF_MED_Photographer_FaceAcc_CtrlRig_C::MathVectorSub_0_0' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_FaceAcc_CtrlRig_C, MathQuaternionFromTwoVectors_0_0) == 0x000AC0, "Member 'UF_MED_Photographer_FaceAcc_CtrlRig_C::MathQuaternionFromTwoVectors_0_0' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_FaceAcc_CtrlRig_C, MathQuaternionMul_0_0) == 0x000B10, "Member 'UF_MED_Photographer_FaceAcc_CtrlRig_C::MathQuaternionMul_0_0' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_FaceAcc_CtrlRig_C, GetBoneTransform_1_0) == 0x000B60, "Member 'UF_MED_Photographer_FaceAcc_CtrlRig_C::GetBoneTransform_1_0' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_FaceAcc_CtrlRig_C, GetBoneTransform_0_0) == 0x000BD0, "Member 'UF_MED_Photographer_FaceAcc_CtrlRig_C::GetBoneTransform_0_0' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_FaceAcc_CtrlRig_C, MathTransformTransformVector_0_0) == 0x000C40, "Member 'UF_MED_Photographer_FaceAcc_CtrlRig_C::MathTransformTransformVector_0_0' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_FaceAcc_CtrlRig_C, SetBoneRotation_0_0) == 0x000CB0, "Member 'UF_MED_Photographer_FaceAcc_CtrlRig_C::SetBoneRotation_0_0' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_FaceAcc_CtrlRig_C, MathVectorAdd_0) == 0x000D00, "Member 'UF_MED_Photographer_FaceAcc_CtrlRig_C::MathVectorAdd_0' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_FaceAcc_CtrlRig_C, GetRelativeBoneTransform) == 0x000D50, "Member 'UF_MED_Photographer_FaceAcc_CtrlRig_C::GetRelativeBoneTransform' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_FaceAcc_CtrlRig_C, MathQuaternionToEuler_0) == 0x000DC0, "Member 'UF_MED_Photographer_FaceAcc_CtrlRig_C::MathQuaternionToEuler_0' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_FaceAcc_CtrlRig_C, MathQuaternionFromEuler_0) == 0x000E00, "Member 'UF_MED_Photographer_FaceAcc_CtrlRig_C::MathQuaternionFromEuler_0' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_FaceAcc_CtrlRig_C, MathFloatRemap) == 0x000E40, "Member 'UF_MED_Photographer_FaceAcc_CtrlRig_C::MathFloatRemap' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_FaceAcc_CtrlRig_C, ModifyBoneTransforms) == 0x000E80, "Member 'UF_MED_Photographer_FaceAcc_CtrlRig_C::ModifyBoneTransforms' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_FaceAcc_CtrlRig_C, GetRelativeBoneTransform_0) == 0x000EE0, "Member 'UF_MED_Photographer_FaceAcc_CtrlRig_C::GetRelativeBoneTransform_0' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_FaceAcc_CtrlRig_C, MathQuaternionToEuler_0_0) == 0x000F50, "Member 'UF_MED_Photographer_FaceAcc_CtrlRig_C::MathQuaternionToEuler_0_0' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_FaceAcc_CtrlRig_C, MathFloatRemap_0) == 0x000F90, "Member 'UF_MED_Photographer_FaceAcc_CtrlRig_C::MathFloatRemap_0' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_FaceAcc_CtrlRig_C, MathFloatMul_0) == 0x000FD0, "Member 'UF_MED_Photographer_FaceAcc_CtrlRig_C::MathFloatMul_0' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_FaceAcc_CtrlRig_C, MathFloatAdd) == 0x001000, "Member 'UF_MED_Photographer_FaceAcc_CtrlRig_C::MathFloatAdd' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_FaceAcc_CtrlRig_C, ModifyBoneTransforms_0) == 0x001030, "Member 'UF_MED_Photographer_FaceAcc_CtrlRig_C::ModifyBoneTransforms_0' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_FaceAcc_CtrlRig_C, MathQuaternionFromEuler_0_0) == 0x001090, "Member 'UF_MED_Photographer_FaceAcc_CtrlRig_C::MathQuaternionFromEuler_0_0' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_FaceAcc_CtrlRig_C, ModifyBoneTransforms_0_0) == 0x0010D0, "Member 'UF_MED_Photographer_FaceAcc_CtrlRig_C::ModifyBoneTransforms_0_0' has a wrong offset!");
static_assert(offsetof(UF_MED_Photographer_FaceAcc_CtrlRig_C, MathFloatRemap_1) == 0x001128, "Member 'UF_MED_Photographer_FaceAcc_CtrlRig_C::MathFloatRemap_1' has a wrong offset!");

}

