#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_MED_Rebirth_Soldier_AnimBP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass F_MED_Rebirth_Soldier_AnimBP.F_MED_Rebirth_Soldier_AnimBP_C
// 0x0F10 (0x1330 - 0x0420)
class UF_MED_Rebirth_Soldier_AnimBP_C final : public UCustomCharacterPartAnimInstance_Rebirth_Soldier_F
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0420(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	uint8                                         Pad_428[0x8];                                      // 0x0428(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_1;                         // 0x0430(0x05A0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x09D0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x09F0(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x0A10(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0B18(0x0108)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x0C20(0x05A0)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x11C0(0x0140)(ContainsInstancedReference)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1300(0x0030)()

public:
	void ExecuteUbergraph_F_MED_Rebirth_Soldier_AnimBP(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"F_MED_Rebirth_Soldier_AnimBP_C">();
	}
	static class UF_MED_Rebirth_Soldier_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UF_MED_Rebirth_Soldier_AnimBP_C>();
	}
};
static_assert(alignof(UF_MED_Rebirth_Soldier_AnimBP_C) == 0x000010, "Wrong alignment on UF_MED_Rebirth_Soldier_AnimBP_C");
static_assert(sizeof(UF_MED_Rebirth_Soldier_AnimBP_C) == 0x001330, "Wrong size on UF_MED_Rebirth_Soldier_AnimBP_C");
static_assert(offsetof(UF_MED_Rebirth_Soldier_AnimBP_C, UberGraphFrame) == 0x000420, "Member 'UF_MED_Rebirth_Soldier_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UF_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_RigidBody_1) == 0x000430, "Member 'UF_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_RigidBody_1' has a wrong offset!");
static_assert(offsetof(UF_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x0009D0, "Member 'UF_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x0009F0, "Member 'UF_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UF_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_ModifyBone_1) == 0x000A10, "Member 'UF_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UF_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_ModifyBone) == 0x000B18, "Member 'UF_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UF_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_RigidBody) == 0x000C20, "Member 'UF_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(UF_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_CopyPoseFromMesh) == 0x0011C0, "Member 'UF_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UF_MED_Rebirth_Soldier_AnimBP_C, AnimGraphNode_Root) == 0x001300, "Member 'UF_MED_Rebirth_Soldier_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");

}

