#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FakeStatsGraphs

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass FakeStatsGraphs.FakeStatsGraphs_C
// 0x0030 (0x0260 - 0x0230)
class UFakeStatsGraphs_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Bar_1;                                             // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Bar_2;                                             // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Bar_3;                                             // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Bar_4;                                             // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Bar_5;                                             // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_FakeStatsGraphs(int32 EntryPoint);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void RandomizePositions();
	void RandomizeTimings();
	void RandomizeTiling();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FakeStatsGraphs_C">();
	}
	static class UFakeStatsGraphs_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFakeStatsGraphs_C>();
	}
};
static_assert(alignof(UFakeStatsGraphs_C) == 0x000008, "Wrong alignment on UFakeStatsGraphs_C");
static_assert(sizeof(UFakeStatsGraphs_C) == 0x000260, "Wrong size on UFakeStatsGraphs_C");
static_assert(offsetof(UFakeStatsGraphs_C, UberGraphFrame) == 0x000230, "Member 'UFakeStatsGraphs_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFakeStatsGraphs_C, Bar_1) == 0x000238, "Member 'UFakeStatsGraphs_C::Bar_1' has a wrong offset!");
static_assert(offsetof(UFakeStatsGraphs_C, Bar_2) == 0x000240, "Member 'UFakeStatsGraphs_C::Bar_2' has a wrong offset!");
static_assert(offsetof(UFakeStatsGraphs_C, Bar_3) == 0x000248, "Member 'UFakeStatsGraphs_C::Bar_3' has a wrong offset!");
static_assert(offsetof(UFakeStatsGraphs_C, Bar_4) == 0x000250, "Member 'UFakeStatsGraphs_C::Bar_4' has a wrong offset!");
static_assert(offsetof(UFakeStatsGraphs_C, Bar_5) == 0x000258, "Member 'UFakeStatsGraphs_C::Bar_5' has a wrong offset!");

}

