#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Feedback

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Feedback.Feedback_C
// 0x00D8 (0x0610 - 0x0538)
class UFeedback_C final : public UFortGameFeedbackBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0538(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           BugCreationChooseComponentVBox;                    // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           BugCreationSignInVBox;                             // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      CancelBug;                                         // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USoloButton_C*                          CancelLogin;                                       // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCloseButton_C*                         CloseButton;                                       // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      CommentButton;                                     // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_0;                                 // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      ContentButton;                                     // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        EntryProgressSwitcher;                             // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           EntryVbox;                                         // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      EpicQABugButton;                                   // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           InteractableVBox;                                  // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULightbox_C*                            Lightbox;                                          // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MainIcon;                                          // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               ProgressSizeBox;                                   // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           ProgressVBox;                                      // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                RootBorder;                                        // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               RootOverlay;                                       // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USoloButton_C*                          SendButton;                                        // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          SubjectContainer;                                  // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      SubmitBug;                                         // 0x05E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USoloButton_C*                          SubmitSignIn;                                      // 0x05F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Title;                                             // 0x05F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          TouchTOCloseZone;                                  // 0x0600(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EFortUIGameFeedbackType                       FeedBackType;                                      // 0x0608(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Feedback(int32 EntryPoint);
	void BndEvt__CloseButton_K2Node_ComponentBoundEvent_7_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void OnBuildBugComponentListComplete();
	void BndEvt__CancelBug_K2Node_ComponentBoundEvent_6_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__SubmitBug_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__SubmitSignIn_K2Node_ComponentBoundEvent_5_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__SendButton_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void OnFeedbackTypeChanged(EFortUIGameFeedbackType FeedBackType_0);
	void HandleTextChanged(const class FText& Text);
	void BndEvt__CancelButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void OnBeginIntro();
	void OnInitiateDebugInfoForFeedbackComplete();
	void Construct();
	void BindDelegates();
	void AddButtonFeedbackTypes();
	bool CanSendFeedback();
	void InitializeFeedback();
	struct FEventReply TouchToClose(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void Update_Send_Button_Enabled();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Feedback_C">();
	}
	static class UFeedback_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFeedback_C>();
	}
};
static_assert(alignof(UFeedback_C) == 0x000008, "Wrong alignment on UFeedback_C");
static_assert(sizeof(UFeedback_C) == 0x000610, "Wrong size on UFeedback_C");
static_assert(offsetof(UFeedback_C, UberGraphFrame) == 0x000538, "Member 'UFeedback_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UFeedback_C, BugCreationChooseComponentVBox) == 0x000540, "Member 'UFeedback_C::BugCreationChooseComponentVBox' has a wrong offset!");
static_assert(offsetof(UFeedback_C, BugCreationSignInVBox) == 0x000548, "Member 'UFeedback_C::BugCreationSignInVBox' has a wrong offset!");
static_assert(offsetof(UFeedback_C, CancelBug) == 0x000550, "Member 'UFeedback_C::CancelBug' has a wrong offset!");
static_assert(offsetof(UFeedback_C, CancelLogin) == 0x000558, "Member 'UFeedback_C::CancelLogin' has a wrong offset!");
static_assert(offsetof(UFeedback_C, CloseButton) == 0x000560, "Member 'UFeedback_C::CloseButton' has a wrong offset!");
static_assert(offsetof(UFeedback_C, CommentButton) == 0x000568, "Member 'UFeedback_C::CommentButton' has a wrong offset!");
static_assert(offsetof(UFeedback_C, CommonTextBlock_0) == 0x000570, "Member 'UFeedback_C::CommonTextBlock_0' has a wrong offset!");
static_assert(offsetof(UFeedback_C, ContentButton) == 0x000578, "Member 'UFeedback_C::ContentButton' has a wrong offset!");
static_assert(offsetof(UFeedback_C, EntryProgressSwitcher) == 0x000580, "Member 'UFeedback_C::EntryProgressSwitcher' has a wrong offset!");
static_assert(offsetof(UFeedback_C, EntryVbox) == 0x000588, "Member 'UFeedback_C::EntryVbox' has a wrong offset!");
static_assert(offsetof(UFeedback_C, EpicQABugButton) == 0x000590, "Member 'UFeedback_C::EpicQABugButton' has a wrong offset!");
static_assert(offsetof(UFeedback_C, Image_0) == 0x000598, "Member 'UFeedback_C::Image_0' has a wrong offset!");
static_assert(offsetof(UFeedback_C, InteractableVBox) == 0x0005A0, "Member 'UFeedback_C::InteractableVBox' has a wrong offset!");
static_assert(offsetof(UFeedback_C, Lightbox) == 0x0005A8, "Member 'UFeedback_C::Lightbox' has a wrong offset!");
static_assert(offsetof(UFeedback_C, MainIcon) == 0x0005B0, "Member 'UFeedback_C::MainIcon' has a wrong offset!");
static_assert(offsetof(UFeedback_C, ProgressSizeBox) == 0x0005B8, "Member 'UFeedback_C::ProgressSizeBox' has a wrong offset!");
static_assert(offsetof(UFeedback_C, ProgressVBox) == 0x0005C0, "Member 'UFeedback_C::ProgressVBox' has a wrong offset!");
static_assert(offsetof(UFeedback_C, RootBorder) == 0x0005C8, "Member 'UFeedback_C::RootBorder' has a wrong offset!");
static_assert(offsetof(UFeedback_C, RootOverlay) == 0x0005D0, "Member 'UFeedback_C::RootOverlay' has a wrong offset!");
static_assert(offsetof(UFeedback_C, SendButton) == 0x0005D8, "Member 'UFeedback_C::SendButton' has a wrong offset!");
static_assert(offsetof(UFeedback_C, SubjectContainer) == 0x0005E0, "Member 'UFeedback_C::SubjectContainer' has a wrong offset!");
static_assert(offsetof(UFeedback_C, SubmitBug) == 0x0005E8, "Member 'UFeedback_C::SubmitBug' has a wrong offset!");
static_assert(offsetof(UFeedback_C, SubmitSignIn) == 0x0005F0, "Member 'UFeedback_C::SubmitSignIn' has a wrong offset!");
static_assert(offsetof(UFeedback_C, Title) == 0x0005F8, "Member 'UFeedback_C::Title' has a wrong offset!");
static_assert(offsetof(UFeedback_C, TouchTOCloseZone) == 0x000600, "Member 'UFeedback_C::TouchTOCloseZone' has a wrong offset!");
static_assert(offsetof(UFeedback_C, FeedBackType) == 0x000608, "Member 'UFeedback_C::FeedBackType' has a wrong offset!");

}

