#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FL_NiagaraVehicleUserVariables

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function FL_NiagaraVehicleUserVariables.FL_NiagaraVehicleUserVariables_C.setNiagaraVehicleUserVariables
// 0x0038 (0x0038 - 0x0000)
struct FL_NiagaraVehicleUserVariables_C_SetNiagaraVehicleUserVariables final
{
public:
	class UNiagaraComponent*                      NiagaraSystem;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableSpawning;                                    // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          InWater;                                           // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          InAir;                                             // 0x000A(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          HasDriver;                                         // 0x000B(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         Boost;                                             // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ForwardSpeed;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TurnDirection;                                     // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TurnSpeed;                                         // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TurningAngle;                                      // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS;                                                // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableSpawn;                                       // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FL_NiagaraVehicleUserVariables_C_SetNiagaraVehicleUserVariables) == 0x000008, "Wrong alignment on FL_NiagaraVehicleUserVariables_C_SetNiagaraVehicleUserVariables");
static_assert(sizeof(FL_NiagaraVehicleUserVariables_C_SetNiagaraVehicleUserVariables) == 0x000038, "Wrong size on FL_NiagaraVehicleUserVariables_C_SetNiagaraVehicleUserVariables");
static_assert(offsetof(FL_NiagaraVehicleUserVariables_C_SetNiagaraVehicleUserVariables, NiagaraSystem) == 0x000000, "Member 'FL_NiagaraVehicleUserVariables_C_SetNiagaraVehicleUserVariables::NiagaraSystem' has a wrong offset!");
static_assert(offsetof(FL_NiagaraVehicleUserVariables_C_SetNiagaraVehicleUserVariables, EnableSpawning) == 0x000008, "Member 'FL_NiagaraVehicleUserVariables_C_SetNiagaraVehicleUserVariables::EnableSpawning' has a wrong offset!");
static_assert(offsetof(FL_NiagaraVehicleUserVariables_C_SetNiagaraVehicleUserVariables, InWater) == 0x000009, "Member 'FL_NiagaraVehicleUserVariables_C_SetNiagaraVehicleUserVariables::InWater' has a wrong offset!");
static_assert(offsetof(FL_NiagaraVehicleUserVariables_C_SetNiagaraVehicleUserVariables, InAir) == 0x00000A, "Member 'FL_NiagaraVehicleUserVariables_C_SetNiagaraVehicleUserVariables::InAir' has a wrong offset!");
static_assert(offsetof(FL_NiagaraVehicleUserVariables_C_SetNiagaraVehicleUserVariables, HasDriver) == 0x00000B, "Member 'FL_NiagaraVehicleUserVariables_C_SetNiagaraVehicleUserVariables::HasDriver' has a wrong offset!");
static_assert(offsetof(FL_NiagaraVehicleUserVariables_C_SetNiagaraVehicleUserVariables, Boost) == 0x00000C, "Member 'FL_NiagaraVehicleUserVariables_C_SetNiagaraVehicleUserVariables::Boost' has a wrong offset!");
static_assert(offsetof(FL_NiagaraVehicleUserVariables_C_SetNiagaraVehicleUserVariables, ForwardSpeed) == 0x000010, "Member 'FL_NiagaraVehicleUserVariables_C_SetNiagaraVehicleUserVariables::ForwardSpeed' has a wrong offset!");
static_assert(offsetof(FL_NiagaraVehicleUserVariables_C_SetNiagaraVehicleUserVariables, TurnDirection) == 0x000014, "Member 'FL_NiagaraVehicleUserVariables_C_SetNiagaraVehicleUserVariables::TurnDirection' has a wrong offset!");
static_assert(offsetof(FL_NiagaraVehicleUserVariables_C_SetNiagaraVehicleUserVariables, TurnSpeed) == 0x000018, "Member 'FL_NiagaraVehicleUserVariables_C_SetNiagaraVehicleUserVariables::TurnSpeed' has a wrong offset!");
static_assert(offsetof(FL_NiagaraVehicleUserVariables_C_SetNiagaraVehicleUserVariables, TurningAngle) == 0x00001C, "Member 'FL_NiagaraVehicleUserVariables_C_SetNiagaraVehicleUserVariables::TurningAngle' has a wrong offset!");
static_assert(offsetof(FL_NiagaraVehicleUserVariables_C_SetNiagaraVehicleUserVariables, __WorldContext) == 0x000020, "Member 'FL_NiagaraVehicleUserVariables_C_SetNiagaraVehicleUserVariables::__WorldContext' has a wrong offset!");
static_assert(offsetof(FL_NiagaraVehicleUserVariables_C_SetNiagaraVehicleUserVariables, NS) == 0x000028, "Member 'FL_NiagaraVehicleUserVariables_C_SetNiagaraVehicleUserVariables::NS' has a wrong offset!");
static_assert(offsetof(FL_NiagaraVehicleUserVariables_C_SetNiagaraVehicleUserVariables, EnableSpawn) == 0x000030, "Member 'FL_NiagaraVehicleUserVariables_C_SetNiagaraVehicleUserVariables::EnableSpawn' has a wrong offset!");

// Function FL_NiagaraVehicleUserVariables.FL_NiagaraVehicleUserVariables_C.setNiagaraPontoonUserVariables
// 0x0150 (0x0150 - 0x0000)
struct FL_NiagaraVehicleUserVariables_C_SetNiagaraPontoonUserVariables final
{
public:
	class UNiagaraComponent*                      Niagara;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVehicleSphericalPontoon               Pontoon;                                           // 0x0010(0x0130)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                __WorldContext;                                    // 0x0140(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS;                                                // 0x0148(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FL_NiagaraVehicleUserVariables_C_SetNiagaraPontoonUserVariables) == 0x000010, "Wrong alignment on FL_NiagaraVehicleUserVariables_C_SetNiagaraPontoonUserVariables");
static_assert(sizeof(FL_NiagaraVehicleUserVariables_C_SetNiagaraPontoonUserVariables) == 0x000150, "Wrong size on FL_NiagaraVehicleUserVariables_C_SetNiagaraPontoonUserVariables");
static_assert(offsetof(FL_NiagaraVehicleUserVariables_C_SetNiagaraPontoonUserVariables, Niagara) == 0x000000, "Member 'FL_NiagaraVehicleUserVariables_C_SetNiagaraPontoonUserVariables::Niagara' has a wrong offset!");
static_assert(offsetof(FL_NiagaraVehicleUserVariables_C_SetNiagaraPontoonUserVariables, Pontoon) == 0x000010, "Member 'FL_NiagaraVehicleUserVariables_C_SetNiagaraPontoonUserVariables::Pontoon' has a wrong offset!");
static_assert(offsetof(FL_NiagaraVehicleUserVariables_C_SetNiagaraPontoonUserVariables, __WorldContext) == 0x000140, "Member 'FL_NiagaraVehicleUserVariables_C_SetNiagaraPontoonUserVariables::__WorldContext' has a wrong offset!");
static_assert(offsetof(FL_NiagaraVehicleUserVariables_C_SetNiagaraPontoonUserVariables, NS) == 0x000148, "Member 'FL_NiagaraVehicleUserVariables_C_SetNiagaraPontoonUserVariables::NS' has a wrong offset!");

// Function FL_NiagaraVehicleUserVariables.FL_NiagaraVehicleUserVariables_C.niagaraPontoonModule
// 0x0260 (0x0260 - 0x0000)
struct FL_NiagaraVehicleUserVariables_C_NiagaraPontoonModule final
{
public:
	class UNiagaraComponent*                      Niagara;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVehicleSphericalPontoon               Pontoon;                                           // 0x0010(0x0130)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                __WorldContext;                                    // 0x0140(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS;                                                // 0x0148(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_1;          // 0x0160(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x01A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_2;          // 0x01C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_3;          // 0x01D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x01E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x01F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_6;              // 0x0200(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_7;              // 0x0210(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_4;          // 0x0220(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_2;          // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_8;              // 0x0238(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_9;              // 0x0248(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_3;          // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FL_NiagaraVehicleUserVariables_C_NiagaraPontoonModule) == 0x000010, "Wrong alignment on FL_NiagaraVehicleUserVariables_C_NiagaraPontoonModule");
static_assert(sizeof(FL_NiagaraVehicleUserVariables_C_NiagaraPontoonModule) == 0x000260, "Wrong size on FL_NiagaraVehicleUserVariables_C_NiagaraPontoonModule");
static_assert(offsetof(FL_NiagaraVehicleUserVariables_C_NiagaraPontoonModule, Niagara) == 0x000000, "Member 'FL_NiagaraVehicleUserVariables_C_NiagaraPontoonModule::Niagara' has a wrong offset!");
static_assert(offsetof(FL_NiagaraVehicleUserVariables_C_NiagaraPontoonModule, Pontoon) == 0x000010, "Member 'FL_NiagaraVehicleUserVariables_C_NiagaraPontoonModule::Pontoon' has a wrong offset!");
static_assert(offsetof(FL_NiagaraVehicleUserVariables_C_NiagaraPontoonModule, __WorldContext) == 0x000140, "Member 'FL_NiagaraVehicleUserVariables_C_NiagaraPontoonModule::__WorldContext' has a wrong offset!");
static_assert(offsetof(FL_NiagaraVehicleUserVariables_C_NiagaraPontoonModule, NS) == 0x000148, "Member 'FL_NiagaraVehicleUserVariables_C_NiagaraPontoonModule::NS' has a wrong offset!");
static_assert(offsetof(FL_NiagaraVehicleUserVariables_C_NiagaraPontoonModule, CallFunc_Conv_NameToString_ReturnValue) == 0x000150, "Member 'FL_NiagaraVehicleUserVariables_C_NiagaraPontoonModule::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_NiagaraVehicleUserVariables_C_NiagaraPontoonModule, CallFunc_Conv_NameToString_ReturnValue_1) == 0x000160, "Member 'FL_NiagaraVehicleUserVariables_C_NiagaraPontoonModule::CallFunc_Conv_NameToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FL_NiagaraVehicleUserVariables_C_NiagaraPontoonModule, CallFunc_Concat_StrStr_ReturnValue) == 0x000170, "Member 'FL_NiagaraVehicleUserVariables_C_NiagaraPontoonModule::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_NiagaraVehicleUserVariables_C_NiagaraPontoonModule, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000180, "Member 'FL_NiagaraVehicleUserVariables_C_NiagaraPontoonModule::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FL_NiagaraVehicleUserVariables_C_NiagaraPontoonModule, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000190, "Member 'FL_NiagaraVehicleUserVariables_C_NiagaraPontoonModule::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FL_NiagaraVehicleUserVariables_C_NiagaraPontoonModule, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0001A0, "Member 'FL_NiagaraVehicleUserVariables_C_NiagaraPontoonModule::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FL_NiagaraVehicleUserVariables_C_NiagaraPontoonModule, CallFunc_Conv_StringToName_ReturnValue) == 0x0001B0, "Member 'FL_NiagaraVehicleUserVariables_C_NiagaraPontoonModule::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_NiagaraVehicleUserVariables_C_NiagaraPontoonModule, CallFunc_Conv_StringToName_ReturnValue_1) == 0x0001B8, "Member 'FL_NiagaraVehicleUserVariables_C_NiagaraPontoonModule::CallFunc_Conv_StringToName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FL_NiagaraVehicleUserVariables_C_NiagaraPontoonModule, CallFunc_Conv_NameToString_ReturnValue_2) == 0x0001C0, "Member 'FL_NiagaraVehicleUserVariables_C_NiagaraPontoonModule::CallFunc_Conv_NameToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FL_NiagaraVehicleUserVariables_C_NiagaraPontoonModule, CallFunc_Conv_NameToString_ReturnValue_3) == 0x0001D0, "Member 'FL_NiagaraVehicleUserVariables_C_NiagaraPontoonModule::CallFunc_Conv_NameToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(FL_NiagaraVehicleUserVariables_C_NiagaraPontoonModule, CallFunc_Concat_StrStr_ReturnValue_4) == 0x0001E0, "Member 'FL_NiagaraVehicleUserVariables_C_NiagaraPontoonModule::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(FL_NiagaraVehicleUserVariables_C_NiagaraPontoonModule, CallFunc_Concat_StrStr_ReturnValue_5) == 0x0001F0, "Member 'FL_NiagaraVehicleUserVariables_C_NiagaraPontoonModule::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(FL_NiagaraVehicleUserVariables_C_NiagaraPontoonModule, CallFunc_Concat_StrStr_ReturnValue_6) == 0x000200, "Member 'FL_NiagaraVehicleUserVariables_C_NiagaraPontoonModule::CallFunc_Concat_StrStr_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(FL_NiagaraVehicleUserVariables_C_NiagaraPontoonModule, CallFunc_Concat_StrStr_ReturnValue_7) == 0x000210, "Member 'FL_NiagaraVehicleUserVariables_C_NiagaraPontoonModule::CallFunc_Concat_StrStr_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(FL_NiagaraVehicleUserVariables_C_NiagaraPontoonModule, CallFunc_Conv_NameToString_ReturnValue_4) == 0x000220, "Member 'FL_NiagaraVehicleUserVariables_C_NiagaraPontoonModule::CallFunc_Conv_NameToString_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(FL_NiagaraVehicleUserVariables_C_NiagaraPontoonModule, CallFunc_Conv_StringToName_ReturnValue_2) == 0x000230, "Member 'FL_NiagaraVehicleUserVariables_C_NiagaraPontoonModule::CallFunc_Conv_StringToName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FL_NiagaraVehicleUserVariables_C_NiagaraPontoonModule, CallFunc_Concat_StrStr_ReturnValue_8) == 0x000238, "Member 'FL_NiagaraVehicleUserVariables_C_NiagaraPontoonModule::CallFunc_Concat_StrStr_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(FL_NiagaraVehicleUserVariables_C_NiagaraPontoonModule, CallFunc_Concat_StrStr_ReturnValue_9) == 0x000248, "Member 'FL_NiagaraVehicleUserVariables_C_NiagaraPontoonModule::CallFunc_Concat_StrStr_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(FL_NiagaraVehicleUserVariables_C_NiagaraPontoonModule, CallFunc_Conv_StringToName_ReturnValue_3) == 0x000258, "Member 'FL_NiagaraVehicleUserVariables_C_NiagaraPontoonModule::CallFunc_Conv_StringToName_ReturnValue_3' has a wrong offset!");

// Function FL_NiagaraVehicleUserVariables.FL_NiagaraVehicleUserVariables_C.setNiagaraSkydiveUserVariables
// 0x0030 (0x0030 - 0x0000)
struct FL_NiagaraVehicleUserVariables_C_SetNiagaraSkydiveUserVariables final
{
public:
	class UNiagaraComponent*                      Niagara;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Velocity;                                          // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AccumulatedSpeed;                                  // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FL_NiagaraVehicleUserVariables_C_SetNiagaraSkydiveUserVariables) == 0x000008, "Wrong alignment on FL_NiagaraVehicleUserVariables_C_SetNiagaraSkydiveUserVariables");
static_assert(sizeof(FL_NiagaraVehicleUserVariables_C_SetNiagaraSkydiveUserVariables) == 0x000030, "Wrong size on FL_NiagaraVehicleUserVariables_C_SetNiagaraSkydiveUserVariables");
static_assert(offsetof(FL_NiagaraVehicleUserVariables_C_SetNiagaraSkydiveUserVariables, Niagara) == 0x000000, "Member 'FL_NiagaraVehicleUserVariables_C_SetNiagaraSkydiveUserVariables::Niagara' has a wrong offset!");
static_assert(offsetof(FL_NiagaraVehicleUserVariables_C_SetNiagaraSkydiveUserVariables, Velocity) == 0x000008, "Member 'FL_NiagaraVehicleUserVariables_C_SetNiagaraSkydiveUserVariables::Velocity' has a wrong offset!");
static_assert(offsetof(FL_NiagaraVehicleUserVariables_C_SetNiagaraSkydiveUserVariables, __WorldContext) == 0x000018, "Member 'FL_NiagaraVehicleUserVariables_C_SetNiagaraSkydiveUserVariables::__WorldContext' has a wrong offset!");
static_assert(offsetof(FL_NiagaraVehicleUserVariables_C_SetNiagaraSkydiveUserVariables, AccumulatedSpeed) == 0x000020, "Member 'FL_NiagaraVehicleUserVariables_C_SetNiagaraSkydiveUserVariables::AccumulatedSpeed' has a wrong offset!");
static_assert(offsetof(FL_NiagaraVehicleUserVariables_C_SetNiagaraSkydiveUserVariables, CallFunc_VSize_ReturnValue) == 0x000024, "Member 'FL_NiagaraVehicleUserVariables_C_SetNiagaraSkydiveUserVariables::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(FL_NiagaraVehicleUserVariables_C_SetNiagaraSkydiveUserVariables, CallFunc_MapRangeClamped_ReturnValue) == 0x000028, "Member 'FL_NiagaraVehicleUserVariables_C_SetNiagaraSkydiveUserVariables::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");

}

