#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Frontend_BP12_Room_M_Scripting

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Frontend_BP12_Room_M_Scripting.Frontend_BP12_Room_M_Scripting_C.ExecuteUbergraph_Frontend_BP12_Room_M_Scripting
// 0x0078 (0x0078 - 0x0000)
struct Frontend_BP12_Room_M_Scripting_C_ExecuteUbergraph_Frontend_BP12_Room_M_Scripting final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  CallFunc_GetFirstLocalFortPlayerController_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAsyncAction_SendQuestStatEvent*    CallFunc_SendClientStatEvent_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Frontend_BP12_Room_M_Scripting_C_ExecuteUbergraph_Frontend_BP12_Room_M_Scripting) == 0x000008, "Wrong alignment on Frontend_BP12_Room_M_Scripting_C_ExecuteUbergraph_Frontend_BP12_Room_M_Scripting");
static_assert(sizeof(Frontend_BP12_Room_M_Scripting_C_ExecuteUbergraph_Frontend_BP12_Room_M_Scripting) == 0x000078, "Wrong size on Frontend_BP12_Room_M_Scripting_C_ExecuteUbergraph_Frontend_BP12_Room_M_Scripting");
static_assert(offsetof(Frontend_BP12_Room_M_Scripting_C_ExecuteUbergraph_Frontend_BP12_Room_M_Scripting, EntryPoint) == 0x000000, "Member 'Frontend_BP12_Room_M_Scripting_C_ExecuteUbergraph_Frontend_BP12_Room_M_Scripting::EntryPoint' has a wrong offset!");
static_assert(offsetof(Frontend_BP12_Room_M_Scripting_C_ExecuteUbergraph_Frontend_BP12_Room_M_Scripting, CallFunc_GetFirstLocalFortPlayerController_ReturnValue) == 0x000008, "Member 'Frontend_BP12_Room_M_Scripting_C_ExecuteUbergraph_Frontend_BP12_Room_M_Scripting::CallFunc_GetFirstLocalFortPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Frontend_BP12_Room_M_Scripting_C_ExecuteUbergraph_Frontend_BP12_Room_M_Scripting, CallFunc_GetQuestManager_ReturnValue) == 0x000010, "Member 'Frontend_BP12_Room_M_Scripting_C_ExecuteUbergraph_Frontend_BP12_Room_M_Scripting::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Frontend_BP12_Room_M_Scripting_C_ExecuteUbergraph_Frontend_BP12_Room_M_Scripting, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'Frontend_BP12_Room_M_Scripting_C_ExecuteUbergraph_Frontend_BP12_Room_M_Scripting::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Frontend_BP12_Room_M_Scripting_C_ExecuteUbergraph_Frontend_BP12_Room_M_Scripting, K2Node_CreateDelegate_OutputDelegate_1) == 0x000028, "Member 'Frontend_BP12_Room_M_Scripting_C_ExecuteUbergraph_Frontend_BP12_Room_M_Scripting::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Frontend_BP12_Room_M_Scripting_C_ExecuteUbergraph_Frontend_BP12_Room_M_Scripting, K2Node_CreateDelegate_OutputDelegate_2) == 0x000038, "Member 'Frontend_BP12_Room_M_Scripting_C_ExecuteUbergraph_Frontend_BP12_Room_M_Scripting::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Frontend_BP12_Room_M_Scripting_C_ExecuteUbergraph_Frontend_BP12_Room_M_Scripting, K2Node_CreateDelegate_OutputDelegate_3) == 0x000048, "Member 'Frontend_BP12_Room_M_Scripting_C_ExecuteUbergraph_Frontend_BP12_Room_M_Scripting::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(Frontend_BP12_Room_M_Scripting_C_ExecuteUbergraph_Frontend_BP12_Room_M_Scripting, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000058, "Member 'Frontend_BP12_Room_M_Scripting_C_ExecuteUbergraph_Frontend_BP12_Room_M_Scripting::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Frontend_BP12_Room_M_Scripting_C_ExecuteUbergraph_Frontend_BP12_Room_M_Scripting, CallFunc_SendClientStatEvent_ReturnValue) == 0x000068, "Member 'Frontend_BP12_Room_M_Scripting_C_ExecuteUbergraph_Frontend_BP12_Room_M_Scripting::CallFunc_SendClientStatEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Frontend_BP12_Room_M_Scripting_C_ExecuteUbergraph_Frontend_BP12_Room_M_Scripting, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'Frontend_BP12_Room_M_Scripting_C_ExecuteUbergraph_Frontend_BP12_Room_M_Scripting::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

