#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_Throw_SneakySnowmanV2

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GA_Athena_Throw_SneakySnowmanV2.GA_Athena_Throw_SneakySnowmanV2_C.ExecuteUbergraph_GA_Athena_Throw_SneakySnowmanV2
// 0x0020 (0x0020 - 0x0000)
struct GA_Athena_Throw_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Throw_SneakySnowmanV2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1; // 0x000C(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Throw_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Throw_SneakySnowmanV2) == 0x000004, "Wrong alignment on GA_Athena_Throw_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Throw_SneakySnowmanV2");
static_assert(sizeof(GA_Athena_Throw_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Throw_SneakySnowmanV2) == 0x000020, "Wrong size on GA_Athena_Throw_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Throw_SneakySnowmanV2");
static_assert(offsetof(GA_Athena_Throw_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Throw_SneakySnowmanV2, EntryPoint) == 0x000000, "Member 'GA_Athena_Throw_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Throw_SneakySnowmanV2::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Athena_Throw_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Throw_SneakySnowmanV2, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000004, "Member 'GA_Athena_Throw_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Throw_SneakySnowmanV2::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Throw_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Throw_SneakySnowmanV2, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1) == 0x00000C, "Member 'GA_Athena_Throw_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Throw_SneakySnowmanV2::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Throw_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Throw_SneakySnowmanV2, CallFunc_MakeVector_ReturnValue) == 0x000014, "Member 'GA_Athena_Throw_SneakySnowmanV2_C_ExecuteUbergraph_GA_Athena_Throw_SneakySnowmanV2::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

// Function GA_Athena_Throw_SneakySnowmanV2.GA_Athena_Throw_SneakySnowmanV2_C.SpawnLocationAndRotation
// 0x00A0 (0x00A0 - 0x0000)
struct GA_Athena_Throw_SneakySnowmanV2_C_SpawnLocationAndRotation final
{
public:
	struct FVector                                OutLoc;                                            // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               OutRot;                                            // 0x000C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FSoftClassPath                         GolfCart;                                          // 0x0018(0x0018)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                Temp_struct_Variable;                              // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_Conv_SoftClassReferenceToClass_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetVehicleActor_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsActor;                   // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ClassIsChildOf_ReturnValue;               // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A[0x2];                                       // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default;                             // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_Throw_SneakySnowmanV2_C_SpawnLocationAndRotation) == 0x000008, "Wrong alignment on GA_Athena_Throw_SneakySnowmanV2_C_SpawnLocationAndRotation");
static_assert(sizeof(GA_Athena_Throw_SneakySnowmanV2_C_SpawnLocationAndRotation) == 0x0000A0, "Wrong size on GA_Athena_Throw_SneakySnowmanV2_C_SpawnLocationAndRotation");
static_assert(offsetof(GA_Athena_Throw_SneakySnowmanV2_C_SpawnLocationAndRotation, OutLoc) == 0x000000, "Member 'GA_Athena_Throw_SneakySnowmanV2_C_SpawnLocationAndRotation::OutLoc' has a wrong offset!");
static_assert(offsetof(GA_Athena_Throw_SneakySnowmanV2_C_SpawnLocationAndRotation, OutRot) == 0x00000C, "Member 'GA_Athena_Throw_SneakySnowmanV2_C_SpawnLocationAndRotation::OutRot' has a wrong offset!");
static_assert(offsetof(GA_Athena_Throw_SneakySnowmanV2_C_SpawnLocationAndRotation, GolfCart) == 0x000018, "Member 'GA_Athena_Throw_SneakySnowmanV2_C_SpawnLocationAndRotation::GolfCart' has a wrong offset!");
static_assert(offsetof(GA_Athena_Throw_SneakySnowmanV2_C_SpawnLocationAndRotation, Temp_struct_Variable) == 0x000030, "Member 'GA_Athena_Throw_SneakySnowmanV2_C_SpawnLocationAndRotation::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_Throw_SneakySnowmanV2_C_SpawnLocationAndRotation, Temp_bool_Variable) == 0x00003C, "Member 'GA_Athena_Throw_SneakySnowmanV2_C_SpawnLocationAndRotation::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_Throw_SneakySnowmanV2_C_SpawnLocationAndRotation, CallFunc_Conv_SoftClassReferenceToClass_ReturnValue) == 0x000040, "Member 'GA_Athena_Throw_SneakySnowmanV2_C_SpawnLocationAndRotation::CallFunc_Conv_SoftClassReferenceToClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Throw_SneakySnowmanV2_C_SpawnLocationAndRotation, CallFunc_GetVehicleActor_ReturnValue) == 0x000048, "Member 'GA_Athena_Throw_SneakySnowmanV2_C_SpawnLocationAndRotation::CallFunc_GetVehicleActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Throw_SneakySnowmanV2_C_SpawnLocationAndRotation, K2Node_ClassDynamicCast_AsActor) == 0x000050, "Member 'GA_Athena_Throw_SneakySnowmanV2_C_SpawnLocationAndRotation::K2Node_ClassDynamicCast_AsActor' has a wrong offset!");
static_assert(offsetof(GA_Athena_Throw_SneakySnowmanV2_C_SpawnLocationAndRotation, K2Node_ClassDynamicCast_bSuccess) == 0x000058, "Member 'GA_Athena_Throw_SneakySnowmanV2_C_SpawnLocationAndRotation::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Athena_Throw_SneakySnowmanV2_C_SpawnLocationAndRotation, CallFunc_GetObjectClass_ReturnValue) == 0x000060, "Member 'GA_Athena_Throw_SneakySnowmanV2_C_SpawnLocationAndRotation::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Throw_SneakySnowmanV2_C_SpawnLocationAndRotation, CallFunc_IsValid_ReturnValue) == 0x000068, "Member 'GA_Athena_Throw_SneakySnowmanV2_C_SpawnLocationAndRotation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Throw_SneakySnowmanV2_C_SpawnLocationAndRotation, CallFunc_ClassIsChildOf_ReturnValue) == 0x000069, "Member 'GA_Athena_Throw_SneakySnowmanV2_C_SpawnLocationAndRotation::CallFunc_ClassIsChildOf_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Throw_SneakySnowmanV2_C_SpawnLocationAndRotation, CallFunc_GetActorForwardVector_ReturnValue) == 0x00006C, "Member 'GA_Athena_Throw_SneakySnowmanV2_C_SpawnLocationAndRotation::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Throw_SneakySnowmanV2_C_SpawnLocationAndRotation, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000078, "Member 'GA_Athena_Throw_SneakySnowmanV2_C_SpawnLocationAndRotation::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Throw_SneakySnowmanV2_C_SpawnLocationAndRotation, CallFunc_Add_VectorVector_ReturnValue) == 0x000084, "Member 'GA_Athena_Throw_SneakySnowmanV2_C_SpawnLocationAndRotation::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Throw_SneakySnowmanV2_C_SpawnLocationAndRotation, K2Node_Select_Default) == 0x000090, "Member 'GA_Athena_Throw_SneakySnowmanV2_C_SpawnLocationAndRotation::K2Node_Select_Default' has a wrong offset!");

// Function GA_Athena_Throw_SneakySnowmanV2.GA_Athena_Throw_SneakySnowmanV2_C.K2_CanActivateAbility
// 0x0068 (0x0068 - 0x0000)
struct GA_Athena_Throw_SneakySnowmanV2_C_K2_CanActivateAbility final
{
public:
	struct FGameplayAbilityActorInfo              ActorInfo;                                         // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	struct FGameplayTagContainer                  RelevantTags;                                      // 0x0040(0x0020)(Parm, OutParm)
	bool                                          ReturnValue;                                       // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Athena_Throw_SneakySnowmanV2_C_K2_CanActivateAbility) == 0x000008, "Wrong alignment on GA_Athena_Throw_SneakySnowmanV2_C_K2_CanActivateAbility");
static_assert(sizeof(GA_Athena_Throw_SneakySnowmanV2_C_K2_CanActivateAbility) == 0x000068, "Wrong size on GA_Athena_Throw_SneakySnowmanV2_C_K2_CanActivateAbility");
static_assert(offsetof(GA_Athena_Throw_SneakySnowmanV2_C_K2_CanActivateAbility, ActorInfo) == 0x000000, "Member 'GA_Athena_Throw_SneakySnowmanV2_C_K2_CanActivateAbility::ActorInfo' has a wrong offset!");
static_assert(offsetof(GA_Athena_Throw_SneakySnowmanV2_C_K2_CanActivateAbility, RelevantTags) == 0x000040, "Member 'GA_Athena_Throw_SneakySnowmanV2_C_K2_CanActivateAbility::RelevantTags' has a wrong offset!");
static_assert(offsetof(GA_Athena_Throw_SneakySnowmanV2_C_K2_CanActivateAbility, ReturnValue) == 0x000060, "Member 'GA_Athena_Throw_SneakySnowmanV2_C_K2_CanActivateAbility::ReturnValue' has a wrong offset!");

}

