#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_HookDestroy

#include "Basic.hpp"

#include "ToyAngleSelectorInfo_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GA_Athena_HookDestroy.GA_Athena_HookDestroy_C.ExecuteUbergraph_GA_Athena_HookDestroy
// 0x0838 (0x0838 - 0x0000)
struct GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEvaluateCurveTableResult                     CallFunc_EvaluateCurveTableRow_OutResult;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateCurveTableRow_OutXY;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_Payload_2;                      // 0x0018(0x00B0)()
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate;              // 0x00C8(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayEventData                     Temp_struct_Variable;                              // 0x00D8(0x00B0)()
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue;            // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AB_Prj_Hook_Athena_C*                   K2Node_DynamicCast_AsB_Prj_Hook_Athena;            // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A1[0x3];                                      // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x01A4(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   CallFunc_PickGrappleMontage_SectionName;           // 0x01B4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_14;                  // 0x01BC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_13;                  // 0x01C4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x01CC(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_12;                  // 0x01DC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x01E4(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_11;                  // 0x01F4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x01FC(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_10;                  // 0x020C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_5;            // 0x0214(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable_1;                              // 0x0224(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x022C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_Payload_1;                      // 0x0240(0x00B0)()
	struct FGameplayEventData                     Temp_struct_Variable_1;                            // 0x02F0(0x00B0)()
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue_1;          // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A9[0x3];                                      // 0x03A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_7;            // 0x03AC(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_9;                   // 0x03BC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_8;                   // 0x03C4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_8;            // 0x03CC(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_7;                   // 0x03DC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_9;            // 0x03E4(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_6;                   // 0x03F4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_10;           // 0x03FC(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_5;                   // 0x040C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_11;           // 0x0414(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable_2;                              // 0x0424(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_12;           // 0x042C(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x043C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x0444(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_13;           // 0x044C(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x045C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_14;           // 0x0464(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x0474(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_15;           // 0x047C(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x048C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_16;           // 0x0494(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable_3;                              // 0x04A4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_17;           // 0x04AC(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_4BC[0x4];                                      // 0x04BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_Payload;                        // 0x04C0(0x00B0)()
	struct FGameplayEventData                     Temp_struct_Variable_2;                            // 0x0570(0x00B0)()
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue_2;          // 0x0620(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0628(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_629[0x3];                                      // 0x0629(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_18;           // 0x062C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_63C[0x4];                                      // 0x063C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_NetworkSyncPoint*          CallFunc_WaitNetSync_ReturnValue;                  // 0x0640(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0648(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0649(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x064A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x064B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_19;           // 0x064C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x065C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x065D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65E[0x2];                                      // 0x065E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x0660(0x0040)(ContainsInstancedReference)
	bool                                          CallFunc_IsServer_ReturnValue_1;                   // 0x06A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A1[0x7];                                      // 0x06A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x06A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x06B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B1[0x7];                                      // 0x06B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x06B8(0x0028)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x06E0(0x0010)(ZeroConstructor, ReferenceParm)
	class FName                                   K2Node_CustomEvent_NotifyName_18;                  // 0x06F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortWeapon*                            CallFunc_GetCurrentSourceWeapon_ReturnValue;       // 0x06F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  CallFunc_GetInventoryGUID_ReturnValue;             // 0x0700(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  CallFunc_GetFortPlayerControllerFromActor_ReturnValue; // 0x0710(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_K2_RemoveItemFromPlayerByGuid_ReturnValue; // 0x0718(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71C[0x4];                                      // 0x071C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x0720(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_20;           // 0x0728(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0738(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_739[0x3];                                      // 0x0739(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_15;                  // 0x073C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_744[0x4];                                      // 0x0744(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1; // 0x0748(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0750(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_751[0x3];                                      // 0x0751(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetLocalMagazineAmmoCount_ReturnValue;    // 0x0754(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_19;                  // 0x0758(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0760(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_761[0x3];                                      // 0x0761(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_21;           // 0x0764(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_774[0x4];                                      // 0x0774(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_2; // 0x0778(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0780(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_781[0x3];                                      // 0x0781(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_16;                  // 0x0784(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_78C[0x4];                                      // 0x078C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortWeapon*                            CallFunc_GetCurrentSourceWeapon_ReturnValue_1;     // 0x0790(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0798(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x07A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAbilitySystemComponent*            K2Node_DynamicCast_AsFort_Ability_System_Component; // 0x07A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x07B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B1[0x7];                                      // 0x07B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AB_Hookgun_Athena_C*                    K2Node_DynamicCast_AsB_Hookgun_Athena;             // 0x07B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x07C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C1[0x3];                                      // 0x07C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_22;           // 0x07C4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_7D4[0x4];                                      // 0x07D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetVehicleActor_ReturnValue;              // 0x07D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortAthenaJackalVehicle*               K2Node_DynamicCast_AsFort_Athena_Jackal_Vehicle;   // 0x07E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x07E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E9[0x7];                                      // 0x07E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_3; // 0x07F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x07F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x07F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7FA[0x6];                                      // 0x07FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_GetCurrentMontage_ReturnValue;            // 0x0800(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_GetCurrentMontage_ReturnValue_1;          // 0x0808(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0810(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0811(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_812[0x2];                                      // 0x0812(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_17;                  // 0x0814(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_23;           // 0x081C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x082C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82D[0x3];                                      // 0x082D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0830(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy) == 0x000008, "Wrong alignment on GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy");
static_assert(sizeof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy) == 0x000838, "Wrong size on GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, EntryPoint) == 0x000000, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_EvaluateCurveTableRow_OutResult) == 0x000004, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_EvaluateCurveTableRow_OutResult' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_EvaluateCurveTableRow_OutXY) == 0x000008, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_EvaluateCurveTableRow_OutXY' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x00000C, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_SwitchEnum_CmpSuccess) == 0x00000D, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, Temp_name_Variable) == 0x000010, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CustomEvent_Payload_2) == 0x000018, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CustomEvent_Payload_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CreateDelegate_OutputDelegate) == 0x0000C8, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, Temp_struct_Variable) == 0x0000D8, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_WaitGameplayEvent_ReturnValue) == 0x000188, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_WaitGameplayEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_IsValid_ReturnValue) == 0x000190, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_DynamicCast_AsB_Prj_Hook_Athena) == 0x000198, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_DynamicCast_AsB_Prj_Hook_Athena' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_DynamicCast_bSuccess) == 0x0001A0, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CreateDelegate_OutputDelegate_1) == 0x0001A4, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_PickGrappleMontage_SectionName) == 0x0001B4, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_PickGrappleMontage_SectionName' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CustomEvent_NotifyName_14) == 0x0001BC, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CustomEvent_NotifyName_14' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CustomEvent_NotifyName_13) == 0x0001C4, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CustomEvent_NotifyName_13' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CreateDelegate_OutputDelegate_2) == 0x0001CC, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CustomEvent_NotifyName_12) == 0x0001DC, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CustomEvent_NotifyName_12' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CreateDelegate_OutputDelegate_3) == 0x0001E4, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CustomEvent_NotifyName_11) == 0x0001F4, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CustomEvent_NotifyName_11' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CreateDelegate_OutputDelegate_4) == 0x0001FC, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CustomEvent_NotifyName_10) == 0x00020C, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CustomEvent_NotifyName_10' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CreateDelegate_OutputDelegate_5) == 0x000214, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, Temp_name_Variable_1) == 0x000224, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CreateDelegate_OutputDelegate_6) == 0x00022C, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CustomEvent_Payload_1) == 0x000240, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CustomEvent_Payload_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, Temp_struct_Variable_1) == 0x0002F0, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_WaitGameplayEvent_ReturnValue_1) == 0x0003A0, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_WaitGameplayEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_IsValid_ReturnValue_1) == 0x0003A8, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CreateDelegate_OutputDelegate_7) == 0x0003AC, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CustomEvent_NotifyName_9) == 0x0003BC, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CustomEvent_NotifyName_9' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CustomEvent_NotifyName_8) == 0x0003C4, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CustomEvent_NotifyName_8' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CreateDelegate_OutputDelegate_8) == 0x0003CC, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CustomEvent_NotifyName_7) == 0x0003DC, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CustomEvent_NotifyName_7' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CreateDelegate_OutputDelegate_9) == 0x0003E4, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CustomEvent_NotifyName_6) == 0x0003F4, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CustomEvent_NotifyName_6' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CreateDelegate_OutputDelegate_10) == 0x0003FC, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CustomEvent_NotifyName_5) == 0x00040C, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CustomEvent_NotifyName_5' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CreateDelegate_OutputDelegate_11) == 0x000414, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, Temp_name_Variable_2) == 0x000424, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CreateDelegate_OutputDelegate_12) == 0x00042C, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CustomEvent_NotifyName_4) == 0x00043C, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CustomEvent_NotifyName_4' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CustomEvent_NotifyName_3) == 0x000444, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CustomEvent_NotifyName_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CreateDelegate_OutputDelegate_13) == 0x00044C, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CreateDelegate_OutputDelegate_13' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CustomEvent_NotifyName_2) == 0x00045C, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CustomEvent_NotifyName_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CreateDelegate_OutputDelegate_14) == 0x000464, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CreateDelegate_OutputDelegate_14' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CustomEvent_NotifyName_1) == 0x000474, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CustomEvent_NotifyName_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CreateDelegate_OutputDelegate_15) == 0x00047C, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CreateDelegate_OutputDelegate_15' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CustomEvent_NotifyName) == 0x00048C, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CreateDelegate_OutputDelegate_16) == 0x000494, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CreateDelegate_OutputDelegate_16' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, Temp_name_Variable_3) == 0x0004A4, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::Temp_name_Variable_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CreateDelegate_OutputDelegate_17) == 0x0004AC, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CreateDelegate_OutputDelegate_17' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CustomEvent_Payload) == 0x0004C0, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, Temp_struct_Variable_2) == 0x000570, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_WaitGameplayEvent_ReturnValue_2) == 0x000620, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_WaitGameplayEvent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_IsValid_ReturnValue_2) == 0x000628, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CreateDelegate_OutputDelegate_18) == 0x00062C, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CreateDelegate_OutputDelegate_18' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_WaitNetSync_ReturnValue) == 0x000640, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_WaitNetSync_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, Temp_bool_IsClosed_Variable) == 0x000648, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_IsValid_ReturnValue_3) == 0x000649, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, Temp_bool_Has_Been_Initd_Variable) == 0x00064A, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_IsServer_ReturnValue) == 0x00064B, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CreateDelegate_OutputDelegate_19) == 0x00064C, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CreateDelegate_OutputDelegate_19' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, Temp_bool_IsClosed_Variable_1) == 0x00065C, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, Temp_bool_Has_Been_Initd_Variable_1) == 0x00065D, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_GetActorInfo_ReturnValue) == 0x000660, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_IsServer_ReturnValue_1) == 0x0006A0, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_IsServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x0006A8, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_DynamicCast_bSuccess_1) == 0x0006B0, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x0006B8, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x0006E0, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CustomEvent_NotifyName_18) == 0x0006F0, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CustomEvent_NotifyName_18' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_GetCurrentSourceWeapon_ReturnValue) == 0x0006F8, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_GetCurrentSourceWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_GetInventoryGUID_ReturnValue) == 0x000700, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_GetInventoryGUID_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_GetFortPlayerControllerFromActor_ReturnValue) == 0x000710, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_GetFortPlayerControllerFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_K2_RemoveItemFromPlayerByGuid_ReturnValue) == 0x000718, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_K2_RemoveItemFromPlayerByGuid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue) == 0x000720, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CreateDelegate_OutputDelegate_20) == 0x000728, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CreateDelegate_OutputDelegate_20' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_IsValid_ReturnValue_4) == 0x000738, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CustomEvent_NotifyName_15) == 0x00073C, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CustomEvent_NotifyName_15' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1) == 0x000748, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_IsValid_ReturnValue_5) == 0x000750, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_GetLocalMagazineAmmoCount_ReturnValue) == 0x000754, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_GetLocalMagazineAmmoCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CustomEvent_NotifyName_19) == 0x000758, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CustomEvent_NotifyName_19' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000760, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CreateDelegate_OutputDelegate_21) == 0x000764, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CreateDelegate_OutputDelegate_21' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_2) == 0x000778, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_IsValid_ReturnValue_6) == 0x000780, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CustomEvent_NotifyName_16) == 0x000784, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CustomEvent_NotifyName_16' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_GetCurrentSourceWeapon_ReturnValue_1) == 0x000790, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_GetCurrentSourceWeapon_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000798, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x0007A0, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_DynamicCast_AsFort_Ability_System_Component) == 0x0007A8, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_DynamicCast_AsFort_Ability_System_Component' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_DynamicCast_bSuccess_2) == 0x0007B0, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_DynamicCast_AsB_Hookgun_Athena) == 0x0007B8, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_DynamicCast_AsB_Hookgun_Athena' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_DynamicCast_bSuccess_3) == 0x0007C0, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CreateDelegate_OutputDelegate_22) == 0x0007C4, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CreateDelegate_OutputDelegate_22' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_GetVehicleActor_ReturnValue) == 0x0007D8, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_GetVehicleActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_DynamicCast_AsFort_Athena_Jackal_Vehicle) == 0x0007E0, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_DynamicCast_AsFort_Athena_Jackal_Vehicle' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_DynamicCast_bSuccess_4) == 0x0007E8, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_3) == 0x0007F0, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_Not_PreBool_ReturnValue) == 0x0007F8, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_IsValid_ReturnValue_7) == 0x0007F9, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_GetCurrentMontage_ReturnValue) == 0x000800, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_GetCurrentMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_GetCurrentMontage_ReturnValue_1) == 0x000808, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_GetCurrentMontage_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000810, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000811, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CustomEvent_NotifyName_17) == 0x000814, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CustomEvent_NotifyName_17' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, K2Node_CreateDelegate_OutputDelegate_23) == 0x00081C, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::K2Node_CreateDelegate_OutputDelegate_23' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_K2_CommitAbility_ReturnValue) == 0x00082C, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy, CallFunc_Add_FloatFloat_ReturnValue) == 0x000830, "Member 'GA_Athena_HookDestroy_C_ExecuteUbergraph_GA_Athena_HookDestroy::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

// Function GA_Athena_HookDestroy.GA_Athena_HookDestroy_C.EventReceived_1B71851D49048B6433DA75B0D6007B6E
// 0x00B0 (0x00B0 - 0x0000)
struct GA_Athena_HookDestroy_C_EventReceived_1B71851D49048B6433DA75B0D6007B6E final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Athena_HookDestroy_C_EventReceived_1B71851D49048B6433DA75B0D6007B6E) == 0x000008, "Wrong alignment on GA_Athena_HookDestroy_C_EventReceived_1B71851D49048B6433DA75B0D6007B6E");
static_assert(sizeof(GA_Athena_HookDestroy_C_EventReceived_1B71851D49048B6433DA75B0D6007B6E) == 0x0000B0, "Wrong size on GA_Athena_HookDestroy_C_EventReceived_1B71851D49048B6433DA75B0D6007B6E");
static_assert(offsetof(GA_Athena_HookDestroy_C_EventReceived_1B71851D49048B6433DA75B0D6007B6E, Payload) == 0x000000, "Member 'GA_Athena_HookDestroy_C_EventReceived_1B71851D49048B6433DA75B0D6007B6E::Payload' has a wrong offset!");

// Function GA_Athena_HookDestroy.GA_Athena_HookDestroy_C.OnCompleted_7CDAB77949F908D1F388AB845AE6C282
// 0x0008 (0x0008 - 0x0000)
struct GA_Athena_HookDestroy_C_OnCompleted_7CDAB77949F908D1F388AB845AE6C282 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_HookDestroy_C_OnCompleted_7CDAB77949F908D1F388AB845AE6C282) == 0x000004, "Wrong alignment on GA_Athena_HookDestroy_C_OnCompleted_7CDAB77949F908D1F388AB845AE6C282");
static_assert(sizeof(GA_Athena_HookDestroy_C_OnCompleted_7CDAB77949F908D1F388AB845AE6C282) == 0x000008, "Wrong size on GA_Athena_HookDestroy_C_OnCompleted_7CDAB77949F908D1F388AB845AE6C282");
static_assert(offsetof(GA_Athena_HookDestroy_C_OnCompleted_7CDAB77949F908D1F388AB845AE6C282, NotifyName) == 0x000000, "Member 'GA_Athena_HookDestroy_C_OnCompleted_7CDAB77949F908D1F388AB845AE6C282::NotifyName' has a wrong offset!");

// Function GA_Athena_HookDestroy.GA_Athena_HookDestroy_C.OnBlendOut_7CDAB77949F908D1F388AB845AE6C282
// 0x0008 (0x0008 - 0x0000)
struct GA_Athena_HookDestroy_C_OnBlendOut_7CDAB77949F908D1F388AB845AE6C282 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_HookDestroy_C_OnBlendOut_7CDAB77949F908D1F388AB845AE6C282) == 0x000004, "Wrong alignment on GA_Athena_HookDestroy_C_OnBlendOut_7CDAB77949F908D1F388AB845AE6C282");
static_assert(sizeof(GA_Athena_HookDestroy_C_OnBlendOut_7CDAB77949F908D1F388AB845AE6C282) == 0x000008, "Wrong size on GA_Athena_HookDestroy_C_OnBlendOut_7CDAB77949F908D1F388AB845AE6C282");
static_assert(offsetof(GA_Athena_HookDestroy_C_OnBlendOut_7CDAB77949F908D1F388AB845AE6C282, NotifyName) == 0x000000, "Member 'GA_Athena_HookDestroy_C_OnBlendOut_7CDAB77949F908D1F388AB845AE6C282::NotifyName' has a wrong offset!");

// Function GA_Athena_HookDestroy.GA_Athena_HookDestroy_C.OnInterrupted_7CDAB77949F908D1F388AB845AE6C282
// 0x0008 (0x0008 - 0x0000)
struct GA_Athena_HookDestroy_C_OnInterrupted_7CDAB77949F908D1F388AB845AE6C282 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_HookDestroy_C_OnInterrupted_7CDAB77949F908D1F388AB845AE6C282) == 0x000004, "Wrong alignment on GA_Athena_HookDestroy_C_OnInterrupted_7CDAB77949F908D1F388AB845AE6C282");
static_assert(sizeof(GA_Athena_HookDestroy_C_OnInterrupted_7CDAB77949F908D1F388AB845AE6C282) == 0x000008, "Wrong size on GA_Athena_HookDestroy_C_OnInterrupted_7CDAB77949F908D1F388AB845AE6C282");
static_assert(offsetof(GA_Athena_HookDestroy_C_OnInterrupted_7CDAB77949F908D1F388AB845AE6C282, NotifyName) == 0x000000, "Member 'GA_Athena_HookDestroy_C_OnInterrupted_7CDAB77949F908D1F388AB845AE6C282::NotifyName' has a wrong offset!");

// Function GA_Athena_HookDestroy.GA_Athena_HookDestroy_C.OnNotifyBegin_7CDAB77949F908D1F388AB845AE6C282
// 0x0008 (0x0008 - 0x0000)
struct GA_Athena_HookDestroy_C_OnNotifyBegin_7CDAB77949F908D1F388AB845AE6C282 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_HookDestroy_C_OnNotifyBegin_7CDAB77949F908D1F388AB845AE6C282) == 0x000004, "Wrong alignment on GA_Athena_HookDestroy_C_OnNotifyBegin_7CDAB77949F908D1F388AB845AE6C282");
static_assert(sizeof(GA_Athena_HookDestroy_C_OnNotifyBegin_7CDAB77949F908D1F388AB845AE6C282) == 0x000008, "Wrong size on GA_Athena_HookDestroy_C_OnNotifyBegin_7CDAB77949F908D1F388AB845AE6C282");
static_assert(offsetof(GA_Athena_HookDestroy_C_OnNotifyBegin_7CDAB77949F908D1F388AB845AE6C282, NotifyName) == 0x000000, "Member 'GA_Athena_HookDestroy_C_OnNotifyBegin_7CDAB77949F908D1F388AB845AE6C282::NotifyName' has a wrong offset!");

// Function GA_Athena_HookDestroy.GA_Athena_HookDestroy_C.OnNotifyEnd_7CDAB77949F908D1F388AB845AE6C282
// 0x0008 (0x0008 - 0x0000)
struct GA_Athena_HookDestroy_C_OnNotifyEnd_7CDAB77949F908D1F388AB845AE6C282 final
{
public:
