#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_AppleSun_RemoveFX

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GA_Athena_AppleSun_RemoveFX.GA_Athena_AppleSun_RemoveFX_C.ExecuteUbergraph_GA_Athena_AppleSun_RemoveFX
// 0x00A0 (0x00A0 - 0x0000)
struct GA_Athena_AppleSun_RemoveFX_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFX final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMovementMode                                 Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitMovementModeChange*    CallFunc_CreateWaitMovementModeChange_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EMovementMode NewMovementMode)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMovementMode                                 K2Node_CustomEvent_NewMovementMode;                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMovementMode                                 Temp_byte_Variable_1;                              // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitMovementModeChange*    CallFunc_CreateWaitMovementModeChange_ReturnValue_1; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMovementMode                                 K2Node_CustomEvent_NewMovementMode_1;              // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IFortVehicleInterface> CallFunc_GetVehicleUInterface_ReturnValue;         // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInVehicle_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_InterfaceToObject_ReturnValue;       // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTouchingGround_ReturnValue;             // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73[0x1];                                       // 0x0073(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0074(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0088(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EMovementMode NewMovementMode)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0090(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(GA_Athena_AppleSun_RemoveFX_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFX) == 0x000008, "Wrong alignment on GA_Athena_AppleSun_RemoveFX_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFX");
static_assert(sizeof(GA_Athena_AppleSun_RemoveFX_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFX) == 0x0000A0, "Wrong size on GA_Athena_AppleSun_RemoveFX_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFX");
static_assert(offsetof(GA_Athena_AppleSun_RemoveFX_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFX, EntryPoint) == 0x000000, "Member 'GA_Athena_AppleSun_RemoveFX_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFX::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Athena_AppleSun_RemoveFX_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFX, Temp_byte_Variable) == 0x000004, "Member 'GA_Athena_AppleSun_RemoveFX_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFX::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_AppleSun_RemoveFX_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFX, CallFunc_CreateWaitMovementModeChange_ReturnValue) == 0x000008, "Member 'GA_Athena_AppleSun_RemoveFX_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFX::CallFunc_CreateWaitMovementModeChange_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_AppleSun_RemoveFX_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFX, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GA_Athena_AppleSun_RemoveFX_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFX::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Athena_AppleSun_RemoveFX_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFX, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'GA_Athena_AppleSun_RemoveFX_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFX::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_AppleSun_RemoveFX_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFX, K2Node_CustomEvent_NewMovementMode) == 0x000021, "Member 'GA_Athena_AppleSun_RemoveFX_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFX::K2Node_CustomEvent_NewMovementMode' has a wrong offset!");
static_assert(offsetof(GA_Athena_AppleSun_RemoveFX_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFX, Temp_byte_Variable_1) == 0x000022, "Member 'GA_Athena_AppleSun_RemoveFX_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFX::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_AppleSun_RemoveFX_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFX, CallFunc_CreateWaitMovementModeChange_ReturnValue_1) == 0x000028, "Member 'GA_Athena_AppleSun_RemoveFX_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFX::CallFunc_CreateWaitMovementModeChange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_AppleSun_RemoveFX_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFX, CallFunc_IsValid_ReturnValue_1) == 0x000030, "Member 'GA_Athena_AppleSun_RemoveFX_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFX::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_AppleSun_RemoveFX_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFX, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000038, "Member 'GA_Athena_AppleSun_RemoveFX_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFX::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_AppleSun_RemoveFX_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFX, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000040, "Member 'GA_Athena_AppleSun_RemoveFX_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFX::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Athena_AppleSun_RemoveFX_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFX, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'GA_Athena_AppleSun_RemoveFX_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFX::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Athena_AppleSun_RemoveFX_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFX, K2Node_CustomEvent_NewMovementMode_1) == 0x000049, "Member 'GA_Athena_AppleSun_RemoveFX_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFX::K2Node_CustomEvent_NewMovementMode_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_AppleSun_RemoveFX_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFX, CallFunc_GetVehicleUInterface_ReturnValue) == 0x000050, "Member 'GA_Athena_AppleSun_RemoveFX_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFX::CallFunc_GetVehicleUInterface_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_AppleSun_RemoveFX_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFX, CallFunc_IsInVehicle_ReturnValue) == 0x000060, "Member 'GA_Athena_AppleSun_RemoveFX_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFX::CallFunc_IsInVehicle_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_AppleSun_RemoveFX_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFX, CallFunc_Conv_InterfaceToObject_ReturnValue) == 0x000068, "Member 'GA_Athena_AppleSun_RemoveFX_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFX::CallFunc_Conv_InterfaceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_AppleSun_RemoveFX_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFX, CallFunc_IsTouchingGround_ReturnValue) == 0x000070, "Member 'GA_Athena_AppleSun_RemoveFX_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFX::CallFunc_IsTouchingGround_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_AppleSun_RemoveFX_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFX, CallFunc_IsValid_ReturnValue_2) == 0x000071, "Member 'GA_Athena_AppleSun_RemoveFX_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFX::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_AppleSun_RemoveFX_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFX, CallFunc_BooleanAND_ReturnValue) == 0x000072, "Member 'GA_Athena_AppleSun_RemoveFX_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFX::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_AppleSun_RemoveFX_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFX, K2Node_CreateDelegate_OutputDelegate_1) == 0x000074, "Member 'GA_Athena_AppleSun_RemoveFX_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFX::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_AppleSun_RemoveFX_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFX, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000088, "Member 'GA_Athena_AppleSun_RemoveFX_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFX::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_AppleSun_RemoveFX_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFX, K2Node_CreateDelegate_OutputDelegate_2) == 0x000090, "Member 'GA_Athena_AppleSun_RemoveFX_C_ExecuteUbergraph_GA_Athena_AppleSun_RemoveFX::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");

// Function GA_Athena_AppleSun_RemoveFX.GA_Athena_AppleSun_RemoveFX_C.OnChange_E50882E9463BCB5DDE04EE8407D66091
// 0x0001 (0x0001 - 0x0000)
struct GA_Athena_AppleSun_RemoveFX_C_OnChange_E50882E9463BCB5DDE04EE8407D66091 final
{
public:
	EMovementMode                                 NewMovementMode;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_AppleSun_RemoveFX_C_OnChange_E50882E9463BCB5DDE04EE8407D66091) == 0x000001, "Wrong alignment on GA_Athena_AppleSun_RemoveFX_C_OnChange_E50882E9463BCB5DDE04EE8407D66091");
static_assert(sizeof(GA_Athena_AppleSun_RemoveFX_C_OnChange_E50882E9463BCB5DDE04EE8407D66091) == 0x000001, "Wrong size on GA_Athena_AppleSun_RemoveFX_C_OnChange_E50882E9463BCB5DDE04EE8407D66091");
static_assert(offsetof(GA_Athena_AppleSun_RemoveFX_C_OnChange_E50882E9463BCB5DDE04EE8407D66091, NewMovementMode) == 0x000000, "Member 'GA_Athena_AppleSun_RemoveFX_C_OnChange_E50882E9463BCB5DDE04EE8407D66091::NewMovementMode' has a wrong offset!");

// Function GA_Athena_AppleSun_RemoveFX.GA_Athena_AppleSun_RemoveFX_C.OnChange_3DD8539A4FF5097BAD1292AD341357CA
// 0x0001 (0x0001 - 0x0000)
struct GA_Athena_AppleSun_RemoveFX_C_OnChange_3DD8539A4FF5097BAD1292AD341357CA final
{
public:
	EMovementMode                                 NewMovementMode;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Athena_AppleSun_RemoveFX_C_OnChange_3DD8539A4FF5097BAD1292AD341357CA) == 0x000001, "Wrong alignment on GA_Athena_AppleSun_RemoveFX_C_OnChange_3DD8539A4FF5097BAD1292AD341357CA");
static_assert(sizeof(GA_Athena_AppleSun_RemoveFX_C_OnChange_3DD8539A4FF5097BAD1292AD341357CA) == 0x000001, "Wrong size on GA_Athena_AppleSun_RemoveFX_C_OnChange_3DD8539A4FF5097BAD1292AD341357CA");
static_assert(offsetof(GA_Athena_AppleSun_RemoveFX_C_OnChange_3DD8539A4FF5097BAD1292AD341357CA, NewMovementMode) == 0x000000, "Member 'GA_Athena_AppleSun_RemoveFX_C_OnChange_3DD8539A4FF5097BAD1292AD341357CA::NewMovementMode' has a wrong offset!");

}

