#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Athena_Donut_Lifesteal

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Athena_Donut_Lifesteal.GA_Athena_Donut_Lifesteal_C.ExecuteUbergraph_GA_Athena_Donut_Lifesteal
// 0x0228 (0x0228 - 0x0000)
struct GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEffectSpecHandle              CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue; // 0x0008(0x0010)()
	float                                         CallFunc_GetValueAtLevel_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMaxShield_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RowToBool_ReturnValue;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetShield_ReturnValue;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHealth_ReturnValue;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxHealth_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0058(0x00B0)(ConstParm)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxHealth_ReturnValue_1;               // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetHealth_ReturnValue_1;                  // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayCueParameters                 CallFunc_MakeGameplayCueParameters_ReturnValue;    // 0x0128(0x00B8)(ContainsInstancedReference)
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue; // 0x01E0(0x0010)()
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_2;        // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_2;                     // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue_1;                     // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              CallFunc_AssignTagSetByCallerMagnitude_ReturnValue_1; // 0x0208(0x0010)()
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_219[0x3];                                      // 0x0219(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue; // 0x021C(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal) == 0x000008, "Wrong alignment on GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal");
static_assert(sizeof(GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal) == 0x000228, "Wrong size on GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal");
static_assert(offsetof(GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal, EntryPoint) == 0x000000, "Member 'GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal, Temp_bool_Variable) == 0x000004, "Member 'GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal, CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue) == 0x000008, "Member 'GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal::CallFunc_MakeOutgoingGameplayEffectSpec_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal, CallFunc_GetValueAtLevel_ReturnValue) == 0x000018, "Member 'GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal::CallFunc_GetValueAtLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000020, "Member 'GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000028, "Member 'GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal, CallFunc_GetMaxShield_ReturnValue) == 0x000034, "Member 'GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal::CallFunc_GetMaxShield_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal, CallFunc_RowToBool_ReturnValue) == 0x000038, "Member 'GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal::CallFunc_RowToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal, CallFunc_GetShield_ReturnValue) == 0x00003C, "Member 'GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal::CallFunc_GetShield_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000040, "Member 'GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal, CallFunc_GetHealth_ReturnValue) == 0x000044, "Member 'GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal::CallFunc_GetHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal, CallFunc_GetMaxHealth_ReturnValue) == 0x000048, "Member 'GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal::CallFunc_GetMaxHealth_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal, Temp_float_Variable) == 0x00004C, "Member 'GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000050, "Member 'GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal, K2Node_Event_EventData) == 0x000058, "Member 'GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000108, "Member 'GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal, CallFunc_FClamp_ReturnValue) == 0x00010C, "Member 'GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal, CallFunc_GetMaxHealth_ReturnValue_1) == 0x000110, "Member 'GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal::CallFunc_GetMaxHealth_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal, CallFunc_FFloor_ReturnValue) == 0x000114, "Member 'GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal::CallFunc_FFloor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal, CallFunc_GetHealth_ReturnValue_1) == 0x000118, "Member 'GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal::CallFunc_GetHealth_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00011C, "Member 'GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000120, "Member 'GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000124, "Member 'GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal, CallFunc_MakeGameplayCueParameters_ReturnValue) == 0x000128, "Member 'GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal::CallFunc_MakeGameplayCueParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue) == 0x0001E0, "Member 'GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal, CallFunc_Subtract_FloatFloat_ReturnValue_2) == 0x0001F0, "Member 'GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal::CallFunc_Subtract_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal, CallFunc_FClamp_ReturnValue_1) == 0x0001F4, "Member 'GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal, CallFunc_FClamp_ReturnValue_2) == 0x0001F8, "Member 'GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal::CallFunc_FClamp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal, CallFunc_FFloor_ReturnValue_1) == 0x0001FC, "Member 'GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal::CallFunc_FFloor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000200, "Member 'GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal, K2Node_Select_Default) == 0x000204, "Member 'GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal, CallFunc_AssignTagSetByCallerMagnitude_ReturnValue_1) == 0x000208, "Member 'GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal::CallFunc_AssignTagSetByCallerMagnitude_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000218, "Member 'GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal, CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue) == 0x00021C, "Member 'GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal::CallFunc_K2_ApplyGameplayEffectSpecToOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal, CallFunc_BooleanOR_ReturnValue) == 0x000224, "Member 'GA_Athena_Donut_Lifesteal_C_ExecuteUbergraph_GA_Athena_Donut_Lifesteal::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function GA_Athena_Donut_Lifesteal.GA_Athena_Donut_Lifesteal_C.K2_ActivateAbilityFromEvent
// 0x00B0 (0x00B0 - 0x0000)
struct GA_Athena_Donut_Lifesteal_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Athena_Donut_Lifesteal_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on GA_Athena_Donut_Lifesteal_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GA_Athena_Donut_Lifesteal_C_K2_ActivateAbilityFromEvent) == 0x0000B0, "Wrong size on GA_Athena_Donut_Lifesteal_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GA_Athena_Donut_Lifesteal_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GA_Athena_Donut_Lifesteal_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

// Function GA_Athena_Donut_Lifesteal.GA_Athena_Donut_Lifesteal_C.K2_ShouldAbilityRespondToEvent
// 0x0120 (0x0120 - 0x0000)
struct GA_Athena_Donut_Lifesteal_C_K2_ShouldAbilityRespondToEvent final
{
public:
	struct FGameplayAbilityActorInfo              ActorInfo;                                         // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	struct FGameplayEventData                     Payload;                                           // 0x0040(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          ReturnValue;                                       // 0x00F0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F2[0x6];                                       // 0x00F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x00F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABuildingActor*                         K2Node_DynamicCast_AsBuilding_Actor;               // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x011B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Athena_Donut_Lifesteal_C_K2_ShouldAbilityRespondToEvent) == 0x000008, "Wrong alignment on GA_Athena_Donut_Lifesteal_C_K2_ShouldAbilityRespondToEvent");
static_assert(sizeof(GA_Athena_Donut_Lifesteal_C_K2_ShouldAbilityRespondToEvent) == 0x000120, "Wrong size on GA_Athena_Donut_Lifesteal_C_K2_ShouldAbilityRespondToEvent");
static_assert(offsetof(GA_Athena_Donut_Lifesteal_C_K2_ShouldAbilityRespondToEvent, ActorInfo) == 0x000000, "Member 'GA_Athena_Donut_Lifesteal_C_K2_ShouldAbilityRespondToEvent::ActorInfo' has a wrong offset!");
static_assert(offsetof(GA_Athena_Donut_Lifesteal_C_K2_ShouldAbilityRespondToEvent, Payload) == 0x000040, "Member 'GA_Athena_Donut_Lifesteal_C_K2_ShouldAbilityRespondToEvent::Payload' has a wrong offset!");
static_assert(offsetof(GA_Athena_Donut_Lifesteal_C_K2_ShouldAbilityRespondToEvent, ReturnValue) == 0x0000F0, "Member 'GA_Athena_Donut_Lifesteal_C_K2_ShouldAbilityRespondToEvent::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Donut_Lifesteal_C_K2_ShouldAbilityRespondToEvent, Temp_bool_Variable) == 0x0000F1, "Member 'GA_Athena_Donut_Lifesteal_C_K2_ShouldAbilityRespondToEvent::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_Athena_Donut_Lifesteal_C_K2_ShouldAbilityRespondToEvent, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x0000F8, "Member 'GA_Athena_Donut_Lifesteal_C_K2_ShouldAbilityRespondToEvent::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(GA_Athena_Donut_Lifesteal_C_K2_ShouldAbilityRespondToEvent, K2Node_DynamicCast_bSuccess) == 0x000108, "Member 'GA_Athena_Donut_Lifesteal_C_K2_ShouldAbilityRespondToEvent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Athena_Donut_Lifesteal_C_K2_ShouldAbilityRespondToEvent, K2Node_DynamicCast_AsBuilding_Actor) == 0x000110, "Member 'GA_Athena_Donut_Lifesteal_C_K2_ShouldAbilityRespondToEvent::K2Node_DynamicCast_AsBuilding_Actor' has a wrong offset!");
static_assert(offsetof(GA_Athena_Donut_Lifesteal_C_K2_ShouldAbilityRespondToEvent, K2Node_DynamicCast_bSuccess_1) == 0x000118, "Member 'GA_Athena_Donut_Lifesteal_C_K2_ShouldAbilityRespondToEvent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Athena_Donut_Lifesteal_C_K2_ShouldAbilityRespondToEvent, CallFunc_Not_PreBool_ReturnValue) == 0x000119, "Member 'GA_Athena_Donut_Lifesteal_C_K2_ShouldAbilityRespondToEvent::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Donut_Lifesteal_C_K2_ShouldAbilityRespondToEvent, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x00011A, "Member 'GA_Athena_Donut_Lifesteal_C_K2_ShouldAbilityRespondToEvent::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Athena_Donut_Lifesteal_C_K2_ShouldAbilityRespondToEvent, CallFunc_HasTag_ReturnValue) == 0x00011B, "Member 'GA_Athena_Donut_Lifesteal_C_K2_ShouldAbilityRespondToEvent::CallFunc_HasTag_ReturnValue' has a wrong offset!");

}

