#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Ranged_ExplosiveBow_Athena_Tina

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Ranged_ExplosiveBow_Athena_Tina.GA_Ranged_ExplosiveBow_Athena_Tina_C.K2_CommitExecute
// 0x000C (0x000C - 0x0000)
struct GA_Ranged_ExplosiveBow_Athena_Tina_C_K2_CommitExecute final
{
public:
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue; // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Ranged_ExplosiveBow_Athena_Tina_C_K2_CommitExecute) == 0x000004, "Wrong alignment on GA_Ranged_ExplosiveBow_Athena_Tina_C_K2_CommitExecute");
static_assert(sizeof(GA_Ranged_ExplosiveBow_Athena_Tina_C_K2_CommitExecute) == 0x00000C, "Wrong size on GA_Ranged_ExplosiveBow_Athena_Tina_C_K2_CommitExecute");
static_assert(offsetof(GA_Ranged_ExplosiveBow_Athena_Tina_C_K2_CommitExecute, CallFunc_IsServer_ReturnValue) == 0x000000, "Member 'GA_Ranged_ExplosiveBow_Athena_Tina_C_K2_CommitExecute::CallFunc_IsServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Ranged_ExplosiveBow_Athena_Tina_C_K2_CommitExecute, CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue) == 0x000004, "Member 'GA_Ranged_ExplosiveBow_Athena_Tina_C_K2_CommitExecute::CallFunc_BP_ApplyGameplayEffectToOwner_ReturnValue' has a wrong offset!");

// Function GA_Ranged_ExplosiveBow_Athena_Tina.GA_Ranged_ExplosiveBow_Athena_Tina_C.K2_CanActivateAbility
// 0x00C0 (0x00C0 - 0x0000)
struct GA_Ranged_ExplosiveBow_Athena_Tina_C_K2_CanActivateAbility final
{
public:
	struct FGameplayAbilityActorInfo              ActorInfo;                                         // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	struct FGameplayTagContainer                  RelevantTags;                                      // 0x0040(0x0020)(Parm, OutParm)
	bool                                          ReturnValue;                                       // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAttribute                     Attribute;                                         // 0x0068(0x0038)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute; // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B2[0x2];                                       // 0x00B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttribute_ReturnValue;            // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBotControlled_ReturnValue;              // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Ranged_ExplosiveBow_Athena_Tina_C_K2_CanActivateAbility) == 0x000008, "Wrong alignment on GA_Ranged_ExplosiveBow_Athena_Tina_C_K2_CanActivateAbility");
static_assert(sizeof(GA_Ranged_ExplosiveBow_Athena_Tina_C_K2_CanActivateAbility) == 0x0000C0, "Wrong size on GA_Ranged_ExplosiveBow_Athena_Tina_C_K2_CanActivateAbility");
static_assert(offsetof(GA_Ranged_ExplosiveBow_Athena_Tina_C_K2_CanActivateAbility, ActorInfo) == 0x000000, "Member 'GA_Ranged_ExplosiveBow_Athena_Tina_C_K2_CanActivateAbility::ActorInfo' has a wrong offset!");
static_assert(offsetof(GA_Ranged_ExplosiveBow_Athena_Tina_C_K2_CanActivateAbility, RelevantTags) == 0x000040, "Member 'GA_Ranged_ExplosiveBow_Athena_Tina_C_K2_CanActivateAbility::RelevantTags' has a wrong offset!");
static_assert(offsetof(GA_Ranged_ExplosiveBow_Athena_Tina_C_K2_CanActivateAbility, ReturnValue) == 0x000060, "Member 'GA_Ranged_ExplosiveBow_Athena_Tina_C_K2_CanActivateAbility::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Ranged_ExplosiveBow_Athena_Tina_C_K2_CanActivateAbility, Attribute) == 0x000068, "Member 'GA_Ranged_ExplosiveBow_Athena_Tina_C_K2_CanActivateAbility::Attribute' has a wrong offset!");
static_assert(offsetof(GA_Ranged_ExplosiveBow_Athena_Tina_C_K2_CanActivateAbility, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x0000A0, "Member 'GA_Ranged_ExplosiveBow_Athena_Tina_C_K2_CanActivateAbility::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Ranged_ExplosiveBow_Athena_Tina_C_K2_CanActivateAbility, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x0000A8, "Member 'GA_Ranged_ExplosiveBow_Athena_Tina_C_K2_CanActivateAbility::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Ranged_ExplosiveBow_Athena_Tina_C_K2_CanActivateAbility, K2Node_DynamicCast_bSuccess) == 0x0000B0, "Member 'GA_Ranged_ExplosiveBow_Athena_Tina_C_K2_CanActivateAbility::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Ranged_ExplosiveBow_Athena_Tina_C_K2_CanActivateAbility, CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute) == 0x0000B1, "Member 'GA_Ranged_ExplosiveBow_Athena_Tina_C_K2_CanActivateAbility::CallFunc_GetFloatAttribute_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(GA_Ranged_ExplosiveBow_Athena_Tina_C_K2_CanActivateAbility, CallFunc_GetFloatAttribute_ReturnValue) == 0x0000B4, "Member 'GA_Ranged_ExplosiveBow_Athena_Tina_C_K2_CanActivateAbility::CallFunc_GetFloatAttribute_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Ranged_ExplosiveBow_Athena_Tina_C_K2_CanActivateAbility, CallFunc_IsBotControlled_ReturnValue) == 0x0000B8, "Member 'GA_Ranged_ExplosiveBow_Athena_Tina_C_K2_CanActivateAbility::CallFunc_IsBotControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Ranged_ExplosiveBow_Athena_Tina_C_K2_CanActivateAbility, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0000B9, "Member 'GA_Ranged_ExplosiveBow_Athena_Tina_C_K2_CanActivateAbility::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Ranged_ExplosiveBow_Athena_Tina_C_K2_CanActivateAbility, CallFunc_BooleanOR_ReturnValue) == 0x0000BA, "Member 'GA_Ranged_ExplosiveBow_Athena_Tina_C_K2_CanActivateAbility::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

}

