#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Ranged_GenericProjectileImpact_HookGun

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GA_Ranged_GenericDamage_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Ranged_GenericProjectileImpact_HookGun.GA_Ranged_GenericProjectileImpact_HookGun_C
// 0x0048 (0x0AC0 - 0x0A78)
class UGA_Ranged_GenericProjectileImpact_HookGun_C final : public UGA_Ranged_GenericDamage_C
{
public:
	struct FGameplayTagContainer                  ChangeEquipmentTag;                                // 0x0A78(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           RopeActiveTag;                                     // 0x0A98(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UFortQuestItemDefinition*               QuestItem;                                         // 0x0AA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ObjBackendName;                                    // 0x0AA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    ObjStat;                                           // 0x0AB0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void K2_OnEndAbility(bool bWasCancelled);
	void Overflow(class UFortWorldItem* Item_Dropped);
	void K2_CommitExecute();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Ranged_GenericProjectileImpact_HookGun_C">();
	}
	static class UGA_Ranged_GenericProjectileImpact_HookGun_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Ranged_GenericProjectileImpact_HookGun_C>();
	}
};
static_assert(alignof(UGA_Ranged_GenericProjectileImpact_HookGun_C) == 0x000008, "Wrong alignment on UGA_Ranged_GenericProjectileImpact_HookGun_C");
static_assert(sizeof(UGA_Ranged_GenericProjectileImpact_HookGun_C) == 0x000AC0, "Wrong size on UGA_Ranged_GenericProjectileImpact_HookGun_C");
static_assert(offsetof(UGA_Ranged_GenericProjectileImpact_HookGun_C, ChangeEquipmentTag) == 0x000A78, "Member 'UGA_Ranged_GenericProjectileImpact_HookGun_C::ChangeEquipmentTag' has a wrong offset!");
static_assert(offsetof(UGA_Ranged_GenericProjectileImpact_HookGun_C, RopeActiveTag) == 0x000A98, "Member 'UGA_Ranged_GenericProjectileImpact_HookGun_C::RopeActiveTag' has a wrong offset!");
static_assert(offsetof(UGA_Ranged_GenericProjectileImpact_HookGun_C, QuestItem) == 0x000AA0, "Member 'UGA_Ranged_GenericProjectileImpact_HookGun_C::QuestItem' has a wrong offset!");
static_assert(offsetof(UGA_Ranged_GenericProjectileImpact_HookGun_C, ObjBackendName) == 0x000AA8, "Member 'UGA_Ranged_GenericProjectileImpact_HookGun_C::ObjBackendName' has a wrong offset!");
static_assert(offsetof(UGA_Ranged_GenericProjectileImpact_HookGun_C, ObjStat) == 0x000AB0, "Member 'UGA_Ranged_GenericProjectileImpact_HookGun_C::ObjStat' has a wrong offset!");

}

