#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAT_CommandoActiveAbility

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GAT_ActiveAbility_Hero_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GAT_CommandoActiveAbility.GAT_CommandoActiveAbility_C
// 0x00C8 (0x0B38 - 0x0A70)
class UGAT_CommandoActiveAbility_C : public UGAT_ActiveAbility_Hero_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GAT_CommandoActiveAbility_C;        // 0x0A70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayEventData                     Event_Data;                                        // 0x0A78(0x00B0)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AFortPawn*                              CommandoPlayerPawn;                                // 0x0B28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsAutoCommitted;                                   // 0x0B30(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsStaminaLockedOut;                                // 0x0B31(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_GAT_CommandoActiveAbility(int32 EntryPoint);
	void K2_ActivateAbility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GAT_CommandoActiveAbility_C">();
	}
	static class UGAT_CommandoActiveAbility_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGAT_CommandoActiveAbility_C>();
	}
};
static_assert(alignof(UGAT_CommandoActiveAbility_C) == 0x000008, "Wrong alignment on UGAT_CommandoActiveAbility_C");
static_assert(sizeof(UGAT_CommandoActiveAbility_C) == 0x000B38, "Wrong size on UGAT_CommandoActiveAbility_C");
static_assert(offsetof(UGAT_CommandoActiveAbility_C, UberGraphFrame_GAT_CommandoActiveAbility_C) == 0x000A70, "Member 'UGAT_CommandoActiveAbility_C::UberGraphFrame_GAT_CommandoActiveAbility_C' has a wrong offset!");
static_assert(offsetof(UGAT_CommandoActiveAbility_C, Event_Data) == 0x000A78, "Member 'UGAT_CommandoActiveAbility_C::Event_Data' has a wrong offset!");
static_assert(offsetof(UGAT_CommandoActiveAbility_C, CommandoPlayerPawn) == 0x000B28, "Member 'UGAT_CommandoActiveAbility_C::CommandoPlayerPawn' has a wrong offset!");
static_assert(offsetof(UGAT_CommandoActiveAbility_C, IsAutoCommitted) == 0x000B30, "Member 'UGAT_CommandoActiveAbility_C::IsAutoCommitted' has a wrong offset!");
static_assert(offsetof(UGAT_CommandoActiveAbility_C, IsStaminaLockedOut) == 0x000B31, "Member 'UGAT_CommandoActiveAbility_C::IsStaminaLockedOut' has a wrong offset!");

}

