#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAT_Athena_c4_Detonate

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GAT_Athena_c4_Detonate.GAT_Athena_c4_Detonate_C.ExecuteUbergraph_GAT_Athena_c4_Detonate
// 0x0220 (0x0220 - 0x0000)
struct GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable;                              // 0x0010(0x0028)()
	struct FGameplayTag                           Temp_struct_Variable_1;                            // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortAbilityTask_PlayMontageWaitTarget* CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData;                     // 0x0078(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag;                 // 0x00A0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_1;                   // 0x00A8(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_1;               // 0x00D0(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate;              // 0x00D8(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetTrackedGroupedActors_ReturnValue;      // 0x00F0(0x0010)(ZeroConstructor, ReferenceParm)
	struct FGameplayAbilityActorInfo              CallFunc_GetActorInfo_ReturnValue;                 // 0x0100(0x0040)(ContainsInstancedReference)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_BGA_Athena_C4_C*                     K2Node_DynamicCast_AsB_BGA_Athena_C4;              // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn_1;           // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       CallFunc_AbilityTargetDataFromActor_ReturnValue;   // 0x0168(0x0028)()
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue; // 0x0190(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A5[0x3];                                      // 0x01A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x01A8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x3];                                      // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_K2_GetItemQuantityOnPlayer_ReturnValue;   // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x3];                                      // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_K2_RemoveItemFromPlayer_ReturnValue;      // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEvaluateCurveTableResult                     CallFunc_EvaluateCurveTableRow_OutResult;          // 0x01C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CA[0x2];                                      // 0x01CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateCurveTableRow_OutXY;              // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEvaluateCurveTableResult                     CallFunc_EvaluateCurveTableRow_OutResult_1;        // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x3];                                      // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateCurveTableRow_OutXY_1;            // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DA[0x6];                                      // 0x01DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData_2;                   // 0x01E0(0x0028)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag_2;               // 0x0208(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0210(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate) == 0x000008, "Wrong alignment on GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate");
static_assert(sizeof(GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate) == 0x000220, "Wrong size on GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate");
static_assert(offsetof(GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate, EntryPoint) == 0x000000, "Member 'GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate::EntryPoint' has a wrong offset!");
static_assert(offsetof(GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate, Temp_struct_Variable) == 0x000010, "Member 'GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate, Temp_struct_Variable_1) == 0x000038, "Member 'GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate, CallFunc_GetAvatarActorFromActorInfo_ReturnValue) == 0x000040, "Member 'GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate::CallFunc_GetAvatarActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x000048, "Member 'GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate, CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue) == 0x000058, "Member 'GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate::CallFunc_PlayMontageInfoAndWaitForTrigger_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate, CallFunc_GetController_ReturnValue) == 0x000060, "Member 'GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate, K2Node_DynamicCast_AsFort_Player_Controller) == 0x000068, "Member 'GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate::K2Node_DynamicCast_AsFort_Player_Controller' has a wrong offset!");
static_assert(offsetof(GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate, K2Node_DynamicCast_bSuccess_1) == 0x000070, "Member 'GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate, CallFunc_IsValid_ReturnValue) == 0x000071, "Member 'GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate, K2Node_CustomEvent_TargetData) == 0x000078, "Member 'GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate::K2Node_CustomEvent_TargetData' has a wrong offset!");
static_assert(offsetof(GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate, K2Node_CustomEvent_ApplicationTag) == 0x0000A0, "Member 'GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate::K2Node_CustomEvent_ApplicationTag' has a wrong offset!");
static_assert(offsetof(GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate, K2Node_CustomEvent_TargetData_1) == 0x0000A8, "Member 'GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate::K2Node_CustomEvent_TargetData_1' has a wrong offset!");
static_assert(offsetof(GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate, K2Node_CustomEvent_ApplicationTag_1) == 0x0000D0, "Member 'GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate::K2Node_CustomEvent_ApplicationTag_1' has a wrong offset!");
static_assert(offsetof(GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate, K2Node_CreateDelegate_OutputDelegate) == 0x0000D8, "Member 'GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000E8, "Member 'GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate, CallFunc_GetTrackedGroupedActors_ReturnValue) == 0x0000F0, "Member 'GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate::CallFunc_GetTrackedGroupedActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate, CallFunc_GetActorInfo_ReturnValue) == 0x000100, "Member 'GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate::CallFunc_GetActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate, CallFunc_Array_Get_Item) == 0x000140, "Member 'GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate, K2Node_DynamicCast_AsB_BGA_Athena_C4) == 0x000148, "Member 'GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate::K2Node_DynamicCast_AsB_BGA_Athena_C4' has a wrong offset!");
static_assert(offsetof(GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate, K2Node_DynamicCast_bSuccess_2) == 0x000150, "Member 'GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate, K2Node_DynamicCast_AsFort_Player_Pawn_1) == 0x000158, "Member 'GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate::K2Node_DynamicCast_AsFort_Player_Pawn_1' has a wrong offset!");
static_assert(offsetof(GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate, K2Node_DynamicCast_bSuccess_3) == 0x000160, "Member 'GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate, CallFunc_AbilityTargetDataFromActor_ReturnValue) == 0x000168, "Member 'GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate::CallFunc_AbilityTargetDataFromActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate, CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue) == 0x000190, "Member 'GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate::CallFunc_BP_ApplyGameplayEffectToTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate, CallFunc_Array_Length_ReturnValue) == 0x0001A0, "Member 'GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate, CallFunc_Less_IntInt_ReturnValue) == 0x0001A4, "Member 'GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate, K2Node_CreateDelegate_OutputDelegate_1) == 0x0001A8, "Member 'GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate, CallFunc_IsValid_ReturnValue_1) == 0x0001B8, "Member 'GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate, CallFunc_K2_GetItemQuantityOnPlayer_ReturnValue) == 0x0001BC, "Member 'GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate::CallFunc_K2_GetItemQuantityOnPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0001C0, "Member 'GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate, CallFunc_K2_RemoveItemFromPlayer_ReturnValue) == 0x0001C4, "Member 'GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate::CallFunc_K2_RemoveItemFromPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate, CallFunc_K2_CommitAbility_ReturnValue) == 0x0001C8, "Member 'GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate, CallFunc_EvaluateCurveTableRow_OutResult) == 0x0001C9, "Member 'GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate::CallFunc_EvaluateCurveTableRow_OutResult' has a wrong offset!");
static_assert(offsetof(GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate, CallFunc_EvaluateCurveTableRow_OutXY) == 0x0001CC, "Member 'GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate::CallFunc_EvaluateCurveTableRow_OutXY' has a wrong offset!");
static_assert(offsetof(GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate, CallFunc_EvaluateCurveTableRow_OutResult_1) == 0x0001D0, "Member 'GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate::CallFunc_EvaluateCurveTableRow_OutResult_1' has a wrong offset!");
static_assert(offsetof(GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate, CallFunc_EvaluateCurveTableRow_OutXY_1) == 0x0001D4, "Member 'GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate::CallFunc_EvaluateCurveTableRow_OutXY_1' has a wrong offset!");
static_assert(offsetof(GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate, K2Node_SwitchEnum_CmpSuccess) == 0x0001D8, "Member 'GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate, K2Node_SwitchEnum_CmpSuccess_1) == 0x0001D9, "Member 'GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate, K2Node_CustomEvent_TargetData_2) == 0x0001E0, "Member 'GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate::K2Node_CustomEvent_TargetData_2' has a wrong offset!");
static_assert(offsetof(GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate, K2Node_CustomEvent_ApplicationTag_2) == 0x000208, "Member 'GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate::K2Node_CustomEvent_ApplicationTag_2' has a wrong offset!");
static_assert(offsetof(GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate, K2Node_CreateDelegate_OutputDelegate_2) == 0x000210, "Member 'GAT_Athena_c4_Detonate_C_ExecuteUbergraph_GAT_Athena_c4_Detonate::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");

// Function GAT_Athena_c4_Detonate.GAT_Athena_c4_Detonate_C.Triggered_1CF0B54948FD6A9E1DB2B5BC49A0C635
// 0x0030 (0x0030 - 0x0000)
struct GAT_Athena_c4_Detonate_C_Triggered_1CF0B54948FD6A9E1DB2B5BC49A0C635 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAT_Athena_c4_Detonate_C_Triggered_1CF0B54948FD6A9E1DB2B5BC49A0C635) == 0x000008, "Wrong alignment on GAT_Athena_c4_Detonate_C_Triggered_1CF0B54948FD6A9E1DB2B5BC49A0C635");
static_assert(sizeof(GAT_Athena_c4_Detonate_C_Triggered_1CF0B54948FD6A9E1DB2B5BC49A0C635) == 0x000030, "Wrong size on GAT_Athena_c4_Detonate_C_Triggered_1CF0B54948FD6A9E1DB2B5BC49A0C635");
static_assert(offsetof(GAT_Athena_c4_Detonate_C_Triggered_1CF0B54948FD6A9E1DB2B5BC49A0C635, TargetData) == 0x000000, "Member 'GAT_Athena_c4_Detonate_C_Triggered_1CF0B54948FD6A9E1DB2B5BC49A0C635::TargetData' has a wrong offset!");
static_assert(offsetof(GAT_Athena_c4_Detonate_C_Triggered_1CF0B54948FD6A9E1DB2B5BC49A0C635, ApplicationTag) == 0x000028, "Member 'GAT_Athena_c4_Detonate_C_Triggered_1CF0B54948FD6A9E1DB2B5BC49A0C635::ApplicationTag' has a wrong offset!");

// Function GAT_Athena_c4_Detonate.GAT_Athena_c4_Detonate_C.Cancelled_1CF0B54948FD6A9E1DB2B5BC49A0C635
// 0x0030 (0x0030 - 0x0000)
struct GAT_Athena_c4_Detonate_C_Cancelled_1CF0B54948FD6A9E1DB2B5BC49A0C635 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAT_Athena_c4_Detonate_C_Cancelled_1CF0B54948FD6A9E1DB2B5BC49A0C635) == 0x000008, "Wrong alignment on GAT_Athena_c4_Detonate_C_Cancelled_1CF0B54948FD6A9E1DB2B5BC49A0C635");
static_assert(sizeof(GAT_Athena_c4_Detonate_C_Cancelled_1CF0B54948FD6A9E1DB2B5BC49A0C635) == 0x000030, "Wrong size on GAT_Athena_c4_Detonate_C_Cancelled_1CF0B54948FD6A9E1DB2B5BC49A0C635");
static_assert(offsetof(GAT_Athena_c4_Detonate_C_Cancelled_1CF0B54948FD6A9E1DB2B5BC49A0C635, TargetData) == 0x000000, "Member 'GAT_Athena_c4_Detonate_C_Cancelled_1CF0B54948FD6A9E1DB2B5BC49A0C635::TargetData' has a wrong offset!");
static_assert(offsetof(GAT_Athena_c4_Detonate_C_Cancelled_1CF0B54948FD6A9E1DB2B5BC49A0C635, ApplicationTag) == 0x000028, "Member 'GAT_Athena_c4_Detonate_C_Cancelled_1CF0B54948FD6A9E1DB2B5BC49A0C635::ApplicationTag' has a wrong offset!");

// Function GAT_Athena_c4_Detonate.GAT_Athena_c4_Detonate_C.Completed_1CF0B54948FD6A9E1DB2B5BC49A0C635
// 0x0030 (0x0030 - 0x0000)
struct GAT_Athena_c4_Detonate_C_Completed_1CF0B54948FD6A9E1DB2B5BC49A0C635 final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GAT_Athena_c4_Detonate_C_Completed_1CF0B54948FD6A9E1DB2B5BC49A0C635) == 0x000008, "Wrong alignment on GAT_Athena_c4_Detonate_C_Completed_1CF0B54948FD6A9E1DB2B5BC49A0C635");
static_assert(sizeof(GAT_Athena_c4_Detonate_C_Completed_1CF0B54948FD6A9E1DB2B5BC49A0C635) == 0x000030, "Wrong size on GAT_Athena_c4_Detonate_C_Completed_1CF0B54948FD6A9E1DB2B5BC49A0C635");
static_assert(offsetof(GAT_Athena_c4_Detonate_C_Completed_1CF0B54948FD6A9E1DB2B5BC49A0C635, TargetData) == 0x000000, "Member 'GAT_Athena_c4_Detonate_C_Completed_1CF0B54948FD6A9E1DB2B5BC49A0C635::TargetData' has a wrong offset!");
static_assert(offsetof(GAT_Athena_c4_Detonate_C_Completed_1CF0B54948FD6A9E1DB2B5BC49A0C635, ApplicationTag) == 0x000028, "Member 'GAT_Athena_c4_Detonate_C_Completed_1CF0B54948FD6A9E1DB2B5BC49A0C635::ApplicationTag' has a wrong offset!");

// Function GAT_Athena_c4_Detonate.GAT_Athena_c4_Detonate_C.Update Used Explosive Stat
// 0x0028 (0x0028 - 0x0000)
struct GAT_Athena_c4_Detonate_C_Update_Used_Explosive_Stat final
{
public:
	class AFortPawn*                              CallFunc_GetActivatingPawn_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerController*                  K2Node_DynamicCast_AsFort_Player_Controller;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GAT_Athena_c4_Detonate_C_Update_Used_Explosive_Stat) == 0x000008, "Wrong alignment on GAT_Athena_c4_Detonate_C_Update_Used_Explosive_Stat");
static_assert(sizeof(GAT_Athena_c4_Detonate_C_Update_Used_Explosive_Stat) == 0x000028, "Wrong size on GAT_Athena_c4_Detonate_C_Update_Used_Explosive_Stat");
static_assert(offsetof(GAT_Athena_c4_Detonate_C_Update_Used_Explosive_Stat, CallFunc_GetActivatingPawn_ReturnValue) == 0x000000, "Member 'GAT_Athena_c4_Detonate_C_Update_Used_Explosive_Stat::CallFunc_GetActivatingPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(GAT_Athena_c4_Detonate_C_Update_Used_Explosive_Stat, CallFunc_GetController_ReturnValue) == 0x000008, "Member 'GAT_Athena_c4_Detonate_C_Update_Used_Explosive_Stat::CallFunc_GetController_ReturnValue' has a wrong offset!");
