#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_MegaStorm_DamageRing

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCNL_MegaStorm_DamageRing.GCNL_MegaStorm_DamageRing_C
// 0x0048 (0x07D0 - 0x0788)
class AGCNL_MegaStorm_DamageRing_C final : public AFortGameplayCueNotify_Loop
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0788(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Timeline_1_StormDamage_20EF97A841793BC1BC17A38E68D1694B; // 0x0790(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_1__Direction_20EF97A841793BC1BC17A38E68D1694B; // 0x0794(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_795[0x3];                                      // 0x0795(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_1;                                        // 0x0798(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_StormDamage_217AB728482679C9E1B9D281A03AF2D6; // 0x07A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_217AB728482679C9E1B9D281A03AF2D6; // 0x07A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A5[0x3];                                      // 0x07A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x07A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               StormDamageFX;                                     // 0x07B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RawMagnitude;                                      // 0x07B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7BC[0x4];                                      // 0x07BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASafeZoneIndicator_C*                   SafeZoneIndicator;                                 // 0x07C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             OnDamageSound;                                     // 0x07C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GCNL_MegaStorm_DamageRing(int32 EntryPoint);
	void Reset();
	void OnRemoval(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents, class UCameraShake* BurstCameraShakeInstance, class ADecalActor* BurstDecalInstance);
	void OnLoopingStart(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents);
	void ReceiveBeginPlay();
	void Timeline_1__UpdateFunc();
	void Timeline_1__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCNL_MegaStorm_DamageRing_C">();
	}
	static class AGCNL_MegaStorm_DamageRing_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCNL_MegaStorm_DamageRing_C>();
	}
};
static_assert(alignof(AGCNL_MegaStorm_DamageRing_C) == 0x000008, "Wrong alignment on AGCNL_MegaStorm_DamageRing_C");
static_assert(sizeof(AGCNL_MegaStorm_DamageRing_C) == 0x0007D0, "Wrong size on AGCNL_MegaStorm_DamageRing_C");
static_assert(offsetof(AGCNL_MegaStorm_DamageRing_C, UberGraphFrame) == 0x000788, "Member 'AGCNL_MegaStorm_DamageRing_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCNL_MegaStorm_DamageRing_C, Timeline_1_StormDamage_20EF97A841793BC1BC17A38E68D1694B) == 0x000790, "Member 'AGCNL_MegaStorm_DamageRing_C::Timeline_1_StormDamage_20EF97A841793BC1BC17A38E68D1694B' has a wrong offset!");
static_assert(offsetof(AGCNL_MegaStorm_DamageRing_C, Timeline_1__Direction_20EF97A841793BC1BC17A38E68D1694B) == 0x000794, "Member 'AGCNL_MegaStorm_DamageRing_C::Timeline_1__Direction_20EF97A841793BC1BC17A38E68D1694B' has a wrong offset!");
static_assert(offsetof(AGCNL_MegaStorm_DamageRing_C, Timeline_1) == 0x000798, "Member 'AGCNL_MegaStorm_DamageRing_C::Timeline_1' has a wrong offset!");
static_assert(offsetof(AGCNL_MegaStorm_DamageRing_C, Timeline_0_StormDamage_217AB728482679C9E1B9D281A03AF2D6) == 0x0007A0, "Member 'AGCNL_MegaStorm_DamageRing_C::Timeline_0_StormDamage_217AB728482679C9E1B9D281A03AF2D6' has a wrong offset!");
static_assert(offsetof(AGCNL_MegaStorm_DamageRing_C, Timeline_0__Direction_217AB728482679C9E1B9D281A03AF2D6) == 0x0007A4, "Member 'AGCNL_MegaStorm_DamageRing_C::Timeline_0__Direction_217AB728482679C9E1B9D281A03AF2D6' has a wrong offset!");
static_assert(offsetof(AGCNL_MegaStorm_DamageRing_C, Timeline_0) == 0x0007A8, "Member 'AGCNL_MegaStorm_DamageRing_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(AGCNL_MegaStorm_DamageRing_C, StormDamageFX) == 0x0007B0, "Member 'AGCNL_MegaStorm_DamageRing_C::StormDamageFX' has a wrong offset!");
static_assert(offsetof(AGCNL_MegaStorm_DamageRing_C, RawMagnitude) == 0x0007B8, "Member 'AGCNL_MegaStorm_DamageRing_C::RawMagnitude' has a wrong offset!");
static_assert(offsetof(AGCNL_MegaStorm_DamageRing_C, SafeZoneIndicator) == 0x0007C0, "Member 'AGCNL_MegaStorm_DamageRing_C::SafeZoneIndicator' has a wrong offset!");
static_assert(offsetof(AGCNL_MegaStorm_DamageRing_C, OnDamageSound) == 0x0007C8, "Member 'AGCNL_MegaStorm_DamageRing_C::OnDamageSound' has a wrong offset!");

}

