#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_Uncle_Dash_Charging

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCNL_Uncle_Dash_Charging.GCNL_Uncle_Dash_Charging_C
// 0x0048 (0x07D0 - 0x0788)
class AGCNL_Uncle_Dash_Charging_C final : public AFortGameplayCueNotify_Loop
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0788(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               AttachedFX;                                        // 0x0790(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 PlayerPawn;                                        // 0x0798(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           ChargeTierTimer;                                   // 0x07A0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             AudioCue_Tier1;                                    // 0x07A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             AudioCue_Tier2;                                    // 0x07B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             AudioCue_Tier3;                                    // 0x07B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Pitch;                                             // 0x07C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C4[0x4];                                      // 0x07C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        Start_Spin_Audio;                                  // 0x07C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GCNL_Uncle_Dash_Charging(int32 EntryPoint);
	void OnRemoval(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents, class UCameraShake* BurstCameraShakeInstance, class ADecalActor* BurstDecalInstance);
	void ChargeTierUp();
	void ResetGate();
	void OnLoopingStart(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, const TArray<class UParticleSystemComponent*>& ParticleComponents, const TArray<class UAudioComponent*>& AudioComponents);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCNL_Uncle_Dash_Charging_C">();
	}
	static class AGCNL_Uncle_Dash_Charging_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCNL_Uncle_Dash_Charging_C>();
	}
};
static_assert(alignof(AGCNL_Uncle_Dash_Charging_C) == 0x000008, "Wrong alignment on AGCNL_Uncle_Dash_Charging_C");
static_assert(sizeof(AGCNL_Uncle_Dash_Charging_C) == 0x0007D0, "Wrong size on AGCNL_Uncle_Dash_Charging_C");
static_assert(offsetof(AGCNL_Uncle_Dash_Charging_C, UberGraphFrame) == 0x000788, "Member 'AGCNL_Uncle_Dash_Charging_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCNL_Uncle_Dash_Charging_C, AttachedFX) == 0x000790, "Member 'AGCNL_Uncle_Dash_Charging_C::AttachedFX' has a wrong offset!");
static_assert(offsetof(AGCNL_Uncle_Dash_Charging_C, PlayerPawn) == 0x000798, "Member 'AGCNL_Uncle_Dash_Charging_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(AGCNL_Uncle_Dash_Charging_C, ChargeTierTimer) == 0x0007A0, "Member 'AGCNL_Uncle_Dash_Charging_C::ChargeTierTimer' has a wrong offset!");
static_assert(offsetof(AGCNL_Uncle_Dash_Charging_C, AudioCue_Tier1) == 0x0007A8, "Member 'AGCNL_Uncle_Dash_Charging_C::AudioCue_Tier1' has a wrong offset!");
static_assert(offsetof(AGCNL_Uncle_Dash_Charging_C, AudioCue_Tier2) == 0x0007B0, "Member 'AGCNL_Uncle_Dash_Charging_C::AudioCue_Tier2' has a wrong offset!");
static_assert(offsetof(AGCNL_Uncle_Dash_Charging_C, AudioCue_Tier3) == 0x0007B8, "Member 'AGCNL_Uncle_Dash_Charging_C::AudioCue_Tier3' has a wrong offset!");
static_assert(offsetof(AGCNL_Uncle_Dash_Charging_C, Pitch) == 0x0007C0, "Member 'AGCNL_Uncle_Dash_Charging_C::Pitch' has a wrong offset!");
static_assert(offsetof(AGCNL_Uncle_Dash_Charging_C, Start_Spin_Audio) == 0x0007C8, "Member 'AGCNL_Uncle_Dash_Charging_C::Start_Spin_Audio' has a wrong offset!");

}

