#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GhostRockLayerAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK::Params
{

// Function GhostRockLayerAnimBP.GhostRockLayerAnimBP_C.ExecuteUbergraph_GhostRockLayerAnimBP
// 0x0004 (0x0004 - 0x0000)
struct GhostRockLayerAnimBP_C_ExecuteUbergraph_GhostRockLayerAnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GhostRockLayerAnimBP_C_ExecuteUbergraph_GhostRockLayerAnimBP) == 0x000004, "Wrong alignment on GhostRockLayerAnimBP_C_ExecuteUbergraph_GhostRockLayerAnimBP");
static_assert(sizeof(GhostRockLayerAnimBP_C_ExecuteUbergraph_GhostRockLayerAnimBP) == 0x000004, "Wrong size on GhostRockLayerAnimBP_C_ExecuteUbergraph_GhostRockLayerAnimBP");
static_assert(offsetof(GhostRockLayerAnimBP_C_ExecuteUbergraph_GhostRockLayerAnimBP, EntryPoint) == 0x000000, "Member 'GhostRockLayerAnimBP_C_ExecuteUbergraph_GhostRockLayerAnimBP::EntryPoint' has a wrong offset!");

// Function GhostRockLayerAnimBP.GhostRockLayerAnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct GhostRockLayerAnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(GhostRockLayerAnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on GhostRockLayerAnimBP_C_AnimGraph");
static_assert(sizeof(GhostRockLayerAnimBP_C_AnimGraph) == 0x000010, "Wrong size on GhostRockLayerAnimBP_C_AnimGraph");
static_assert(offsetof(GhostRockLayerAnimBP_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'GhostRockLayerAnimBP_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function GhostRockLayerAnimBP.GhostRockLayerAnimBP_C.ItemRelaxedEntry
// 0x0020 (0x0020 - 0x0000)
struct GhostRockLayerAnimBP_C_ItemRelaxedEntry final
{
public:
	struct FPoseLink                              InPoseRelaxedEntry;                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemRelaxedEntry_0;                                // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(GhostRockLayerAnimBP_C_ItemRelaxedEntry) == 0x000008, "Wrong alignment on GhostRockLayerAnimBP_C_ItemRelaxedEntry");
static_assert(sizeof(GhostRockLayerAnimBP_C_ItemRelaxedEntry) == 0x000020, "Wrong size on GhostRockLayerAnimBP_C_ItemRelaxedEntry");
static_assert(offsetof(GhostRockLayerAnimBP_C_ItemRelaxedEntry, InPoseRelaxedEntry) == 0x000000, "Member 'GhostRockLayerAnimBP_C_ItemRelaxedEntry::InPoseRelaxedEntry' has a wrong offset!");
static_assert(offsetof(GhostRockLayerAnimBP_C_ItemRelaxedEntry, ItemRelaxedEntry_0) == 0x000010, "Member 'GhostRockLayerAnimBP_C_ItemRelaxedEntry::ItemRelaxedEntry_0' has a wrong offset!");

// Function GhostRockLayerAnimBP.GhostRockLayerAnimBP_C.ItemLowerBodyJogPostPivot
// 0x0020 (0x0020 - 0x0000)
struct GhostRockLayerAnimBP_C_ItemLowerBodyJogPostPivot final
{
public:
	struct FPoseLink                              InPoseLowerBodyJogPostPivot;                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemLowerBodyJogPostPivot_0;                       // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(GhostRockLayerAnimBP_C_ItemLowerBodyJogPostPivot) == 0x000008, "Wrong alignment on GhostRockLayerAnimBP_C_ItemLowerBodyJogPostPivot");
static_assert(sizeof(GhostRockLayerAnimBP_C_ItemLowerBodyJogPostPivot) == 0x000020, "Wrong size on GhostRockLayerAnimBP_C_ItemLowerBodyJogPostPivot");
static_assert(offsetof(GhostRockLayerAnimBP_C_ItemLowerBodyJogPostPivot, InPoseLowerBodyJogPostPivot) == 0x000000, "Member 'GhostRockLayerAnimBP_C_ItemLowerBodyJogPostPivot::InPoseLowerBodyJogPostPivot' has a wrong offset!");
static_assert(offsetof(GhostRockLayerAnimBP_C_ItemLowerBodyJogPostPivot, ItemLowerBodyJogPostPivot_0) == 0x000010, "Member 'GhostRockLayerAnimBP_C_ItemLowerBodyJogPostPivot::ItemLowerBodyJogPostPivot_0' has a wrong offset!");

// Function GhostRockLayerAnimBP.GhostRockLayerAnimBP_C.ItemLowerBodyJogPrePivot
// 0x0020 (0x0020 - 0x0000)
struct GhostRockLayerAnimBP_C_ItemLowerBodyJogPrePivot final
{
public:
	struct FPoseLink                              InPoseLowerBodyJogPrePivot;                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemLowerBodyJogPrePivot_0;                        // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(GhostRockLayerAnimBP_C_ItemLowerBodyJogPrePivot) == 0x000008, "Wrong alignment on GhostRockLayerAnimBP_C_ItemLowerBodyJogPrePivot");
static_assert(sizeof(GhostRockLayerAnimBP_C_ItemLowerBodyJogPrePivot) == 0x000020, "Wrong size on GhostRockLayerAnimBP_C_ItemLowerBodyJogPrePivot");
static_assert(offsetof(GhostRockLayerAnimBP_C_ItemLowerBodyJogPrePivot, InPoseLowerBodyJogPrePivot) == 0x000000, "Member 'GhostRockLayerAnimBP_C_ItemLowerBodyJogPrePivot::InPoseLowerBodyJogPrePivot' has a wrong offset!");
static_assert(offsetof(GhostRockLayerAnimBP_C_ItemLowerBodyJogPrePivot, ItemLowerBodyJogPrePivot_0) == 0x000010, "Member 'GhostRockLayerAnimBP_C_ItemLowerBodyJogPrePivot::ItemLowerBodyJogPrePivot_0' has a wrong offset!");

// Function GhostRockLayerAnimBP.GhostRockLayerAnimBP_C.ItemLowerBodyJogStop
// 0x0020 (0x0020 - 0x0000)
struct GhostRockLayerAnimBP_C_ItemLowerBodyJogStop final
{
public:
	struct FPoseLink                              InPoseLowerBodyJogStop;                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemLowerBodyJogStop_0;                            // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(GhostRockLayerAnimBP_C_ItemLowerBodyJogStop) == 0x000008, "Wrong alignment on GhostRockLayerAnimBP_C_ItemLowerBodyJogStop");
static_assert(sizeof(GhostRockLayerAnimBP_C_ItemLowerBodyJogStop) == 0x000020, "Wrong size on GhostRockLayerAnimBP_C_ItemLowerBodyJogStop");
static_assert(offsetof(GhostRockLayerAnimBP_C_ItemLowerBodyJogStop, InPoseLowerBodyJogStop) == 0x000000, "Member 'GhostRockLayerAnimBP_C_ItemLowerBodyJogStop::InPoseLowerBodyJogStop' has a wrong offset!");
static_assert(offsetof(GhostRockLayerAnimBP_C_ItemLowerBodyJogStop, ItemLowerBodyJogStop_0) == 0x000010, "Member 'GhostRockLayerAnimBP_C_ItemLowerBodyJogStop::ItemLowerBodyJogStop_0' has a wrong offset!");

// Function GhostRockLayerAnimBP.GhostRockLayerAnimBP_C.ItemLowerBodyJogStart
// 0x0020 (0x0020 - 0x0000)
struct GhostRockLayerAnimBP_C_ItemLowerBodyJogStart final
{
public:
	struct FPoseLink                              InPoseLowerBodyJogStart;                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemLowerBodyJogStart_0;                           // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(GhostRockLayerAnimBP_C_ItemLowerBodyJogStart) == 0x000008, "Wrong alignment on GhostRockLayerAnimBP_C_ItemLowerBodyJogStart");
static_assert(sizeof(GhostRockLayerAnimBP_C_ItemLowerBodyJogStart) == 0x000020, "Wrong size on GhostRockLayerAnimBP_C_ItemLowerBodyJogStart");
static_assert(offsetof(GhostRockLayerAnimBP_C_ItemLowerBodyJogStart, InPoseLowerBodyJogStart) == 0x000000, "Member 'GhostRockLayerAnimBP_C_ItemLowerBodyJogStart::InPoseLowerBodyJogStart' has a wrong offset!");
static_assert(offsetof(GhostRockLayerAnimBP_C_ItemLowerBodyJogStart, ItemLowerBodyJogStart_0) == 0x000010, "Member 'GhostRockLayerAnimBP_C_ItemLowerBodyJogStart::ItemLowerBodyJogStart_0' has a wrong offset!");

// Function GhostRockLayerAnimBP.GhostRockLayerAnimBP_C.ItemLowerBodyMovement
// 0x0020 (0x0020 - 0x0000)
struct GhostRockLayerAnimBP_C_ItemLowerBodyMovement final
{
public:
	struct FPoseLink                              InPoseLowerBodyMovement;                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemLowerBodyMovement_0;                           // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(GhostRockLayerAnimBP_C_ItemLowerBodyMovement) == 0x000008, "Wrong alignment on GhostRockLayerAnimBP_C_ItemLowerBodyMovement");
static_assert(sizeof(GhostRockLayerAnimBP_C_ItemLowerBodyMovement) == 0x000020, "Wrong size on GhostRockLayerAnimBP_C_ItemLowerBodyMovement");
static_assert(offsetof(GhostRockLayerAnimBP_C_ItemLowerBodyMovement, InPoseLowerBodyMovement) == 0x000000, "Member 'GhostRockLayerAnimBP_C_ItemLowerBodyMovement::InPoseLowerBodyMovement' has a wrong offset!");
static_assert(offsetof(GhostRockLayerAnimBP_C_ItemLowerBodyMovement, ItemLowerBodyMovement_0) == 0x000010, "Member 'GhostRockLayerAnimBP_C_ItemLowerBodyMovement::ItemLowerBodyMovement_0' has a wrong offset!");

// Function GhostRockLayerAnimBP.GhostRockLayerAnimBP_C.ItemJogPostPivotAdditive
// 0x0020 (0x0020 - 0x0000)
struct GhostRockLayerAnimBP_C_ItemJogPostPivotAdditive final
{
public:
	struct FPoseLink                              InPosePostPivotAdditive;                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemJogPostPivotAdditive_0;                        // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(GhostRockLayerAnimBP_C_ItemJogPostPivotAdditive) == 0x000008, "Wrong alignment on GhostRockLayerAnimBP_C_ItemJogPostPivotAdditive");
static_assert(sizeof(GhostRockLayerAnimBP_C_ItemJogPostPivotAdditive) == 0x000020, "Wrong size on GhostRockLayerAnimBP_C_ItemJogPostPivotAdditive");
static_assert(offsetof(GhostRockLayerAnimBP_C_ItemJogPostPivotAdditive, InPosePostPivotAdditive) == 0x000000, "Member 'GhostRockLayerAnimBP_C_ItemJogPostPivotAdditive::InPosePostPivotAdditive' has a wrong offset!");
static_assert(offsetof(GhostRockLayerAnimBP_C_ItemJogPostPivotAdditive, ItemJogPostPivotAdditive_0) == 0x000010, "Member 'GhostRockLayerAnimBP_C_ItemJogPostPivotAdditive::ItemJogPostPivotAdditive_0' has a wrong offset!");

// Function GhostRockLayerAnimBP.GhostRockLayerAnimBP_C.ItemJogPrePivotAdditive
// 0x0020 (0x0020 - 0x0000)
struct GhostRockLayerAnimBP_C_ItemJogPrePivotAdditive final
{
public:
	struct FPoseLink                              InPosePrePivotAdditive;                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemJogPrePivotAdditive_0;                         // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(GhostRockLayerAnimBP_C_ItemJogPrePivotAdditive) == 0x000008, "Wrong alignment on GhostRockLayerAnimBP_C_ItemJogPrePivotAdditive");
static_assert(sizeof(GhostRockLayerAnimBP_C_ItemJogPrePivotAdditive) == 0x000020, "Wrong size on GhostRockLayerAnimBP_C_ItemJogPrePivotAdditive");
static_assert(offsetof(GhostRockLayerAnimBP_C_ItemJogPrePivotAdditive, InPosePrePivotAdditive) == 0x000000, "Member 'GhostRockLayerAnimBP_C_ItemJogPrePivotAdditive::InPosePrePivotAdditive' has a wrong offset!");
static_assert(offsetof(GhostRockLayerAnimBP_C_ItemJogPrePivotAdditive, ItemJogPrePivotAdditive_0) == 0x000010, "Member 'GhostRockLayerAnimBP_C_ItemJogPrePivotAdditive::ItemJogPrePivotAdditive_0' has a wrong offset!");

// Function GhostRockLayerAnimBP.GhostRockLayerAnimBP_C.ItemJogStopAdditive
// 0x0020 (0x0020 - 0x0000)
struct GhostRockLayerAnimBP_C_ItemJogStopAdditive final
{
public:
	struct FPoseLink                              InPoseJogStopAdditive;                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemJogStopAdditive_0;                             // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(GhostRockLayerAnimBP_C_ItemJogStopAdditive) == 0x000008, "Wrong alignment on GhostRockLayerAnimBP_C_ItemJogStopAdditive");
static_assert(sizeof(GhostRockLayerAnimBP_C_ItemJogStopAdditive) == 0x000020, "Wrong size on GhostRockLayerAnimBP_C_ItemJogStopAdditive");
static_assert(offsetof(GhostRockLayerAnimBP_C_ItemJogStopAdditive, InPoseJogStopAdditive) == 0x000000, "Member 'GhostRockLayerAnimBP_C_ItemJogStopAdditive::InPoseJogStopAdditive' has a wrong offset!");
static_assert(offsetof(GhostRockLayerAnimBP_C_ItemJogStopAdditive, ItemJogStopAdditive_0) == 0x000010, "Member 'GhostRockLayerAnimBP_C_ItemJogStopAdditive::ItemJogStopAdditive_0' has a wrong offset!");

// Function GhostRockLayerAnimBP.GhostRockLayerAnimBP_C.ItemJogStartAdditive
// 0x0020 (0x0020 - 0x0000)
struct GhostRockLayerAnimBP_C_ItemJogStartAdditive final
{
public:
	struct FPoseLink                              InPoseJogStartAdditive;                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemJogStartAdditive_0;                            // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(GhostRockLayerAnimBP_C_ItemJogStartAdditive) == 0x000008, "Wrong alignment on GhostRockLayerAnimBP_C_ItemJogStartAdditive");
static_assert(sizeof(GhostRockLayerAnimBP_C_ItemJogStartAdditive) == 0x000020, "Wrong size on GhostRockLayerAnimBP_C_ItemJogStartAdditive");
static_assert(offsetof(GhostRockLayerAnimBP_C_ItemJogStartAdditive, InPoseJogStartAdditive) == 0x000000, "Member 'GhostRockLayerAnimBP_C_ItemJogStartAdditive::InPoseJogStartAdditive' has a wrong offset!");
static_assert(offsetof(GhostRockLayerAnimBP_C_ItemJogStartAdditive, ItemJogStartAdditive_0) == 0x000010, "Member 'GhostRockLayerAnimBP_C_ItemJogStartAdditive::ItemJogStartAdditive_0' has a wrong offset!");

// Function GhostRockLayerAnimBP.GhostRockLayerAnimBP_C.ItemFlyModeLoopAdditive
// 0x0010 (0x0010 - 0x0000)
struct GhostRockLayerAnimBP_C_ItemFlyModeLoopAdditive final
{
public:
	struct FPoseLink                              ItemFlyModeLoopAdditive_0;                         // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(GhostRockLayerAnimBP_C_ItemFlyModeLoopAdditive) == 0x000008, "Wrong alignment on GhostRockLayerAnimBP_C_ItemFlyModeLoopAdditive");
static_assert(sizeof(GhostRockLayerAnimBP_C_ItemFlyModeLoopAdditive) == 0x000010, "Wrong size on GhostRockLayerAnimBP_C_ItemFlyModeLoopAdditive");
static_assert(offsetof(GhostRockLayerAnimBP_C_ItemFlyModeLoopAdditive, ItemFlyModeLoopAdditive_0) == 0x000000, "Member 'GhostRockLayerAnimBP_C_ItemFlyModeLoopAdditive::ItemFlyModeLoopAdditive_0' has a wrong offset!");

// Function GhostRockLayerAnimBP.GhostRockLayerAnimBP_C.ItemFlyModeStartAdditive
// 0x0010 (0x0010 - 0x0000)
struct GhostRockLayerAnimBP_C_ItemFlyModeStartAdditive final
{
public:
	struct FPoseLink                              ItemFlyModeStartAdditive_0;                        // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(GhostRockLayerAnimBP_C_ItemFlyModeStartAdditive) == 0x000008, "Wrong alignment on GhostRockLayerAnimBP_C_ItemFlyModeStartAdditive");
static_assert(sizeof(GhostRockLayerAnimBP_C_ItemFlyModeStartAdditive) == 0x000010, "Wrong size on GhostRockLayerAnimBP_C_ItemFlyModeStartAdditive");
static_assert(offsetof(GhostRockLayerAnimBP_C_ItemFlyModeStartAdditive, ItemFlyModeStartAdditive_0) == 0x000000, "Member 'GhostRockLayerAnimBP_C_ItemFlyModeStartAdditive::ItemFlyModeStartAdditive_0' has a wrong offset!");

// Function GhostRockLayerAnimBP.GhostRockLayerAnimBP_C.ItemZipLineStartAdditive
// 0x0010 (0x0010 - 0x0000)
struct GhostRockLayerAnimBP_C_ItemZipLineStartAdditive final
{
public:
	struct FPoseLink                              ItemZipLineStartAdditive_0;                        // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(GhostRockLayerAnimBP_C_ItemZipLineStartAdditive) == 0x000008, "Wrong alignment on GhostRockLayerAnimBP_C_ItemZipLineStartAdditive");
static_assert(sizeof(GhostRockLayerAnimBP_C_ItemZipLineStartAdditive) == 0x000010, "Wrong size on GhostRockLayerAnimBP_C_ItemZipLineStartAdditive");
static_assert(offsetof(GhostRockLayerAnimBP_C_ItemZipLineStartAdditive, ItemZipLineStartAdditive_0) == 0x000000, "Member 'GhostRockLayerAnimBP_C_ItemZipLineStartAdditive::ItemZipLineStartAdditive_0' has a wrong offset!");

// Function GhostRockLayerAnimBP.GhostRockLayerAnimBP_C.ItemJetPackJumpAdditive
// 0x0010 (0x0010 - 0x0000)
struct GhostRockLayerAnimBP_C_ItemJetPackJumpAdditive final
{
public:
	struct FPoseLink                              ItemJetPackJumpAdditive_0;                         // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(GhostRockLayerAnimBP_C_ItemJetPackJumpAdditive) == 0x000008, "Wrong alignment on GhostRockLayerAnimBP_C_ItemJetPackJumpAdditive");
static_assert(sizeof(GhostRockLayerAnimBP_C_ItemJetPackJumpAdditive) == 0x000010, "Wrong size on GhostRockLayerAnimBP_C_ItemJetPackJumpAdditive");
static_assert(offsetof(GhostRockLayerAnimBP_C_ItemJetPackJumpAdditive, ItemJetPackJumpAdditive_0) == 0x000000, "Member 'GhostRockLayerAnimBP_C_ItemJetPackJumpAdditive::ItemJetPackJumpAdditive_0' has a wrong offset!");

// Function GhostRockLayerAnimBP.GhostRockLayerAnimBP_C.ItemJetPackStartAdditive
// 0x0010 (0x0010 - 0x0000)
struct GhostRockLayerAnimBP_C_ItemJetPackStartAdditive final
{
public:
	struct FPoseLink                              ItemJetPackStartAdditive_0;                        // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(GhostRockLayerAnimBP_C_ItemJetPackStartAdditive) == 0x000008, "Wrong alignment on GhostRockLayerAnimBP_C_ItemJetPackStartAdditive");
static_assert(sizeof(GhostRockLayerAnimBP_C_ItemJetPackStartAdditive) == 0x000010, "Wrong size on GhostRockLayerAnimBP_C_ItemJetPackStartAdditive");
static_assert(offsetof(GhostRockLayerAnimBP_C_ItemJetPackStartAdditive, ItemJetPackStartAdditive_0) == 0x000000, "Member 'GhostRockLayerAnimBP_C_ItemJetPackStartAdditive::ItemJetPackStartAdditive_0' has a wrong offset!");

// Function GhostRockLayerAnimBP.GhostRockLayerAnimBP_C.ItemFallLandAdditive
// 0x0010 (0x0010 - 0x0000)
struct GhostRockLayerAnimBP_C_ItemFallLandAdditive final
{
public:
	struct FPoseLink                              ItemFallLandAdditive_0;                            // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(GhostRockLayerAnimBP_C_ItemFallLandAdditive) == 0x000008, "Wrong alignment on GhostRockLayerAnimBP_C_ItemFallLandAdditive");
static_assert(sizeof(GhostRockLayerAnimBP_C_ItemFallLandAdditive) == 0x000010, "Wrong size on GhostRockLayerAnimBP_C_ItemFallLandAdditive");
static_assert(offsetof(GhostRockLayerAnimBP_C_ItemFallLandAdditive, ItemFallLandAdditive_0) == 0x000000, "Member 'GhostRockLayerAnimBP_C_ItemFallLandAdditive::ItemFallLandAdditive_0' has a wrong offset!");

// Function GhostRockLayerAnimBP.GhostRockLayerAnimBP_C.ItemFallAdditive
// 0x0010 (0x0010 - 0x0000)
struct GhostRockLayerAnimBP_C_ItemFallAdditive final
{
public:
	struct FPoseLink                              ItemFallAdditive_0;                                // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(GhostRockLayerAnimBP_C_ItemFallAdditive) == 0x000008, "Wrong alignment on GhostRockLayerAnimBP_C_ItemFallAdditive");
static_assert(sizeof(GhostRockLayerAnimBP_C_ItemFallAdditive) == 0x000010, "Wrong size on GhostRockLayerAnimBP_C_ItemFallAdditive");
static_assert(offsetof(GhostRockLayerAnimBP_C_ItemFallAdditive, ItemFallAdditive_0) == 0x000000, "Member 'GhostRockLayerAnimBP_C_ItemFallAdditive::ItemFallAdditive_0' has a wrong offset!");

// Function GhostRockLayerAnimBP.GhostRockLayerAnimBP_C.ItemJumpLoopAdditive
// 0x0010 (0x0010 - 0x0000)
struct GhostRockLayerAnimBP_C_ItemJumpLoopAdditive final
{
public:
	struct FPoseLink                              ItemJumpLoopAdditive_0;                            // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(GhostRockLayerAnimBP_C_ItemJumpLoopAdditive) == 0x000008, "Wrong alignment on GhostRockLayerAnimBP_C_ItemJumpLoopAdditive");
static_assert(sizeof(GhostRockLayerAnimBP_C_ItemJumpLoopAdditive) == 0x000010, "Wrong size on GhostRockLayerAnimBP_C_ItemJumpLoopAdditive");
static_assert(offsetof(GhostRockLayerAnimBP_C_ItemJumpLoopAdditive, ItemJumpLoopAdditive_0) == 0x000000, "Member 'GhostRockLayerAnimBP_C_ItemJumpLoopAdditive::ItemJumpLoopAdditive_0' has a wrong offset!");

// Function GhostRockLayerAnimBP.GhostRockLayerAnimBP_C.ItemJumpUpAdditive
// 0x0010 (0x0010 - 0x0000)
struct GhostRockLayerAnimBP_C_ItemJumpUpAdditive final
{
public:
	struct FPoseLink                              ItemJumpUpAdditive_0;                              // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(GhostRockLayerAnimBP_C_ItemJumpUpAdditive) == 0x000008, "Wrong alignment on GhostRockLayerAnimBP_C_ItemJumpUpAdditive");
static_assert(sizeof(GhostRockLayerAnimBP_C_ItemJumpUpAdditive) == 0x000010, "Wrong size on GhostRockLayerAnimBP_C_ItemJumpUpAdditive");
static_assert(offsetof(GhostRockLayerAnimBP_C_ItemJumpUpAdditive, ItemJumpUpAdditive_0) == 0x000000, "Member 'GhostRockLayerAnimBP_C_ItemJumpUpAdditive::ItemJumpUpAdditive_0' has a wrong offset!");

// Function GhostRockLayerAnimBP.GhostRockLayerAnimBP_C.ItemSlopeSliding
// 0x0010 (0x0010 - 0x0000)
struct GhostRockLayerAnimBP_C_ItemSlopeSliding final
{
public:
	struct FPoseLink                              ItemSlopeSliding_0;                                // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(GhostRockLayerAnimBP_C_ItemSlopeSliding) == 0x000008, "Wrong alignment on GhostRockLayerAnimBP_C_ItemSlopeSliding");
static_assert(sizeof(GhostRockLayerAnimBP_C_ItemSlopeSliding) == 0x000010, "Wrong size on GhostRockLayerAnimBP_C_ItemSlopeSliding");
static_assert(offsetof(GhostRockLayerAnimBP_C_ItemSlopeSliding, ItemSlopeSliding_0) == 0x000000, "Member 'GhostRockLayerAnimBP_C_ItemSlopeSliding::ItemSlopeSliding_0' has a wrong offset!");

// Function GhostRockLayerAnimBP.GhostRockLayerAnimBP_C.ItemCrouchTurningAdditive
// 0x0010 (0x0010 - 0x0000)
struct GhostRockLayerAnimBP_C_ItemCrouchTurningAdditive final
{
public:
	struct FPoseLink                              ItemCrouchTurningAdditive_0;                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(GhostRockLayerAnimBP_C_ItemCrouchTurningAdditive) == 0x000008, "Wrong alignment on GhostRockLayerAnimBP_C_ItemCrouchTurningAdditive");
static_assert(sizeof(GhostRockLayerAnimBP_C_ItemCrouchTurningAdditive) == 0x000010, "Wrong size on GhostRockLayerAnimBP_C_ItemCrouchTurningAdditive");
static_assert(offsetof(GhostRockLayerAnimBP_C_ItemCrouchTurningAdditive, ItemCrouchTurningAdditive_0) == 0x000000, "Member 'GhostRockLayerAnimBP_C_ItemCrouchTurningAdditive::ItemCrouchTurningAdditive_0' has a wrong offset!");

// Function GhostRockLayerAnimBP.GhostRockLayerAnimBP_C.ItemIdleAdditive
// 0x0020 (0x0020 - 0x0000)
struct GhostRockLayerAnimBP_C_ItemIdleAdditive final
{
public:
	struct FPoseLink                              InPoseIdleAdditive;                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemIdleAdditive_0;                                // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(GhostRockLayerAnimBP_C_ItemIdleAdditive) == 0x000008, "Wrong alignment on GhostRockLayerAnimBP_C_ItemIdleAdditive");
static_assert(sizeof(GhostRockLayerAnimBP_C_ItemIdleAdditive) == 0x000020, "Wrong size on GhostRockLayerAnimBP_C_ItemIdleAdditive");
static_assert(offsetof(GhostRockLayerAnimBP_C_ItemIdleAdditive, InPoseIdleAdditive) == 0x000000, "Member 'GhostRockLayerAnimBP_C_ItemIdleAdditive::InPoseIdleAdditive' has a wrong offset!");
static_assert(offsetof(GhostRockLayerAnimBP_C_ItemIdleAdditive, ItemIdleAdditive_0) == 0x000010, "Member 'GhostRockLayerAnimBP_C_ItemIdleAdditive::ItemIdleAdditive_0' has a wrong offset!");

// Function GhostRockLayerAnimBP.GhostRockLayerAnimBP_C.ItemFullBodySprint
// 0x0020 (0x0020 - 0x0000)
struct GhostRockLayerAnimBP_C_ItemFullBodySprint final
{
public:
	struct FPoseLink                              InPoseSprint;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemFullBodySprint_0;                              // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(GhostRockLayerAnimBP_C_ItemFullBodySprint) == 0x000008, "Wrong alignment on GhostRockLayerAnimBP_C_ItemFullBodySprint");
static_assert(sizeof(GhostRockLayerAnimBP_C_ItemFullBodySprint) == 0x000020, "Wrong size on GhostRockLayerAnimBP_C_ItemFullBodySprint");
static_assert(offsetof(GhostRockLayerAnimBP_C_ItemFullBodySprint, InPoseSprint) == 0x000000, "Member 'GhostRockLayerAnimBP_C_ItemFullBodySprint::InPoseSprint' has a wrong offset!");
static_assert(offsetof(GhostRockLayerAnimBP_C_ItemFullBodySprint, ItemFullBodySprint_0) == 0x000010, "Member 'GhostRockLayerAnimBP_C_ItemFullBodySprint::ItemFullBodySprint_0' has a wrong offset!");

// Function GhostRockLayerAnimBP.GhostRockLayerAnimBP_C.ItemUpperBody
// 0x0260 (0x0260 - 0x0000)
struct GhostRockLayerAnimBP_C_ItemUpperBody final
{
public:
	struct FPoseLink                              InPoseUpperBody;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FFortAnimInput_AdjustedAim             InputParam_0;                                      // 0x0010(0x0240)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemUpperBody_0;                                   // 0x0250(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(GhostRockLayerAnimBP_C_ItemUpperBody) == 0x000008, "Wrong alignment on GhostRockLayerAnimBP_C_ItemUpperBody");
static_assert(sizeof(GhostRockLayerAnimBP_C_ItemUpperBody) == 0x000260, "Wrong size on GhostRockLayerAnimBP_C_ItemUpperBody");
static_assert(offsetof(GhostRockLayerAnimBP_C_ItemUpperBody, InPoseUpperBody) == 0x000000, "Member 'GhostRockLayerAnimBP_C_ItemUpperBody::InPoseUpperBody' has a wrong offset!");
static_assert(offsetof(GhostRockLayerAnimBP_C_ItemUpperBody, InputParam_0) == 0x000010, "Member 'GhostRockLayerAnimBP_C_ItemUpperBody::InputParam_0' has a wrong offset!");
static_assert(offsetof(GhostRockLayerAnimBP_C_ItemUpperBody, ItemUpperBody_0) == 0x000250, "Member 'GhostRockLayerAnimBP_C_ItemUpperBody::ItemUpperBody_0' has a wrong offset!");

// Function GhostRockLayerAnimBP.GhostRockLayerAnimBP_C.ItemLowerBodyLeanAdditive
// 0x0020 (0x0020 - 0x0000)
struct GhostRockLayerAnimBP_C_ItemLowerBodyLeanAdditive final
{
public:
	struct FPoseLink                              InPoseLowerBodyLeanAdditive;                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              ItemLowerBodyLeanAdditive_0;                       // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(GhostRockLayerAnimBP_C_ItemLowerBodyLeanAdditive) == 0x000008, "Wrong alignment on GhostRockLayerAnimBP_C_ItemLowerBodyLeanAdditive");
static_assert(sizeof(GhostRockLayerAnimBP_C_ItemLowerBodyLeanAdditive) == 0x000020, "Wrong size on GhostRockLayerAnimBP_C_ItemLowerBodyLeanAdditive");
static_assert(offsetof(GhostRockLayerAnimBP_C_ItemLowerBodyLeanAdditive, InPoseLowerBodyLeanAdditive) == 0x000000, "Member 'GhostRockLayerAnimBP_C_ItemLowerBodyLeanAdditive::InPoseLowerBodyLeanAdditive' has a wrong offset!");
static_assert(offsetof(GhostRockLayerAnimBP_C_ItemLowerBodyLeanAdditive, ItemLowerBodyLeanAdditive_0) == 0x000010, "Member 'GhostRockLayerAnimBP_C_ItemLowerBodyLeanAdditive::ItemLowerBodyLeanAdditive_0' has a wrong offset!");

}

