#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LoadoutSaveConfirmation

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LoadoutSaveConfirmation.LoadoutSaveConfirmation_C
// 0x0030 (0x04C8 - 0x0498)
class ULoadoutSaveConfirmation_C final : public UFortLoadoutSaveConfirmation
{
public:
	class UCommonRichTextBlock*                   CommonRichTextBlock_177;                           // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_66;                                          // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Separator_Down;                              // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Separator_Up;                                // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ULightbox_C*                            Lightbox;                                          // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_145;                                      // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LoadoutSaveConfirmation_C">();
	}
	static class ULoadoutSaveConfirmation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULoadoutSaveConfirmation_C>();
	}
};
static_assert(alignof(ULoadoutSaveConfirmation_C) == 0x000008, "Wrong alignment on ULoadoutSaveConfirmation_C");
static_assert(sizeof(ULoadoutSaveConfirmation_C) == 0x0004C8, "Wrong size on ULoadoutSaveConfirmation_C");
static_assert(offsetof(ULoadoutSaveConfirmation_C, CommonRichTextBlock_177) == 0x000498, "Member 'ULoadoutSaveConfirmation_C::CommonRichTextBlock_177' has a wrong offset!");
static_assert(offsetof(ULoadoutSaveConfirmation_C, Image_66) == 0x0004A0, "Member 'ULoadoutSaveConfirmation_C::Image_66' has a wrong offset!");
static_assert(offsetof(ULoadoutSaveConfirmation_C, Image_Separator_Down) == 0x0004A8, "Member 'ULoadoutSaveConfirmation_C::Image_Separator_Down' has a wrong offset!");
static_assert(offsetof(ULoadoutSaveConfirmation_C, Image_Separator_Up) == 0x0004B0, "Member 'ULoadoutSaveConfirmation_C::Image_Separator_Up' has a wrong offset!");
static_assert(offsetof(ULoadoutSaveConfirmation_C, Lightbox) == 0x0004B8, "Member 'ULoadoutSaveConfirmation_C::Lightbox' has a wrong offset!");
static_assert(offsetof(ULoadoutSaveConfirmation_C, SafeZone_145) == 0x0004C0, "Member 'ULoadoutSaveConfirmation_C::SafeZone_145' has a wrong offset!");

}

