#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Lotus_Mustache_HealthBar

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Lotus_Mustache_HealthBar.Lotus_Mustache_HealthBar_C
// 0x0018 (0x0248 - 0x0230)
class ULotus_Mustache_HealthBar_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UProgressBar*                           ProgressBar_35;                                    // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AActor*                                 Target;                                            // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Lotus_Mustache_HealthBar(int32 EntryPoint);
	void SetHealth(float HealthPercent);
	void Destruct();
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Lotus_Mustache_HealthBar_C">();
	}
	static class ULotus_Mustache_HealthBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULotus_Mustache_HealthBar_C>();
	}
};
static_assert(alignof(ULotus_Mustache_HealthBar_C) == 0x000008, "Wrong alignment on ULotus_Mustache_HealthBar_C");
static_assert(sizeof(ULotus_Mustache_HealthBar_C) == 0x000248, "Wrong size on ULotus_Mustache_HealthBar_C");
static_assert(offsetof(ULotus_Mustache_HealthBar_C, UberGraphFrame) == 0x000230, "Member 'ULotus_Mustache_HealthBar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ULotus_Mustache_HealthBar_C, ProgressBar_35) == 0x000238, "Member 'ULotus_Mustache_HealthBar_C::ProgressBar_35' has a wrong offset!");
static_assert(offsetof(ULotus_Mustache_HealthBar_C, Target) == 0x000240, "Member 'ULotus_Mustache_HealthBar_C::Target' has a wrong offset!");

}

