#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: M_LRG_Buff_Cat_AnimBp

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function M_LRG_Buff_Cat_AnimBp.M_LRG_Buff_Cat_AnimBp_C.ExecuteUbergraph_M_LRG_Buff_Cat_AnimBp
// 0x0018 (0x0018 - 0x0000)
struct M_LRG_Buff_Cat_AnimBp_C_ExecuteUbergraph_M_LRG_Buff_Cat_AnimBp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_Context_1;                            // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_Context;                              // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(M_LRG_Buff_Cat_AnimBp_C_ExecuteUbergraph_M_LRG_Buff_Cat_AnimBp) == 0x000004, "Wrong alignment on M_LRG_Buff_Cat_AnimBp_C_ExecuteUbergraph_M_LRG_Buff_Cat_AnimBp");
static_assert(sizeof(M_LRG_Buff_Cat_AnimBp_C_ExecuteUbergraph_M_LRG_Buff_Cat_AnimBp) == 0x000018, "Wrong size on M_LRG_Buff_Cat_AnimBp_C_ExecuteUbergraph_M_LRG_Buff_Cat_AnimBp");
static_assert(offsetof(M_LRG_Buff_Cat_AnimBp_C_ExecuteUbergraph_M_LRG_Buff_Cat_AnimBp, EntryPoint) == 0x000000, "Member 'M_LRG_Buff_Cat_AnimBp_C_ExecuteUbergraph_M_LRG_Buff_Cat_AnimBp::EntryPoint' has a wrong offset!");
static_assert(offsetof(M_LRG_Buff_Cat_AnimBp_C_ExecuteUbergraph_M_LRG_Buff_Cat_AnimBp, K2Node_Event_Context_1) == 0x000004, "Member 'M_LRG_Buff_Cat_AnimBp_C_ExecuteUbergraph_M_LRG_Buff_Cat_AnimBp::K2Node_Event_Context_1' has a wrong offset!");
static_assert(offsetof(M_LRG_Buff_Cat_AnimBp_C_ExecuteUbergraph_M_LRG_Buff_Cat_AnimBp, K2Node_Event_Context) == 0x00000C, "Member 'M_LRG_Buff_Cat_AnimBp_C_ExecuteUbergraph_M_LRG_Buff_Cat_AnimBp::K2Node_Event_Context' has a wrong offset!");
static_assert(offsetof(M_LRG_Buff_Cat_AnimBp_C_ExecuteUbergraph_M_LRG_Buff_Cat_AnimBp, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000014, "Member 'M_LRG_Buff_Cat_AnimBp_C_ExecuteUbergraph_M_LRG_Buff_Cat_AnimBp::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(M_LRG_Buff_Cat_AnimBp_C_ExecuteUbergraph_M_LRG_Buff_Cat_AnimBp, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x000015, "Member 'M_LRG_Buff_Cat_AnimBp_C_ExecuteUbergraph_M_LRG_Buff_Cat_AnimBp::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");

// Function M_LRG_Buff_Cat_AnimBp.M_LRG_Buff_Cat_AnimBp_C.OnNotifyPartsStopped
// 0x0008 (0x0008 - 0x0000)
struct M_LRG_Buff_Cat_AnimBp_C_OnNotifyPartsStopped final
{
public:
	class FName                                   Context;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(M_LRG_Buff_Cat_AnimBp_C_OnNotifyPartsStopped) == 0x000004, "Wrong alignment on M_LRG_Buff_Cat_AnimBp_C_OnNotifyPartsStopped");
static_assert(sizeof(M_LRG_Buff_Cat_AnimBp_C_OnNotifyPartsStopped) == 0x000008, "Wrong size on M_LRG_Buff_Cat_AnimBp_C_OnNotifyPartsStopped");
static_assert(offsetof(M_LRG_Buff_Cat_AnimBp_C_OnNotifyPartsStopped, Context) == 0x000000, "Member 'M_LRG_Buff_Cat_AnimBp_C_OnNotifyPartsStopped::Context' has a wrong offset!");

// Function M_LRG_Buff_Cat_AnimBp.M_LRG_Buff_Cat_AnimBp_C.OnNotifyPartsStarted
// 0x0008 (0x0008 - 0x0000)
struct M_LRG_Buff_Cat_AnimBp_C_OnNotifyPartsStarted final
{
public:
	class FName                                   Context;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(M_LRG_Buff_Cat_AnimBp_C_OnNotifyPartsStarted) == 0x000004, "Wrong alignment on M_LRG_Buff_Cat_AnimBp_C_OnNotifyPartsStarted");
static_assert(sizeof(M_LRG_Buff_Cat_AnimBp_C_OnNotifyPartsStarted) == 0x000008, "Wrong size on M_LRG_Buff_Cat_AnimBp_C_OnNotifyPartsStarted");
static_assert(offsetof(M_LRG_Buff_Cat_AnimBp_C_OnNotifyPartsStarted, Context) == 0x000000, "Member 'M_LRG_Buff_Cat_AnimBp_C_OnNotifyPartsStarted::Context' has a wrong offset!");

// Function M_LRG_Buff_Cat_AnimBp.M_LRG_Buff_Cat_AnimBp_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct M_LRG_Buff_Cat_AnimBp_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(M_LRG_Buff_Cat_AnimBp_C_AnimGraph) == 0x000008, "Wrong alignment on M_LRG_Buff_Cat_AnimBp_C_AnimGraph");
static_assert(sizeof(M_LRG_Buff_Cat_AnimBp_C_AnimGraph) == 0x000010, "Wrong size on M_LRG_Buff_Cat_AnimBp_C_AnimGraph");
static_assert(offsetof(M_LRG_Buff_Cat_AnimBp_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'M_LRG_Buff_Cat_AnimBp_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

