#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: M_MED_BananaAgent_Body_CtrlRig

#include "Basic.hpp"

#include "ControlRig_structs.hpp"
#include "ControlRig_classes.hpp"


namespace SDK
{

// ControlRigBlueprintGeneratedClass M_MED_BananaAgent_Body_CtrlRig.M_MED_BananaAgent_Body_CtrlRig_C
// 0x0620 (0x0960 - 0x0340)
class UM_MED_BananaAgent_Body_CtrlRig_C final : public UControlRig
{
public:
	struct FRigUnit_BeginExecution                BeginExecution;                                    // 0x0340(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_GetRelativeBoneTransform      GetRelativeBoneTransform;                          // 0x0370(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_MathQuaternionToEuler         MathQuaternionToEuler_0_0_0_0;                     // 0x03E0(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_MathFloatAbs                  MathFloatAbs;                                      // 0x0420(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_MathFloatRemap                MathFloatRemap_0_0_0_0_0_0;                        // 0x0448(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)
	uint8                                         Pad_488[0x8];                                      // 0x0488(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_GetRelativeBoneTransform      GetRelativeBoneTransform_0;                        // 0x0490(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_MathQuaternionToEuler         MathQuaternionToEuler_0_0_0_0_0;                   // 0x0500(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_MathFloatRemap                MathFloatRemap_0_0_0_0_0_0_0;                      // 0x0540(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_MathFloatAbs                  MathFloatAbs_0;                                    // 0x0580(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_ModifyBoneTransforms          ModifyBoneTransforms;                              // 0x05A8(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_MathQuaternionFromEuler       MathQuaternionFromEuler_1_0;                       // 0x0600(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_ModifyBoneTransforms          ModifyBoneTransforms_0;                            // 0x0640(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance)
	uint8                                         Pad_698[0x8];                                      // 0x0698(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_MathQuaternionFromEuler       MathQuaternionFromEuler_1_0_0;                     // 0x06A0(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_ModifyBoneTransforms          ModifyBoneTransforms_1;                            // 0x06E0(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance)
	uint8                                         Pad_738[0x8];                                      // 0x0738(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_MathQuaternionFromEuler       MathQuaternionFromEuler_1_0_1;                     // 0x0740(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_ModifyBoneTransforms          ModifyBoneTransforms_0_0;                          // 0x0780(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance)
	uint8                                         Pad_7D8[0x8];                                      // 0x07D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_MathQuaternionFromEuler       MathQuaternionFromEuler_1_0_0_0;                   // 0x07E0(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_ModifyBoneTransforms          ModifyBoneTransforms_0_1;                          // 0x0820(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance)
	uint8                                         Pad_878[0x8];                                      // 0x0878(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_MathQuaternionFromEuler       MathQuaternionFromEuler_1_0_0_1;                   // 0x0880(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRigUnit_ModifyBoneTransforms          ModifyBoneTransforms_0_1_0;                        // 0x08C0(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance)
	uint8                                         Pad_918[0x8];                                      // 0x0918(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_MathQuaternionFromEuler       MathQuaternionFromEuler_1_0_0_0_0;                 // 0x0920(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"M_MED_BananaAgent_Body_CtrlRig_C">();
	}
	static class UM_MED_BananaAgent_Body_CtrlRig_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UM_MED_BananaAgent_Body_CtrlRig_C>();
	}
};
static_assert(alignof(UM_MED_BananaAgent_Body_CtrlRig_C) == 0x000010, "Wrong alignment on UM_MED_BananaAgent_Body_CtrlRig_C");
static_assert(sizeof(UM_MED_BananaAgent_Body_CtrlRig_C) == 0x000960, "Wrong size on UM_MED_BananaAgent_Body_CtrlRig_C");
static_assert(offsetof(UM_MED_BananaAgent_Body_CtrlRig_C, BeginExecution) == 0x000340, "Member 'UM_MED_BananaAgent_Body_CtrlRig_C::BeginExecution' has a wrong offset!");
static_assert(offsetof(UM_MED_BananaAgent_Body_CtrlRig_C, GetRelativeBoneTransform) == 0x000370, "Member 'UM_MED_BananaAgent_Body_CtrlRig_C::GetRelativeBoneTransform' has a wrong offset!");
static_assert(offsetof(UM_MED_BananaAgent_Body_CtrlRig_C, MathQuaternionToEuler_0_0_0_0) == 0x0003E0, "Member 'UM_MED_BananaAgent_Body_CtrlRig_C::MathQuaternionToEuler_0_0_0_0' has a wrong offset!");
static_assert(offsetof(UM_MED_BananaAgent_Body_CtrlRig_C, MathFloatAbs) == 0x000420, "Member 'UM_MED_BananaAgent_Body_CtrlRig_C::MathFloatAbs' has a wrong offset!");
static_assert(offsetof(UM_MED_BananaAgent_Body_CtrlRig_C, MathFloatRemap_0_0_0_0_0_0) == 0x000448, "Member 'UM_MED_BananaAgent_Body_CtrlRig_C::MathFloatRemap_0_0_0_0_0_0' has a wrong offset!");
static_assert(offsetof(UM_MED_BananaAgent_Body_CtrlRig_C, GetRelativeBoneTransform_0) == 0x000490, "Member 'UM_MED_BananaAgent_Body_CtrlRig_C::GetRelativeBoneTransform_0' has a wrong offset!");
static_assert(offsetof(UM_MED_BananaAgent_Body_CtrlRig_C, MathQuaternionToEuler_0_0_0_0_0) == 0x000500, "Member 'UM_MED_BananaAgent_Body_CtrlRig_C::MathQuaternionToEuler_0_0_0_0_0' has a wrong offset!");
static_assert(offsetof(UM_MED_BananaAgent_Body_CtrlRig_C, MathFloatRemap_0_0_0_0_0_0_0) == 0x000540, "Member 'UM_MED_BananaAgent_Body_CtrlRig_C::MathFloatRemap_0_0_0_0_0_0_0' has a wrong offset!");
static_assert(offsetof(UM_MED_BananaAgent_Body_CtrlRig_C, MathFloatAbs_0) == 0x000580, "Member 'UM_MED_BananaAgent_Body_CtrlRig_C::MathFloatAbs_0' has a wrong offset!");
static_assert(offsetof(UM_MED_BananaAgent_Body_CtrlRig_C, ModifyBoneTransforms) == 0x0005A8, "Member 'UM_MED_BananaAgent_Body_CtrlRig_C::ModifyBoneTransforms' has a wrong offset!");
static_assert(offsetof(UM_MED_BananaAgent_Body_CtrlRig_C, MathQuaternionFromEuler_1_0) == 0x000600, "Member 'UM_MED_BananaAgent_Body_CtrlRig_C::MathQuaternionFromEuler_1_0' has a wrong offset!");
static_assert(offsetof(UM_MED_BananaAgent_Body_CtrlRig_C, ModifyBoneTransforms_0) == 0x000640, "Member 'UM_MED_BananaAgent_Body_CtrlRig_C::ModifyBoneTransforms_0' has a wrong offset!");
static_assert(offsetof(UM_MED_BananaAgent_Body_CtrlRig_C, MathQuaternionFromEuler_1_0_0) == 0x0006A0, "Member 'UM_MED_BananaAgent_Body_CtrlRig_C::MathQuaternionFromEuler_1_0_0' has a wrong offset!");
static_assert(offsetof(UM_MED_BananaAgent_Body_CtrlRig_C, ModifyBoneTransforms_1) == 0x0006E0, "Member 'UM_MED_BananaAgent_Body_CtrlRig_C::ModifyBoneTransforms_1' has a wrong offset!");
static_assert(offsetof(UM_MED_BananaAgent_Body_CtrlRig_C, MathQuaternionFromEuler_1_0_1) == 0x000740, "Member 'UM_MED_BananaAgent_Body_CtrlRig_C::MathQuaternionFromEuler_1_0_1' has a wrong offset!");
static_assert(offsetof(UM_MED_BananaAgent_Body_CtrlRig_C, ModifyBoneTransforms_0_0) == 0x000780, "Member 'UM_MED_BananaAgent_Body_CtrlRig_C::ModifyBoneTransforms_0_0' has a wrong offset!");
static_assert(offsetof(UM_MED_BananaAgent_Body_CtrlRig_C, MathQuaternionFromEuler_1_0_0_0) == 0x0007E0, "Member 'UM_MED_BananaAgent_Body_CtrlRig_C::MathQuaternionFromEuler_1_0_0_0' has a wrong offset!");
static_assert(offsetof(UM_MED_BananaAgent_Body_CtrlRig_C, ModifyBoneTransforms_0_1) == 0x000820, "Member 'UM_MED_BananaAgent_Body_CtrlRig_C::ModifyBoneTransforms_0_1' has a wrong offset!");
static_assert(offsetof(UM_MED_BananaAgent_Body_CtrlRig_C, MathQuaternionFromEuler_1_0_0_1) == 0x000880, "Member 'UM_MED_BananaAgent_Body_CtrlRig_C::MathQuaternionFromEuler_1_0_0_1' has a wrong offset!");
static_assert(offsetof(UM_MED_BananaAgent_Body_CtrlRig_C, ModifyBoneTransforms_0_1_0) == 0x0008C0, "Member 'UM_MED_BananaAgent_Body_CtrlRig_C::ModifyBoneTransforms_0_1_0' has a wrong offset!");
static_assert(offsetof(UM_MED_BananaAgent_Body_CtrlRig_C, MathQuaternionFromEuler_1_0_0_0_0) == 0x000920, "Member 'UM_MED_BananaAgent_Body_CtrlRig_C::MathQuaternionFromEuler_1_0_0_0_0' has a wrong offset!");

}

