#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: M_MED_Cat_Burglar_Human_FaceAcc_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass M_MED_Cat_Burglar_Human_FaceAcc_AnimBP.M_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C
// 0x23C0 (0x27E0 - 0x0420)
class UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	uint8                                         Pad_418[0x8];                                      // 0x0418(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0420(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0428(0x0030)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x0458(0x0140)(ContainsInstancedReference)
	uint8                                         Pad_598[0x8];                                      // 0x0598(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_7;                      // 0x05A0(0x0440)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_6;                      // 0x09E0(0x0440)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_5;                      // 0x0E20(0x0440)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_4;                      // 0x1260(0x0440)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_3;                      // 0x16A0(0x0440)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x1AE0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x1B00(0x0020)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_2;                      // 0x1B20(0x0440)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_1;                      // 0x1F60(0x0440)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics;                        // 0x23A0(0x0440)()

public:
	void ExecuteUbergraph_M_MED_Cat_Burglar_Human_FaceAcc_AnimBP(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"M_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C">();
	}
	static class UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C>();
	}
};
static_assert(alignof(UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C) == 0x000010, "Wrong alignment on UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C");
static_assert(sizeof(UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C) == 0x0027E0, "Wrong size on UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C");
static_assert(offsetof(UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C, UberGraphFrame) == 0x000420, "Member 'UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C, AnimGraphNode_Root) == 0x000428, "Member 'UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C, AnimGraphNode_CopyPoseFromMesh) == 0x000458, "Member 'UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C, AnimGraphNode_AnimDynamics_7) == 0x0005A0, "Member 'UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C::AnimGraphNode_AnimDynamics_7' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C, AnimGraphNode_AnimDynamics_6) == 0x0009E0, "Member 'UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C::AnimGraphNode_AnimDynamics_6' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C, AnimGraphNode_AnimDynamics_5) == 0x000E20, "Member 'UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C::AnimGraphNode_AnimDynamics_5' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C, AnimGraphNode_AnimDynamics_4) == 0x001260, "Member 'UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C::AnimGraphNode_AnimDynamics_4' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C, AnimGraphNode_AnimDynamics_3) == 0x0016A0, "Member 'UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C::AnimGraphNode_AnimDynamics_3' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x001AE0, "Member 'UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x001B00, "Member 'UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C, AnimGraphNode_AnimDynamics_2) == 0x001B20, "Member 'UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C::AnimGraphNode_AnimDynamics_2' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C, AnimGraphNode_AnimDynamics_1) == 0x001F60, "Member 'UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C::AnimGraphNode_AnimDynamics_1' has a wrong offset!");
static_assert(offsetof(UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C, AnimGraphNode_AnimDynamics) == 0x0023A0, "Member 'UM_MED_Cat_Burglar_Human_FaceAcc_AnimBP_C::AnimGraphNode_AnimDynamics' has a wrong offset!");

}

