#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Pickaxe_Rhino_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass Pickaxe_Rhino_AnimBlueprint.Pickaxe_Rhino_AnimBlueprint_C
// 0x0690 (0x0900 - 0x0270)
class UPickaxe_Rhino_AnimBlueprint_C final : public UAnimInstance
{
public:
	uint8                                         Pad_268[0x8];                                      // 0x0268(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0278(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_SubInput;                            // 0x02A8(0x0070)()
	uint8                                         Pad_318[0x8];                                      // 0x0318(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x0320(0x05A0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x08C0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x08E0(0x0020)()

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_Pickaxe_Rhino_AnimBlueprint(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Pickaxe_Rhino_AnimBlueprint_C">();
	}
	static class UPickaxe_Rhino_AnimBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPickaxe_Rhino_AnimBlueprint_C>();
	}
};
static_assert(alignof(UPickaxe_Rhino_AnimBlueprint_C) == 0x000010, "Wrong alignment on UPickaxe_Rhino_AnimBlueprint_C");
static_assert(sizeof(UPickaxe_Rhino_AnimBlueprint_C) == 0x000900, "Wrong size on UPickaxe_Rhino_AnimBlueprint_C");
static_assert(offsetof(UPickaxe_Rhino_AnimBlueprint_C, UberGraphFrame) == 0x000270, "Member 'UPickaxe_Rhino_AnimBlueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPickaxe_Rhino_AnimBlueprint_C, AnimGraphNode_Root) == 0x000278, "Member 'UPickaxe_Rhino_AnimBlueprint_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UPickaxe_Rhino_AnimBlueprint_C, AnimGraphNode_SubInput) == 0x0002A8, "Member 'UPickaxe_Rhino_AnimBlueprint_C::AnimGraphNode_SubInput' has a wrong offset!");
static_assert(offsetof(UPickaxe_Rhino_AnimBlueprint_C, AnimGraphNode_RigidBody) == 0x000320, "Member 'UPickaxe_Rhino_AnimBlueprint_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(UPickaxe_Rhino_AnimBlueprint_C, AnimGraphNode_LocalToComponentSpace) == 0x0008C0, "Member 'UPickaxe_Rhino_AnimBlueprint_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UPickaxe_Rhino_AnimBlueprint_C, AnimGraphNode_ComponentToLocalSpace) == 0x0008E0, "Member 'UPickaxe_Rhino_AnimBlueprint_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");

}

