#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prj_Athena_FloppingRabbit

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "B_Prj_ThrownConsumable_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Prj_Athena_FloppingRabbit.Prj_Athena_FloppingRabbit_C
// 0x02C8 (0x0BD0 - 0x0908)
class APrj_Athena_FloppingRabbit_C final : public AB_Prj_ThrownConsumable_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Prj_Athena_FloppingRabbit_C;        // 0x0908(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        LineLoc;                                           // 0x0910(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         BigBob_BigDip_9789CB934FE6D3F1A956D993031B4307;    // 0x0918(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            BigBob__Direction_9789CB934FE6D3F1A956D993031B4307; // 0x091C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91D[0x3];                                      // 0x091D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     BigBob;                                            // 0x0920(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             NullHit;                                           // 0x0928(0x008C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FRotator                               WaterRotation;                                     // 0x09B4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                MeshLocAfterHit;                                   // 0x09C0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ChanceForBigBob;                                   // 0x09CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      ObjectTypes;                                       // 0x09D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	float                                         DistanceCheckInterval;                             // 0x09E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9E4[0x4];                                      // 0x09E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Spawner;                                           // 0x09E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StartingCatchBigBobChance;                         // 0x09F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Delay_CatchWindow;                                 // 0x09F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanCatch;                                          // 0x09F8(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          InWater;                                           // 0x09F9(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9FA[0x6];                                      // 0x09FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawn*                        PlayerPawn;                                        // 0x0A00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AB_Athena_FloppingRabbit_Wire_C*        Wire;                                              // 0x0A08(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Event_Fire;                                        // 0x0A10(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Event_InWorld;                                     // 0x0A18(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         MaxDistanceFromPlayer;                             // 0x0A20(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DefaultSpawner;                                    // 0x0A24(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A25[0x3];                                      // 0x0A25(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         IncreaseBigBobChanceAmount;                        // 0x0A28(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2C[0x4];                                      // 0x0A2C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         Row_ChanceForBigBob;                               // 0x0A30(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_ChanceForBigBobIncrease;                       // 0x0A50(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_CatchWindow;                                   // 0x0A70(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UParticleSystem*                        FX_HitWater;                                       // 0x0A90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FXScaleHitWater;                                   // 0x0A98(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AA4[0x4];                                      // 0x0AA4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Sound_HitWater;                                    // 0x0AA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        FX_WaterDip;                                       // 0x0AB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         NS_FX_HitWater;                                    // 0x0AB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         NS_FX_SpawnItems;                                  // 0x0AC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         NS_FX_WaterDip;                                    // 0x0AC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         NS_FX_WaterDip_HighTier;                           // 0x0AD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        FX_WaterDip_HighTier;                              // 0x0AD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FXScaleWaterDip;                                   // 0x0AE0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AEC[0x4];                                      // 0x0AEC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Sound_WaterDip;                                    // 0x0AF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Event_ProjDestroyed;                               // 0x0AF8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         Row_DistanceCheck;                                 // 0x0B00(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_DistanceCheckZ;                                // 0x0B20(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Dipping;                                           // 0x0B40(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B41[0x7];                                      // 0x0B41(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 SpawnedDefaultSpawner;                             // 0x0B48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FScalableFloat                         Row_BobChanceDelayMin;                             // 0x0B50(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FScalableFloat                         Row_BobChanceDelayMax;                             // 0x0B70(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          SpawnedItem;                                       // 0x0B90(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B91[0x7];                                      // 0x0B91(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_FluidSim_FN_C*                      FluidSim;                                          // 0x0B98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Sound_WaterDip_HighTier;                           // 0x0BA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WorldSpawner;                                      // 0x0BA8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BA9[0x7];                                      // 0x0BA9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        FX_SpawnItems;                                     // 0x0BB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Sound_SpawnItems;                                  // 0x0BB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ItemAttachMinDist;                                 // 0x0BC0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ItemAttachDistanceRequirement;                     // 0x0BC4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bStartedFishingSession;                            // 0x0BC8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BC9[0x3];                                      // 0x0BC9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BounceOutOfWaterDelay;                             // 0x0BCC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Prj_Athena_FloppingRabbit(int32 EntryPoint);
	void BndEvt__WaterInteractionComponent_K2Node_ComponentBoundEvent_0_WaterInteractionOnExitWater__DelegateSignature(class AFortWaterBodyActor* WaterBody, class UFortWaterInteractionComponent* WaterInteractionComponent_0, bool bIsLastBody);
	void WriteNothingCaughtFishingAnalytic();
	void CustomPickupAttach(class AFortPickup* FortPickup);
	void SpawnItemsFX();
	void CheckForHighTierSpawner();
	void CheckForDip();
	void ReceiveDestroyed();
	void HitWater(bool FishSpawner);
	void OnExploded(const TArray<class AActor*>& HitActors, const TArray<struct FHitResult>& HitResults);
	void ForceKill();
	void DistanceCheck();
	void ReceiveBeginPlay();
	void HideAndKill();
	void TryCatch();
	void CatchWindow();
	void FullDip(bool InWorldSpawner);
	void BndEvt__CapsuleComponent_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, const struct FVector& HitLocation, const struct FVector& HitNormal, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void BigBob__UpdateFunc();
	void BigBob__FinishedFunc();
	void GetSheetVals();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Prj_Athena_FloppingRabbit_C">();
	}
	static class APrj_Athena_FloppingRabbit_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APrj_Athena_FloppingRabbit_C>();
	}
};
static_assert(alignof(APrj_Athena_FloppingRabbit_C) == 0x000008, "Wrong alignment on APrj_Athena_FloppingRabbit_C");
static_assert(sizeof(APrj_Athena_FloppingRabbit_C) == 0x000BD0, "Wrong size on APrj_Athena_FloppingRabbit_C");
static_assert(offsetof(APrj_Athena_FloppingRabbit_C, UberGraphFrame_Prj_Athena_FloppingRabbit_C) == 0x000908, "Member 'APrj_Athena_FloppingRabbit_C::UberGraphFrame_Prj_Athena_FloppingRabbit_C' has a wrong offset!");
static_assert(offsetof(APrj_Athena_FloppingRabbit_C, LineLoc) == 0x000910, "Member 'APrj_Athena_FloppingRabbit_C::LineLoc' has a wrong offset!");
static_assert(offsetof(APrj_Athena_FloppingRabbit_C, BigBob_BigDip_9789CB934FE6D3F1A956D993031B4307) == 0x000918, "Member 'APrj_Athena_FloppingRabbit_C::BigBob_BigDip_9789CB934FE6D3F1A956D993031B4307' has a wrong offset!");
static_assert(offsetof(APrj_Athena_FloppingRabbit_C, BigBob__Direction_9789CB934FE6D3F1A956D993031B4307) == 0x00091C, "Member 'APrj_Athena_FloppingRabbit_C::BigBob__Direction_9789CB934FE6D3F1A956D993031B4307' has a wrong offset!");
static_assert(offsetof(APrj_Athena_FloppingRabbit_C, BigBob) == 0x000920, "Member 'APrj_Athena_FloppingRabbit_C::BigBob' has a wrong offset!");
static_assert(offsetof(APrj_Athena_FloppingRabbit_C, NullHit) == 0x000928, "Member 'APrj_Athena_FloppingRabbit_C::NullHit' has a wrong offset!");
static_assert(offsetof(APrj_Athena_FloppingRabbit_C, WaterRotation) == 0x0009B4, "Member 'APrj_Athena_FloppingRabbit_C::WaterRotation' has a wrong offset!");
static_assert(offsetof(APrj_Athena_FloppingRabbit_C, MeshLocAfterHit) == 0x0009C0, "Member 'APrj_Athena_FloppingRabbit_C::MeshLocAfterHit' has a wrong offset!");
static_assert(offsetof(APrj_Athena_FloppingRabbit_C, ChanceForBigBob) == 0x0009CC, "Member 'APrj_Athena_FloppingRabbit_C::ChanceForBigBob' has a wrong offset!");
static_assert(offsetof(APrj_Athena_FloppingRabbit_C, ObjectTypes) == 0x0009D0, "Member 'APrj_Athena_FloppingRabbit_C::ObjectTypes' has a wrong offset!");
static_assert(offsetof(APrj_Athena_FloppingRabbit_C, DistanceCheckInterval) == 0x0009E0, "Member 'APrj_Athena_FloppingRabbit_C::DistanceCheckInterval' has a wrong offset!");
static_assert(offsetof(APrj_Athena_FloppingRabbit_C, Spawner) == 0x0009E8, "Member 'APrj_Athena_FloppingRabbit_C::Spawner' has a wrong offset!");
static_assert(offsetof(APrj_Athena_FloppingRabbit_C, StartingCatchBigBobChance) == 0x0009F0, "Member 'APrj_Athena_FloppingRabbit_C::StartingCatchBigBobChance' has a wrong offset!");
static_assert(offsetof(APrj_Athena_FloppingRabbit_C, Delay_CatchWindow) == 0x0009F4, "Member 'APrj_Athena_FloppingRabbit_C::Delay_CatchWindow' has a wrong offset!");
static_assert(offsetof(APrj_Athena_FloppingRabbit_C, CanCatch) == 0x0009F8, "Member 'APrj_Athena_FloppingRabbit_C::CanCatch' has a wrong offset!");
static_assert(offsetof(APrj_Athena_FloppingRabbit_C, InWater) == 0x0009F9, "Member 'APrj_Athena_FloppingRabbit_C::InWater' has a wrong offset!");
static_assert(offsetof(APrj_Athena_FloppingRabbit_C, PlayerPawn) == 0x000A00, "Member 'APrj_Athena_FloppingRabbit_C::PlayerPawn' has a wrong offset!");
static_assert(offsetof(APrj_Athena_FloppingRabbit_C, Wire) == 0x000A08, "Member 'APrj_Athena_FloppingRabbit_C::Wire' has a wrong offset!");
static_assert(offsetof(APrj_Athena_FloppingRabbit_C, Event_Fire) == 0x000A10, "Member 'APrj_Athena_FloppingRabbit_C::Event_Fire' has a wrong offset!");
static_assert(offsetof(APrj_Athena_FloppingRabbit_C, Event_InWorld) == 0x000A18, "Member 'APrj_Athena_FloppingRabbit_C::Event_InWorld' has a wrong offset!");
static_assert(offsetof(APrj_Athena_FloppingRabbit_C, MaxDistanceFromPlayer) == 0x000A20, "Member 'APrj_Athena_FloppingRabbit_C::MaxDistanceFromPlayer' has a wrong offset!");
static_assert(offsetof(APrj_Athena_FloppingRabbit_C, DefaultSpawner) == 0x000A24, "Member 'APrj_Athena_FloppingRabbit_C::DefaultSpawner' has a wrong offset!");
static_assert(offsetof(APrj_Athena_FloppingRabbit_C, IncreaseBigBobChanceAmount) == 0x000A28, "Member 'APrj_Athena_FloppingRabbit_C::IncreaseBigBobChanceAmount' has a wrong offset!");
static_assert(offsetof(APrj_Athena_FloppingRabbit_C, Row_ChanceForBigBob) == 0x000A30, "Member 'APrj_Athena_FloppingRabbit_C::Row_ChanceForBigBob' has a wrong offset!");
static_assert(offsetof(APrj_Athena_FloppingRabbit_C, Row_ChanceForBigBobIncrease) == 0x000A50, "Member 'APrj_Athena_FloppingRabbit_C::Row_ChanceForBigBobIncrease' has a wrong offset!");
static_assert(offsetof(APrj_Athena_FloppingRabbit_C, Row_CatchWindow) == 0x000A70, "Member 'APrj_Athena_FloppingRabbit_C::Row_CatchWindow' has a wrong offset!");
static_assert(offsetof(APrj_Athena_FloppingRabbit_C, FX_HitWater) == 0x000A90, "Member 'APrj_Athena_FloppingRabbit_C::FX_HitWater' has a wrong offset!");
static_assert(offsetof(APrj_Athena_FloppingRabbit_C, FXScaleHitWater) == 0x000A98, "Member 'APrj_Athena_FloppingRabbit_C::FXScaleHitWater' has a wrong offset!");
static_assert(offsetof(APrj_Athena_FloppingRabbit_C, Sound_HitWater) == 0x000AA8, "Member 'APrj_Athena_FloppingRabbit_C::Sound_HitWater' has a wrong offset!");
static_assert(offsetof(APrj_Athena_FloppingRabbit_C, FX_WaterDip) == 0x000AB0, "Member 'APrj_Athena_FloppingRabbit_C::FX_WaterDip' has a wrong offset!");
static_assert(offsetof(APrj_Athena_FloppingRabbit_C, NS_FX_HitWater) == 0x000AB8, "Member 'APrj_Athena_FloppingRabbit_C::NS_FX_HitWater' has a wrong offset!");
static_assert(offsetof(APrj_Athena_FloppingRabbit_C, NS_FX_SpawnItems) == 0x000AC0, "Member 'APrj_Athena_FloppingRabbit_C::NS_FX_SpawnItems' has a wrong offset!");
static_assert(offsetof(APrj_Athena_FloppingRabbit_C, NS_FX_WaterDip) == 0x000AC8, "Member 'APrj_Athena_FloppingRabbit_C::NS_FX_WaterDip' has a wrong offset!");
static_assert(offsetof(APrj_Athena_FloppingRabbit_C, NS_FX_WaterDip_HighTier) == 0x000AD0, "Member 'APrj_Athena_FloppingRabbit_C::NS_FX_WaterDip_HighTier' has a wrong offset!");
static_assert(offsetof(APrj_Athena_FloppingRabbit_C, FX_WaterDip_HighTier) == 0x000AD8, "Member 'APrj_Athena_FloppingRabbit_C::FX_WaterDip_HighTier' has a wrong offset!");
static_assert(offsetof(APrj_Athena_FloppingRabbit_C, FXScaleWaterDip) == 0x000AE0, "Member 'APrj_Athena_FloppingRabbit_C::FXScaleWaterDip' has a wrong offset!");
static_assert(offsetof(APrj_Athena_FloppingRabbit_C, Sound_WaterDip) == 0x000AF0, "Member 'APrj_Athena_FloppingRabbit_C::Sound_WaterDip' has a wrong offset!");
static_assert(offsetof(APrj_Athena_FloppingRabbit_C, Event_ProjDestroyed) == 0x000AF8, "Member 'APrj_Athena_FloppingRabbit_C::Event_ProjDestroyed' has a wrong offset!");
static_assert(offsetof(APrj_Athena_FloppingRabbit_C, Row_DistanceCheck) == 0x000B00, "Member 'APrj_Athena_FloppingRabbit_C::Row_DistanceCheck' has a wrong offset!");
static_assert(offsetof(APrj_Athena_FloppingRabbit_C, Row_DistanceCheckZ) == 0x000B20, "Member 'APrj_Athena_FloppingRabbit_C::Row_DistanceCheckZ' has a wrong offset!");
static_assert(offsetof(APrj_Athena_FloppingRabbit_C, Dipping) == 0x000B40, "Member 'APrj_Athena_FloppingRabbit_C::Dipping' has a wrong offset!");
static_assert(offsetof(APrj_Athena_FloppingRabbit_C, SpawnedDefaultSpawner) == 0x000B48, "Member 'APrj_Athena_FloppingRabbit_C::SpawnedDefaultSpawner' has a wrong offset!");
static_assert(offsetof(APrj_Athena_FloppingRabbit_C, Row_BobChanceDelayMin) == 0x000B50, "Member 'APrj_Athena_FloppingRabbit_C::Row_BobChanceDelayMin' has a wrong offset!");
static_assert(offsetof(APrj_Athena_FloppingRabbit_C, Row_BobChanceDelayMax) == 0x000B70, "Member 'APrj_Athena_FloppingRabbit_C::Row_BobChanceDelayMax' has a wrong offset!");
static_assert(offsetof(APrj_Athena_FloppingRabbit_C, SpawnedItem) == 0x000B90, "Member 'APrj_Athena_FloppingRabbit_C::SpawnedItem' has a wrong offset!");
static_assert(offsetof(APrj_Athena_FloppingRabbit_C, FluidSim) == 0x000B98, "Member 'APrj_Athena_FloppingRabbit_C::FluidSim' has a wrong offset!");
static_assert(offsetof(APrj_Athena_FloppingRabbit_C, Sound_WaterDip_HighTier) == 0x000BA0, "Member 'APrj_Athena_FloppingRabbit_C::Sound_WaterDip_HighTier' has a wrong offset!");
static_assert(offsetof(APrj_Athena_FloppingRabbit_C, WorldSpawner) == 0x000BA8, "Member 'APrj_Athena_FloppingRabbit_C::WorldSpawner' has a wrong offset!");
static_assert(offsetof(APrj_Athena_FloppingRabbit_C, FX_SpawnItems) == 0x000BB0, "Member 'APrj_Athena_FloppingRabbit_C::FX_SpawnItems' has a wrong offset!");
static_assert(offsetof(APrj_Athena_FloppingRabbit_C, Sound_SpawnItems) == 0x000BB8, "Member 'APrj_Athena_FloppingRabbit_C::Sound_SpawnItems' has a wrong offset!");
static_assert(offsetof(APrj_Athena_FloppingRabbit_C, ItemAttachMinDist) == 0x000BC0, "Member 'APrj_Athena_FloppingRabbit_C::ItemAttachMinDist' has a wrong offset!");
static_assert(offsetof(APrj_Athena_FloppingRabbit_C, ItemAttachDistanceRequirement) == 0x000BC4, "Member 'APrj_Athena_FloppingRabbit_C::ItemAttachDistanceRequirement' has a wrong offset!");
static_assert(offsetof(APrj_Athena_FloppingRabbit_C, bStartedFishingSession) == 0x000BC8, "Member 'APrj_Athena_FloppingRabbit_C::bStartedFishingSession' has a wrong offset!");
static_assert(offsetof(APrj_Athena_FloppingRabbit_C, BounceOutOfWaterDelay) == 0x000BCC, "Member 'APrj_Athena_FloppingRabbit_C::BounceOutOfWaterDelay' has a wrong offset!");

}

