#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PunchCard

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PunchCard.PunchCard_C
// 0x00C8 (0x0440 - 0x0378)
class UPunchCard_C final : public UAthenaPunchCard
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Outro;                                             // 0x0380(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x0388(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  CommonWidgetSwitcher_Complete;                     // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              GridScale;                                         // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_Header;                              // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_FlatBG;                                      // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_NoBG;                                        // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_SuperBorder;                                 // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageBackground;                                   // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPunchCardEntry_C*                      PunchCardEntry_0;                                  // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPunchCardEntry_C*                      PunchCardEntry_1;                                  // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPunchCardEntry_C*                      PunchCardEntry_2;                                  // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPunchCardEntry_C*                      PunchCardEntry_3;                                  // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPunchCardEntry_C*                      PunchCardEntry_4;                                  // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPunchCardEntry_C*                      PunchCardEntry_5;                                  // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPunchCardEntry_C*                      PunchCardEntry_6;                                  // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPunchCardEntry_C*                      PunchCardEntry_7;                                  // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPunchCardEntry_C*                      PunchCardEntry_8;                                  // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPunchCardEntry_C*                      PunchCardEntry_9;                                  // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_0;                                         // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_ChallengeName;                                // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_BackgroundType;                     // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  WidgetSwitcher_Header;                             // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         LocationType;                                      // 0x0438(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSuper;                                           // 0x043C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_PunchCard(int32 EntryPoint);
	void SetSuperStyle(bool IsSuper_0);
	void UpdateCardCompleted(bool bCompleted);
	void On_Outro_Finished();
	void FinishedPlacingMedals(bool bPlayOutro);
	void On_Intro_Done();
	void ShowWidget();
	void MedalFInishedPlacing();
	void RunIntroAnim();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PunchCard_C">();
	}
	static class UPunchCard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPunchCard_C>();
	}
};
static_assert(alignof(UPunchCard_C) == 0x000008, "Wrong alignment on UPunchCard_C");
static_assert(sizeof(UPunchCard_C) == 0x000440, "Wrong size on UPunchCard_C");
static_assert(offsetof(UPunchCard_C, UberGraphFrame) == 0x000378, "Member 'UPunchCard_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPunchCard_C, Outro) == 0x000380, "Member 'UPunchCard_C::Outro' has a wrong offset!");
static_assert(offsetof(UPunchCard_C, Intro) == 0x000388, "Member 'UPunchCard_C::Intro' has a wrong offset!");
static_assert(offsetof(UPunchCard_C, CommonWidgetSwitcher_Complete) == 0x000390, "Member 'UPunchCard_C::CommonWidgetSwitcher_Complete' has a wrong offset!");
static_assert(offsetof(UPunchCard_C, GridScale) == 0x000398, "Member 'UPunchCard_C::GridScale' has a wrong offset!");
static_assert(offsetof(UPunchCard_C, HorizontalBox_Header) == 0x0003A0, "Member 'UPunchCard_C::HorizontalBox_Header' has a wrong offset!");
static_assert(offsetof(UPunchCard_C, Image_FlatBG) == 0x0003A8, "Member 'UPunchCard_C::Image_FlatBG' has a wrong offset!");
static_assert(offsetof(UPunchCard_C, Image_NoBG) == 0x0003B0, "Member 'UPunchCard_C::Image_NoBG' has a wrong offset!");
static_assert(offsetof(UPunchCard_C, Image_SuperBorder) == 0x0003B8, "Member 'UPunchCard_C::Image_SuperBorder' has a wrong offset!");
static_assert(offsetof(UPunchCard_C, ImageBackground) == 0x0003C0, "Member 'UPunchCard_C::ImageBackground' has a wrong offset!");
static_assert(offsetof(UPunchCard_C, PunchCardEntry_0) == 0x0003C8, "Member 'UPunchCard_C::PunchCardEntry_0' has a wrong offset!");
static_assert(offsetof(UPunchCard_C, PunchCardEntry_1) == 0x0003D0, "Member 'UPunchCard_C::PunchCardEntry_1' has a wrong offset!");
static_assert(offsetof(UPunchCard_C, PunchCardEntry_2) == 0x0003D8, "Member 'UPunchCard_C::PunchCardEntry_2' has a wrong offset!");
static_assert(offsetof(UPunchCard_C, PunchCardEntry_3) == 0x0003E0, "Member 'UPunchCard_C::PunchCardEntry_3' has a wrong offset!");
static_assert(offsetof(UPunchCard_C, PunchCardEntry_4) == 0x0003E8, "Member 'UPunchCard_C::PunchCardEntry_4' has a wrong offset!");
static_assert(offsetof(UPunchCard_C, PunchCardEntry_5) == 0x0003F0, "Member 'UPunchCard_C::PunchCardEntry_5' has a wrong offset!");
static_assert(offsetof(UPunchCard_C, PunchCardEntry_6) == 0x0003F8, "Member 'UPunchCard_C::PunchCardEntry_6' has a wrong offset!");
static_assert(offsetof(UPunchCard_C, PunchCardEntry_7) == 0x000400, "Member 'UPunchCard_C::PunchCardEntry_7' has a wrong offset!");
static_assert(offsetof(UPunchCard_C, PunchCardEntry_8) == 0x000408, "Member 'UPunchCard_C::PunchCardEntry_8' has a wrong offset!");
static_assert(offsetof(UPunchCard_C, PunchCardEntry_9) == 0x000410, "Member 'UPunchCard_C::PunchCardEntry_9' has a wrong offset!");
static_assert(offsetof(UPunchCard_C, SizeBox_0) == 0x000418, "Member 'UPunchCard_C::SizeBox_0' has a wrong offset!");
static_assert(offsetof(UPunchCard_C, Text_ChallengeName) == 0x000420, "Member 'UPunchCard_C::Text_ChallengeName' has a wrong offset!");
static_assert(offsetof(UPunchCard_C, WidgetSwitcher_BackgroundType) == 0x000428, "Member 'UPunchCard_C::WidgetSwitcher_BackgroundType' has a wrong offset!");
static_assert(offsetof(UPunchCard_C, WidgetSwitcher_Header) == 0x000430, "Member 'UPunchCard_C::WidgetSwitcher_Header' has a wrong offset!");
static_assert(offsetof(UPunchCard_C, LocationType) == 0x000438, "Member 'UPunchCard_C::LocationType' has a wrong offset!");
static_assert(offsetof(UPunchCard_C, IsSuper) == 0x00043C, "Member 'UPunchCard_C::IsSuper' has a wrong offset!");

}

