#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ServerBrowserActionTile

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ServerBrowserActionTile.ServerBrowserActionTile_C
// 0x00E0 (0x0CB0 - 0x0BD0)
class UServerBrowserActionTile_C final : public UFortNamedServerActionTile
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BD0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x0BD8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Selected_1;                                        // 0x0BE0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PrivacyToggle;                                     // 0x0BE8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoverToggle;                                       // 0x0BF0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ViewPlayers;                                       // 0x0BF8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Selected;                                          // 0x0C00(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonBorder*                          ActionDescription;                                 // 0x0C08(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorder_NewServerContent;                     // 0x0C10(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           CreateServerContent;                               // 0x0C18(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      CreateServerPrivacy;                               // 0x0C20(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_112;                                         // 0x0C28(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_113;                                         // 0x0C30(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_114;                                         // 0x0C38(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_115;                                         // 0x0C40(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_116;                                         // 0x0C48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ColorFill;                                   // 0x0C50(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Gradient;                                    // 0x0C58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              Launch_Overlay;                                    // 0x0C60(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextPrivacyToggle;                                 // 0x0C68(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               WarningOverlay;                                    // 0x0C70(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UTexture*>                       TEMPBGArray;                                       // 0x0C78(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class FString>                         FriendListOutput;                                  // 0x0C88(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	bool                                          PlayersShown;                                      // 0x0C98(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          NewServerIsPrivate;                                // 0x0C99(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9A[0x2];                                      // 0x0C9A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           DisabledColor;                                     // 0x0C9C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ServerBrowserActionTile(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void OnLaunchButtonEnableChanged(bool bEnableValue);
	void BP_OnUnhovered();
	void BP_OnHovered();
	void InitializeSelectedButton();
	void Construct();
	void BP_OnDeselected();
	void BP_OnSelected();
	void BndEvt__Button_ShowFriends_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__CreateServerPrivacy_K2Node_ComponentBoundEvent_4_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__CreateServerPrivacy_K2Node_ComponentBoundEvent_3_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__IconTextButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void BndEvt__Button_CloseFriends_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ServerBrowserActionTile_C">();
	}
	static class UServerBrowserActionTile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UServerBrowserActionTile_C>();
	}
};
static_assert(alignof(UServerBrowserActionTile_C) == 0x000008, "Wrong alignment on UServerBrowserActionTile_C");
static_assert(sizeof(UServerBrowserActionTile_C) == 0x000CB0, "Wrong size on UServerBrowserActionTile_C");
static_assert(offsetof(UServerBrowserActionTile_C, UberGraphFrame) == 0x000BD0, "Member 'UServerBrowserActionTile_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UServerBrowserActionTile_C, Hover) == 0x000BD8, "Member 'UServerBrowserActionTile_C::Hover' has a wrong offset!");
static_assert(offsetof(UServerBrowserActionTile_C, Selected_1) == 0x000BE0, "Member 'UServerBrowserActionTile_C::Selected_1' has a wrong offset!");
static_assert(offsetof(UServerBrowserActionTile_C, PrivacyToggle) == 0x000BE8, "Member 'UServerBrowserActionTile_C::PrivacyToggle' has a wrong offset!");
static_assert(offsetof(UServerBrowserActionTile_C, HoverToggle) == 0x000BF0, "Member 'UServerBrowserActionTile_C::HoverToggle' has a wrong offset!");
static_assert(offsetof(UServerBrowserActionTile_C, ViewPlayers) == 0x000BF8, "Member 'UServerBrowserActionTile_C::ViewPlayers' has a wrong offset!");
static_assert(offsetof(UServerBrowserActionTile_C, Selected) == 0x000C00, "Member 'UServerBrowserActionTile_C::Selected' has a wrong offset!");
static_assert(offsetof(UServerBrowserActionTile_C, ActionDescription) == 0x000C08, "Member 'UServerBrowserActionTile_C::ActionDescription' has a wrong offset!");
static_assert(offsetof(UServerBrowserActionTile_C, CommonBorder_NewServerContent) == 0x000C10, "Member 'UServerBrowserActionTile_C::CommonBorder_NewServerContent' has a wrong offset!");
static_assert(offsetof(UServerBrowserActionTile_C, CreateServerContent) == 0x000C18, "Member 'UServerBrowserActionTile_C::CreateServerContent' has a wrong offset!");
static_assert(offsetof(UServerBrowserActionTile_C, CreateServerPrivacy) == 0x000C20, "Member 'UServerBrowserActionTile_C::CreateServerPrivacy' has a wrong offset!");
static_assert(offsetof(UServerBrowserActionTile_C, Image_112) == 0x000C28, "Member 'UServerBrowserActionTile_C::Image_112' has a wrong offset!");
static_assert(offsetof(UServerBrowserActionTile_C, Image_113) == 0x000C30, "Member 'UServerBrowserActionTile_C::Image_113' has a wrong offset!");
static_assert(offsetof(UServerBrowserActionTile_C, Image_114) == 0x000C38, "Member 'UServerBrowserActionTile_C::Image_114' has a wrong offset!");
static_assert(offsetof(UServerBrowserActionTile_C, Image_115) == 0x000C40, "Member 'UServerBrowserActionTile_C::Image_115' has a wrong offset!");
static_assert(offsetof(UServerBrowserActionTile_C, Image_116) == 0x000C48, "Member 'UServerBrowserActionTile_C::Image_116' has a wrong offset!");
static_assert(offsetof(UServerBrowserActionTile_C, Image_ColorFill) == 0x000C50, "Member 'UServerBrowserActionTile_C::Image_ColorFill' has a wrong offset!");
static_assert(offsetof(UServerBrowserActionTile_C, Image_Gradient) == 0x000C58, "Member 'UServerBrowserActionTile_C::Image_Gradient' has a wrong offset!");
static_assert(offsetof(UServerBrowserActionTile_C, Launch_Overlay) == 0x000C60, "Member 'UServerBrowserActionTile_C::Launch_Overlay' has a wrong offset!");
static_assert(offsetof(UServerBrowserActionTile_C, TextPrivacyToggle) == 0x000C68, "Member 'UServerBrowserActionTile_C::TextPrivacyToggle' has a wrong offset!");
static_assert(offsetof(UServerBrowserActionTile_C, WarningOverlay) == 0x000C70, "Member 'UServerBrowserActionTile_C::WarningOverlay' has a wrong offset!");
static_assert(offsetof(UServerBrowserActionTile_C, TEMPBGArray) == 0x000C78, "Member 'UServerBrowserActionTile_C::TEMPBGArray' has a wrong offset!");
static_assert(offsetof(UServerBrowserActionTile_C, FriendListOutput) == 0x000C88, "Member 'UServerBrowserActionTile_C::FriendListOutput' has a wrong offset!");
static_assert(offsetof(UServerBrowserActionTile_C, PlayersShown) == 0x000C98, "Member 'UServerBrowserActionTile_C::PlayersShown' has a wrong offset!");
static_assert(offsetof(UServerBrowserActionTile_C, NewServerIsPrivate) == 0x000C99, "Member 'UServerBrowserActionTile_C::NewServerIsPrivate' has a wrong offset!");
static_assert(offsetof(UServerBrowserActionTile_C, DisabledColor) == 0x000C9C, "Member 'UServerBrowserActionTile_C::DisabledColor' has a wrong offset!");

}

