#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpatialCustomizationSelection

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function SpatialCustomizationSelection.SpatialCustomizationSelection_C.ExecuteUbergraph_SpatialCustomizationSelection
// 0x00E8 (0x00E8 - 0x0000)
struct SpatialCustomizationSelection_C_ExecuteUbergraph_SpatialCustomizationSelection final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	ESpatialCustomizationCategoryState            K2Node_Event_CategoryState;                        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Event_Color;                                // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bUseColorPicker;                      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_InFinalizedChoiceText;                // 0x0038(0x0018)(ConstParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0050(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0090(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00A0(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSucceeded;                           // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button_1;               // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_2;       // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpatialCustomizationSelection_C_ExecuteUbergraph_SpatialCustomizationSelection) == 0x000008, "Wrong alignment on SpatialCustomizationSelection_C_ExecuteUbergraph_SpatialCustomizationSelection");
static_assert(sizeof(SpatialCustomizationSelection_C_ExecuteUbergraph_SpatialCustomizationSelection) == 0x0000E8, "Wrong size on SpatialCustomizationSelection_C_ExecuteUbergraph_SpatialCustomizationSelection");
static_assert(offsetof(SpatialCustomizationSelection_C_ExecuteUbergraph_SpatialCustomizationSelection, EntryPoint) == 0x000000, "Member 'SpatialCustomizationSelection_C_ExecuteUbergraph_SpatialCustomizationSelection::EntryPoint' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationSelection_C_ExecuteUbergraph_SpatialCustomizationSelection, K2Node_ComponentBoundEvent_Button) == 0x000008, "Member 'SpatialCustomizationSelection_C_ExecuteUbergraph_SpatialCustomizationSelection::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationSelection_C_ExecuteUbergraph_SpatialCustomizationSelection, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'SpatialCustomizationSelection_C_ExecuteUbergraph_SpatialCustomizationSelection::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationSelection_C_ExecuteUbergraph_SpatialCustomizationSelection, K2Node_Event_CategoryState) == 0x000020, "Member 'SpatialCustomizationSelection_C_ExecuteUbergraph_SpatialCustomizationSelection::K2Node_Event_CategoryState' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationSelection_C_ExecuteUbergraph_SpatialCustomizationSelection, K2Node_Event_Color) == 0x000024, "Member 'SpatialCustomizationSelection_C_ExecuteUbergraph_SpatialCustomizationSelection::K2Node_Event_Color' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationSelection_C_ExecuteUbergraph_SpatialCustomizationSelection, K2Node_Event_bUseColorPicker) == 0x000034, "Member 'SpatialCustomizationSelection_C_ExecuteUbergraph_SpatialCustomizationSelection::K2Node_Event_bUseColorPicker' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationSelection_C_ExecuteUbergraph_SpatialCustomizationSelection, K2Node_Event_InFinalizedChoiceText) == 0x000038, "Member 'SpatialCustomizationSelection_C_ExecuteUbergraph_SpatialCustomizationSelection::K2Node_Event_InFinalizedChoiceText' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationSelection_C_ExecuteUbergraph_SpatialCustomizationSelection, K2Node_MakeStruct_FormatArgumentData) == 0x000050, "Member 'SpatialCustomizationSelection_C_ExecuteUbergraph_SpatialCustomizationSelection::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationSelection_C_ExecuteUbergraph_SpatialCustomizationSelection, K2Node_MakeArray_Array) == 0x000090, "Member 'SpatialCustomizationSelection_C_ExecuteUbergraph_SpatialCustomizationSelection::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationSelection_C_ExecuteUbergraph_SpatialCustomizationSelection, CallFunc_Format_ReturnValue) == 0x0000A0, "Member 'SpatialCustomizationSelection_C_ExecuteUbergraph_SpatialCustomizationSelection::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationSelection_C_ExecuteUbergraph_SpatialCustomizationSelection, CallFunc_PlayAnimationForward_ReturnValue) == 0x0000B8, "Member 'SpatialCustomizationSelection_C_ExecuteUbergraph_SpatialCustomizationSelection::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationSelection_C_ExecuteUbergraph_SpatialCustomizationSelection, K2Node_Event_bSucceeded) == 0x0000C0, "Member 'SpatialCustomizationSelection_C_ExecuteUbergraph_SpatialCustomizationSelection::K2Node_Event_bSucceeded' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationSelection_C_ExecuteUbergraph_SpatialCustomizationSelection, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x0000C8, "Member 'SpatialCustomizationSelection_C_ExecuteUbergraph_SpatialCustomizationSelection::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationSelection_C_ExecuteUbergraph_SpatialCustomizationSelection, K2Node_ComponentBoundEvent_Button_1) == 0x0000D0, "Member 'SpatialCustomizationSelection_C_ExecuteUbergraph_SpatialCustomizationSelection::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationSelection_C_ExecuteUbergraph_SpatialCustomizationSelection, CallFunc_PlayAnimationForward_ReturnValue_2) == 0x0000D8, "Member 'SpatialCustomizationSelection_C_ExecuteUbergraph_SpatialCustomizationSelection::CallFunc_PlayAnimationForward_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationSelection_C_ExecuteUbergraph_SpatialCustomizationSelection, CallFunc_PlayAnimationReverse_ReturnValue) == 0x0000E0, "Member 'SpatialCustomizationSelection_C_ExecuteUbergraph_SpatialCustomizationSelection::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");

// Function SpatialCustomizationSelection.SpatialCustomizationSelection_C.BndEvt__Button_PreviousChoice_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SpatialCustomizationSelection_C_BndEvt__Button_PreviousChoice_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpatialCustomizationSelection_C_BndEvt__Button_PreviousChoice_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on SpatialCustomizationSelection_C_BndEvt__Button_PreviousChoice_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(SpatialCustomizationSelection_C_BndEvt__Button_PreviousChoice_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on SpatialCustomizationSelection_C_BndEvt__Button_PreviousChoice_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(SpatialCustomizationSelection_C_BndEvt__Button_PreviousChoice_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'SpatialCustomizationSelection_C_BndEvt__Button_PreviousChoice_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function SpatialCustomizationSelection.SpatialCustomizationSelection_C.BndEvt__Button_NextChoice_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SpatialCustomizationSelection_C_BndEvt__Button_NextChoice_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpatialCustomizationSelection_C_BndEvt__Button_NextChoice_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on SpatialCustomizationSelection_C_BndEvt__Button_NextChoice_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(SpatialCustomizationSelection_C_BndEvt__Button_NextChoice_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on SpatialCustomizationSelection_C_BndEvt__Button_NextChoice_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(SpatialCustomizationSelection_C_BndEvt__Button_NextChoice_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'SpatialCustomizationSelection_C_BndEvt__Button_NextChoice_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function SpatialCustomizationSelection.SpatialCustomizationSelection_C.OnFinalizeChoiceFinished
// 0x0001 (0x0001 - 0x0000)
struct SpatialCustomizationSelection_C_OnFinalizeChoiceFinished final
{
public:
	bool                                          bSucceeded;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SpatialCustomizationSelection_C_OnFinalizeChoiceFinished) == 0x000001, "Wrong alignment on SpatialCustomizationSelection_C_OnFinalizeChoiceFinished");
static_assert(sizeof(SpatialCustomizationSelection_C_OnFinalizeChoiceFinished) == 0x000001, "Wrong size on SpatialCustomizationSelection_C_OnFinalizeChoiceFinished");
static_assert(offsetof(SpatialCustomizationSelection_C_OnFinalizeChoiceFinished, bSucceeded) == 0x000000, "Member 'SpatialCustomizationSelection_C_OnFinalizeChoiceFinished::bSucceeded' has a wrong offset!");

// Function SpatialCustomizationSelection.SpatialCustomizationSelection_C.OnUpdateFinalizedText
// 0x0018 (0x0018 - 0x0000)
struct SpatialCustomizationSelection_C_OnUpdateFinalizedText final
{
public:
	class FText                                   InFinalizedChoiceText;                             // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(SpatialCustomizationSelection_C_OnUpdateFinalizedText) == 0x000008, "Wrong alignment on SpatialCustomizationSelection_C_OnUpdateFinalizedText");
static_assert(sizeof(SpatialCustomizationSelection_C_OnUpdateFinalizedText) == 0x000018, "Wrong size on SpatialCustomizationSelection_C_OnUpdateFinalizedText");
static_assert(offsetof(SpatialCustomizationSelection_C_OnUpdateFinalizedText, InFinalizedChoiceText) == 0x000000, "Member 'SpatialCustomizationSelection_C_OnUpdateFinalizedText::InFinalizedChoiceText' has a wrong offset!");

// Function SpatialCustomizationSelection.SpatialCustomizationSelection_C.OnCategoryUpdated
// 0x0018 (0x0018 - 0x0000)
struct SpatialCustomizationSelection_C_OnCategoryUpdated final
{
public:
	ESpatialCustomizationCategoryState            CategoryState;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Color;                                             // 0x0004(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseColorPicker;                                   // 0x0014(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SpatialCustomizationSelection_C_OnCategoryUpdated) == 0x000004, "Wrong alignment on SpatialCustomizationSelection_C_OnCategoryUpdated");
static_assert(sizeof(SpatialCustomizationSelection_C_OnCategoryUpdated) == 0x000018, "Wrong size on SpatialCustomizationSelection_C_OnCategoryUpdated");
static_assert(offsetof(SpatialCustomizationSelection_C_OnCategoryUpdated, CategoryState) == 0x000000, "Member 'SpatialCustomizationSelection_C_OnCategoryUpdated::CategoryState' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationSelection_C_OnCategoryUpdated, Color) == 0x000004, "Member 'SpatialCustomizationSelection_C_OnCategoryUpdated::Color' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationSelection_C_OnCategoryUpdated, bUseColorPicker) == 0x000014, "Member 'SpatialCustomizationSelection_C_OnCategoryUpdated::bUseColorPicker' has a wrong offset!");

// Function SpatialCustomizationSelection.SpatialCustomizationSelection_C.HandleCategoryUpdated
// 0x01C8 (0x01C8 - 0x0000)
struct SpatialCustomizationSelection_C_HandleCategoryUpdated final
{
public:
	ESpatialCustomizationCategoryState            State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Color;                                             // 0x0004(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseColorPicker;                                    // 0x0014(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESpatialCustomizationCategoryState            Temp_byte_Variable;                                // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_2;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_3;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_4;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable_5;                            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_6;                            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_2;                             // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_3;                             // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_4;                             // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_5;                             // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESpatialCustomizationCategoryState            Temp_byte_Variable_1;                              // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESpatialCustomizationCategoryState            Temp_byte_Variable_2;                              // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7B[0x1];                                       // 0x007B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x007C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_R;                             // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G;                             // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B;                             // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A;                             // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x00CC(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x00E0(0x0028)()
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x010C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0120(0x0028)()
	float                                         K2Node_Select_Default_2;                           // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_Select_Default_3;                           // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_4;                           // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_5;                           // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0160(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select_Default_6;                           // 0x0170(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select_Default_7;                           // 0x0178(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x0180(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x3];                                      // 0x0199(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default_8;                           // 0x019C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_2;         // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select_Default_9;                           // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpatialCustomizationSelection_C_HandleCategoryUpdated) == 0x000008, "Wrong alignment on SpatialCustomizationSelection_C_HandleCategoryUpdated");
static_assert(sizeof(SpatialCustomizationSelection_C_HandleCategoryUpdated) == 0x0001C8, "Wrong size on SpatialCustomizationSelection_C_HandleCategoryUpdated");
static_assert(offsetof(SpatialCustomizationSelection_C_HandleCategoryUpdated, State) == 0x000000, "Member 'SpatialCustomizationSelection_C_HandleCategoryUpdated::State' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationSelection_C_HandleCategoryUpdated, Color) == 0x000004, "Member 'SpatialCustomizationSelection_C_HandleCategoryUpdated::Color' has a wrong offset!");
