#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpatialHenchmanFactionAlter

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function SpatialHenchmanFactionAlter.SpatialHenchmanFactionAlter_C.OnFocusReceived
// 0x0270 (0x0270 - 0x0000)
struct SpatialHenchmanFactionAlter_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            NewLocalVar_0;                                     // 0x00F8(0x00B8)(Edit, BlueprintVisible)
	struct FEventReply                            K2Node_MakeStruct_EventReply;                      // 0x01B0(0x00B8)()
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpatialHenchmanFactionAlter_C_OnFocusReceived) == 0x000008, "Wrong alignment on SpatialHenchmanFactionAlter_C_OnFocusReceived");
static_assert(sizeof(SpatialHenchmanFactionAlter_C_OnFocusReceived) == 0x000270, "Wrong size on SpatialHenchmanFactionAlter_C_OnFocusReceived");
static_assert(offsetof(SpatialHenchmanFactionAlter_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'SpatialHenchmanFactionAlter_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(SpatialHenchmanFactionAlter_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'SpatialHenchmanFactionAlter_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(SpatialHenchmanFactionAlter_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'SpatialHenchmanFactionAlter_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(SpatialHenchmanFactionAlter_C_OnFocusReceived, NewLocalVar_0) == 0x0000F8, "Member 'SpatialHenchmanFactionAlter_C_OnFocusReceived::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(SpatialHenchmanFactionAlter_C_OnFocusReceived, K2Node_MakeStruct_EventReply) == 0x0001B0, "Member 'SpatialHenchmanFactionAlter_C_OnFocusReceived::K2Node_MakeStruct_EventReply' has a wrong offset!");
static_assert(offsetof(SpatialHenchmanFactionAlter_C_OnFocusReceived, CallFunc_GetOwningPlayer_ReturnValue) == 0x000268, "Member 'SpatialHenchmanFactionAlter_C_OnFocusReceived::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");

// Function SpatialHenchmanFactionAlter.SpatialHenchmanFactionAlter_C.InitForVariant
// 0x0038 (0x0038 - 0x0000)
struct SpatialHenchmanFactionAlter_C_InitForVariant final
{
public:
	class UFortVariantTokenType*                  VariantToken;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionState                                 MissionState;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMissionState                                 OtherMissionState;                                 // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetDisplayName_ReturnValue;               // 0x0010(0x0018)()
	EMissionState                                 Temp_byte_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpatialHenchmanFactionAlter_C_InitForVariant) == 0x000008, "Wrong alignment on SpatialHenchmanFactionAlter_C_InitForVariant");
static_assert(sizeof(SpatialHenchmanFactionAlter_C_InitForVariant) == 0x000038, "Wrong size on SpatialHenchmanFactionAlter_C_InitForVariant");
static_assert(offsetof(SpatialHenchmanFactionAlter_C_InitForVariant, VariantToken) == 0x000000, "Member 'SpatialHenchmanFactionAlter_C_InitForVariant::VariantToken' has a wrong offset!");
static_assert(offsetof(SpatialHenchmanFactionAlter_C_InitForVariant, MissionState) == 0x000008, "Member 'SpatialHenchmanFactionAlter_C_InitForVariant::MissionState' has a wrong offset!");
static_assert(offsetof(SpatialHenchmanFactionAlter_C_InitForVariant, OtherMissionState) == 0x000009, "Member 'SpatialHenchmanFactionAlter_C_InitForVariant::OtherMissionState' has a wrong offset!");
static_assert(offsetof(SpatialHenchmanFactionAlter_C_InitForVariant, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00000A, "Member 'SpatialHenchmanFactionAlter_C_InitForVariant::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpatialHenchmanFactionAlter_C_InitForVariant, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00000B, "Member 'SpatialHenchmanFactionAlter_C_InitForVariant::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SpatialHenchmanFactionAlter_C_InitForVariant, CallFunc_IsValid_ReturnValue) == 0x00000C, "Member 'SpatialHenchmanFactionAlter_C_InitForVariant::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpatialHenchmanFactionAlter_C_InitForVariant, CallFunc_BooleanAND_ReturnValue) == 0x00000D, "Member 'SpatialHenchmanFactionAlter_C_InitForVariant::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpatialHenchmanFactionAlter_C_InitForVariant, CallFunc_GetDisplayName_ReturnValue) == 0x000010, "Member 'SpatialHenchmanFactionAlter_C_InitForVariant::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpatialHenchmanFactionAlter_C_InitForVariant, Temp_byte_Variable) == 0x000028, "Member 'SpatialHenchmanFactionAlter_C_InitForVariant::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SpatialHenchmanFactionAlter_C_InitForVariant, K2Node_Select_Default) == 0x000030, "Member 'SpatialHenchmanFactionAlter_C_InitForVariant::K2Node_Select_Default' has a wrong offset!");

// Function SpatialHenchmanFactionAlter.SpatialHenchmanFactionAlter_C.OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct SpatialHenchmanFactionAlter_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(SpatialHenchmanFactionAlter_C_OnMouseEnter) == 0x000008, "Wrong alignment on SpatialHenchmanFactionAlter_C_OnMouseEnter");
static_assert(sizeof(SpatialHenchmanFactionAlter_C_OnMouseEnter) == 0x0000A8, "Wrong size on SpatialHenchmanFactionAlter_C_OnMouseEnter");
static_assert(offsetof(SpatialHenchmanFactionAlter_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'SpatialHenchmanFactionAlter_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(SpatialHenchmanFactionAlter_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'SpatialHenchmanFactionAlter_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function SpatialHenchmanFactionAlter.SpatialHenchmanFactionAlter_C.OnMouseLeave
// 0x0070 (0x0070 - 0x0000)
struct SpatialHenchmanFactionAlter_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(SpatialHenchmanFactionAlter_C_OnMouseLeave) == 0x000008, "Wrong alignment on SpatialHenchmanFactionAlter_C_OnMouseLeave");
static_assert(sizeof(SpatialHenchmanFactionAlter_C_OnMouseLeave) == 0x000070, "Wrong size on SpatialHenchmanFactionAlter_C_OnMouseLeave");
static_assert(offsetof(SpatialHenchmanFactionAlter_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'SpatialHenchmanFactionAlter_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function SpatialHenchmanFactionAlter.SpatialHenchmanFactionAlter_C.BndEvt__SpatialHenchmenViewMoreButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SpatialHenchmanFactionAlter_C_BndEvt__SpatialHenchmenViewMoreButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpatialHenchmanFactionAlter_C_BndEvt__SpatialHenchmenViewMoreButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on SpatialHenchmanFactionAlter_C_BndEvt__SpatialHenchmenViewMoreButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(SpatialHenchmanFactionAlter_C_BndEvt__SpatialHenchmenViewMoreButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on SpatialHenchmanFactionAlter_C_BndEvt__SpatialHenchmenViewMoreButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(SpatialHenchmanFactionAlter_C_BndEvt__SpatialHenchmenViewMoreButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'SpatialHenchmanFactionAlter_C_BndEvt__SpatialHenchmenViewMoreButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function SpatialHenchmanFactionAlter.SpatialHenchmanFactionAlter_C.OnFocusLost
// 0x0008 (0x0008 - 0x0000)
struct SpatialHenchmanFactionAlter_C_OnFocusLost final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(SpatialHenchmanFactionAlter_C_OnFocusLost) == 0x000004, "Wrong alignment on SpatialHenchmanFactionAlter_C_OnFocusLost");
static_assert(sizeof(SpatialHenchmanFactionAlter_C_OnFocusLost) == 0x000008, "Wrong size on SpatialHenchmanFactionAlter_C_OnFocusLost");
static_assert(offsetof(SpatialHenchmanFactionAlter_C_OnFocusLost, InFocusEvent) == 0x000000, "Member 'SpatialHenchmanFactionAlter_C_OnFocusLost::InFocusEvent' has a wrong offset!");

// Function SpatialHenchmanFactionAlter.SpatialHenchmanFactionAlter_C.ExecuteUbergraph_SpatialHenchmanFactionAlter
// 0x0148 (0x0148 - 0x0000)
struct SpatialHenchmanFactionAlter_C_ExecuteUbergraph_SpatialHenchmanFactionAlter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0004(0x0008)(NoDestructor)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x000C(0x0038)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0048(0x0070)(ConstParm)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00C8(0x0070)(ConstParm)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpatialHenchmanFactionAlter_C_ExecuteUbergraph_SpatialHenchmanFactionAlter) == 0x000008, "Wrong alignment on SpatialHenchmanFactionAlter_C_ExecuteUbergraph_SpatialHenchmanFactionAlter");
static_assert(sizeof(SpatialHenchmanFactionAlter_C_ExecuteUbergraph_SpatialHenchmanFactionAlter) == 0x000148, "Wrong size on SpatialHenchmanFactionAlter_C_ExecuteUbergraph_SpatialHenchmanFactionAlter");
static_assert(offsetof(SpatialHenchmanFactionAlter_C_ExecuteUbergraph_SpatialHenchmanFactionAlter, EntryPoint) == 0x000000, "Member 'SpatialHenchmanFactionAlter_C_ExecuteUbergraph_SpatialHenchmanFactionAlter::EntryPoint' has a wrong offset!");
static_assert(offsetof(SpatialHenchmanFactionAlter_C_ExecuteUbergraph_SpatialHenchmanFactionAlter, K2Node_Event_InFocusEvent) == 0x000004, "Member 'SpatialHenchmanFactionAlter_C_ExecuteUbergraph_SpatialHenchmanFactionAlter::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(SpatialHenchmanFactionAlter_C_ExecuteUbergraph_SpatialHenchmanFactionAlter, K2Node_Event_MyGeometry) == 0x00000C, "Member 'SpatialHenchmanFactionAlter_C_ExecuteUbergraph_SpatialHenchmanFactionAlter::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(SpatialHenchmanFactionAlter_C_ExecuteUbergraph_SpatialHenchmanFactionAlter, K2Node_Event_MouseEvent_1) == 0x000048, "Member 'SpatialHenchmanFactionAlter_C_ExecuteUbergraph_SpatialHenchmanFactionAlter::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(SpatialHenchmanFactionAlter_C_ExecuteUbergraph_SpatialHenchmanFactionAlter, CallFunc_PlayAnimationReverse_ReturnValue) == 0x0000B8, "Member 'SpatialHenchmanFactionAlter_C_ExecuteUbergraph_SpatialHenchmanFactionAlter::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpatialHenchmanFactionAlter_C_ExecuteUbergraph_SpatialHenchmanFactionAlter, CallFunc_PlayAnimationForward_ReturnValue) == 0x0000C0, "Member 'SpatialHenchmanFactionAlter_C_ExecuteUbergraph_SpatialHenchmanFactionAlter::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpatialHenchmanFactionAlter_C_ExecuteUbergraph_SpatialHenchmanFactionAlter, K2Node_Event_MouseEvent) == 0x0000C8, "Member 'SpatialHenchmanFactionAlter_C_ExecuteUbergraph_SpatialHenchmanFactionAlter::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(SpatialHenchmanFactionAlter_C_ExecuteUbergraph_SpatialHenchmanFactionAlter, K2Node_ComponentBoundEvent_Button) == 0x000138, "Member 'SpatialHenchmanFactionAlter_C_ExecuteUbergraph_SpatialHenchmanFactionAlter::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(SpatialHenchmanFactionAlter_C_ExecuteUbergraph_SpatialHenchmanFactionAlter, CallFunc_PlayAnimation_ReturnValue) == 0x000140, "Member 'SpatialHenchmanFactionAlter_C_ExecuteUbergraph_SpatialHenchmanFactionAlter::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

}

