#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpatialCategorySelectButton

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function SpatialCategorySelectButton.SpatialCategorySelectButton_C.ExecuteUbergraph_SpatialCategorySelectButton
// 0x0068 (0x0068 - 0x0000)
struct SpatialCategorySelectButton_C_ExecuteUbergraph_SpatialCategorySelectButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B[0x5];                                       // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              K2Node_CustomEvent_bNewInputType;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue_1;            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue_1; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate;              // 0x0054(0x0010)(ZeroConstructor, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpatialCategorySelectButton_C_ExecuteUbergraph_SpatialCategorySelectButton) == 0x000008, "Wrong alignment on SpatialCategorySelectButton_C_ExecuteUbergraph_SpatialCategorySelectButton");
static_assert(sizeof(SpatialCategorySelectButton_C_ExecuteUbergraph_SpatialCategorySelectButton) == 0x000068, "Wrong size on SpatialCategorySelectButton_C_ExecuteUbergraph_SpatialCategorySelectButton");
static_assert(offsetof(SpatialCategorySelectButton_C_ExecuteUbergraph_SpatialCategorySelectButton, EntryPoint) == 0x000000, "Member 'SpatialCategorySelectButton_C_ExecuteUbergraph_SpatialCategorySelectButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(SpatialCategorySelectButton_C_ExecuteUbergraph_SpatialCategorySelectButton, Temp_bool_Variable) == 0x000004, "Member 'SpatialCategorySelectButton_C_ExecuteUbergraph_SpatialCategorySelectButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SpatialCategorySelectButton_C_ExecuteUbergraph_SpatialCategorySelectButton, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000008, "Member 'SpatialCategorySelectButton_C_ExecuteUbergraph_SpatialCategorySelectButton::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpatialCategorySelectButton_C_ExecuteUbergraph_SpatialCategorySelectButton, CallFunc_PlayAnimationForward_ReturnValue) == 0x000010, "Member 'SpatialCategorySelectButton_C_ExecuteUbergraph_SpatialCategorySelectButton::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpatialCategorySelectButton_C_ExecuteUbergraph_SpatialCategorySelectButton, Temp_byte_Variable) == 0x000018, "Member 'SpatialCategorySelectButton_C_ExecuteUbergraph_SpatialCategorySelectButton::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SpatialCategorySelectButton_C_ExecuteUbergraph_SpatialCategorySelectButton, Temp_byte_Variable_1) == 0x000019, "Member 'SpatialCategorySelectButton_C_ExecuteUbergraph_SpatialCategorySelectButton::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(SpatialCategorySelectButton_C_ExecuteUbergraph_SpatialCategorySelectButton, K2Node_Event_IsDesignTime) == 0x00001A, "Member 'SpatialCategorySelectButton_C_ExecuteUbergraph_SpatialCategorySelectButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(SpatialCategorySelectButton_C_ExecuteUbergraph_SpatialCategorySelectButton, CallFunc_GetOwningPlayer_ReturnValue) == 0x000020, "Member 'SpatialCategorySelectButton_C_ExecuteUbergraph_SpatialCategorySelectButton::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpatialCategorySelectButton_C_ExecuteUbergraph_SpatialCategorySelectButton, K2Node_CustomEvent_bNewInputType) == 0x000028, "Member 'SpatialCategorySelectButton_C_ExecuteUbergraph_SpatialCategorySelectButton::K2Node_CustomEvent_bNewInputType' has a wrong offset!");
static_assert(offsetof(SpatialCategorySelectButton_C_ExecuteUbergraph_SpatialCategorySelectButton, CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue) == 0x000030, "Member 'SpatialCategorySelectButton_C_ExecuteUbergraph_SpatialCategorySelectButton::CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpatialCategorySelectButton_C_ExecuteUbergraph_SpatialCategorySelectButton, CallFunc_GetOwningPlayer_ReturnValue_1) == 0x000038, "Member 'SpatialCategorySelectButton_C_ExecuteUbergraph_SpatialCategorySelectButton::CallFunc_GetOwningPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SpatialCategorySelectButton_C_ExecuteUbergraph_SpatialCategorySelectButton, CallFunc_GetCurrentInputType_ReturnValue) == 0x000040, "Member 'SpatialCategorySelectButton_C_ExecuteUbergraph_SpatialCategorySelectButton::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpatialCategorySelectButton_C_ExecuteUbergraph_SpatialCategorySelectButton, CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue_1) == 0x000048, "Member 'SpatialCategorySelectButton_C_ExecuteUbergraph_SpatialCategorySelectButton::CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SpatialCategorySelectButton_C_ExecuteUbergraph_SpatialCategorySelectButton, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000050, "Member 'SpatialCategorySelectButton_C_ExecuteUbergraph_SpatialCategorySelectButton::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpatialCategorySelectButton_C_ExecuteUbergraph_SpatialCategorySelectButton, K2Node_CreateDelegate_OutputDelegate) == 0x000054, "Member 'SpatialCategorySelectButton_C_ExecuteUbergraph_SpatialCategorySelectButton::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(SpatialCategorySelectButton_C_ExecuteUbergraph_SpatialCategorySelectButton, K2Node_Select_Default) == 0x000064, "Member 'SpatialCategorySelectButton_C_ExecuteUbergraph_SpatialCategorySelectButton::K2Node_Select_Default' has a wrong offset!");

// Function SpatialCategorySelectButton.SpatialCategorySelectButton_C.InputSourceChanged
// 0x0001 (0x0001 - 0x0000)
struct SpatialCategorySelectButton_C_InputSourceChanged final
{
public:
	ECommonInputType                              bNewInputType;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpatialCategorySelectButton_C_InputSourceChanged) == 0x000001, "Wrong alignment on SpatialCategorySelectButton_C_InputSourceChanged");
static_assert(sizeof(SpatialCategorySelectButton_C_InputSourceChanged) == 0x000001, "Wrong size on SpatialCategorySelectButton_C_InputSourceChanged");
static_assert(offsetof(SpatialCategorySelectButton_C_InputSourceChanged, bNewInputType) == 0x000000, "Member 'SpatialCategorySelectButton_C_InputSourceChanged::bNewInputType' has a wrong offset!");

// Function SpatialCategorySelectButton.SpatialCategorySelectButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct SpatialCategorySelectButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SpatialCategorySelectButton_C_PreConstruct) == 0x000001, "Wrong alignment on SpatialCategorySelectButton_C_PreConstruct");
static_assert(sizeof(SpatialCategorySelectButton_C_PreConstruct) == 0x000001, "Wrong size on SpatialCategorySelectButton_C_PreConstruct");
static_assert(offsetof(SpatialCategorySelectButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'SpatialCategorySelectButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

