#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Spatial_Specialbutton

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "Slate_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Spatial_Specialbutton.Spatial_Specialbutton_C
// 0x0090 (0x0C00 - 0x0B70)
class USpatial_Specialbutton_C final : public UCommonButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x0B78(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_Material;                                   // 0x0B80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0B88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_45;                                          // 0x0B90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Right_Image;                               // 0x0B98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Rich_text;                                         // 0x0BA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Button_text;                                       // 0x0BA8(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FSlateColor                            Text_Color;                                        // 0x0BC0(0x0028)(Edit, BlueprintVisible)
	class UMaterialInterface*                     Material_Brush;                                    // 0x0BE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Right_Image;                                       // 0x0BF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextJustify                                  Justifiction;                                      // 0x0BF8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Auto_wrap_text;                                    // 0x0BF9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_Spatial_Specialbutton(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void BP_OnUnhovered();
	void BP_OnHovered();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Spatial_Specialbutton_C">();
	}
	static class USpatial_Specialbutton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpatial_Specialbutton_C>();
	}
};
static_assert(alignof(USpatial_Specialbutton_C) == 0x000008, "Wrong alignment on USpatial_Specialbutton_C");
static_assert(sizeof(USpatial_Specialbutton_C) == 0x000C00, "Wrong size on USpatial_Specialbutton_C");
static_assert(offsetof(USpatial_Specialbutton_C, UberGraphFrame) == 0x000B70, "Member 'USpatial_Specialbutton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USpatial_Specialbutton_C, Hover) == 0x000B78, "Member 'USpatial_Specialbutton_C::Hover' has a wrong offset!");
static_assert(offsetof(USpatial_Specialbutton_C, Border_Material) == 0x000B80, "Member 'USpatial_Specialbutton_C::Border_Material' has a wrong offset!");
static_assert(offsetof(USpatial_Specialbutton_C, Image) == 0x000B88, "Member 'USpatial_Specialbutton_C::Image' has a wrong offset!");
static_assert(offsetof(USpatial_Specialbutton_C, Image_45) == 0x000B90, "Member 'USpatial_Specialbutton_C::Image_45' has a wrong offset!");
static_assert(offsetof(USpatial_Specialbutton_C, Overlay_Right_Image) == 0x000B98, "Member 'USpatial_Specialbutton_C::Overlay_Right_Image' has a wrong offset!");
static_assert(offsetof(USpatial_Specialbutton_C, Rich_text) == 0x000BA0, "Member 'USpatial_Specialbutton_C::Rich_text' has a wrong offset!");
static_assert(offsetof(USpatial_Specialbutton_C, Button_text) == 0x000BA8, "Member 'USpatial_Specialbutton_C::Button_text' has a wrong offset!");
static_assert(offsetof(USpatial_Specialbutton_C, Text_Color) == 0x000BC0, "Member 'USpatial_Specialbutton_C::Text_Color' has a wrong offset!");
static_assert(offsetof(USpatial_Specialbutton_C, Material_Brush) == 0x000BE8, "Member 'USpatial_Specialbutton_C::Material_Brush' has a wrong offset!");
static_assert(offsetof(USpatial_Specialbutton_C, Right_Image) == 0x000BF0, "Member 'USpatial_Specialbutton_C::Right_Image' has a wrong offset!");
static_assert(offsetof(USpatial_Specialbutton_C, Justifiction) == 0x000BF8, "Member 'USpatial_Specialbutton_C::Justifiction' has a wrong offset!");
static_assert(offsetof(USpatial_Specialbutton_C, Auto_wrap_text) == 0x000BF9, "Member 'USpatial_Specialbutton_C::Auto_wrap_text' has a wrong offset!");

}

