#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpatialFactionPerkProgress

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SpatialFactionPerkProgress.SpatialFactionPerkProgress_C
// 0x00A8 (0x0310 - 0x0268)
class USpatialFactionPerkProgress_C final : public USpatialFactionPerkProgress
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Make_it_big;                                       // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_Node;                                       // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Check;                                       // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_LockedBottom;                                // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Node;                                              // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Progress_FactionA;                                 // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Progress_Level_Bar_1;                              // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Progress_Level_Bar_2;                              // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Progress_Level_Bar_3;                              // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Progress_Level_Bar_4;                              // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Progress_Level_BasicTech;                          // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ProgressBarContainer;                              // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_height;                                    // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_IsBasic;                            // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           Selected_fill_color;                               // 0x02E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Unselected_fill_color;                             // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UImage*>                         Progressl_Bars;                                    // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference)

public:
	void ExecuteUbergraph_SpatialFactionPerkProgress(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void OnFactionSet(bool bIsCurrentFaction);
	void OnInitializePerkProgress(int32 FactionNumber, int32 PerkLevel, float PercentProgress, bool bIsRevealed, bool bIsCurrentFaction);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SpatialFactionPerkProgress_C">();
	}
	static class USpatialFactionPerkProgress_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpatialFactionPerkProgress_C>();
	}
};
static_assert(alignof(USpatialFactionPerkProgress_C) == 0x000008, "Wrong alignment on USpatialFactionPerkProgress_C");
static_assert(sizeof(USpatialFactionPerkProgress_C) == 0x000310, "Wrong size on USpatialFactionPerkProgress_C");
static_assert(offsetof(USpatialFactionPerkProgress_C, UberGraphFrame) == 0x000268, "Member 'USpatialFactionPerkProgress_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USpatialFactionPerkProgress_C, Make_it_big) == 0x000270, "Member 'USpatialFactionPerkProgress_C::Make_it_big' has a wrong offset!");
static_assert(offsetof(USpatialFactionPerkProgress_C, Border_Node) == 0x000278, "Member 'USpatialFactionPerkProgress_C::Border_Node' has a wrong offset!");
static_assert(offsetof(USpatialFactionPerkProgress_C, Image_Check) == 0x000280, "Member 'USpatialFactionPerkProgress_C::Image_Check' has a wrong offset!");
static_assert(offsetof(USpatialFactionPerkProgress_C, Image_LockedBottom) == 0x000288, "Member 'USpatialFactionPerkProgress_C::Image_LockedBottom' has a wrong offset!");
static_assert(offsetof(USpatialFactionPerkProgress_C, Node) == 0x000290, "Member 'USpatialFactionPerkProgress_C::Node' has a wrong offset!");
static_assert(offsetof(USpatialFactionPerkProgress_C, Progress_FactionA) == 0x000298, "Member 'USpatialFactionPerkProgress_C::Progress_FactionA' has a wrong offset!");
static_assert(offsetof(USpatialFactionPerkProgress_C, Progress_Level_Bar_1) == 0x0002A0, "Member 'USpatialFactionPerkProgress_C::Progress_Level_Bar_1' has a wrong offset!");
static_assert(offsetof(USpatialFactionPerkProgress_C, Progress_Level_Bar_2) == 0x0002A8, "Member 'USpatialFactionPerkProgress_C::Progress_Level_Bar_2' has a wrong offset!");
static_assert(offsetof(USpatialFactionPerkProgress_C, Progress_Level_Bar_3) == 0x0002B0, "Member 'USpatialFactionPerkProgress_C::Progress_Level_Bar_3' has a wrong offset!");
static_assert(offsetof(USpatialFactionPerkProgress_C, Progress_Level_Bar_4) == 0x0002B8, "Member 'USpatialFactionPerkProgress_C::Progress_Level_Bar_4' has a wrong offset!");
static_assert(offsetof(USpatialFactionPerkProgress_C, Progress_Level_BasicTech) == 0x0002C0, "Member 'USpatialFactionPerkProgress_C::Progress_Level_BasicTech' has a wrong offset!");
static_assert(offsetof(USpatialFactionPerkProgress_C, ProgressBarContainer) == 0x0002C8, "Member 'USpatialFactionPerkProgress_C::ProgressBarContainer' has a wrong offset!");
static_assert(offsetof(USpatialFactionPerkProgress_C, SizeBox_height) == 0x0002D0, "Member 'USpatialFactionPerkProgress_C::SizeBox_height' has a wrong offset!");
static_assert(offsetof(USpatialFactionPerkProgress_C, WidgetSwitcher_IsBasic) == 0x0002D8, "Member 'USpatialFactionPerkProgress_C::WidgetSwitcher_IsBasic' has a wrong offset!");
static_assert(offsetof(USpatialFactionPerkProgress_C, Selected_fill_color) == 0x0002E0, "Member 'USpatialFactionPerkProgress_C::Selected_fill_color' has a wrong offset!");
static_assert(offsetof(USpatialFactionPerkProgress_C, Unselected_fill_color) == 0x0002F0, "Member 'USpatialFactionPerkProgress_C::Unselected_fill_color' has a wrong offset!");
static_assert(offsetof(USpatialFactionPerkProgress_C, Progressl_Bars) == 0x000300, "Member 'USpatialFactionPerkProgress_C::Progressl_Bars' has a wrong offset!");

}

