#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpatialCustomizationChoiceNavigationButton

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SpatialCustomizationChoiceNavigationButton.SpatialCustomizationChoiceNavigationButton_C
// 0x0048 (0x0BB8 - 0x0B70)
class USpatialCustomizationChoiceNavigationButton_C final : public UCommonButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B70(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x0B78(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UFortLazyImage*                         Image_Direction;                                   // 0x0B80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          Bright;                                            // 0x0B88(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B89[0x7];                                      // 0x0B89(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UMaterialInterface>      RightDirection;                                    // 0x0B90(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SpatialCustomizationChoiceNavigationButton(int32 EntryPoint);
	void InputSourceChanged(ECommonInputType bNewInputType);
	void BP_OnUnhovered();
	void BP_OnHovered();
	void Construct();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SpatialCustomizationChoiceNavigationButton_C">();
	}
	static class USpatialCustomizationChoiceNavigationButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpatialCustomizationChoiceNavigationButton_C>();
	}
};
static_assert(alignof(USpatialCustomizationChoiceNavigationButton_C) == 0x000008, "Wrong alignment on USpatialCustomizationChoiceNavigationButton_C");
static_assert(sizeof(USpatialCustomizationChoiceNavigationButton_C) == 0x000BB8, "Wrong size on USpatialCustomizationChoiceNavigationButton_C");
static_assert(offsetof(USpatialCustomizationChoiceNavigationButton_C, UberGraphFrame) == 0x000B70, "Member 'USpatialCustomizationChoiceNavigationButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USpatialCustomizationChoiceNavigationButton_C, Hover) == 0x000B78, "Member 'USpatialCustomizationChoiceNavigationButton_C::Hover' has a wrong offset!");
static_assert(offsetof(USpatialCustomizationChoiceNavigationButton_C, Image_Direction) == 0x000B80, "Member 'USpatialCustomizationChoiceNavigationButton_C::Image_Direction' has a wrong offset!");
static_assert(offsetof(USpatialCustomizationChoiceNavigationButton_C, Bright) == 0x000B88, "Member 'USpatialCustomizationChoiceNavigationButton_C::Bright' has a wrong offset!");
static_assert(offsetof(USpatialCustomizationChoiceNavigationButton_C, RightDirection) == 0x000B90, "Member 'USpatialCustomizationChoiceNavigationButton_C::RightDirection' has a wrong offset!");

}

