#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpatialCustomizationChoice

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function SpatialCustomizationChoice.SpatialCustomizationChoice_C.ExecuteUbergraph_SpatialCustomizationChoice
// 0x00C0 (0x00C0 - 0x0000)
struct SpatialCustomizationChoice_C_ExecuteUbergraph_SpatialCustomizationChoice final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESpatialCustomizationCategoryState            K2Node_Event_State;                                // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Event_Color;                                // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomInteger_ReturnValue;                // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESpatialCustomizationCategoryState            Temp_byte_Variable_2;                              // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B[0x5];                                       // 0x006B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FMargin                                K2Node_Select_Default_1;                           // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpatialCustomizationChoice_C_ExecuteUbergraph_SpatialCustomizationChoice) == 0x000008, "Wrong alignment on SpatialCustomizationChoice_C_ExecuteUbergraph_SpatialCustomizationChoice");
static_assert(sizeof(SpatialCustomizationChoice_C_ExecuteUbergraph_SpatialCustomizationChoice) == 0x0000C0, "Wrong size on SpatialCustomizationChoice_C_ExecuteUbergraph_SpatialCustomizationChoice");
static_assert(offsetof(SpatialCustomizationChoice_C_ExecuteUbergraph_SpatialCustomizationChoice, EntryPoint) == 0x000000, "Member 'SpatialCustomizationChoice_C_ExecuteUbergraph_SpatialCustomizationChoice::EntryPoint' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationChoice_C_ExecuteUbergraph_SpatialCustomizationChoice, Temp_int_Variable) == 0x000004, "Member 'SpatialCustomizationChoice_C_ExecuteUbergraph_SpatialCustomizationChoice::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationChoice_C_ExecuteUbergraph_SpatialCustomizationChoice, Temp_int_Variable_1) == 0x000008, "Member 'SpatialCustomizationChoice_C_ExecuteUbergraph_SpatialCustomizationChoice::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationChoice_C_ExecuteUbergraph_SpatialCustomizationChoice, Temp_bool_Variable) == 0x00000C, "Member 'SpatialCustomizationChoice_C_ExecuteUbergraph_SpatialCustomizationChoice::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationChoice_C_ExecuteUbergraph_SpatialCustomizationChoice, Temp_byte_Variable) == 0x00000D, "Member 'SpatialCustomizationChoice_C_ExecuteUbergraph_SpatialCustomizationChoice::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationChoice_C_ExecuteUbergraph_SpatialCustomizationChoice, Temp_byte_Variable_1) == 0x00000E, "Member 'SpatialCustomizationChoice_C_ExecuteUbergraph_SpatialCustomizationChoice::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationChoice_C_ExecuteUbergraph_SpatialCustomizationChoice, K2Node_Event_State) == 0x00000F, "Member 'SpatialCustomizationChoice_C_ExecuteUbergraph_SpatialCustomizationChoice::K2Node_Event_State' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationChoice_C_ExecuteUbergraph_SpatialCustomizationChoice, K2Node_Event_Color) == 0x000010, "Member 'SpatialCustomizationChoice_C_ExecuteUbergraph_SpatialCustomizationChoice::K2Node_Event_Color' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationChoice_C_ExecuteUbergraph_SpatialCustomizationChoice, CallFunc_PlayAnimationForward_ReturnValue) == 0x000020, "Member 'SpatialCustomizationChoice_C_ExecuteUbergraph_SpatialCustomizationChoice::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationChoice_C_ExecuteUbergraph_SpatialCustomizationChoice, K2Node_SwitchEnum_CmpSuccess) == 0x000028, "Member 'SpatialCustomizationChoice_C_ExecuteUbergraph_SpatialCustomizationChoice::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationChoice_C_ExecuteUbergraph_SpatialCustomizationChoice, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000030, "Member 'SpatialCustomizationChoice_C_ExecuteUbergraph_SpatialCustomizationChoice::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationChoice_C_ExecuteUbergraph_SpatialCustomizationChoice, Temp_int_Variable_2) == 0x000038, "Member 'SpatialCustomizationChoice_C_ExecuteUbergraph_SpatialCustomizationChoice::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationChoice_C_ExecuteUbergraph_SpatialCustomizationChoice, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'SpatialCustomizationChoice_C_ExecuteUbergraph_SpatialCustomizationChoice::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationChoice_C_ExecuteUbergraph_SpatialCustomizationChoice, CallFunc_RandomInteger_ReturnValue) == 0x000040, "Member 'SpatialCustomizationChoice_C_ExecuteUbergraph_SpatialCustomizationChoice::CallFunc_RandomInteger_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationChoice_C_ExecuteUbergraph_SpatialCustomizationChoice, Temp_int_Variable_3) == 0x000044, "Member 'SpatialCustomizationChoice_C_ExecuteUbergraph_SpatialCustomizationChoice::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationChoice_C_ExecuteUbergraph_SpatialCustomizationChoice, Temp_int_Variable_4) == 0x000048, "Member 'SpatialCustomizationChoice_C_ExecuteUbergraph_SpatialCustomizationChoice::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationChoice_C_ExecuteUbergraph_SpatialCustomizationChoice, Temp_byte_Variable_2) == 0x00004C, "Member 'SpatialCustomizationChoice_C_ExecuteUbergraph_SpatialCustomizationChoice::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationChoice_C_ExecuteUbergraph_SpatialCustomizationChoice, K2Node_Select_Default) == 0x000050, "Member 'SpatialCustomizationChoice_C_ExecuteUbergraph_SpatialCustomizationChoice::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationChoice_C_ExecuteUbergraph_SpatialCustomizationChoice, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000058, "Member 'SpatialCustomizationChoice_C_ExecuteUbergraph_SpatialCustomizationChoice::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationChoice_C_ExecuteUbergraph_SpatialCustomizationChoice, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000060, "Member 'SpatialCustomizationChoice_C_ExecuteUbergraph_SpatialCustomizationChoice::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationChoice_C_ExecuteUbergraph_SpatialCustomizationChoice, Temp_bool_Variable_1) == 0x000068, "Member 'SpatialCustomizationChoice_C_ExecuteUbergraph_SpatialCustomizationChoice::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationChoice_C_ExecuteUbergraph_SpatialCustomizationChoice, K2Node_Event_IsDesignTime) == 0x000069, "Member 'SpatialCustomizationChoice_C_ExecuteUbergraph_SpatialCustomizationChoice::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationChoice_C_ExecuteUbergraph_SpatialCustomizationChoice, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00006A, "Member 'SpatialCustomizationChoice_C_ExecuteUbergraph_SpatialCustomizationChoice::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationChoice_C_ExecuteUbergraph_SpatialCustomizationChoice, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x000070, "Member 'SpatialCustomizationChoice_C_ExecuteUbergraph_SpatialCustomizationChoice::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationChoice_C_ExecuteUbergraph_SpatialCustomizationChoice, K2Node_MakeStruct_Margin) == 0x000078, "Member 'SpatialCustomizationChoice_C_ExecuteUbergraph_SpatialCustomizationChoice::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationChoice_C_ExecuteUbergraph_SpatialCustomizationChoice, K2Node_MakeStruct_Margin_1) == 0x000088, "Member 'SpatialCustomizationChoice_C_ExecuteUbergraph_SpatialCustomizationChoice::K2Node_MakeStruct_Margin_1' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationChoice_C_ExecuteUbergraph_SpatialCustomizationChoice, K2Node_Select_Default_1) == 0x000098, "Member 'SpatialCustomizationChoice_C_ExecuteUbergraph_SpatialCustomizationChoice::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationChoice_C_ExecuteUbergraph_SpatialCustomizationChoice, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x0000A8, "Member 'SpatialCustomizationChoice_C_ExecuteUbergraph_SpatialCustomizationChoice::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationChoice_C_ExecuteUbergraph_SpatialCustomizationChoice, CallFunc_PlayAnimationReverse_ReturnValue_1) == 0x0000B0, "Member 'SpatialCustomizationChoice_C_ExecuteUbergraph_SpatialCustomizationChoice::CallFunc_PlayAnimationReverse_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationChoice_C_ExecuteUbergraph_SpatialCustomizationChoice, K2Node_Select_Default_2) == 0x0000B8, "Member 'SpatialCustomizationChoice_C_ExecuteUbergraph_SpatialCustomizationChoice::K2Node_Select_Default_2' has a wrong offset!");

// Function SpatialCustomizationChoice.SpatialCustomizationChoice_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct SpatialCustomizationChoice_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SpatialCustomizationChoice_C_PreConstruct) == 0x000001, "Wrong alignment on SpatialCustomizationChoice_C_PreConstruct");
static_assert(sizeof(SpatialCustomizationChoice_C_PreConstruct) == 0x000001, "Wrong size on SpatialCustomizationChoice_C_PreConstruct");
static_assert(offsetof(SpatialCustomizationChoice_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'SpatialCustomizationChoice_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function SpatialCustomizationChoice.SpatialCustomizationChoice_C.OnSetupChoice
// 0x0014 (0x0014 - 0x0000)
struct SpatialCustomizationChoice_C_OnSetupChoice final
{
public:
	ESpatialCustomizationCategoryState            State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Color;                                             // 0x0004(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpatialCustomizationChoice_C_OnSetupChoice) == 0x000004, "Wrong alignment on SpatialCustomizationChoice_C_OnSetupChoice");
static_assert(sizeof(SpatialCustomizationChoice_C_OnSetupChoice) == 0x000014, "Wrong size on SpatialCustomizationChoice_C_OnSetupChoice");
static_assert(offsetof(SpatialCustomizationChoice_C_OnSetupChoice, State) == 0x000000, "Member 'SpatialCustomizationChoice_C_OnSetupChoice::State' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationChoice_C_OnSetupChoice, Color) == 0x000004, "Member 'SpatialCustomizationChoice_C_OnSetupChoice::Color' has a wrong offset!");

// Function SpatialCustomizationChoice.SpatialCustomizationChoice_C.Set Hover Color
// 0x0038 (0x0038 - 0x0000)
struct SpatialCustomizationChoice_C_Set_Hover_Color final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0010(0x0028)()
};
static_assert(alignof(SpatialCustomizationChoice_C_Set_Hover_Color) == 0x000008, "Wrong alignment on SpatialCustomizationChoice_C_Set_Hover_Color");
static_assert(sizeof(SpatialCustomizationChoice_C_Set_Hover_Color) == 0x000038, "Wrong size on SpatialCustomizationChoice_C_Set_Hover_Color");
static_assert(offsetof(SpatialCustomizationChoice_C_Set_Hover_Color, Color) == 0x000000, "Member 'SpatialCustomizationChoice_C_Set_Hover_Color::Color' has a wrong offset!");
static_assert(offsetof(SpatialCustomizationChoice_C_Set_Hover_Color, K2Node_MakeStruct_SlateColor) == 0x000010, "Member 'SpatialCustomizationChoice_C_Set_Hover_Color::K2Node_MakeStruct_SlateColor' has a wrong offset!");

}

