#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpatialFactionChoiceScreen

#include "Basic.hpp"


namespace SDK::Params
{

// Function SpatialFactionChoiceScreen.SpatialFactionChoiceScreen_C.ExecuteUbergraph_SpatialFactionChoiceScreen
// 0x0018 (0x0018 - 0x0000)
struct SpatialFactionChoiceScreen_C_ExecuteUbergraph_SpatialFactionChoiceScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button_1;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpatialFactionChoiceScreen_C_ExecuteUbergraph_SpatialFactionChoiceScreen) == 0x000008, "Wrong alignment on SpatialFactionChoiceScreen_C_ExecuteUbergraph_SpatialFactionChoiceScreen");
static_assert(sizeof(SpatialFactionChoiceScreen_C_ExecuteUbergraph_SpatialFactionChoiceScreen) == 0x000018, "Wrong size on SpatialFactionChoiceScreen_C_ExecuteUbergraph_SpatialFactionChoiceScreen");
static_assert(offsetof(SpatialFactionChoiceScreen_C_ExecuteUbergraph_SpatialFactionChoiceScreen, EntryPoint) == 0x000000, "Member 'SpatialFactionChoiceScreen_C_ExecuteUbergraph_SpatialFactionChoiceScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(SpatialFactionChoiceScreen_C_ExecuteUbergraph_SpatialFactionChoiceScreen, K2Node_ComponentBoundEvent_Button_1) == 0x000008, "Member 'SpatialFactionChoiceScreen_C_ExecuteUbergraph_SpatialFactionChoiceScreen::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(SpatialFactionChoiceScreen_C_ExecuteUbergraph_SpatialFactionChoiceScreen, K2Node_ComponentBoundEvent_Button) == 0x000010, "Member 'SpatialFactionChoiceScreen_C_ExecuteUbergraph_SpatialFactionChoiceScreen::K2Node_ComponentBoundEvent_Button' has a wrong offset!");

// Function SpatialFactionChoiceScreen.SpatialFactionChoiceScreen_C.BndEvt__Button_FactionChoice1_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SpatialFactionChoiceScreen_C_BndEvt__Button_FactionChoice1_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpatialFactionChoiceScreen_C_BndEvt__Button_FactionChoice1_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on SpatialFactionChoiceScreen_C_BndEvt__Button_FactionChoice1_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(SpatialFactionChoiceScreen_C_BndEvt__Button_FactionChoice1_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on SpatialFactionChoiceScreen_C_BndEvt__Button_FactionChoice1_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(SpatialFactionChoiceScreen_C_BndEvt__Button_FactionChoice1_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'SpatialFactionChoiceScreen_C_BndEvt__Button_FactionChoice1_K2Node_ComponentBoundEvent_1_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function SpatialFactionChoiceScreen.SpatialFactionChoiceScreen_C.BndEvt__Button_FactionChoice2_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SpatialFactionChoiceScreen_C_BndEvt__Button_FactionChoice2_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpatialFactionChoiceScreen_C_BndEvt__Button_FactionChoice2_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on SpatialFactionChoiceScreen_C_BndEvt__Button_FactionChoice2_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(SpatialFactionChoiceScreen_C_BndEvt__Button_FactionChoice2_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on SpatialFactionChoiceScreen_C_BndEvt__Button_FactionChoice2_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(SpatialFactionChoiceScreen_C_BndEvt__Button_FactionChoice2_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'SpatialFactionChoiceScreen_C_BndEvt__Button_FactionChoice2_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

}

