#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpatialHenchmanFactionComplete

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SpatialHenchmanFactionComplete.SpatialHenchmanFactionComplete_C
// 0x0058 (0x0288 - 0x0230)
class USpatialHenchmanFactionComplete_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BGFill;                                            // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LeftLine;                                          // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RightLine;                                         // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   Text_CompleteInfo;                                 // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Ego;                                               // 0x0258(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Alter;                                             // 0x0270(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void InitCompletedInfo(bool bIsAlter, class UFortItemDefinition* RewardItem);
	void ExecuteUbergraph_SpatialHenchmanFactionComplete(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SpatialHenchmanFactionComplete_C">();
	}
	static class USpatialHenchmanFactionComplete_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpatialHenchmanFactionComplete_C>();
	}
};
static_assert(alignof(USpatialHenchmanFactionComplete_C) == 0x000008, "Wrong alignment on USpatialHenchmanFactionComplete_C");
static_assert(sizeof(USpatialHenchmanFactionComplete_C) == 0x000288, "Wrong size on USpatialHenchmanFactionComplete_C");
static_assert(offsetof(USpatialHenchmanFactionComplete_C, UberGraphFrame) == 0x000230, "Member 'USpatialHenchmanFactionComplete_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USpatialHenchmanFactionComplete_C, BGFill) == 0x000238, "Member 'USpatialHenchmanFactionComplete_C::BGFill' has a wrong offset!");
static_assert(offsetof(USpatialHenchmanFactionComplete_C, LeftLine) == 0x000240, "Member 'USpatialHenchmanFactionComplete_C::LeftLine' has a wrong offset!");
static_assert(offsetof(USpatialHenchmanFactionComplete_C, RightLine) == 0x000248, "Member 'USpatialHenchmanFactionComplete_C::RightLine' has a wrong offset!");
static_assert(offsetof(USpatialHenchmanFactionComplete_C, Text_CompleteInfo) == 0x000250, "Member 'USpatialHenchmanFactionComplete_C::Text_CompleteInfo' has a wrong offset!");
static_assert(offsetof(USpatialHenchmanFactionComplete_C, Ego) == 0x000258, "Member 'USpatialHenchmanFactionComplete_C::Ego' has a wrong offset!");
static_assert(offsetof(USpatialHenchmanFactionComplete_C, Alter) == 0x000270, "Member 'USpatialHenchmanFactionComplete_C::Alter' has a wrong offset!");

}

