#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpatialHenchmanFactionEgoSmall

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function SpatialHenchmanFactionEgoSmall.SpatialHenchmanFactionEgoSmall_C.BndEvt__SpatialHenchmenViewMoreButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct SpatialHenchmanFactionEgoSmall_C_BndEvt__SpatialHenchmenViewMoreButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpatialHenchmanFactionEgoSmall_C_BndEvt__SpatialHenchmenViewMoreButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on SpatialHenchmanFactionEgoSmall_C_BndEvt__SpatialHenchmenViewMoreButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(SpatialHenchmanFactionEgoSmall_C_BndEvt__SpatialHenchmenViewMoreButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on SpatialHenchmanFactionEgoSmall_C_BndEvt__SpatialHenchmenViewMoreButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(SpatialHenchmanFactionEgoSmall_C_BndEvt__SpatialHenchmenViewMoreButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'SpatialHenchmanFactionEgoSmall_C_BndEvt__SpatialHenchmenViewMoreButton_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function SpatialHenchmanFactionEgoSmall.SpatialHenchmanFactionEgoSmall_C.OnMouseLeave
// 0x0070 (0x0070 - 0x0000)
struct SpatialHenchmanFactionEgoSmall_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(SpatialHenchmanFactionEgoSmall_C_OnMouseLeave) == 0x000008, "Wrong alignment on SpatialHenchmanFactionEgoSmall_C_OnMouseLeave");
static_assert(sizeof(SpatialHenchmanFactionEgoSmall_C_OnMouseLeave) == 0x000070, "Wrong size on SpatialHenchmanFactionEgoSmall_C_OnMouseLeave");
static_assert(offsetof(SpatialHenchmanFactionEgoSmall_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'SpatialHenchmanFactionEgoSmall_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function SpatialHenchmanFactionEgoSmall.SpatialHenchmanFactionEgoSmall_C.OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct SpatialHenchmanFactionEgoSmall_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(SpatialHenchmanFactionEgoSmall_C_OnMouseEnter) == 0x000008, "Wrong alignment on SpatialHenchmanFactionEgoSmall_C_OnMouseEnter");
static_assert(sizeof(SpatialHenchmanFactionEgoSmall_C_OnMouseEnter) == 0x0000A8, "Wrong size on SpatialHenchmanFactionEgoSmall_C_OnMouseEnter");
static_assert(offsetof(SpatialHenchmanFactionEgoSmall_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'SpatialHenchmanFactionEgoSmall_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(SpatialHenchmanFactionEgoSmall_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'SpatialHenchmanFactionEgoSmall_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function SpatialHenchmanFactionEgoSmall.SpatialHenchmanFactionEgoSmall_C.ExecuteUbergraph_SpatialHenchmanFactionEgoSmall
// 0x0140 (0x0140 - 0x0000)
struct SpatialHenchmanFactionEgoSmall_C_ExecuteUbergraph_SpatialHenchmanFactionEgoSmall final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0028(0x0070)(ConstParm)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0098(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00D0(0x0070)(ConstParm)
};
static_assert(alignof(SpatialHenchmanFactionEgoSmall_C_ExecuteUbergraph_SpatialHenchmanFactionEgoSmall) == 0x000008, "Wrong alignment on SpatialHenchmanFactionEgoSmall_C_ExecuteUbergraph_SpatialHenchmanFactionEgoSmall");
static_assert(sizeof(SpatialHenchmanFactionEgoSmall_C_ExecuteUbergraph_SpatialHenchmanFactionEgoSmall) == 0x000140, "Wrong size on SpatialHenchmanFactionEgoSmall_C_ExecuteUbergraph_SpatialHenchmanFactionEgoSmall");
static_assert(offsetof(SpatialHenchmanFactionEgoSmall_C_ExecuteUbergraph_SpatialHenchmanFactionEgoSmall, EntryPoint) == 0x000000, "Member 'SpatialHenchmanFactionEgoSmall_C_ExecuteUbergraph_SpatialHenchmanFactionEgoSmall::EntryPoint' has a wrong offset!");
static_assert(offsetof(SpatialHenchmanFactionEgoSmall_C_ExecuteUbergraph_SpatialHenchmanFactionEgoSmall, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000008, "Member 'SpatialHenchmanFactionEgoSmall_C_ExecuteUbergraph_SpatialHenchmanFactionEgoSmall::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpatialHenchmanFactionEgoSmall_C_ExecuteUbergraph_SpatialHenchmanFactionEgoSmall, CallFunc_PlayAnimationForward_ReturnValue) == 0x000010, "Member 'SpatialHenchmanFactionEgoSmall_C_ExecuteUbergraph_SpatialHenchmanFactionEgoSmall::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpatialHenchmanFactionEgoSmall_C_ExecuteUbergraph_SpatialHenchmanFactionEgoSmall, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000018, "Member 'SpatialHenchmanFactionEgoSmall_C_ExecuteUbergraph_SpatialHenchmanFactionEgoSmall::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SpatialHenchmanFactionEgoSmall_C_ExecuteUbergraph_SpatialHenchmanFactionEgoSmall, K2Node_ComponentBoundEvent_Button) == 0x000020, "Member 'SpatialHenchmanFactionEgoSmall_C_ExecuteUbergraph_SpatialHenchmanFactionEgoSmall::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(SpatialHenchmanFactionEgoSmall_C_ExecuteUbergraph_SpatialHenchmanFactionEgoSmall, K2Node_Event_MouseEvent_1) == 0x000028, "Member 'SpatialHenchmanFactionEgoSmall_C_ExecuteUbergraph_SpatialHenchmanFactionEgoSmall::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(SpatialHenchmanFactionEgoSmall_C_ExecuteUbergraph_SpatialHenchmanFactionEgoSmall, K2Node_Event_MyGeometry) == 0x000098, "Member 'SpatialHenchmanFactionEgoSmall_C_ExecuteUbergraph_SpatialHenchmanFactionEgoSmall::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(SpatialHenchmanFactionEgoSmall_C_ExecuteUbergraph_SpatialHenchmanFactionEgoSmall, K2Node_Event_MouseEvent) == 0x0000D0, "Member 'SpatialHenchmanFactionEgoSmall_C_ExecuteUbergraph_SpatialHenchmanFactionEgoSmall::K2Node_Event_MouseEvent' has a wrong offset!");

}

