#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpatialCustomizationCategoryEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SpatialCustomizationCategoryEntry.SpatialCustomizationCategoryEntry_C
// 0x0080 (0x0C98 - 0x0C18)
class USpatialCustomizationCategoryEntry_C final : public UAthenaSpatialCustomizationCategoryEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C18(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Unhover;                                           // 0x0C20(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoverLeft;                                         // 0x0C28(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoverRight;                                        // 0x0C30(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x0C38(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_Smallstate;                                 // 0x0C40(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFakeStatsGraphs_C*                     FakeStatsGraphs;                                   // 0x0C48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HBox_EntryContents;                                // 0x0C50(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Background;                                  // 0x0C58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SceenSpaceTexture;                                 // 0x0C60(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_EntryName_Big;                                // 0x0C68(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_1;                                     // 0x0C70(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_SmallState;                         // 0x0C78(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bLeftText;                                         // 0x0C80(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C81[0x7];                                      // 0x0C81(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 GlitchinessRandomizer;                             // 0x0C88(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_SpatialCustomizationCategoryEntry(int32 EntryPoint);
	void BP_OnUnhovered();
	void BP_OnHovered();
	void OnCategoryStateSet(ESpatialCustomizationCategoryState State, const struct FLinearColor& StateColor);
	void PreConstruct(bool IsDesignTime);
	void HandleCategoryStateSet(ESpatialCustomizationCategoryState State, const struct FLinearColor& StateColor);
	void Set_rim_brush_color(class UCommonActionWidget* Target, const struct FLinearColor& Color);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SpatialCustomizationCategoryEntry_C">();
	}
	static class USpatialCustomizationCategoryEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpatialCustomizationCategoryEntry_C>();
	}
};
static_assert(alignof(USpatialCustomizationCategoryEntry_C) == 0x000008, "Wrong alignment on USpatialCustomizationCategoryEntry_C");
static_assert(sizeof(USpatialCustomizationCategoryEntry_C) == 0x000C98, "Wrong size on USpatialCustomizationCategoryEntry_C");
static_assert(offsetof(USpatialCustomizationCategoryEntry_C, UberGraphFrame) == 0x000C18, "Member 'USpatialCustomizationCategoryEntry_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USpatialCustomizationCategoryEntry_C, Unhover) == 0x000C20, "Member 'USpatialCustomizationCategoryEntry_C::Unhover' has a wrong offset!");
static_assert(offsetof(USpatialCustomizationCategoryEntry_C, HoverLeft) == 0x000C28, "Member 'USpatialCustomizationCategoryEntry_C::HoverLeft' has a wrong offset!");
static_assert(offsetof(USpatialCustomizationCategoryEntry_C, HoverRight) == 0x000C30, "Member 'USpatialCustomizationCategoryEntry_C::HoverRight' has a wrong offset!");
static_assert(offsetof(USpatialCustomizationCategoryEntry_C, Hover) == 0x000C38, "Member 'USpatialCustomizationCategoryEntry_C::Hover' has a wrong offset!");
static_assert(offsetof(USpatialCustomizationCategoryEntry_C, Border_Smallstate) == 0x000C40, "Member 'USpatialCustomizationCategoryEntry_C::Border_Smallstate' has a wrong offset!");
static_assert(offsetof(USpatialCustomizationCategoryEntry_C, FakeStatsGraphs) == 0x000C48, "Member 'USpatialCustomizationCategoryEntry_C::FakeStatsGraphs' has a wrong offset!");
static_assert(offsetof(USpatialCustomizationCategoryEntry_C, HBox_EntryContents) == 0x000C50, "Member 'USpatialCustomizationCategoryEntry_C::HBox_EntryContents' has a wrong offset!");
static_assert(offsetof(USpatialCustomizationCategoryEntry_C, Image_Background) == 0x000C58, "Member 'USpatialCustomizationCategoryEntry_C::Image_Background' has a wrong offset!");
static_assert(offsetof(USpatialCustomizationCategoryEntry_C, SceenSpaceTexture) == 0x000C60, "Member 'USpatialCustomizationCategoryEntry_C::SceenSpaceTexture' has a wrong offset!");
static_assert(offsetof(USpatialCustomizationCategoryEntry_C, Text_EntryName_Big) == 0x000C68, "Member 'USpatialCustomizationCategoryEntry_C::Text_EntryName_Big' has a wrong offset!");
static_assert(offsetof(USpatialCustomizationCategoryEntry_C, VerticalBox_1) == 0x000C70, "Member 'USpatialCustomizationCategoryEntry_C::VerticalBox_1' has a wrong offset!");
static_assert(offsetof(USpatialCustomizationCategoryEntry_C, WidgetSwitcher_SmallState) == 0x000C78, "Member 'USpatialCustomizationCategoryEntry_C::WidgetSwitcher_SmallState' has a wrong offset!");
static_assert(offsetof(USpatialCustomizationCategoryEntry_C, bLeftText) == 0x000C80, "Member 'USpatialCustomizationCategoryEntry_C::bLeftText' has a wrong offset!");
static_assert(offsetof(USpatialCustomizationCategoryEntry_C, GlitchinessRandomizer) == 0x000C88, "Member 'USpatialCustomizationCategoryEntry_C::GlitchinessRandomizer' has a wrong offset!");

}

