#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpatialFactionPerk_unlocked

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SpatialFactionPerk_unlocked.SpatialFactionPerk_unlocked_C
// 0x0048 (0x02B8 - 0x0270)
class USpatialFactionPerk_unlocked_C final : public UFactionUnlockedPerkListEntry
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover;                                             // 0x0278(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Selected;                                          // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               Content_Selected;                                  // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_58;                                          // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_REwardTile;                                  // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_SelectedBottom;                              // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_SelectedTop_1;                               // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               RevealedContent;                                   // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SpatialFactionPerk_unlocked(int32 EntryPoint);
	void BPSetup(class UFactionUnlockedPerkData* InPerk);
	void BP_OnDeselected_1();
	void BP_OnSelected_1();
	void BP_OnUnhovered_1();
	void BP_OnHovered_1();
	void OnLoaded_625B37C643E292B11217C98384656193(class UObject* Loaded);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SpatialFactionPerk_unlocked_C">();
	}
	static class USpatialFactionPerk_unlocked_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpatialFactionPerk_unlocked_C>();
	}
};
static_assert(alignof(USpatialFactionPerk_unlocked_C) == 0x000008, "Wrong alignment on USpatialFactionPerk_unlocked_C");
static_assert(sizeof(USpatialFactionPerk_unlocked_C) == 0x0002B8, "Wrong size on USpatialFactionPerk_unlocked_C");
static_assert(offsetof(USpatialFactionPerk_unlocked_C, UberGraphFrame) == 0x000270, "Member 'USpatialFactionPerk_unlocked_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USpatialFactionPerk_unlocked_C, Hover) == 0x000278, "Member 'USpatialFactionPerk_unlocked_C::Hover' has a wrong offset!");
static_assert(offsetof(USpatialFactionPerk_unlocked_C, Selected) == 0x000280, "Member 'USpatialFactionPerk_unlocked_C::Selected' has a wrong offset!");
static_assert(offsetof(USpatialFactionPerk_unlocked_C, Content_Selected) == 0x000288, "Member 'USpatialFactionPerk_unlocked_C::Content_Selected' has a wrong offset!");
static_assert(offsetof(USpatialFactionPerk_unlocked_C, Image_58) == 0x000290, "Member 'USpatialFactionPerk_unlocked_C::Image_58' has a wrong offset!");
static_assert(offsetof(USpatialFactionPerk_unlocked_C, Image_REwardTile) == 0x000298, "Member 'USpatialFactionPerk_unlocked_C::Image_REwardTile' has a wrong offset!");
static_assert(offsetof(USpatialFactionPerk_unlocked_C, Image_SelectedBottom) == 0x0002A0, "Member 'USpatialFactionPerk_unlocked_C::Image_SelectedBottom' has a wrong offset!");
static_assert(offsetof(USpatialFactionPerk_unlocked_C, Image_SelectedTop_1) == 0x0002A8, "Member 'USpatialFactionPerk_unlocked_C::Image_SelectedTop_1' has a wrong offset!");
static_assert(offsetof(USpatialFactionPerk_unlocked_C, RevealedContent) == 0x0002B0, "Member 'USpatialFactionPerk_unlocked_C::RevealedContent' has a wrong offset!");

}

