#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StoreMain_RMT_OfferDetails

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "FortniteUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass StoreMain_RMT_OfferDetails.StoreMain_RMT_OfferDetails_C
// 0x0178 (0x08A0 - 0x0728)
class UStoreMain_RMT_OfferDetails_C final : public UFortRealMoneyOfferDetails
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0728(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x0730(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BaseColor;                                         // 0x0738(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         BonusMTXArea;                                      // 0x0740(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          BorderDisclaimer;                                  // 0x0748(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          CommonBorder_VBucks;                               // 0x0750(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   CommonRichTextBlock_Legal;                         // 0x0758(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   CommonRichTextBlock_SubTitle;                      // 0x0760(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   CommonRichTextBlock_TaglineandInclusion;           // 0x0768(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonText_BaseQuantity;                           // 0x0770(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonText_BonusQuantity;                          // 0x0778(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_VbucksLegal;                       // 0x0780(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Highlight;                                         // 0x0788(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_LTM;                                 // 0x0790(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_999;                                         // 0x0798(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Badge;                                       // 0x07A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortLazyImage*                         Image_CurrencyIcon;                                // 0x07A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_LTM;                                         // 0x07B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Separator_Down;                              // 0x07B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Separator_Up;                                // 0x07C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       KeyArt;                                            // 0x07C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               MTXArea;                                           // 0x07D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               MTXButtonBox;                                      // 0x07D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OverlayGradientDetails;                            // 0x07E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlaySalePrice;                                  // 0x07E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonRichTextBlock*                   RichText_Header;                                   // 0x07F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URMT_Offer_EntryRow_C*                  RMT_Offer_EntryRow;                                // 0x07F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_1;                                        // 0x0800(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SpeedLines;                                        // 0x0808(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStoreMain_Offer_VBucks_Modal_C*        StoreMain_Offer_VBucks_Modal;                      // 0x0810(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStoreMain_OfferDetailsAttribute_C*     StoreMain_OfferDetailsAttribute1;                  // 0x0818(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStoreMain_OfferDetailsAttribute_C*     StoreMain_OfferDetailsAttribute2;                  // 0x0820(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextName;                                          // 0x0828(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextOfferDisplayPrice;                             // 0x0830(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextOriginalPrice;                                 // 0x0838(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBoxOfferInfo;                                     // 0x0840(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<int32, class UFortMtxOfferData*>         ABAssetCollection;                                 // 0x0848(0x0050)(Edit, BlueprintVisible, ZeroConstructor)
	class UFortAccountItemDefinition*             PriceItem;                                         // 0x0898(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_StoreMain_RMT_OfferDetails(int32 EntryPoint);
	void HideUndoInBottomBar();
	void ShowUndoInBottomBar();
	void BndEvt__Button_Undo_K2Node_ComponentBoundEvent_0_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void ShowPurchasedOverlay(int32 QuantityPurchased, const TArray<struct FPurchasedItemInfo>& PurchasedItems, const class FString& OfferId);
	void BP_OnActivated();
	void ShowPurchaseConfirmation();
	void OnOfferSet();
	void ResetPurchaseButtonText();
	void OnPurchasingStarted();
	void HandleBack(bool* PassThrough);
	void Init();
	void PopDetails();
	void RegisterInput();
	void UnregisterInput();
	void InitCurrency();
	bool IsGiftingStorefrontOffer();
	void SetPurchaseButtonText(const class FText& ButtonText);
	void InitDetailAttributes(const struct FLinearColor& TertiaryColor);
	void UpdatePurchaseButton();
	void Set_colors_from_data_Asset(const struct FLinearColor& Upsell_Primary, const struct FLinearColor& Upsell_Secondary, const struct FLinearColor& Text_Color, bool Use_Base_Color, const struct FLinearColor& Background, const struct FLinearColor& Gradient);
	void SetupCurrencyImage();
	bool CanPurchaseMtxPriceOffer(int32 PirceIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"StoreMain_RMT_OfferDetails_C">();
	}
	static class UStoreMain_RMT_OfferDetails_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStoreMain_RMT_OfferDetails_C>();
	}
};
static_assert(alignof(UStoreMain_RMT_OfferDetails_C) == 0x000008, "Wrong alignment on UStoreMain_RMT_OfferDetails_C");
static_assert(sizeof(UStoreMain_RMT_OfferDetails_C) == 0x0008A0, "Wrong size on UStoreMain_RMT_OfferDetails_C");
static_assert(offsetof(UStoreMain_RMT_OfferDetails_C, UberGraphFrame) == 0x000728, "Member 'UStoreMain_RMT_OfferDetails_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UStoreMain_RMT_OfferDetails_C, Intro) == 0x000730, "Member 'UStoreMain_RMT_OfferDetails_C::Intro' has a wrong offset!");
static_assert(offsetof(UStoreMain_RMT_OfferDetails_C, BaseColor) == 0x000738, "Member 'UStoreMain_RMT_OfferDetails_C::BaseColor' has a wrong offset!");
static_assert(offsetof(UStoreMain_RMT_OfferDetails_C, BonusMTXArea) == 0x000740, "Member 'UStoreMain_RMT_OfferDetails_C::BonusMTXArea' has a wrong offset!");
static_assert(offsetof(UStoreMain_RMT_OfferDetails_C, BorderDisclaimer) == 0x000748, "Member 'UStoreMain_RMT_OfferDetails_C::BorderDisclaimer' has a wrong offset!");
static_assert(offsetof(UStoreMain_RMT_OfferDetails_C, CommonBorder_VBucks) == 0x000750, "Member 'UStoreMain_RMT_OfferDetails_C::CommonBorder_VBucks' has a wrong offset!");
static_assert(offsetof(UStoreMain_RMT_OfferDetails_C, CommonRichTextBlock_Legal) == 0x000758, "Member 'UStoreMain_RMT_OfferDetails_C::CommonRichTextBlock_Legal' has a wrong offset!");
static_assert(offsetof(UStoreMain_RMT_OfferDetails_C, CommonRichTextBlock_SubTitle) == 0x000760, "Member 'UStoreMain_RMT_OfferDetails_C::CommonRichTextBlock_SubTitle' has a wrong offset!");
static_assert(offsetof(UStoreMain_RMT_OfferDetails_C, CommonRichTextBlock_TaglineandInclusion) == 0x000768, "Member 'UStoreMain_RMT_OfferDetails_C::CommonRichTextBlock_TaglineandInclusion' has a wrong offset!");
static_assert(offsetof(UStoreMain_RMT_OfferDetails_C, CommonText_BaseQuantity) == 0x000770, "Member 'UStoreMain_RMT_OfferDetails_C::CommonText_BaseQuantity' has a wrong offset!");
static_assert(offsetof(UStoreMain_RMT_OfferDetails_C, CommonText_BonusQuantity) == 0x000778, "Member 'UStoreMain_RMT_OfferDetails_C::CommonText_BonusQuantity' has a wrong offset!");
static_assert(offsetof(UStoreMain_RMT_OfferDetails_C, CommonTextBlock_VbucksLegal) == 0x000780, "Member 'UStoreMain_RMT_OfferDetails_C::CommonTextBlock_VbucksLegal' has a wrong offset!");
static_assert(offsetof(UStoreMain_RMT_OfferDetails_C, Highlight) == 0x000788, "Member 'UStoreMain_RMT_OfferDetails_C::Highlight' has a wrong offset!");
static_assert(offsetof(UStoreMain_RMT_OfferDetails_C, HorizontalBox_LTM) == 0x000790, "Member 'UStoreMain_RMT_OfferDetails_C::HorizontalBox_LTM' has a wrong offset!");
static_assert(offsetof(UStoreMain_RMT_OfferDetails_C, Image_999) == 0x000798, "Member 'UStoreMain_RMT_OfferDetails_C::Image_999' has a wrong offset!");
static_assert(offsetof(UStoreMain_RMT_OfferDetails_C, Image_Badge) == 0x0007A0, "Member 'UStoreMain_RMT_OfferDetails_C::Image_Badge' has a wrong offset!");
static_assert(offsetof(UStoreMain_RMT_OfferDetails_C, Image_CurrencyIcon) == 0x0007A8, "Member 'UStoreMain_RMT_OfferDetails_C::Image_CurrencyIcon' has a wrong offset!");
static_assert(offsetof(UStoreMain_RMT_OfferDetails_C, Image_LTM) == 0x0007B0, "Member 'UStoreMain_RMT_OfferDetails_C::Image_LTM' has a wrong offset!");
static_assert(offsetof(UStoreMain_RMT_OfferDetails_C, Image_Separator_Down) == 0x0007B8, "Member 'UStoreMain_RMT_OfferDetails_C::Image_Separator_Down' has a wrong offset!");
static_assert(offsetof(UStoreMain_RMT_OfferDetails_C, Image_Separator_Up) == 0x0007C0, "Member 'UStoreMain_RMT_OfferDetails_C::Image_Separator_Up' has a wrong offset!");
static_assert(offsetof(UStoreMain_RMT_OfferDetails_C, KeyArt) == 0x0007C8, "Member 'UStoreMain_RMT_OfferDetails_C::KeyArt' has a wrong offset!");
static_assert(offsetof(UStoreMain_RMT_OfferDetails_C, MTXArea) == 0x0007D0, "Member 'UStoreMain_RMT_OfferDetails_C::MTXArea' has a wrong offset!");
static_assert(offsetof(UStoreMain_RMT_OfferDetails_C, MTXButtonBox) == 0x0007D8, "Member 'UStoreMain_RMT_OfferDetails_C::MTXButtonBox' has a wrong offset!");
static_assert(offsetof(UStoreMain_RMT_OfferDetails_C, OverlayGradientDetails) == 0x0007E0, "Member 'UStoreMain_RMT_OfferDetails_C::OverlayGradientDetails' has a wrong offset!");
static_assert(offsetof(UStoreMain_RMT_OfferDetails_C, OverlaySalePrice) == 0x0007E8, "Member 'UStoreMain_RMT_OfferDetails_C::OverlaySalePrice' has a wrong offset!");
static_assert(offsetof(UStoreMain_RMT_OfferDetails_C, RichText_Header) == 0x0007F0, "Member 'UStoreMain_RMT_OfferDetails_C::RichText_Header' has a wrong offset!");
static_assert(offsetof(UStoreMain_RMT_OfferDetails_C, RMT_Offer_EntryRow) == 0x0007F8, "Member 'UStoreMain_RMT_OfferDetails_C::RMT_Offer_EntryRow' has a wrong offset!");
static_assert(offsetof(UStoreMain_RMT_OfferDetails_C, SafeZone_1) == 0x000800, "Member 'UStoreMain_RMT_OfferDetails_C::SafeZone_1' has a wrong offset!");
static_assert(offsetof(UStoreMain_RMT_OfferDetails_C, SpeedLines) == 0x000808, "Member 'UStoreMain_RMT_OfferDetails_C::SpeedLines' has a wrong offset!");
static_assert(offsetof(UStoreMain_RMT_OfferDetails_C, StoreMain_Offer_VBucks_Modal) == 0x000810, "Member 'UStoreMain_RMT_OfferDetails_C::StoreMain_Offer_VBucks_Modal' has a wrong offset!");
static_assert(offsetof(UStoreMain_RMT_OfferDetails_C, StoreMain_OfferDetailsAttribute1) == 0x000818, "Member 'UStoreMain_RMT_OfferDetails_C::StoreMain_OfferDetailsAttribute1' has a wrong offset!");
static_assert(offsetof(UStoreMain_RMT_OfferDetails_C, StoreMain_OfferDetailsAttribute2) == 0x000820, "Member 'UStoreMain_RMT_OfferDetails_C::StoreMain_OfferDetailsAttribute2' has a wrong offset!");
static_assert(offsetof(UStoreMain_RMT_OfferDetails_C, TextName) == 0x000828, "Member 'UStoreMain_RMT_OfferDetails_C::TextName' has a wrong offset!");
static_assert(offsetof(UStoreMain_RMT_OfferDetails_C, TextOfferDisplayPrice) == 0x000830, "Member 'UStoreMain_RMT_OfferDetails_C::TextOfferDisplayPrice' has a wrong offset!");
static_assert(offsetof(UStoreMain_RMT_OfferDetails_C, TextOriginalPrice) == 0x000838, "Member 'UStoreMain_RMT_OfferDetails_C::TextOriginalPrice' has a wrong offset!");
static_assert(offsetof(UStoreMain_RMT_OfferDetails_C, VBoxOfferInfo) == 0x000840, "Member 'UStoreMain_RMT_OfferDetails_C::VBoxOfferInfo' has a wrong offset!");
static_assert(offsetof(UStoreMain_RMT_OfferDetails_C, ABAssetCollection) == 0x000848, "Member 'UStoreMain_RMT_OfferDetails_C::ABAssetCollection' has a wrong offset!");
static_assert(offsetof(UStoreMain_RMT_OfferDetails_C, PriceItem) == 0x000898, "Member 'UStoreMain_RMT_OfferDetails_C::PriceItem' has a wrong offset!");

}

