#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VaultCharacterPlacementHelper

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function VaultCharacterPlacementHelper.VaultCharacterPlacementHelper_C.UpdatePosition For Camera
// 0x0120 (0x0120 - 0x0000)
struct VaultCharacterPlacementHelper_C_UpdatePosition_For_Camera final
{
public:
	EFrontEndCamera                               FrontEndCamera;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EFrontEndCamera>                       K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0060(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x0090(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(VaultCharacterPlacementHelper_C_UpdatePosition_For_Camera) == 0x000010, "Wrong alignment on VaultCharacterPlacementHelper_C_UpdatePosition_For_Camera");
static_assert(sizeof(VaultCharacterPlacementHelper_C_UpdatePosition_For_Camera) == 0x000120, "Wrong size on VaultCharacterPlacementHelper_C_UpdatePosition_For_Camera");
static_assert(offsetof(VaultCharacterPlacementHelper_C_UpdatePosition_For_Camera, FrontEndCamera) == 0x000000, "Member 'VaultCharacterPlacementHelper_C_UpdatePosition_For_Camera::FrontEndCamera' has a wrong offset!");
static_assert(offsetof(VaultCharacterPlacementHelper_C_UpdatePosition_For_Camera, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000001, "Member 'VaultCharacterPlacementHelper_C_UpdatePosition_For_Camera::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(VaultCharacterPlacementHelper_C_UpdatePosition_For_Camera, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000002, "Member 'VaultCharacterPlacementHelper_C_UpdatePosition_For_Camera::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VaultCharacterPlacementHelper_C_UpdatePosition_For_Camera, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000003, "Member 'VaultCharacterPlacementHelper_C_UpdatePosition_For_Camera::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(VaultCharacterPlacementHelper_C_UpdatePosition_For_Camera, K2Node_MakeArray_Array) == 0x000008, "Member 'VaultCharacterPlacementHelper_C_UpdatePosition_For_Camera::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(VaultCharacterPlacementHelper_C_UpdatePosition_For_Camera, CallFunc_Not_PreBool_ReturnValue) == 0x000018, "Member 'VaultCharacterPlacementHelper_C_UpdatePosition_For_Camera::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(VaultCharacterPlacementHelper_C_UpdatePosition_For_Camera, CallFunc_Array_Contains_ReturnValue) == 0x000019, "Member 'VaultCharacterPlacementHelper_C_UpdatePosition_For_Camera::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(VaultCharacterPlacementHelper_C_UpdatePosition_For_Camera, CallFunc_BreakTransform_Location) == 0x00001C, "Member 'VaultCharacterPlacementHelper_C_UpdatePosition_For_Camera::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(VaultCharacterPlacementHelper_C_UpdatePosition_For_Camera, CallFunc_BreakTransform_Rotation) == 0x000028, "Member 'VaultCharacterPlacementHelper_C_UpdatePosition_For_Camera::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(VaultCharacterPlacementHelper_C_UpdatePosition_For_Camera, CallFunc_BreakTransform_Scale) == 0x000034, "Member 'VaultCharacterPlacementHelper_C_UpdatePosition_For_Camera::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(VaultCharacterPlacementHelper_C_UpdatePosition_For_Camera, CallFunc_Add_VectorVector_ReturnValue) == 0x000040, "Member 'VaultCharacterPlacementHelper_C_UpdatePosition_For_Camera::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(VaultCharacterPlacementHelper_C_UpdatePosition_For_Camera, CallFunc_ComposeRotators_ReturnValue) == 0x00004C, "Member 'VaultCharacterPlacementHelper_C_UpdatePosition_For_Camera::CallFunc_ComposeRotators_ReturnValue' has a wrong offset!");
static_assert(offsetof(VaultCharacterPlacementHelper_C_UpdatePosition_For_Camera, CallFunc_MakeTransform_ReturnValue) == 0x000060, "Member 'VaultCharacterPlacementHelper_C_UpdatePosition_For_Camera::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(VaultCharacterPlacementHelper_C_UpdatePosition_For_Camera, CallFunc_K2_SetActorTransform_SweepHitResult) == 0x000090, "Member 'VaultCharacterPlacementHelper_C_UpdatePosition_For_Camera::CallFunc_K2_SetActorTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(VaultCharacterPlacementHelper_C_UpdatePosition_For_Camera, CallFunc_K2_SetActorTransform_ReturnValue) == 0x00011C, "Member 'VaultCharacterPlacementHelper_C_UpdatePosition_For_Camera::CallFunc_K2_SetActorTransform_ReturnValue' has a wrong offset!");

// Function VaultCharacterPlacementHelper.VaultCharacterPlacementHelper_C.UserConstructionScript
// 0x0030 (0x0030 - 0x0000)
struct VaultCharacterPlacementHelper_C_UserConstructionScript final
{
public:
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0000(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(VaultCharacterPlacementHelper_C_UserConstructionScript) == 0x000010, "Wrong alignment on VaultCharacterPlacementHelper_C_UserConstructionScript");
static_assert(sizeof(VaultCharacterPlacementHelper_C_UserConstructionScript) == 0x000030, "Wrong size on VaultCharacterPlacementHelper_C_UserConstructionScript");
static_assert(offsetof(VaultCharacterPlacementHelper_C_UserConstructionScript, CallFunc_GetTransform_ReturnValue) == 0x000000, "Member 'VaultCharacterPlacementHelper_C_UserConstructionScript::CallFunc_GetTransform_ReturnValue' has a wrong offset!");

// Function VaultCharacterPlacementHelper.VaultCharacterPlacementHelper_C.SubGameChanged_Event_0
// 0x0001 (0x0001 - 0x0000)
struct VaultCharacterPlacementHelper_C_SubGameChanged_Event_0 final
{
public:
	ESubGame                                      SubGame;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VaultCharacterPlacementHelper_C_SubGameChanged_Event_0) == 0x000001, "Wrong alignment on VaultCharacterPlacementHelper_C_SubGameChanged_Event_0");
static_assert(sizeof(VaultCharacterPlacementHelper_C_SubGameChanged_Event_0) == 0x000001, "Wrong size on VaultCharacterPlacementHelper_C_SubGameChanged_Event_0");
static_assert(offsetof(VaultCharacterPlacementHelper_C_SubGameChanged_Event_0, SubGame) == 0x000000, "Member 'VaultCharacterPlacementHelper_C_SubGameChanged_Event_0::SubGame' has a wrong offset!");

// Function VaultCharacterPlacementHelper.VaultCharacterPlacementHelper_C.OnFrontEndCameraChanged
// 0x0002 (0x0002 - 0x0000)
struct VaultCharacterPlacementHelper_C_OnFrontEndCameraChanged final
{
public:
	EFrontEndCamera                               NewCamera;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFrontEndCamera                               OldCamera;                                         // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VaultCharacterPlacementHelper_C_OnFrontEndCameraChanged) == 0x000001, "Wrong alignment on VaultCharacterPlacementHelper_C_OnFrontEndCameraChanged");
static_assert(sizeof(VaultCharacterPlacementHelper_C_OnFrontEndCameraChanged) == 0x000002, "Wrong size on VaultCharacterPlacementHelper_C_OnFrontEndCameraChanged");
static_assert(offsetof(VaultCharacterPlacementHelper_C_OnFrontEndCameraChanged, NewCamera) == 0x000000, "Member 'VaultCharacterPlacementHelper_C_OnFrontEndCameraChanged::NewCamera' has a wrong offset!");
static_assert(offsetof(VaultCharacterPlacementHelper_C_OnFrontEndCameraChanged, OldCamera) == 0x000001, "Member 'VaultCharacterPlacementHelper_C_OnFrontEndCameraChanged::OldCamera' has a wrong offset!");

// Function VaultCharacterPlacementHelper.VaultCharacterPlacementHelper_C.ExecuteUbergraph_VaultCharacterPlacementHelper
// 0x00D8 (0x00D8 - 0x0000)
struct VaultCharacterPlacementHelper_C_ExecuteUbergraph_VaultCharacterPlacementHelper final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFrontEndCamera                               K2Node_CustomEvent_NewCamera;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFrontEndCamera                               K2Node_CustomEvent_OldCamera;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ESubGame SubGame)>             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EFrontEndCamera NewCamera, EFrontEndCamera OldCamera)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	ESubGame                                      K2Node_CustomEvent_SubGame;                        // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x0034(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue_1;                 // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESubGame                                      CallFunc_GetSubGame_ReturnValue;                   // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(VaultCharacterPlacementHelper_C_ExecuteUbergraph_VaultCharacterPlacementHelper) == 0x000008, "Wrong alignment on VaultCharacterPlacementHelper_C_ExecuteUbergraph_VaultCharacterPlacementHelper");
static_assert(sizeof(VaultCharacterPlacementHelper_C_ExecuteUbergraph_VaultCharacterPlacementHelper) == 0x0000D8, "Wrong size on VaultCharacterPlacementHelper_C_ExecuteUbergraph_VaultCharacterPlacementHelper");
static_assert(offsetof(VaultCharacterPlacementHelper_C_ExecuteUbergraph_VaultCharacterPlacementHelper, EntryPoint) == 0x000000, "Member 'VaultCharacterPlacementHelper_C_ExecuteUbergraph_VaultCharacterPlacementHelper::EntryPoint' has a wrong offset!");
static_assert(offsetof(VaultCharacterPlacementHelper_C_ExecuteUbergraph_VaultCharacterPlacementHelper, K2Node_CustomEvent_NewCamera) == 0x000004, "Member 'VaultCharacterPlacementHelper_C_ExecuteUbergraph_VaultCharacterPlacementHelper::K2Node_CustomEvent_NewCamera' has a wrong offset!");
static_assert(offsetof(VaultCharacterPlacementHelper_C_ExecuteUbergraph_VaultCharacterPlacementHelper, K2Node_CustomEvent_OldCamera) == 0x000005, "Member 'VaultCharacterPlacementHelper_C_ExecuteUbergraph_VaultCharacterPlacementHelper::K2Node_CustomEvent_OldCamera' has a wrong offset!");
static_assert(offsetof(VaultCharacterPlacementHelper_C_ExecuteUbergraph_VaultCharacterPlacementHelper, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'VaultCharacterPlacementHelper_C_ExecuteUbergraph_VaultCharacterPlacementHelper::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(VaultCharacterPlacementHelper_C_ExecuteUbergraph_VaultCharacterPlacementHelper, CallFunc_GetContext_ReturnValue) == 0x000018, "Member 'VaultCharacterPlacementHelper_C_ExecuteUbergraph_VaultCharacterPlacementHelper::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(VaultCharacterPlacementHelper_C_ExecuteUbergraph_VaultCharacterPlacementHelper, K2Node_CreateDelegate_OutputDelegate_1) == 0x000020, "Member 'VaultCharacterPlacementHelper_C_ExecuteUbergraph_VaultCharacterPlacementHelper::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(VaultCharacterPlacementHelper_C_ExecuteUbergraph_VaultCharacterPlacementHelper, K2Node_CustomEvent_SubGame) == 0x000030, "Member 'VaultCharacterPlacementHelper_C_ExecuteUbergraph_VaultCharacterPlacementHelper::K2Node_CustomEvent_SubGame' has a wrong offset!");
static_assert(offsetof(VaultCharacterPlacementHelper_C_ExecuteUbergraph_VaultCharacterPlacementHelper, CallFunc_K2_SetActorTransform_SweepHitResult) == 0x000034, "Member 'VaultCharacterPlacementHelper_C_ExecuteUbergraph_VaultCharacterPlacementHelper::CallFunc_K2_SetActorTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(VaultCharacterPlacementHelper_C_ExecuteUbergraph_VaultCharacterPlacementHelper, CallFunc_K2_SetActorTransform_ReturnValue) == 0x0000C0, "Member 'VaultCharacterPlacementHelper_C_ExecuteUbergraph_VaultCharacterPlacementHelper::CallFunc_K2_SetActorTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(VaultCharacterPlacementHelper_C_ExecuteUbergraph_VaultCharacterPlacementHelper, CallFunc_GetContext_ReturnValue_1) == 0x0000C8, "Member 'VaultCharacterPlacementHelper_C_ExecuteUbergraph_VaultCharacterPlacementHelper::CallFunc_GetContext_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VaultCharacterPlacementHelper_C_ExecuteUbergraph_VaultCharacterPlacementHelper, CallFunc_GetSubGame_ReturnValue) == 0x0000D0, "Member 'VaultCharacterPlacementHelper_C_ExecuteUbergraph_VaultCharacterPlacementHelper::CallFunc_GetSubGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(VaultCharacterPlacementHelper_C_ExecuteUbergraph_VaultCharacterPlacementHelper, K2Node_SwitchEnum_CmpSuccess) == 0x0000D1, "Member 'VaultCharacterPlacementHelper_C_ExecuteUbergraph_VaultCharacterPlacementHelper::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function VaultCharacterPlacementHelper.VaultCharacterPlacementHelper_C.OnZoomLevelUpdated__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct VaultCharacterPlacementHelper_C_OnZoomLevelUpdated__DelegateSignature final
{
public:
	float                                         CurrentZoomLevel;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VaultCharacterPlacementHelper_C_OnZoomLevelUpdated__DelegateSignature) == 0x000004, "Wrong alignment on VaultCharacterPlacementHelper_C_OnZoomLevelUpdated__DelegateSignature");
static_assert(sizeof(VaultCharacterPlacementHelper_C_OnZoomLevelUpdated__DelegateSignature) == 0x000004, "Wrong size on VaultCharacterPlacementHelper_C_OnZoomLevelUpdated__DelegateSignature");
static_assert(offsetof(VaultCharacterPlacementHelper_C_OnZoomLevelUpdated__DelegateSignature, CurrentZoomLevel) == 0x000000, "Member 'VaultCharacterPlacementHelper_C_OnZoomLevelUpdated__DelegateSignature::CurrentZoomLevel' has a wrong offset!");

}

