#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WolfPack_Backpack_Skeleton_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass WolfPack_Backpack_Skeleton_AnimBP.WolfPack_Backpack_Skeleton_AnimBP_C
// 0x0760 (0x09D0 - 0x0270)
class UWolfPack_Backpack_Skeleton_AnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_268[0x8];                                      // 0x0268(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0278(0x0030)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x02A8(0x0140)(ContainsInstancedReference)
	uint8                                         Pad_3E8[0x8];                                      // 0x03E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x03F0(0x05A0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0990(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x09B0(0x0020)()

public:
	void ExecuteUbergraph_WolfPack_Backpack_Skeleton_AnimBP(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WolfPack_Backpack_Skeleton_AnimBP_C">();
	}
	static class UWolfPack_Backpack_Skeleton_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWolfPack_Backpack_Skeleton_AnimBP_C>();
	}
};
static_assert(alignof(UWolfPack_Backpack_Skeleton_AnimBP_C) == 0x000010, "Wrong alignment on UWolfPack_Backpack_Skeleton_AnimBP_C");
static_assert(sizeof(UWolfPack_Backpack_Skeleton_AnimBP_C) == 0x0009D0, "Wrong size on UWolfPack_Backpack_Skeleton_AnimBP_C");
static_assert(offsetof(UWolfPack_Backpack_Skeleton_AnimBP_C, UberGraphFrame) == 0x000270, "Member 'UWolfPack_Backpack_Skeleton_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWolfPack_Backpack_Skeleton_AnimBP_C, AnimGraphNode_Root) == 0x000278, "Member 'UWolfPack_Backpack_Skeleton_AnimBP_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UWolfPack_Backpack_Skeleton_AnimBP_C, AnimGraphNode_CopyPoseFromMesh) == 0x0002A8, "Member 'UWolfPack_Backpack_Skeleton_AnimBP_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UWolfPack_Backpack_Skeleton_AnimBP_C, AnimGraphNode_RigidBody) == 0x0003F0, "Member 'UWolfPack_Backpack_Skeleton_AnimBP_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(UWolfPack_Backpack_Skeleton_AnimBP_C, AnimGraphNode_LocalToComponentSpace) == 0x000990, "Member 'UWolfPack_Backpack_Skeleton_AnimBP_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UWolfPack_Backpack_Skeleton_AnimBP_C, AnimGraphNode_ComponentToLocalSpace) == 0x0009B0, "Member 'UWolfPack_Backpack_Skeleton_AnimBP_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");

}

